{
  "chapter": "الأعراف",
  "text": "هل ينظرون الا تاويله يوم ياتى تاويله يقول الذين نسوه من قبل قد جاءت رسل ربنا بالحق فهل لنا من شفعاء فيشفعوا۟ لنا او نرد فنعمل غير الذى كنا نعمل قد خسروا۟ انفسهم وضل عنهم ما كانوا۟ يفترون",
  "translations": [
    {
      "translation": "What are they waiting for but its fulfilment? The Day its fulfilment occurs, those who forgot it before will say, 'The Messengers of our Lord came with the Truth. Are there any intercessors to intercede for us, or can we be sent back so that we can do something other than what we did?' They have lost their own selves and what they invented has forsaken them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting for the exposition of what it speaks of? The day that (Reality) is unravelled, the people who had lost sight of it will say: \"The apostles of our Lord had indeed brought the truth. Do we have any one to intercede for us? If only we could go back to the world, we would act otherwise.\" Indeed they have caused themselves harm, and the lies they concocted did not help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting for the fulfilment of its warning? On the Day that warning is fulfilled, those that have neglected it before will say: 'The Messengers of Our Lord did indeed bring forth the truth. Are there any intercessors who will now plead on our behalf? Or, can we be restored to life that we might perform differently from that which we did? ' They surely ended in utter loss, and the lies they had fabricated failed them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Despite the clear details of Our guidance in the Book) do they still wait for further interpretations? On the Day (of Judgment) when its interpretations will be revealed, those who had ignored its guidance will confess, saying, \"The Messengers of our Lord had certainly come to us with the Truth. Will anyone intercede for us or send us back (to life) so that we would be able to act in a different manner to that which we had done before?\" These people have certainly lost their souls and their evil inventions (which they had used for false excuses) will vanish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What do they await, except for the result foretold by that Book to appear? The day when the result foretold by it occurs, those who had previously forgotten it from the beginning (the disbelievers) will exclaim, “Indeed the Noble Messengers of our Lord had brought the truth! Do we have any intercessors who may intercede for us? Or can we be returned (to earth), so we may do contrary to what we have done before?” Indeed they have put themselves into ruin, and have lost the things they fabricated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Await they just for the final fulfillment of the event On the Day the event is finally fulfilled, those who neglected it before will say: \"Verily, the Messengers of our Lord did come with the truth, now are there any intercessors for us that they might intercede on our behalf Or could we be sent back (to the first life of the world) so that we might do (good) deeds other than those (evil) deeds which we used to do\" Verily, they have lost themselves and that which they used to fabricate has gone away from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they wait for aught but its final sequel? On the day when its final sequel comes about, those who neglected it before will say: Indeed the apostles of our Lord brought the truth; are there for us then any intercessors so that they should intercede on our behalf? Or could we be sent back so that we should do (deeds) other than those which we did? Indeed they have lost their souls and that which they forged has gone away from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they look for aught else but its interpretation? The day its interpretation comes, those who before forgot it shall say, 'Indeed, our Lord's Messengers came with the truth. Have we then any intercessors to intercede for us, or shall we be returned, to do other than that we have done?' They have indeed lost their souls, and that which they were forging has gone astray from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Await they aught save the fulfilment thereof? On the day when the fulfilment thereof cometh, those who were before forgetful thereof will say: The messengers of our Lord did bring the Truth! Have we any intercessors, that they may intercede for us? Or can we be returned (to life on earth), that we may act otherwise than we used to act? They have lost their souls, and that which they devised hath failed them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they wait for the fulfillment of that of which it warns? On the Day when that fulfillment comes, those who had neglected it before will say, \"The messengers of our Lord did indeed bring the truth. Have we then any intercessors who would intercede for us? Or, could we be sent back so that we might act differently from the way we used to?\" They have indeed ruined their souls and what they invented has forsaken them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They await only its fulfilment. The Day whereon the fulfilment thereof arriveth, those who were negligent thereof afore shall say: surely the apostles of our Lord brought the truths; are there for us any intercessors that they might intercede for us? or could we be sent back that we may work otherwise than we were wont to work? Surely they have lost themselves, and there hath strayed from them that which they were wont to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not consider [the consequences of] its fulfillment? The day when its fulfillment comes, those who had forgotten it before will say, ‘Our Lord’s apostles had certainly brought the truth. If only we had some intercessors to intercede for us, or we would be returned, so that we may do differently from what we did!’ They have certainly ruined their souls, and what they used to fabricate has forsaken them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they just wait for the final fulfilment of the event? On the day the event is finally fulfilled, those who disregarded it before will say: \"The messengers of our Lord did indeed bring true (tidings). Have we no intercessors now to intercede on our behalf? Or could we be sent back? then should we behave differently from our behaviour in the past.\" In fact they will have lost their souls, and the things they invented will leave them in the lurch.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Await they just for the final fulfillment of the event? On the Day the event is finally fulfilled (i.e. the Day of Resurrection), those who neglected it before will say: \"Verily, the Messengers of our Lord did come with the truth, now are there any intercessors for us that they might intercede on our behalf? Or could we be sent back (to the first life of the world) so that we might do (good) deeds other than those (evil) deeds which we used to do?\" Verily, they have lost their ownselves (i.e. destroyed themselves) and that which they used to fabricate (invoking and worshipping others besides Allah) has gone away from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting but for its fulfillment? On the Day when it is realized, those who have forgotten it will say: 'The Messengers of our Lord have surely come with the truth. Have we then any intercessors to intercede for us, or shall we be returned to do other than that we have done' They have lost their souls, and that which they invented will have gone astray from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting for anything but its fulfillment? The Day its fulfillment comes true, those who disregarded it before will say, “The messengers of our Lord did come with the truth. Have we any intercessors to intercede for us? Or, could we be sent back, to behave differently from the way we behaved before?” They ruined their souls, and what they used to invent has failed them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they await except its result? The Day its result comes those who had ignored it before will say, \"The messengers of our Lord had come with the truth, so are there [now] any intercessors to intercede for us or could we be sent back to do other than we used to do?\" They will have lost themselves, and lost from them is what they used to invent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:53] Are they waiting — they are not waiting — for anything but its fulfilment, the consequences of what is in it?   On the day when its fulfilment comes, which will be [on] the Day of Resurrection, those who were forgetful of it before, [those who] neglected to believe in it, shall say, ‘Indeed, our Lord’s messengers came with the truth. Have we then any intercessors, that they may intercede for us, or shall we be returned, to the world, that we may act otherwise than we used to act?’, [and instead] affirm God’s Oneness and refrain from associating others with Him. It will then be said to them, ‘No!’ God, exalted be He, says: Verily they have lost their souls, for they have ended up in perdition, and that which they used to invent, in alleging [that God has] a partner, has failed, has abandoned, them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Await they) what do the people of Mecca wait for when they have refused to believe (aught save the fulfilment thereof) the consequence of what Allah has promised them in the Qur'an? (On the day) which is the Day of Judgement (when the fulfilment thereof) when the consequence of what Allah has promised them in the Qur'an (cometh, those who were before forgetful thereof) those who did not believe in it in the life of this world (will say: The messengers of our Lord did bring the Truth!) with the exposition of the resurrection, Paradise and hell but we denied all. (Have we any intercessors, that they may intercede for us) to avoid the torment? (Or can we be returned) to life on earth, (that we may act) that we may believe and act (otherwise than we used to act) of idolatry? (They have lost their souls) by missing Paradise and abiding in hell, (and that which they devised) that which they worshipped falsely (hath failed them).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { هَلْ يَنظُرُونَ إِلاَّ تَأْوِيلَهُ } قالَ زيدُ بن علي عليهما السَّلامُ: معناهُ هل يَنظرُونَ إِلاَّ مَعانِيهِ وتَفْسيرَهُ\n ويقالُ عَاقِبَتُهُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Do they not look at the camel}, Zayd ibn Ali said, \"Do they not look at its meanings and its interpretation?\"\n\n\nAnd it is said that his end will be",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وهم { قَدْ خَسِرُوۤاْ أَنْفُسَهُمْ } بالكفر والشرك وعبادة الغير { وَ } مع ذلك { ضَلَّ } غاب وخفي { عَنْهُمْ } لدى الحاجة { مَّا كَانُواْ يَفْتَرُونَ } [الأعراف: 53] لشركائهم من الشفاعة المظاهرة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { هل ينظرون } أي: ما ينتظر الكفار به { إلا تأويلَه } ، أي: ما يؤول إليه أمره من تبين صدقه، بظهور ما نطق به من الوعد والوعيد، بقيام الساعة وما بعدها، { يوم يأتي تأويلُه } بظهور ما نطق به، { يقول الذين نَسُوه من قبل } ، ولم يؤمنوا به: { قد جاءت رسُل ربنا بالحق } أي: قد تبين أنهم جاؤوا بالحق، وحصل لهم اليقين حيث لم ينفع، ثم طلبوا من يشفع فيهم فقالوا: { فهل لنا من شفعاءَ فيشفعوا لنا } اليوم، { أو نُردُّ } أي: وهل نرد إلى الدنيا { فنعملَ غيرَ الذي كنا نعملُ } فنستبدل الكفر بالإيمان، والعصيان بالطاعة والإذعان، أو: فيشفعوا لنا في أحد الأمرين: إما السلامة من العذاب، أو الرد إلى الدنيا فنستبدل الكفر بالإيمان\n قال تعالى: { قد خسروا أنفسهم } أي: بخسوها بسوء أعمالهم وكفرهم، { وضلَّ عنهم ما كانوا يفترون } أي: غاب عنهم افتراؤهم فلم ينفعهم\n الإشارة: إذا وصل أهل الجد والتشمير إلى حضرة العلي الكبير، وأفاض عليهم من ماء غيبه، حتى امتلأت قلوبهم وأسرارهم، فأثمر لهم العلوم اللدنية والأسرار الربانية ناداهم أهل البطالة والتقصير: أفيضوا علينا من الماء الذي سقاكم الله منه، أو مما رزقكم من العلوم والمعارف\n\n\nقالوا: إن الله حرمهما على البطالين الذين اتخذوا طريق القوم لهوًا ولعبًا، وغرتهم الحياة الدنيا فقبضتهم في شبكتها، فيقول تعالى: فاليوم ننساهم من لذيذ مشاهدتي، وحلاوة معرفتي، كما نسوا لقائي بشهود ذاتي، وأنكروا على أوليائي وأهل معرفتي، وجحدوا وجود التربية وحجروا على قدرتي، ولقد جئناهم بكتاب فصّلنا فيه كل شيء فقلنا فيه:\n\n[البَقَرَة:106] إلى يوم القيامة، هل ينظرون إلا تأويله؟ يوم يأتي تأويله بظهور درجات المقربين، في أعلى عليين، حينئذٍ يحصل لهم اليقين بوجود المقربين، أو بالتربية النبوية في كل زمان وحين، فيطلب الشفاعة في اللحوق بهم، أو يرد إلى العمل بعملهم\n\n هيهات! قد بُعثر ما في القبور، وحُصّل ما في الصدور، فخسر المبطلون، وفاز المجتهدون السابقون\n جعلنا الله منهم بمنِّه وكرمه\n ثم عرَّف الحق ـ جل جلاله ـ بنفسه ليعرفه من أراد معرفته في الدنيا، فقال: { إِنَّ رَبَّكُمُ ٱللَّهُ ٱلَّذِي خَلَقَ ٱلسَمَاوَاتِ وَٱلأَرْضَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:21",
      "similarity": 0.3930162709136764
    },
    {
      "verse": "43:86",
      "similarity": 0.3344444538817777
    },
    {
      "verse": "26:100",
      "similarity": 0.33260581857542465
    },
    {
      "verse": "30:13",
      "similarity": 0.32055646467517845
    },
    {
      "verse": "2:48",
      "similarity": 0.316611871801802
    }
  ]
}