{
  "chapter": "الأعراف",
  "text": "ولا تفسدوا۟ فى الارض بعد اصلحها وادعوه خوفا وطمعا ان رحمت الله قريب من المحسنين",
  "translations": [
    {
      "translation": "And do not corrupt the land after it has been reformed; and pray to Him in awe and expectation. The blessing of God is at hand for those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Anddo not make mischief in the earth after it has been set in order, and call upon Him with fear and longing. Surely Allah's mercy is close to those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not destroy the land after it has been well established but pray to God, have fear of Him, and hope to receive His mercy. God's mercy is close to the righteous people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not spread turmoil in the earth after its reform, and pray to Him with fear and hope; indeed Allah’s mercy is close to the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not do mischief on the earth, after it has been set in order, and invoke Him with fear and hope. Surely, Allah's mercy is (ever) near unto the good-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not make mischief in the earth after its reformation, and call on Him fearing and hoping; surely the mercy of Allah is nigh to those who do good (to others).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not corruption in the land, after it has been set, right; and call on Him fearfully, eagerly -- surely the mercy of God is nigh to the good-doers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Work not confusion in the earth after the fair ordering (thereof). and call on Him in fear and hope. Lo! the mercy of Allah is nigh unto the good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "do not spread corruption on the earth after it has been set in order, pray to Him with fear and hope, God's mercy is close to those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And act not corruptly in the earth after the good ordering thereof, and call on Him fearing and longing; verily the mercy of Allah is nigh unto the well-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not cause corruption on the earth after its restoration, and supplicate Him with fear and hope: indeed Allah’s mercy is close to the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do no mischief on the earth, after it hath been set in order, but call on Him with fear and longing (in your hearts): for the Mercy of Allah is (always) near to those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not do mischief on the earth, after it has been set in order, and invoke Him with fear and hope; Surely, Allah's Mercy is (ever) near unto the good-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not make mischief in the earth after it has been put right. Pray to Him with fear and hope; His Mercy is near to the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not corrupt on earth after its reformation, and pray to Him with fear and hope. God’s mercy is close to the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And cause not corruption upon the earth after its reformation. And invoke Him in fear and aspiration. Indeed, the mercy of Allah is near to the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:56] And work not corruption in the land, through idolatry and acts of disobedience, after it has been set right, as a result of the sending forth of messengers [to it], and call upon Him in fear, of His punishment, and in hope, of His mercy — surely the mercy of God is near to the virtuous, the obedient (qarīb, ‘near’, as the predicate of [the feminine noun] rahma, ‘mercy’, is in the masculine because it [rahma] is annexed to Allāh, ‘God’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Work not confusion) through sins and invitation to other than Allah (in the earth after the fair ordering (thereof)) through obedience and calling to Allah, Exalted is He, (and call on Him) worship Him (in fear) of Him and His torment (and hope) in Him that you shall enter His Paradise. (Lo! the mercy of Allah) the 163 Paradise of Allah (is nigh unto the good) the believers who are good in their words and works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } عليكم أن { لاَ تُفْسِدُواْ فِي ٱلأَرْضِ } التي هي محل الكون والفساد { بَعْدَ إِصْلاَحِهَا } بإرسال الرسل وإنزال الكتب { وَٱدْعُوهُ } سبحانه إن أردتم الالتجاء إليه والمناجاة معه { خَوْفاً وَطَمَعاً } أي: خائفين من رده بمقتضى قهره وانتقامه، راجعين قبوله من فضله وإحسانه { إِنَّ رَحْمَتَ ٱللَّهِ } المجيب للمضطرين عناية ولطفاً { قَرِيبٌ مِّنَ ٱلْمُحْسِنِينَ } [الأعراف: 56] الذين يعبدمن الله كأنهم يرونه، ويقومون بين يديه خائفاً مستحيياً من سطوة سلطته وقهره وجلاله، طامعاً راجياً من طوله ونواله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ ولا تُفسدوا في الأرض } بالكفر والمعاصي، { بعد إصلاحها } ببعث الأنبياء، وشرع الأحكام، أو: ولا تفسدوا في الأرض بالمعاصي الموجبة لفساد العالم بالقحط والفتن، بعد إصلاحها بالخصب والأمان، { وادعوه خوفًا وطمعًا } أي: خوفًا من الرد لقصور الأعمال، وطمعًا في القبول بالفضل والكرم { إن رحمةَ الله قريبٌ من المحسنين } المخلصين\n قال البيضاوي: هو ترجيح للطمع، وتنبيه على ما يتوصل به إلى الإجابة، وتذكير قريب لأن الرحمة بمعنى الترحم، أو لأنه صفة محذوف أي: أمر قريب، أو على تشبيه فعيل الذي هو بمعنى مفعول، أو للفرق بين القريب من النسب، والقريب من غيره\n هـ\n قلت: والأحسن أنه إنما ذكره لأن المراد بالرحمة هنا: سر الخصوصية، وهو مذكر، فراعى معنى اللفظ، كأنه قال: إن سر الولاية ـ وهي الخصوصية ـ قريب من المحسنين\n والله تعالى أعلم\n الإشارة: قوله تعالى: { في ستة أيام }: قال الورتجبي: في كل يوم من هذه الأيام: ظهور صفة من صفاته الست: أولها: العلم، والثاني: القدرة: والثالث: السمع، والرابع: والبصر، والخامس: الكلام، والسادس: الإرادة، كملت الأشياء بظهور أنوار الصفات الستة، ولما أتمها صارت الحدثان كجسد آدم بلا روح، فتجلى من صفته السابعة\n وهي حياته القديمة الأزلية الباقية، المنزهة عن همهمة الأنفاس والمشابهة والقياس ـ فقامت الأشياء بصفاته القائمة بذاته، ويكون إلى الأبد لحياتها بروح حياته، المقدسة عن الاتصال والانفصال\n قلت: وهي المعبَّر عنها بالمعاني القائمة بالأواني\n\n\nثم قال: وفي أدق الإشارة: السماوات: الأرواح، والأرض: الأشباح، والعرش: القلوب، بدأ بكشف الصفات للأرواح، وبدأ بكشف الأفعال للأشباح، ثم بدأ بكشف الذات للقلوب لأن مناظر القلوب للغيوب، والغيوب من القلوب محل تجلّي استواء القدم، استوى قهر القدم، بنعت الظهور للعدم، أي: فتلاشى العدم، ثم استوى تجلّي الصفات على الأفعال، واستوى تجلّي الذات على الصفات، فاستوى بنفسه لنفسه، المنزه عن المباشرة بالحدثان والاتصال والانفصال عن الأكوان\n قلت: أي: إذ لا حدثان ولا أكوان لأنها لما قرنت بالقدم تلاشت، وما بقي إلا نعت القدم\n ثم قال: خصَّ السماوات والأرض بتجلي الصفات، وخص العرش بتجلي الذات\n قلت: لأن المعاني المستولية على العرش باقية على أصلها، وهي أسرار الذات لم تتَرَدَّ برداء الكبرياء، وهو حجاب الحس الظاهر، بخلاف المعاني القائمة بالأواني، وهي أنوار الصفات، تجلت مرتدية بحجاب القهرية، فقيل لها: تجلي الصفات\n ثم قال: السماوات والأرض جسد العالم، والعرش قلب العالم، والكرسي دماغ العالم، خص الجميع بالأفعال والصفات، وخص العرش بظهور الذات لأنه قلب الكل، وهو غيب الرحمن وعلمه وحكمته، رأيته في المكاشفة أنوارًا شعشعانيًا، بلا جسم ولا مكان ولا صورة، يتلألأ، فسألت عن ذلك، فقيل لي: هذا عالم يسمى عرشًا\n انتهى\n قلت: وأقرب من هذا كله: أن العرش قد استولى على ما في جوفه من العوالم، حتى صارت في وسطه كلا شيء، ومعاني أسرار الربوبية، وهي العظمة الأصلية ـ قد استولت عليه، وأحاطت به، ومحت وجوده، فعبَّر الحق ـ جل جلاله ـ عن استيلاء هذه العظمة ـ التي هي أسرار الربوبية ـ على العرش بالاستواء\n وإلى هذا أشار في الحكم العطائية بقوله: \" يا من استوى برحمانيته على عرشه، فصار العرش غيبًا في رحمانيته، كما صارت العوالم غيبًا في عرشه، محقت الآثار بالآثار، ومحوت الآثارـ وهي العرش وما احتوى عليه ـ بمحيطات أفلاك الأنوار \" وهي أسرار الذات المحيطات بالآثار ـ من العرش إلى الفرش، فعبّر عن المعاني المستولية على العرش بالرحمانية لأن الرحمانية صفة الذات، والصفة لا تفارق الموصوف، فافهم\n قلت: ومن كحل عينه بإثمد توحيد الذات لا يستعبد أن يكون الحق ـ جل جلاله ـ يتجلى بتجل خاص من أسرار ذاته وأنوار صفاته، يستوي بتلك العظمة على العرش، كما يتجلى يوم القيامة لفصل القضاء بين عباده، إذ تجلياته لا تنحصر، بل كل ما ظهر في عالم الشهادة فإنما هو نور من تجلّي ذاته وصفاته\n وهذا القدر كاف لمن شم شيئًا من أسرار التوحيد، وقد تكلم ابن جزي هنا على الخوف والرجاء، وأطال فيهما، ولكنه يجنح لتصوف أهل الظاهر، وقد تقرر في محله\n وقوله تعالى: { إن رحمة الله قريب من المحسنين }: هو تقييد لقوله: { يختص برحمته من يشاء } فالمختص بالرحمة هم المحسنون\n انظر لفظ الحكم\n والله تعالى أعلم\n ثم ذكر الحقّ ـ جلّ جلاله ـ تصاريف قدرته المفهوم من قوله: { أَلاَ لَهُ ٱلْخَلْقُ وَٱلأَمْرُ } ، فقال: { وَهُوَ ٱلَّذِي يُرْسِلُ ٱلرِّيَاحَ بُشْراً بَيْنَ يَدَيْ رَحْمَتِهِ }\n\n",
      "translations": []
    }
  ]
}