{
  "chapter": "الأعراف",
  "text": "وهو الذى يرسل الريح بشرۢا بين يدى رحمته حتى اذا اقلت سحابا ثقالا سقنه لبلد ميت فانزلنا به الماء فاخرجنا به من كل الثمرت كذلك نخرج الموتى لعلكم تذكرون",
  "translations": [
    {
      "translation": "He it is who sends out the winds, bringing advance news of His mercy, so that when they have lifted up the heavy clouds, We dispatch them to a dead land and send down water to it, by means of which We bring forth all kinds of fruit. In the same way We will bring forth the dead, so that hopefully you will pay heed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed it is He who sends the winds as harbingers of auspicious news announcing His beneficence, bringing heavy clouds which We drive towards a region lying dead, and send down rain, and raise all kinds of fruits. So shall We raise the dead that you may think and reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who sends forth winds as glad tidings in advance of His Mercy, and when they have carried a heavy-laden cloud We drive it to a dead land, then We send down rain from it and bring forth therwith fruits of every kind. In this manner do We raise the dead that you may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God sends the wind bearing the glad news of His mercy. When heavy clouds are formed, We drive them unto a barren country and rain down on it water to cause all kinds of fruits to grow. In the same way do We bring the dead to life again. Perhaps you would take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who sends the winds giving glad tidings, ahead of His mercy; until when they come bearing heavy clouds, We drove it towards a city devoid of vegetation, and then rained water upon it, then produced fruits of various kinds from it; this is how We will bring forth the dead, so that you may heed advice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who sends the winds as heralds of glad tidings, going before His mercy (rain). Till when they have carried a heavy-laden cloud, We drive it to a land that is dead, then We cause water (rain) to descend thereon. Then We produce every kind of fruit therewith. Similarly, We shall raise up the dead, so that you may remember or take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who sends forth the winds bearing good news before His mercy, until, when they bring up a laden cloud, We drive it to a dead land, then We send down water on it, then bring forth with it of fruits of all kinds; thus shall We bring forth the dead that you may be mindful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who looses the winds, bearing good tidings before His mercy, till, when they are charged with heavy clouds, We drive it to a dead land and therewith send down water, and bring forth, therewith all the fruits. Even so We shall bring forth the dead; haply you will remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who sendeth the winds as tidings heralding His mercy, till, when they bear a cloud heavy (with rain), We lead it to a dead land, and then cause water to descend thereon and thereby bring forth fruits of every kind. Thus bring We forth the dead. Haply ye may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who sends forth the winds as harbingers of His mercy, and when they have gathered up the heavy clouds, We drive them on to a dead land where We cause rain to fall, bringing out all kinds of fruit, just as We will raise the dead to life. Perhaps you will take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who sendeth forth the heralding winds before His mercy, until when they have carried a heavy-laden cloud We drive it unto a dead land and send down rain thereby and bring forth thereby all kinds of fruits. In this wise We will raise the dead; haply ye may be admonished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends forth the winds as harbingers of His mercy. When they bear [rain-] laden clouds, We drive them toward a dead land and send down water on it, and with it We bring forth all kinds of crops. Thus shall We raise the dead; maybe you will take admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who sendeth the winds like heralds of glad tidings, going before His mercy: when they have carried the heavy-laden clouds, We drive them to a land that is dead, make rain to descend thereon, and produce every kind of harvest therewith: thus shall We raise up the dead: perchance ye may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who sends the winds as heralds of glad tidings, going before His Mercy (rain). Till when they have carried a heavy-laden cloud, We drive it to a land that is dead, then We cause water (rain) to descend thereon. Then We produce every kind of fruit therewith. Similarly, We shall raise up the dead, so that you may remember or take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends forth the winds as carriers of the glad tidings between the hands of His Mercy, and when they have carried up a heavy cloud, We drive it on to some dead land and therewith send down water bringing forth all manner of fruit. As such We will raise the dead, in order that you remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends the wind ahead of His mercy. Then, when they have gathered up heavy clouds, We drive them to a dead land, where We make water come down, and with it We bring out all kinds of fruits. Thus We bring out the dead—perhaps you will reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who sends the winds as good tidings before His mercy until, when they have carried heavy rainclouds, We drive them to a dead land and We send down rain therein and bring forth thereby [some] of all the fruits. Thus will We bring forth the dead; perhaps you may be reminded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:57] He it is Who sends the winds, unfolding with His mercy, that is, dispersing before the rains (a variant reading [for nushuran, ‘unfolding’] has nushran; another reading has nashran as the verbal noun; and a third variant has bushran, meaning mubashshiran, ‘[with which] He is bearing good tidings [of His mercy]’; the singular of the first reading is nashūr, similar [in pattern] to rasūl, ‘messenger’; the singular of the last is bashīr) until, when they, the winds, bear heavy clouds, [clouds heavy] with rain, We lead it, that is, [We lead] the clouds (herein is a shift from the third [to the first] person), to a dead land, one devoid of any vegetation, in other words, [We lead it there] in order to revive it, and then We send down thereon, on that land, and bring forth thereby, by this water, fruits of every kind. Like that, bringing forth, We shall bring forth the dead, from their graves, through revivification, so that you might remember, and believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And He it is Who sendeth the winds as tidings heralding His mercy) before the rain, (till, when they bear a cloud heavy (with rain), We lead it to a dead land) with no vegetation, (and then cause water to descend thereon) on that dead land, (and thereby bring forth) by means of this water (fruits of every kind. Thus) just as We revive the earth with vegetation (bring We forth the dead) We revive and bring forth the dead from their graves. (Haply you may remember) haply you may take heed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يُرْسِلُ ٱلرِّيَاحَ بُشْراً بَيْنَ يَدَيْ رَحْمَتِهِ } معناهُ مِن كُلِّ مَهبٍ وَجانبٍ ونَاحيةٍ\n\n\n\n\nوقوله تعالى: { أَقَلَّتْ سَحَاباً } معناهُ سَاقتْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"He sends the winds as a glad tiding before His mercy\" - this means that from every direction and side, there is hope.\n The saying of the Most High: {The clouds have lessened} means that it has rained.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا يكون رحمته قريبة من المؤمنين المحسنين { هُوَ ٱلَّذِي يُرْسِلُ ٱلرِّيَاحَ } أي: يثيرها { بُشْراً } مبشرات { بَيْنَ يَدَيْ رَحْمَتِهِ } قدام روحه ورحمته { حَتَّىٰ إِذَآ أَقَلَّتْ } حملت وأثقلت وجمعت من البخارات المتراكمة { سَحَاباً } غليظاً { ثِقَالاً } بالأجزاء المائية { سُقْنَاهُ } من غاية لطفنا { لِبَلَدٍ مَّيِّتٍ } يابس لأجل إحيائه ونضارته { فَأَنْزَلْنَا بِهِ } أي: بالبلد الميت { ٱلْمَآءَ } المحيي { فَأَخْرَجْنَا بِهِ } أي: بالماء { مِن كُلِّ ٱلثَّمَرَاتِ } أي: أنواعها وأجناسها المختلفة بالألوان والطعوم { كَذٰلِكَ } أي: مثل إخراجنا بالماء الصوري أنواع الثمرات من البلد الميت\n نخرج بالماء المعنوي الذي هو العلم اللدني من أراضي القابليات واستعدادات الموتى المحجوبين بالحجاب الظلماني والجهل الجبلي الهيولاني\n بإرسال رياح أنفاس الأنبياء والأولياء المستنشقة من النفس الرحماني\n مبشرات بالكشوف والمشاهدات حتى إذا اجتمعت صارت سحاباً شرعياً ثقيلاً بمياه الحكمة والتقوى\n سقناه من غاية جودنا إلى بلاد النفوس الميتة اليابسة\n فأجرينا فيها أنهار المعارف والحقائق المنتشئة من قلوب الأنبياء والأولياء\n فأخرجنا به ثمرات اليقين العلمي والعيني والحقي { نُخْرِجُ ٱلْموْتَىٰ } في النشأة الأخرى { لَعَلَّكُمْ تَذَكَّرُونَ } [الأعراف: 57] فتعرفون قدرتنا على جميع مقدوراتنا ومراداتنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: نُشُرًا: حال من الرياح\n وهو جمع نشور\n بمعنى ناشر\n ومن قرأ بسكون الشين\n فهو تخفيف منه\n ومن قرأ بفتح النون\n فمصدر في موضع الحال\n بمعنى: ناشرات\n أو مفعول مطلق فإن الإرسال والنشر متقاربان\n ومن قرأه بالباء وسكون الشين فهو جمع بشير\n مخفف\n وأقَلَّت: مشتق من القلة لأن الحامل للشيء يستقله\n وثقالاً: جمع لأن السحاب جمع بمعنى السحائب\n يقول الحقّ جلّ جلاله: { وهو الذي يرسل الرياح } أو الريح نُشْرًا أي: تنشر السحاب\n وتفرقه إلى الأرض التي أراد الله أن تمطر\n أو بشارة بالمطر\n { بين يدي رحمته } أي: قبل نزول المطر\n فهي قدامَه فإن الصبا تثير السحاب\n والشمال تجمعه\n والجنوب تذره\n والدبور تُفرقه\n قاله البيضاوي\n { حتى إذا أقلَّت } أي: حملت { سحابًا ثِقالاً } بالماء لأنها تحمل الماء فتثقل به\n { سُقناه } أي: السحاب بما اشتمل عليه من الماء\n { لبلدٍ ميِّتٍ } أي: لإحيائه أو لسَقيه بعد يبسه\n كأنه ميت\n { فأنزلنا به } أي: بالبلد\n أو بالسحاب\n أو بالسوق\n أو بالريح\n { الماء } الذي في السحاب\n { فأخرجنا به } أي: بالماء\n { من كل الثمرات } من كل أنواعها وأصنافها\n { كذلك نُخرج الموتى } من القبور\n أي: كما نُحيي البلد بإحداث القوة النامية فيه وتطريتها بأنواع النبات والثمرات { كذلك نُخرج الموتى } من الأجداث ونحييها برد النفوس إلى مواد أبدانها بعد جمعها وتطريتها بالقُوى الحسية\n قاله البيضاوي\n وقال ابن جزي: هو تمثيل لإخراج الموتى من القبور بإخراج الزرع من الأرض\n وقد وقع ذلك في القرآن في مواضع منها:\n[فَاطِر:9]\n و\n[قَ:11]\n هـ\n { لعلكم تذكَّرون } فتعلمون أن من قدر على ذلك قدر على إحياء الموتى\n إذ لا فرق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:9",
      "similarity": 0.525597140907055
    },
    {
      "verse": "2:126",
      "similarity": 0.339284656349927
    },
    {
      "verse": "43:11",
      "similarity": 0.3312398181261787
    },
    {
      "verse": "13:12",
      "similarity": 0.3175141568116229
    },
    {
      "verse": "2:164",
      "similarity": 0.300273538515048
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007057.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007057.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:57.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}