{
  "chapter": "الأعراف",
  "text": "والبلد الطيب يخرج نباته باذن ربه والذى خبث لا يخرج الا نكدا كذلك نصرف الءايت لقوم يشكرون",
  "translations": [
    {
      "translation": "Good land yields up its plants by its Lord's permission, but that which is bad only yields up scantily. In this way We vary the Signs for people who are thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The soil that is good produces (rich) crops by the will of its Lord, and that which is had yields only what is poor. So do We explain Our signs in different ways to people who give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the good land, vegetation comes forth in abundance by the command of its Lord, whereas from the bad land, only poor vegetation comes forth. Thus do We expound Our signs in diverse ways for a people who are grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A good land produces plants, by the permission of its Lord, but a wicked land produces only miserable, bitter plants. Thus do We show a variety of evidence for those who give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from the good land comes forth its vegetation by the command of Allah; and from the infertile land, nothing comes forth except a little with difficulty; this is how We explain Our signs in different ways, for people who are thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The vegetation of a good land comes forth (easily) by the permission of its Lord; and that which is bad, brings forth nothing but (a little) with difficulty. Thus do We explain variously the Ayat for a people who give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the good land, its vegetation springs forth (abundantly) by the permission of its Lord, and (as for) that which is inferior (its herbage) comes forth but scantily; thus do We repeat the communications for a people who give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the good land -- its vegetation comes forth by the leave of its Lord, and the corrupt -- it comes forth but scantily. Even so We turn about the signs for a people that are thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the good land, its vegetation cometh forth by permission of its Lord; while as for that which is bad, only the useless cometh forth (from it). Thus do We recount the tokens for people who give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Vegetation comes out of good land in abundance by the will of its Lord, but out of bad land only scantily. Thus We explain Our signs in diverse ways for those who give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a good land: its herbage cometh forth by the command of its Lord; and that which is vile, it cometh forth only scantily. In this wise We vary the signs for a people who return thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The good land—its vegetation comes out by the permission of its Lord, and as for that which is bad, it does not come out except sparsely. Thus do We paraphrase the signs variously for a people who give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From the land that is clean and good, by the will of its Cherisher, springs up produce, (rich) after its kind: but from the land that is bad, springs up nothing but that which is niggardly: thus do we explain the signs by various (symbols) to those who are grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The vegetation of a good land comes forth (easily) by the Permission of its Lord, and that which is bad, brings forth nothing but a little with difficulty. Thus do We explain variously the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) for a people who give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Good land yields its vegetation by the permission of its Lord. While the corrupted yields only the scanty. So We make plain the verses to those who are thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the good land, it yields its produce by the leave of its Lord. But as for the bad, it produces nothing but hardship and misery. Thus We explain the revelations in various ways for people who are thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the good land - its vegetation emerges by permission of its Lord; but that which is bad - nothing emerges except sparsely, with difficulty. Thus do We diversify the signs for a people who are grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:58] As for the good land, the one of rich soil, its vegetation comes forth, wholesomely, by permission of its Lord — this is a similitude of the believer who, when he hears an admonition, he [heeds it and] benefits from it. While as for the, one whose soil is, bad — the vegetation in, it comes forth only miserably, laboriously and with difficulty — this is the similitude of the disbeliever. Even, as We have made clear what has been mentioned, so We dispense, We make clear, the signs for a people who are thankful, to God and so believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجملة معترضة بين جملة : { كذلك نخرج الموتى } \\[ الأعراف : 57 \\] وبين جملة : { لقد أرسلنا نوحاً } \\[ الأعراف : 59 \\] تتضمّن تفصيلاً لمضمون جملة : { فأخرجنا به من كل الثمرات } \\[ الأعراف : 57 \\] إذ قد بيّن فيها اختلاف حال البلد الذي يصيبه ماء السّحاب ، دعا إلى هذا التّفصيل أنّه لما مُثِّل إخراج ثمرات الأرض بإخراج المَوتى منها يوم البعث تذكيراً بذلك للمؤمنين ، وإبطالاً لإحالة البعث عند المشركين ، مُثل هنا باختلاف حال إخراج النّبات من الأرض اختلافُ حال النّاس الأحياءِ في الانتفاع برحمة هُدى الله ، فموقع قوله : { والبلد الطيب يخرج نباته بإذن ربه } كموقع قوله : { كذلك نخرج الموتى } \\[ الأعراف : 57 \\] ولذلك ذُيل هذا بقوله : { كذلك نصرف الأيات لقوم يشكرون } كما ذيل ما قبله بقوله : { كذلك نخرج الموتى لعلكم تذكرون } \\[ الأعراف : 57 \\].والمعنى : كذلك نخرج الموتى وكذلك ينتفع برحمة الهَدْي من خُلقت فطرته طيّبة قابلة للهُدى كالبلد الطّيّب ينتفع بالمطر ، ويحرم من الانتفاع بالهدى من خلقت فطرته خبيثة كالأرض الخبيثة لا تنتفع بالمطر فلا تنبت نباتاً نافعاً ، فالمقصود من هذه الآية التّمثيل ، وليسَ المقصود مجرّد تفصيل أحوال الأرض بعد نزول المطر ، لأنّ الغرض المسوق له الكلام يجمع أمرين : العبرةَ بصنع الله ، والموعظَة بما يماثل أحواله . فالمعنى : كما أنّ البلد الطّيّب يَخرج نباته سريعاً بَهِجاً عند نزول المطر ، والبلد الخبيثَ لا يكاد ينبت فإن أنبت أخرج نبْتاً خبيثاً لا خير فيه .والطيب وصف على وزن فَيْعِل وهي صيغة تدلّ على قوّة الوصف في الموصوف مثل : قيّم ، وهو المتّصف بالطِّيببِ ، وقد تقدّم تفسير الطيب عند قوله تعالى : { قل أحلّ لكم الطّيّباتُ } في سورة المائدة ( 4 ) ، وعند قوله : { يأيّها النّاس كلوا ممّا في الأرض حلالاً طيِّباً } في سورة البقرة ( 168 ).والبلد الطّيب الأرضُ الموصوفة بالطِّيببِ ، وطيبها زكاء تربتها وملاءمتها لإخراج النّبات الصّالح وللزّرع والغرس النّافع وهي الأرض النّقيّه .والذي خبث ضدّ الطَّيب .وقوله : { بإذن ربه } في موضع الحال من { نباته } والإذن : الأمر ، والمراد به أمر العناية به كقوله : { لِمَا خلقتُ بيَدَيّ } \\[ ص : 75 \\] ليدلّ على تشريف ذلك النّبات ، فهو في معنى الوصف بالزّكاء ، والمعنى : البلد الطَّيب يخرج نباته طيّباً زكياً مثلَه ، وقد أشار إلى طيب نباته بأنّ خروجه بإذن ربّه ، فأريد بهذا الإذن إذنٌ خاص هو إذن عناية وتكريم ، وليس المراد إذن التّقدير والتّكوين فإنّ ذلك إذن معروف لا يتعلّق الغرض ببَيانه في مثل هذا المقام .{ والذي خبث } حملهُ جميع المفسّرين على أنّه وصف للبلد ، أي البلد الذي خبث وهو مقابل البلد الطّيب ، وفسّروه بالأرض التي لا تنبت إلاّ نباتاً لا ينفع ، ولا يسرع إنباتها ، مثل السّباخ ، وحملوا ضمير يَخْرج على أنّه عائد للنّبات ، وجعلوا تقدير الكلام : والذي خبث لا ( يخرج ) نباتُه إلاّ نَكِداً ، فحُذف المضاف في التّقدير ، وهو نبات ، وأقيم المضاف إليه مقامه ، وهو ضمير البلد الذي خبث ، المستترُ في فعل يخرج .والذي يظهر لي : أن يكون { الذي } صادقاً على نبات الأرض ، والمعنى : والنّبت الذي خبث لا يخرج إلاّ نَكِداً ، ويكون في الكلام احتباك إذ لم يذكر وصف الطّيب بعد نبات البلد الطّيب ، ولم تذكر الأرض الخبيثة قبل ذكر النّبات الخبيث ، لدلالة كِلا الضدّين على الآخر . والتّقدير : والبلد الطّيب يخرج نباته طيّباً بإذْن ربّه ، والنّبات الذي خبث يخرج نكداً من البلد الخبيث ، وهذا صنع دقيق لا يهمل في الكلام البليغ .وقرأ الجميع { لا يَخْرُج } بفتح التّحتيّة وضمّ الراء إلاّ ابنَ وردان عن أبي جعفر قرأ بضمّ التّحتيّة وكسر الرّاء على خلاف المشهور عنه ، وقيل إنّ نسبة هذا لابن وردان توهم .والنّكد وصف من النكَد بفتح الكاف وهو مصدر نَكِدَ الشّيءُ إذا كان غير صالح يَجُرّ على مستعمله شراً . وقرأ أبو جعفر { إلا نكداً } ، بفتح الكاف .وفي تفصيل معنى الآية جاء الحديث الصّحيح عن النبي صلى الله عليه وسلم أنّه قال : « مثَلُ ما بَعثني الله به من الهُدى والعلم كمثل الغيث الكثير أصاب أرضاً فكان منها نَقِيَّةٌ قبِلَتْ الماءَ فأنبتت الكلأ والعُشْب الكثيرَ ، وكانت منها أجَادِبُ أمسكت الماء فنفع بها الله النّاسَ فشربوا وسَقَوا وزرعوا ، وأصاب طائفة أخرى إنّما هي قِيعَانٌ لا تُمْسك ماء ولا تنبتُ كَلأ فذلك مثَل مَن فَقُه في دين الله ونفعه ما بعثني اللَّهُ به فَعَلِمَ وَعَلَّمَ ، ومَثَل من لم يَرْفَعْ لِذلك رأساً ولم يَقْبَل هُدَى اللَّهِ الذي أُرْسِلْتُ به » . والإشارة بقوله : { كذلك نصرف الأيات } إلى تفنّن الاستدلال بالدّلائل الدّالة على عظيم القدرة المقتضية الوحدانيّة ، والدّالة أيضاً على وقوع البعث بعد الموت ، والدّالة على اختلاف قابليّة النّاس للهدى والانتفاع به بالاستدلال الواضححِ البيّن المقِرّب في جميع ذلك ، فذلك تصريف أي تنويع وتفنين للآيات أي الدّلائل .والمراد بالقوم الذين يشكرون : المؤمنون : تنبيهاً على أنّهم مورد التّمثيل بالبلد الطّيب ، وأنّ غيرهم مورد التّمثيل بالبلد الخبيث ، وهذا كقوله تعالى : { وتلك الأمثال نضربها للنّاس وما يعقلها إلاّ العالِمُون } \\[ العنكبوت : 43 \\].\n\n",
      "translations": [
        {
          "translation": "(As for the good land) which is not a swamp, (its vegetation cometh forth by permission of its Lord) by the will of its Lord without toil or effort, just as the sincere believer fulfils that which Allah commands him to do voluntarily and with the good disposition of his soul; (while as for that which is bad) the bad, swampy land, (only the useless cometh forth (from it)) its vegetation comes forth only with toil and great effort. The hypocrite does not perform that which Allah commands him to do except when compelled and without a good disposition of the soul. (Thus do We recount the tokens) We expound the Qur'an by giving the simile of the believer and the disbeliever (for people who give thanks) for people who believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ يَخْرُجُ إِلاَّ نَكِداً } معناهُ إَلا قَليلاً عَسراً في شِدةٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {There is none that comes out but with great difficulty} means, except with great difficulty and hardship.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعد سوقنا مياه جودنا إلى أموات { ٱلْبَلَدُ ٱلطَّيِّبُ } الذي هو نجيب المنبت\n لطيف الطينة\n قابل التربية { يَخْرُجُ نَبَاتُهُ بِإِذْنِ رَبِّهِ } أي: بتوفيقه سبحانه وتربيته جيداً نافعاً كثيراً على مقتضى استعداده الفطري { وَ } البلد { ٱلَّذِي خَبُثَ } طينته وقل قابليته كالحرة والسبخة { لاَ يَخْرُجُ } نباته بد إجراء المياه اللطيفة عليه { إِلاَّ نَكِداً } قليلاً غير نافع\n بل ضار كالنفوس المنهمكة في الغفلة والضلال إلى حيث لا يؤثر فيها مياه الحكم والمعارف الجارية على ألسنة الرسل\n لخباثة طينتها وقلة قابليتها { كَذٰلِكَ نُصَرِّفُ } نردد ونكرر { ٱلآيَاتِ } الدالة على استقلالنا في ملكنا وملكوتنا { لِقَوْمٍ يَشْكُرُونَ } [الأعراف: 58] نعمتنا ويتفكرون في آلائنا\n ويعتبرون بها إلى أن يستغرقوا في مطالعة جمالنا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والبلدُ الطيب } أي: الأرض الكريمة والتراب الجيد { يَخرج نباتُه } بسهولة\n حسنًا قويًا نضرًا\n { بإذن ربه } أي: بمشيئته وقدرته\n { والذي خبُث } من الأرض كالحرة والسبخة\n { لا يخرج إلا نَكِدًا } قليلاً عديم النفع\n أو عسيرًا بمشقة\n { كذلك نُصرِفَ الآيات } نُكررها ونُرددها { لقوم يشكرون } نعمة الله\n فيتفكرون فيها\n ويعتبرون بها\n قال البيضاوي: والآية مثل لمن تدبر الآيات وانتفع بها\n ولمن لم يرفع إليها رأسًا ولم يتأثر بها\n ومثلُه في البخاري في حديث طويل\n وقال ابن عباس وغيره: هو ضرب مثل للمؤمن والكافر\n وقال ابن جزي: يحتمل أن يكون المراد ما يقتضيه ظاهر اللفظ\n فتكون متممة للمعنى الذي قبلها في المطر\n وأن تكون تمثيلاً للقلوب فالطيب: قلب المؤمن\n والخبيث: قلب الكافر\n وقيل: هما للفِهم والبليد\n هـ\n الإشارة: وهو الذي يرسل رياح الهداية\n تنشر سحاب الواردات الإلهية والنفحات الربانية\n بين يدي معرفته\n أو تُبشر بها قبل وصولها\n حتى إذا أقلت سحابًا ثقالاً بالعلوم اللدنية\n سقناه لقلبٍ ميت بالجهل والهوى\n فأنزلنا مما فيه من ماء ذلك الأمطار\n فأخرجنا به من ثمرت العلوم وأزهار الحِكَم ونوار اليقين\n\nوفي الحكم: \" لا تزكين واردًا لم تعلم ثمرته\n فليس المقصود من السحابة الأمطار\n وإنما المقصود وجود الأثمار \"\n { كذلك نخرج الموتى } أي: نحيي القلوب الموتى بالجهل\n { لعلكم تذكرون }\n والبلد الطيب\n وهو القلب الطيب\n إذا هبت عليه هذه الواردات\n ونزلت فيه أمطار النفحات\n يُخرج نباته من العلوم والمعارف بإذن ربه\n والذي خبث من القلوب لا يخرج ما فيه إلا نكدًا ـ أي: ضعيفًا لعدم تأثره بالواردات والمواعظ\n وقال الورتجبي: ذكر ـ سبحانه ـ القلب الذي هو بلد الله الذي مُطر عليه من بحر امتنانه\n ويخرج نبات ألوان الحالات والمقامات\n ثم قال: وكل قلب بذره الهوى فنباته الشهوات\n هـ\n ثم شرع في ذكر قصص الأنبياء مع أممهم\n تفصيلاً لقوله: { وَكَم مِّن قَرْيَةٍ أَهْلَكْنَاهَا\n\n\n\n } الآية\n فقال: { لَقَدْ أَرْسَلْنَا نُوحاً إِلَىٰ قَوْمِهِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:26",
      "similarity": 0.16534636450373577
    },
    {
      "verse": "5:100",
      "similarity": 0.15394697492210346
    },
    {
      "verse": "21:74",
      "similarity": 0.13645408005186496
    },
    {
      "verse": "3:179",
      "similarity": 0.12971740995475958
    },
    {
      "verse": "8:37",
      "similarity": 0.1199646856980561
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007058.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007058.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:58.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}