{
  "chapter": "الأعراف",
  "text": "لقد ارسلنا نوحا الى قومه فقال يقوم اعبدوا۟ الله ما لكم من اله غيره انى اخاف عليكم عذاب يوم عظيم",
  "translations": [
    {
      "translation": "We sent Nuh to his people and he said, 'My people, worship Allah! You have no other god than Him. I fear for you the punishment of a dreadful Day.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people, and he said: \"O people worship God; you have no other god but He; for I fear the retribution of the great Day may fall on you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We sent forth Noah to his people and he said: 'O my people! Serve Allah, you have no other god than Him Indeed I fear for you the chastisement of an awesome Day.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people. He told them, \"Worship God for He is your only Lord. I am afraid of the punishment that you might suffer on the great Day (of Judgment)\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We sent Nooh to his people – he therefore said, “O my people! Worship Allah – you do not have any God except Him; indeed I fear for you the punishment of the Great Day (of Resurrection).”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We sent Nuh to his people and he said: \"O my people! Worship Allah! You have no other god but Him. Certainly, I fear for you the torment of a Great Day!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We sent Nuh to his people, so he said: O my people! serve Allah, you have no god other than Him; surely I fear for you the chastisement of a grievous day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Noah to his people; and he said, 'O my people, serve God! You have no god other' than He; truly, I fear for you the chastisement of a dreadful day.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah (of old) unto his people, and he said: O my people! Serve Allah. Ye have no other Allah save Him. Lo! I fear for you the retribution of an Awful Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people. He said, \"O my people, worship God; you have no other god but He. I fear for you the punishment of a dreadful Day,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly We sent Nuh unto his people, and he said: O my people! worship Allah; no god ye have but He; verily I fear for you the torment of a mighty day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We sent Noah to his people. He said, ‘O my people, worship Allah! You have no other god besides Him. Indeed I fear for you the punishment of a tremendous day.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people. He said: \"O my people! worship Allah! ye have no other god but Him. I fear for you the punishment of a dreadful day!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We sent Nuh (Noah) to his people and he said: \"O my people! Worship Allah! You have no other Ilah (God) but Him. (La ilaha ill-Allah: none has the right to be worshipped but Allah). Certainly, I fear for you the torment of a Great Day!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent forth Noah to his nation. He said: 'Worship Allah, my people for you have no god except He. I fear for you the punishment of a great Day.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people. He said, “O my people! Worship God; you have no god other than Him. I fear for you the punishment of a tremendous Day.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had certainly sent Noah to his people, and he said, \"O my people, worship Allah; you have no deity other than Him. Indeed, I fear for you the punishment of a tremendous Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:59]   Verily (laqad is the response to an oath that has been omitted) We sent Noah to his people, and he said, ‘O my people, worship God! You have no god other than Him (read ghayrihi as an adjective of ilāh, ‘god’, or ghayruhu as a substitution in its place [sc. instead of min ilāhin, ‘any god’). Truly, I fear for you, if you worship other than Him, the chastisement of an Awful Day’, that is, the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We sent Noah (of old) unto his people, and he said: my people! Serve Allah) profess Allah's divine Oneness. (Ye have no other God save Him) to Whom I am calling you. (Lo! I fear for you) I know that you be inflicted with (the retribution of an Awful Day) if you do not believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أشار سبحانه إلى تفاوت الاستعدادات واختلاف القالبليات بتفصيل الأمم الهالكة بموت العناد والجهل لخبث طينتهم\n فقال مقسماً: والله { لَقَدْ أَرْسَلْنَا } رسولنا { نُوحاً إِلَىٰ قَوْمِهِ } بعدما انصروا وانحرفو عن طريق الحق بالميل إلى الأهواء الباطلة والآراء الفاسدة { فَقَالَ } لهم نوح إمحاضاً للنصح على وجه الشفقة: { يَاقَوْمِ ٱعْبُدُواْ } أيها المنهمكون في الغفلة { ٱللَّهَ } المتوحد في الألوهية\n المتفرد في الربوبية\n المستحق للعبودية\n واعلموا أنه { مَا لَكُمْ مِّنْ إِلَـٰهٍ } معبود بحق { غَيْرُهُ } يقذكم من عذابه\n وإن لم تعبدوه وتوحدوه { إِنِّيۤ } بعدما أوحي إليَّ من عنده إهداءكم وتنبيهكم إلى توحيده { أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ } [الأعراف: 59] هو يوم الطوفان في النشأة الأولى ويوم القيامة في النشأة الأخرى\n\n\nوبعدما سمعوا مقالته { قَالَ ٱلْمَلأُ } الأشراف { مِن قَوْمِهِ }: يا نوح { إِنَّا لَنَرَاكَ فِي ضَلاَلٍ مُّبِينٍ } [الأعراف: 60] ظاهر لائح\n تأمرنا بترك عبادة الآلهة المحققة وتدعوناإلى إله واحد موهوم وأبدعته من عند نفسك\n\n\n{ قَالَ } أيضاً على مقتضى شفقة النبوة لعلهم يتنبهوا: { يَٰقَوْمِ لَيْسَ بِي ضَلَـٰلَةٌ } كما تخليتم من جهلكم { وَلَٰكِنِّي رَسُولٌ } هادٍ لكم مرسل { مِّن رَّبِّ ٱلْعَـٰلَمِينَ } [الأعراف: 61] الذي أوجدكم ورباكم بأنواع التربية\n حتى تعترفوا بربوبيته وتقروا بتوحيده\n\n\nوإنما جئت لكم { أُبَلِّغُكُمْ رِسَالاَتِ رَبِّي وَأَنصَحُ لَكُمْ } بآياته سبحانه\n حتى تفوزوا من عنده بالمثوبة العظمى والمرتبة العليا بإهدائي وإرشادي { وَ } لا تضعفوني ولا تنسبوني إلى الجهل والسفه\n إني { أَعْلَمُ مِنَ ٱللَّهِ } بتوفيقه وحيه وجذب من جانبه { مَا لاَ تَعْلَمُونَ } [الأعراف: 62]\n\n\n{ أَوَ عَجِبْتُمْ } من { أَن جَآءَكُمْ ذِكْرٌ } موعظة وتذكير لإرشادكم { مِّن رَّبِّكُمْ عَلَىٰ } لسان { رَجُلٍ مِّنْكُمْ لِيُنذِرَكُمْ } به عن الكفر والمعاصي ووخامة عاقبتهما { وَلِتَتَّقُواْ } عن محارم الله بسبب إنذاره وتخويفه { وَلَعَلَّكُمْ تُرْحَمُونَ } [الأعراف: 63] بإثبات مأموراته وترك منهياته\n عناية وتفضلاً\n\n\n{ فَكَذَّبُوهُ } بعدما ضعفوه ونسبوه إلى الضلال\n فانتقمنا منهم وأخذناهم بالطوفان { فَأَنجَيْنَاهُ وَ } المؤمنين { ٱلَّذِينَ مَعَهُ } حال كونهم متمكنين { فِي ٱلْفُلْكِ وَأَغْرَقْنَا ٱلَّذِينَ كَذَّبُواْ بِآيَاتِنَآ } المنزلة على رسولنا { إِنَّهُمْ كَانُواْ قَوْماً عَمِينَ } [الأعراف: 64] غير مستبصرين بآيات الله الدالة على توحيده\n لعمي قلوبهم وفسادهم وعمههم في الغفلة الضلال",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أوَ عَجبتم }: الهمزة للإنكار، والواو للعطف، والمعطوف عليه محذوف، أي: أكذبتم وعجبتم، و { في الفلك }: يتعلق بأنجينا، أو بمن معه، أو حال من الموصول\n يقول الحقّ جلّ جلاله: { لقد أرسلنا نوحًا إلى قومه } ، وهو نوح بن لمك بن متوشلخ بن أدريس، نبىء بعده، بعث وهو ابن خمسين سنة أو أربعين، وعاش ألفًا وثلاثمائة سنة، { فقال يا قوم اعبدوا الله } وحده { ما لكم من إله غيرُه } يستحق أن يُعبد، { إني أخاف عليكم } ، إن لم تُؤمنوا وتُوحدوا الله { عذابَ يوم عظيم } وهو يوم القيامة، أو يوم نزول الطوفان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:23",
      "similarity": 0.7574581338624077
    },
    {
      "verse": "11:25",
      "similarity": 0.5617094757057852
    },
    {
      "verse": "26:105",
      "similarity": 0.5302006276295326
    },
    {
      "verse": "26:135",
      "similarity": 0.4939901713074034
    },
    {
      "verse": "71:1",
      "similarity": 0.4901436428480609
    }
  ]
}