{
  "chapter": "الأعراف",
  "text": "لقد ارسلنا نوحا الى قومه فقال يقوم اعبدوا۟ الله ما لكم من اله غيره انى اخاف عليكم عذاب يوم عظيم",
  "translations": [
    {
      "translation": "We sent Nuh to his people and he said, 'My people, worship Allah! You have no other god than Him. I fear for you the punishment of a dreadful Day.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people, and he said: \"O people worship God; you have no other god but He; for I fear the retribution of the great Day may fall on you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We sent forth Noah to his people and he said: 'O my people! Serve Allah, you have no other god than Him Indeed I fear for you the chastisement of an awesome Day.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people. He told them, \"Worship God for He is your only Lord. I am afraid of the punishment that you might suffer on the great Day (of Judgment)\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We sent Nooh to his people – he therefore said, “O my people! Worship Allah – you do not have any God except Him; indeed I fear for you the punishment of the Great Day (of Resurrection).”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We sent Nuh to his people and he said: \"O my people! Worship Allah! You have no other god but Him. Certainly, I fear for you the torment of a Great Day!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We sent Nuh to his people, so he said: O my people! serve Allah, you have no god other than Him; surely I fear for you the chastisement of a grievous day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Noah to his people; and he said, 'O my people, serve God! You have no god other' than He; truly, I fear for you the chastisement of a dreadful day.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah (of old) unto his people, and he said: O my people! Serve Allah. Ye have no other Allah save Him. Lo! I fear for you the retribution of an Awful Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people. He said, \"O my people, worship God; you have no other god but He. I fear for you the punishment of a dreadful Day,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly We sent Nuh unto his people, and he said: O my people! worship Allah; no god ye have but He; verily I fear for you the torment of a mighty day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We sent Noah to his people. He said, ‘O my people, worship Allah! You have no other god besides Him. Indeed I fear for you the punishment of a tremendous day.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people. He said: \"O my people! worship Allah! ye have no other god but Him. I fear for you the punishment of a dreadful day!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We sent Nuh (Noah) to his people and he said: \"O my people! Worship Allah! You have no other Ilah (God) but Him. (La ilaha ill-Allah: none has the right to be worshipped but Allah). Certainly, I fear for you the torment of a Great Day!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent forth Noah to his nation. He said: 'Worship Allah, my people for you have no god except He. I fear for you the punishment of a great Day.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people. He said, “O my people! Worship God; you have no god other than Him. I fear for you the punishment of a tremendous Day.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had certainly sent Noah to his people, and he said, \"O my people, worship Allah; you have no deity other than Him. Indeed, I fear for you the punishment of a tremendous Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:59]   Verily (laqad is the response to an oath that has been omitted) We sent Noah to his people, and he said, ‘O my people, worship God! You have no god other than Him (read ghayrihi as an adjective of ilāh, ‘god’, or ghayruhu as a substitution in its place [sc. instead of min ilāhin, ‘any god’). Truly, I fear for you, if you worship other than Him, the chastisement of an Awful Day’, that is, the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف انتقل به الغرض من إقامة الحجّة والمنّةِ ( المبتدئة بقوله تعالى : { ولقد مكناكم في الأرض } \\[ الأعراف : 10 \\] ، وتنبيه أهل الضّلالة أنّهم غارقون في كيد الشّيطان ، الذي هو عدوّ نوعهم ، من قوله : { قال فبما أغويتني لأقعدن لهم صِراطك المستقيم إلى قوله : وأن تقولوا على الله ما لا تعلمون } \\[ الأعراف : 16 33 \\] ، ثمّ بالتّهديد بوصف عذاب الآخرة وأحوال النّاس فيه ، وما تخلّل ذلك من الأمثال والتّعريض ) ؛ إلى غرض الاعتبار والموعظة بما حلّ بالأمم الماضية . فهذا الاستئناف له مزيد اتّصال بقوله في أوائل السّورة \\[ 4 \\] : { وكم من قرية أهلكناها } الآية ، وقد أفيض القول فيه في معظم السّورة وتَتْبَعُ هذا الاعتبار أغراضٌ أخرى : وهي تسلية الرّسول ، وتعليم أمّته بتاريخ الأمم التي قبلها من الأمم المرسل إليهم ، ليعلم المكذّبون من العرب أنّ لا غضاضة على محمّد ولا على رسالته من تكذيبهم ، ولا يجعله ذلك دون غيره من الرّسل ، بله أن يؤيّد زعمهم أنّه لو كان صادقاً في رسالته لأيَّده الله بعقاب مكذّيبه ( لما قالوا على سبيل التّهكّم أو الحجاج : اللّهمّ إن كان هذا هو الحقّ من عندك فأمطر علينا حجارة من السّماء أو ائتنا بعذاب أليم ). وليعلَمَ أهل الكتاب وغيرهم أنّ ما لقيه محمّد من قومه هو شنشنة أهل الشّقاوة تلقاء دعوة رسل الله . وأكّد هذا الخبر بلام القسم وحرف التّحقيق لأنّ الغرض من هذه الأخبار تنظير أحوال الأمم المكذّبة رسلَها بحال مشركي العرب في تكذيبهم رسالة محمّد .وكثُر في الكلام اقترانُ جملة جواب القسم : بقَدْ } لأنّ القسم يُهيىء نفس السّامع لتوقع خبر مهم فيؤتى بقَد لأنّها تدلّ على تحقيق أمر متوقّع ، كما أثبته الخليل والزّمخشري ، والتّوقّع قد يكون توقعاً للمخبَر به ، وقد يكون توقعاً للخبر كما هنا .وتقدّم التّعريف بنوح عند قوله تعالى { إنّ الله اصطفى آدم ونوحا } في سورة \\[ آل عمران : 33 \\]. وكان قوم نوح يسكنون الجزيرة والعراق ، حسب ظن المؤرّخين . وعبر عنهم القرآن بطريق القومية المضافة إلى نوح إذ لم يكن لهم اسْم خاص من أسماء الأمم يعرفون به ، فالتّعريف بالإضافة هنا لأنّها أخصر طريق .وعطف جملة فقال يا قوم } على جملة { أرسلنا } بالفاء إشعاراً بأنّ ذلك القول صدر منه بفور إرساله ، فهي مضمون ما أرسل به .وخاطب نوح قومه كلّهم لأنّ الدّعوة لا تكون إلاّ عامة لهم ، وعبّر في ندائهم بوصف القوم لتذكيرهم بآصرة القرابة ، ليتحقّقوا أنّه ناصح ومريد خيرهم ومشفق عليهم ، وأضاف ( القوم ) إلى ضميره للتحبيب والتّرقيق لاستجلاب اهتدائهم .وقوله لهم : { اعبدوا الله ما لكم من إله غيره } إبطال للحالة التي كانوا عليها ، وهي تحتمل أن تكون حالة شرك كحالة العرب ، وتحتمل أن تكون حالة وثنيّة باقتصارهم على عبادة لأصنام دون الله تعالى ، كحالة الصّابئه وقدماء اليونان ، وآيات القرآن صالحة للحالين ، والمنقول في القصص : أنّ قوم نوح كانوا مشركين ، وهو الذي يقتضيه ما في «صحيح البخاري» عن ابن عبّاس أنّ آلهة قوم نوح أسماء جماعة من صالحيهم فلمّا ماتُوا قال قومهم : لو اتَّخذنا في مجالسهم أنصاباً فاتّخَذوها وسمَّوْها بأسمائهم حتّى إذا هلك أولئك وتنسخ العلم عُبدت .وظاهر ما في سورة نوح أنّهم كانوا لا يعبدون الله لقوله : { أن اعبدوا الله واتَّقُوه } \\[ نوح : 3 \\] وظاهر ما في سورة فُصِّلت أنّهم يعترفون بالله لقولهم : { لو شاء ربّنا لأنزل ملائكة } \\[ فصلت : 14 \\] مع احتمال أنّه خرج مخرج التّسليم الجدلي فإن كانوا مشركين كان أمرُه إياهم بعبادة الله مقيَّداً بمدلول قوله : { ما لكم من إله غيره } أي أفردوه بالعبادة ولا تشركوا معه الأصنام ، وإن كانوا مقتصرين على عبادة الأوثان كان قوله : { ما لكم من إله غيره } تعليلاً للاقبال على عبادة الله ، أي هو الإله لا أوثانُكم .وجملة : { ما لكم من إله غيره } على الوجه الأوّل بيان للعبادة التي أمَرَهم بها ، أي أفردوه بالعبادة دون غيره ، إذ ليس غيره لكم بالإله .وعلى الوجه الثّاني يكون استئنافاً بيانياً للأمر بالإقلاع عن عبادة غيره .وقرأ الجمهور { غيرهُ } بالرّفع على الصّفة ( لإله ) باعتبار محلّه لأنّه في محلّ رفع إذ هو مبتدأ وإنّما جرّ لدخول حرف الجرّ الزائد ولا يُعتد بجرّه ، وقرأه الكسائي ، وأبو جعفر : بجرّ { غير } على النّعت للّفظ ( إلاه ) نظراً لحرف الجر الزّائد .وجملة : { إني أخاف عليكم عذاب يوم } يجوز أن تكون في موقع التّعليل ، كما في «الكشاف» : أي لمضمون قوله : { ما لكم من إله غيره } كأنّه قيل : اتركوا عبادة غير الله خوفاً من عذاب يوم عظيم ، وبُني نظم الكلام على خوففِ المتكلّم عليهم ، دلالة على إمحاضه النّصح لهم وحرصه على سلامتهم ، حتّى جعل ما يُضر بهم كأنّه يُضِرّ به ، فهو يخافه كما يخافون على أنفسهم ، وذلك لأنّ قوله هذا كان في مبدأ خطابهم بما أرسل به ، ويحتمل أنّه قاله بعد أن ظَهر منهم التّكذيب : أي إن كنتم لا تخافون عذاباً فإنّي أخافه عليكم ، وهذا من رحمة الرّسل بقومهم .وفعل الخوف يتعدّى بنفسه إلى الشّيء المخوف منه ، ويتعدّى إلى مفعول ثان بحرف ( على ) إذا كان الخوف من ضر يلحقُ غيرَ الخائف ، كما قال الأحوص :فإذا تزول تزول على مُتَخَمِّطٍ ... تُخْشَى بوادِرُهُ على الأقرانويجوز أن تكون مستأنفة ثانية بعد جملة { اعبدوا الله } لقصد الإرهاب والإنذار ، ونكتة بناءِ نظم الكلام على خوف المتكلّم عليهم هي هي .والعذاب المخوف ويومه يحتمل أنّهما في الآخرة أو في الدّنيا ، والأظهر الأوّل لأنّ جوابهم بأنّه في ضلال مبين يشعر بأنّهم أحالوا الوحدانية وأحالوا البعث كما يدلّ عليه قوله في سورة \\[ نوح : 17 ، 18 \\] : { والله أنبتكم من الأرض نباتا ثمّ يعيدكم فيها ويخرجكم إخراجاً } فحالهم كحال مشركي العرب لأنّ عبادة الأصنام تمحّض أهلها للاقتصار على أغراض الدّنيا .\n\n",
      "translations": [
        {
          "translation": "(We sent Noah (of old) unto his people, and he said: my people! Serve Allah) profess Allah's divine Oneness. (Ye have no other God save Him) to Whom I am calling you. (Lo! I fear for you) I know that you be inflicted with (the retribution of an Awful Day) if you do not believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أشار سبحانه إلى تفاوت الاستعدادات واختلاف القالبليات بتفصيل الأمم الهالكة بموت العناد والجهل لخبث طينتهم\n فقال مقسماً: والله { لَقَدْ أَرْسَلْنَا } رسولنا { نُوحاً إِلَىٰ قَوْمِهِ } بعدما انصروا وانحرفو عن طريق الحق بالميل إلى الأهواء الباطلة والآراء الفاسدة { فَقَالَ } لهم نوح إمحاضاً للنصح على وجه الشفقة: { يَاقَوْمِ ٱعْبُدُواْ } أيها المنهمكون في الغفلة { ٱللَّهَ } المتوحد في الألوهية\n المتفرد في الربوبية\n المستحق للعبودية\n واعلموا أنه { مَا لَكُمْ مِّنْ إِلَـٰهٍ } معبود بحق { غَيْرُهُ } يقذكم من عذابه\n وإن لم تعبدوه وتوحدوه { إِنِّيۤ } بعدما أوحي إليَّ من عنده إهداءكم وتنبيهكم إلى توحيده { أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ } [الأعراف: 59] هو يوم الطوفان في النشأة الأولى ويوم القيامة في النشأة الأخرى\n\n\nوبعدما سمعوا مقالته { قَالَ ٱلْمَلأُ } الأشراف { مِن قَوْمِهِ }: يا نوح { إِنَّا لَنَرَاكَ فِي ضَلاَلٍ مُّبِينٍ } [الأعراف: 60] ظاهر لائح\n تأمرنا بترك عبادة الآلهة المحققة وتدعوناإلى إله واحد موهوم وأبدعته من عند نفسك\n\n\n{ قَالَ } أيضاً على مقتضى شفقة النبوة لعلهم يتنبهوا: { يَٰقَوْمِ لَيْسَ بِي ضَلَـٰلَةٌ } كما تخليتم من جهلكم { وَلَٰكِنِّي رَسُولٌ } هادٍ لكم مرسل { مِّن رَّبِّ ٱلْعَـٰلَمِينَ } [الأعراف: 61] الذي أوجدكم ورباكم بأنواع التربية\n حتى تعترفوا بربوبيته وتقروا بتوحيده\n\n\nوإنما جئت لكم { أُبَلِّغُكُمْ رِسَالاَتِ رَبِّي وَأَنصَحُ لَكُمْ } بآياته سبحانه\n حتى تفوزوا من عنده بالمثوبة العظمى والمرتبة العليا بإهدائي وإرشادي { وَ } لا تضعفوني ولا تنسبوني إلى الجهل والسفه\n إني { أَعْلَمُ مِنَ ٱللَّهِ } بتوفيقه وحيه وجذب من جانبه { مَا لاَ تَعْلَمُونَ } [الأعراف: 62]\n\n\n{ أَوَ عَجِبْتُمْ } من { أَن جَآءَكُمْ ذِكْرٌ } موعظة وتذكير لإرشادكم { مِّن رَّبِّكُمْ عَلَىٰ } لسان { رَجُلٍ مِّنْكُمْ لِيُنذِرَكُمْ } به عن الكفر والمعاصي ووخامة عاقبتهما { وَلِتَتَّقُواْ } عن محارم الله بسبب إنذاره وتخويفه { وَلَعَلَّكُمْ تُرْحَمُونَ } [الأعراف: 63] بإثبات مأموراته وترك منهياته\n عناية وتفضلاً\n\n\n{ فَكَذَّبُوهُ } بعدما ضعفوه ونسبوه إلى الضلال\n فانتقمنا منهم وأخذناهم بالطوفان { فَأَنجَيْنَاهُ وَ } المؤمنين { ٱلَّذِينَ مَعَهُ } حال كونهم متمكنين { فِي ٱلْفُلْكِ وَأَغْرَقْنَا ٱلَّذِينَ كَذَّبُواْ بِآيَاتِنَآ } المنزلة على رسولنا { إِنَّهُمْ كَانُواْ قَوْماً عَمِينَ } [الأعراف: 64] غير مستبصرين بآيات الله الدالة على توحيده\n لعمي قلوبهم وفسادهم وعمههم في الغفلة الضلال",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أوَ عَجبتم }: الهمزة للإنكار\n والواو للعطف\n والمعطوف عليه محذوف\n أي: أكذبتم وعجبتم\n و { في الفلك }: يتعلق بأنجينا\n أو بمن معه\n أو حال من الموصول\n يقول الحقّ جلّ جلاله: { لقد أرسلنا نوحًا إلى قومه } \n وهو نوح بن لمك بن متوشلخ بن أدريس\n نبىء بعده\n بعث وهو ابن خمسين سنة أو أربعين\n وعاش ألفًا وثلاثمائة سنة\n { فقال يا قوم اعبدوا الله } وحده { ما لكم من إله غيرُه } يستحق أن يُعبد\n { إني أخاف عليكم } \n إن لم تُؤمنوا وتُوحدوا الله { عذابَ يوم عظيم } وهو يوم القيامة\n أو يوم نزول الطوفان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:23",
      "similarity": 0.7574581338624077
    },
    {
      "verse": "11:25",
      "similarity": 0.5617094757057852
    },
    {
      "verse": "26:105",
      "similarity": 0.5302006276295326
    },
    {
      "verse": "26:135",
      "similarity": 0.4939901713074034
    },
    {
      "verse": "71:1",
      "similarity": 0.4901436428480609
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007059.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007059.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:59.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}