{
  "chapter": "الأعراف",
  "text": "فلنسـلن الذين ارسل اليهم ولنسـلن المرسلين",
  "translations": [
    {
      "translation": "We will question those to whom the Messengers were sent, and We will question the Messengers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(On the Day of Reckoning) We shall question the people to whom We had sent Our apostles, (if they followed their teachings), and will question the apostles.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We shall call to account those to whom Messengers were sent, and We shall call to account the Messengers (to see how dutifully they conveyed the Message, and how people responded to it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will certainly question the people and the Messengers sent to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So undoubtedly We shall question those to whom Our Noble Messengers went, and indeed We shall question the Noble Messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then surely, We shall question those (people) to whom it was sent and verily, We shall question the Messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most certainly then We will question those to whom (the apostles) were sent, and most certainly We will also question the apostles;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We shall question those unto whom a Message was sent, and We shall question the Envoys,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then verily We shall question those unto whom (Our message) hath been sent, and verily We shall question the messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then shall We question those to whom Our message was sent and those through whom We sent it\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We will surely question those to whom were the messengers sent, and We will surely question the sent ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will surely question those to whom the apostles were sent, and We will surely question the apostles.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then shall we question those to whom Our message was sent and those by whom We sent it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then surely, We shall question those (people) to whom it (the Book) was sent and verily, We shall question the Messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will question those to whom Our Message was sent, as We shall question the Messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will question those to whom messengers were sent, and We will question the messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We will surely question those to whom [a message] was sent, and We will surely question the messengers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:6] Then verily We shall question those to whom the Message was sent, that is, [We shall question those] communities, about their response to the messengers, and to what extent they implemented that which was   conveyed to them; and We shall question the messengers, about the conveying [of that Message].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then verily We shall question those unto whom (Our message) hath been sent) with the messengers, i.e. We shall question these people about their response to the messengers, (and verily We shall question the messengers) about their conveyance of the message.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَنَسْأَلَنَّ } لنستكشفن ونظهرن في النشأة الأخرى أحوالهم التي كانوا عليها في النشأة الأولى أولاً من { ٱلَّذِينَ أُرْسِلَ إِلَيْهِمْ } الرسل ما فعلوا بهم حين دعوهم إلى إطاعتنا وانقيادنا { وَ } بعدما ظهر منهم ما ظهر { لَنَسْأَلَنَّ } ثانياً عن أحوالهم من { ٱلْمُرْسَلِينَ } [الأعراف: 6] المبلغين لهم أوامرنا ونواهينا عن قبولهم وتكذيبهم وتصديقهم، وبعدما ظهر أيضاً منهم ما ظهر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n[الأنبياء: 14ـ15]: ميتين، فإذا أحييناهم وبعثناهم من قبورهم، فوالله { لنسألن الذين أُرسل إليهم } عن قبول الرسالة وإجابة الرسل، { ولنسألن المرسلين } عما أُجيبوا به، والمراد بهذا السؤال: توبيخ الكفرة وتقريعهم، وأما قوله تعالى:\n\n[القَصَص:78]، فالمنفي: سؤال استعلام لأن الله أحاط بهم علمًا، أو الأول في موقف الحساب، وهذا عند حصول العقاب",
      "translations": []
    }
  ]
}