{
  "chapter": "الأعراف",
  "text": "ابلغكم رسلت ربى وانصح لكم واعلم من الله ما لا تعلمون",
  "translations": [
    {
      "translation": "transmitting my Lord's Message to you and giving you good counsel, and I know from Allah what you do not know.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I bring to you the messages of my Lord, and give you sincere advice, for I know from God what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I convey to you the messages of my Lord, give you sincere advice, and I know from Allah that which you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "sent to preach to you the message of my Lord and to give you good advice. I know what you do not know about God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Conveying to you the messages of my Lord and wishing good for you, and I know from Allah what you do not know.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I convey unto you the Messages of my Lord and give sincere advice to you. And I know from Allah what you know not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I deliver to you the messages of my Lord, and I offer you good advice and I know from Allah what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I deliver to you the Messages of my Lord, and I advise you sincerely; for I know from God that you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I convey unto you the messages of my Lord and give good counsel unto you, and know from Allah that which ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I am conveying my Lord's messages to you and giving you sincere advice. I know things from God that you do not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I preach unto you the messages of my Lord and I councel you good, and I know from Allah which ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I communicate to you the messages of my Lord, and I am your well-wisher, and I know from Allah what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I but fulfil towards you the duties of my Lord's mission: Sincere is my advice to you, and I know from Allah something that ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I convey unto you the Messages of my Lord and give sincere advice to you. And I know from Allah what you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(sent) to convey to you the messages of my Lord and to advise you, for I know from Allah what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“I deliver to you the messages of my Lord, and I advise you, and I know from God what you do not know.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I convey to you the messages of my Lord and advise you; and I know from Allah what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:62] I convey to you (read ublighkum or uballighukum) the Messages of my Lord, and I am advising you, I desire good [for you], for I know from God what you know not.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوجملة : { أبلغكم رسالات ربي } صفة لرسول ، أو مستأنفة ، والمقصود منها إفادة التّجدّد ، وأنّه غير تارككٍ التّبليغَ من أجل تكذيبهم تأييساً لهم من متابعته إياهم ، ولولا هذا المقصد لكان معنى هذه الجملة حاصلاً من معنى قوله : { ولكني رسول } ، ولذلك جمع الرّسالات لأنّ كلّ تبليغ يتضمّن رسالة بما بلَّغَه ، ثمّ إن اعتُبرت جملة : { أبلغكم } صفة ، يكُن العدول عن ضمير الغيبة إلى ضمير التّكلّم في قوله : { أبلغكم } وقولِه : { ربي } التفاتاً ، باعتبار كون الموصوف خبراً عن ضمير المتكلّم ، وإن اعتُبرت استينافاً ، فلا التفات .والتّبليغ والإبلاغ : جعل الشّيء بالغاً ، أي واصلاً إلى المكان المقصود ، وهو هنا استعارة للإعلام بالأمر المقصود علمُه ، فكأنّه ينقله من مكان إلى مكان .وقرأ الجمهور : { أُبَلِّغكم } بفتح الموحّدة وتشديد اللاّم وقرأه أبو عَمرو ، ويعقوب : بسكون الموحدة وتخفيف اللاّم من الإبلاغ والمعنى واحد .ووجه العدول عن الإضمار إلى الإظهار في قوله : { رسالات ربي } هو ما تؤذن به إضافة الرّب إلى ضمير المتكلّم من لزوم طاعته ، وأنّه لا يسعه إلاّ تبليغُ ما أمره بتبليغه ، وإن كَرِه قومه .والنّصح والنّصيحة كلمة جامعة ، يعبّر بها عن حسن النّيّة وإرادة الخير من قوللٍ أو عمللٍ ، وفي الحديث : « الدّين النّصحية » وأن تُناصحوا من ولاّه الله أمركم . ويكثر إطلاق النّصح على القول الذي فيه تنبيه للمخاطب إلى ما ينفعه ويدفع عنه الضّر .وضدّه الغشّ . وأصل معناه أن يتعدّى إلى المفعول بنفسه ، ويكثر أن يُعدّى إلى المفعول بلام زائدة دالة على معنى الاختصاص للدّلالة على أنّ النّاصح أراد من نصحه ذات المنصوح ، لا جلب خير لنفس النّاصح ، ففي ذلك مبالغة ودلالة على إمحاض النصيحة ، وأنّها وقعت خالصة للمنصوح ، مقصوداً بها جانبه لا غير ، فربّ نصيحة ينتَفع بها النّاصح فيقصد النّفعين جميعاً ، وربّما يقع تفاوت بين النّفعين فيكون ترجيح نفع النّاصح تقصيراً أو إجحافاً بنفع المنصوح .وفي الإتيان بالمضارع دلالة على تجديد النّصح لهم ، وإنّه غير تاركه من أجل كراهيتهم أو بذاءتهم .وعقب ذلك بقوله : { وأعلم من الله ما لا تعلمون } جمعاً لمعان كثيرة ممّا تتضمّنه الرّسالة وتأييداً لثباته على دوام التّبليغ والنّصح لهم ، والاستخفاف بكراهيتهم وأذاهم ، لأنّه يعلم ما لا يعلمونه ممّا يحمله على الاسترسال في عمله ذلك ، فجاء بهذا الكلام الجامع ، ويتضمّن هذا الإجمالُ البديعُ تهديداً لهم بحلول عذاب بهم في العاجل والآجل ، وتنبيهاً للتّأمّل فيما أتاهم به ، وفتحاً لبصائرهم أن تتطلب العلم بما لم يكونوا يعلمونه ، وكل ذلك شأنه أن يبعثهم على تصديقه وقبوللِ ما جاءهم به .و { من } ابتدائية أي : صار لي علم وارد من الله تعالى ، وهذه المعاني التي تضمّنها هذا الاستدراك هي ما يُسلِّم كلّ عاقل أنّها من الهدى والصّلاح ، وتلك هي أحواله ، وهم وصفوا حاله بأنّه في ضلال مبين ، ففي هذا الاستدراك نعي على كمال سفاهة عقولهم .\n\n",
      "translations": [
        {
          "translation": "(I convey unto you the messages of my Lord) by explaining commands and prohibition (and give good counsel unto you) I warn against the torment and call you to repentance and faith, (and know from Allah that which ye know not) of torment, if you do not believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأنصحُ لكم } جُهدي\n { وأعلمُ من الله ما لا تعلمون } من صفاته الجلالية والجمالية ومن رحمته وعذابه\n أو من قدرته وشدة بطشه\n أو أعلم من جهة وحيه أشياء لا علم لكم بها\n وجمع الرسالات لاختلاف أوقاتها\n أو لتنوع معانيها\n كعلم العقائد والمواعظ والأحكام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:68",
      "similarity": 0.9775077966565253
    },
    {
      "verse": "7:79",
      "similarity": 0.8511600032401689
    },
    {
      "verse": "7:21",
      "similarity": 0.7747552858023122
    },
    {
      "verse": "12:11",
      "similarity": 0.715467553276275
    },
    {
      "verse": "11:34",
      "similarity": 0.6173429148629522
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007062.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007062.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:62.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}