{
  "chapter": "الأعراف",
  "text": "اوعجبتم ان جاءكم ذكر من ربكم على رجل منكم لينذركم ولتتقوا۟ ولعلكم ترحمون",
  "translations": [
    {
      "translation": "Do you wonder that a warning has come to you from your Lord through a man who is one of you, and warns you to take heed for yourselves and fear God? You might be treated with mercy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you wonder that admonition should come to you from your Lord through a man from amongst yourselves that he may warn you, that you may avoid evil and that mercy may be shown to you?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does it seem strange to you that a reminder from your Lord should be sent to a man, from among you, to warn you so that you might receive mercy?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And are you surprised that an advice came to you from your Lord through a man amongst you, so that he may warn you and that you may fear, and so that there be mercy upon you?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you wonder that there has come to you a Reminder from your Lord through a man from among you, that he may warn you, so that you may fear Allah and that you may receive (His) mercy\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! do you wonder that a reminder has come to you from your Lord through a man from among you, that he might warn you and that you might guard (against evil) and so that mercy may be shown to you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, do you wonder that a reminder from your Lord should come to you by the lips of a man from among you? That he may warn you, and you be godfearing, haply to find mercy.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Marvel ye that there should come unto you a Reminder from your Lord by means of a man among you, that he may warn you, and that ye may keep from evil, and that haply ye may find mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you find it so strange that a message should come from your Lord through a man from among yourselves, so that he may warn you and so that you may fear God and be shown mercy?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Marvel ye that an admonition from your Lord should come unto you upon a man from amongst yourselves, in order that the may warn you and that ye may fear, and that haply ye may be shewn mercy?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you consider it odd that a reminder from your Lord should come to you through a man from among yourselves, to warn you so that you may be Godwary and so that you may receive His mercy?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do ye wonder that there hath come to you a message from your Lord, through a man of your own people, to warn you,- so that ye may fear Allah and haply receive His Mercy?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you wonder that there has come to you a Reminder from your Lord through a man from amongst you, that he may warn you, so that you may fear Allah and that you may receive (His) Mercy?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you wonder that a Remembrance should come to you from your Lord to a man from yourselves in order that he may warn you and that you may be cautious so that mercy comes upon you'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Do you wonder that a reminder has come to you from your Lord, through a man from among you, to warn you, and to lead you to righteousness, so that you may attain mercy?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then do you wonder that there has come to you a reminder from your Lord through a man from among you, that he may warn you and that you may fear Allah so you might receive mercy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:63] Do you then, deny, marvel that a reminder, an admonition, from your Lord should come to you through, the tongue of, a man from among you, that he may warn you, of chastisement if you do not believe, and that you may fear, God, and that you might be shown mercy’, by it?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Marvel ye) indeed, you marvel (that there should come unto you a Reminder) prophethood (from your Lord by means of a man among you) a human being like you, (that he may warn you, and that you may keep from evil) and that you obey Allah and ward off worship of other than Him, (and that haply ye may find mercy) and not be tormented.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوَ عَجِبْتُمْ } من { أَن جَآءَكُمْ ذِكْرٌ } موعظة وتذكير لإرشادكم { مِّن رَّبِّكُمْ عَلَىٰ } لسان { رَجُلٍ مِّنْكُمْ لِيُنذِرَكُمْ } به عن الكفر والمعاصي ووخامة عاقبتهما { وَلِتَتَّقُواْ } عن محارم الله بسبب إنذاره وتخويفه { وَلَعَلَّكُمْ تُرْحَمُونَ } [الأعراف: 63] بإثبات مأموراته وترك منهياته؛ عناية وتفضلاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}