{
  "chapter": "الأعراف",
  "text": "والى عاد اخاهم هودا قال يقوم اعبدوا۟ الله ما لكم من اله غيره افلا تتقون",
  "translations": [
    {
      "translation": "And We sent Hud, their brother, to the people of 'Ad. He said: \"O you people, worship God, for you have no other god but He. Will you not take heed for yourselves?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to 'Ad We sent forth their brother Hud. He said: 'O my people! Serve Allah; you have no other god than Him. Will you, then, not avoid evil?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Hud to his brethren, the tribe of `Ad, who told them, \"Worship God for He is your only Lord. Will you not become pious?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Hud to the people of Aad from their own community; he said, “O my people! Worship Allah – you do not have any God except Him; so do you not fear?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to `Ad (the people, We sent) their brother Hud. He said: \"O my people! Worship Allah! You have no other god but Him. Will you then not have Taqwa\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Ad (We sent) their brother Hud. He said: O my people! serve Allah, you have no god other than Him; will you not then guard (against evil)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Ad their brother Hood; he said, 'O my people, serve God! You have no god other than He; will you not be godfearing?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto (the tribe of) A'ad (We sent) their brother, Hud. He said: O my people! Serve Allah. Ye have no other Allah save Him. Will ye not ward off (evil)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the people of 'Ad We sent their brother, Hud. He said, \"O my people, worship God, you have no other god but He. Then will you not be God-fearing?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto 'Ad We sent their brothers Hud. He said: O my people! worship Allah, no god ye have but He; Fear ye not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to [the people of] ‘Ad [We sent] Hud, their brother. He said, ‘O my people, worship Allah! You have no other god besides Him. Will you not then be wary [of Him]?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the 'Ad people, (We sent) Hud, one of their (own) brethren: He said: O my people! worship Allah! ye have no other god but Him will ye not fear (Allah)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to 'Ad (people, We sent) their brother Hud. He said: \"O my people! Worship Allah! You have no other Ilah (God) but Him. (La ilaha ill-Allah: none has the right to be worshipped but Allah). Will you not fear (Allah)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to (the people of) Aad We sent their brother, Hood. He said: 'Worship Allah, my nation, for you have no god except He. Will you not then be cautious'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Aad, their brother Hud. He said, “O my people! Worship God; you have no god other than Him. Will you not take heed?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to the 'Aad [We sent] their brother Hud. He said, \"O my people, worship Allah; you have no deity other than Him. Then will you not fear Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:65] And, We sent, to, the earlier, ‘Ād their brother Hūd. He said, ‘O my people, worship God, affirm His Oneness! You have no god other than Him. Will you not fear?’, will you [not] fear Him, and so believe?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "164 (And unto (the tribe of) 'Aad) and We sent to 'Aad (their brother) their prophet (Hud. He said: my people! Serve Allah) profess Allah's divine Oneness. (Ye have no other God save Him) save the One to whom I am calling you. (Will ye not ward off (evil)) the worship of other than Him?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أرسلنا أيضاً { إِلَىٰ } قوم { عَادٍ } حين خرجوا عن ربقة الإيمان وعرى التقوى { أَخَاهُمْ هُوداً } أضافه إليهم بالأخوة؛ لكمال الشفقة ووفور الأعطاف { قَالَ } منادياً لهم مضيفاً لهم إلى نفسه؛ ليقبلوا قوله ويمتثلوا بما جاء به من ربه: { يَاقَوْمِ ٱعْبُدُواْ ٱللَّهَ } المظهر الموجد لكم من كتم العدم ورباكم بأنواع اللطف والكرم، واعتقدوا يقيناً أنه { مَا لَكُمْ مِّنْ إِلَـٰهٍ } موجد مرب { غَيْرُهُ } فعليكم أن تعبدون إيماناً به وعملاً بما جاء عنده لأنبيائه حتى يتحققوا بمقر التوحيد، أتنكرون وحدة الحق وتعبدون غيره من الآلهة الباطلة { أَفَلاَ تَتَّقُونَ } [الأعراف: 65] عن بشطه وأخذه؟!\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أخاهم }: عطف على نوح، و { هودًا }: عطف بيان أو بدل، وكذلك { أخاهم صالحًا } وما بعده حيث وقع\n يقول الحقّ جلّ جلاله: { و } أرسلنا { إلى } قبيلة { عادٍ أخاهم } أي: واحد من قبيلتهم، كقولهم: يا أخا العرب، فإنه هود بن عبدالله بن رباح بن الخلود بن عاد بن عوص بن إرم بن سام بن نوح، وقيل: هو هود بن شالح بن أرفخشذ بن سام بن نوح، فهو ابن عم أبي عاد، وإنما أرسل إليهم منهم لأنهم أفهم لقوله، وأعرف بحاله، وأرغب في أتباعه، ثم وعظهم فقال: { يا قوم اعبدوا الله } وحده { ما لكم من إله غيره أفلا تتقون } عذاب الله، { قال الملأ الذين كفروا من قومه } ، كان قومه أحسن من قوم نوح، إذ كان من أشرافهم من آمن به كمرثد بن سعد، ولذلك قيد الملأ بمن كفر، بخلاف قوم نوح لم يكن أحد منهم آمن به، فأطلق الملأ، قالوا لهود عليه السلام: { إنا لنراك في سفاهة } أي: متمكنًا في خفة العقل، راسخًا فيها، حيث فَارَقتَ دين قومك، { وإنا لنظنك من الكاذبين } في ادعاء الرسالة\n { قال يا قوم ليس بي سفاهة ولكني رسول من ربّ العالمين أُبلغكم رسالاتِ ربي وأنا لكم ناصح أمين } ، يحتمل أن يريد أمانته على الوحي، أو أنهم كانوا قد عرفوه بالأمانة والصدق قبل الرسالة\n ثم قال: { أوَ عجبتم } من { أن جاءكم ذِكرٌ من ربكم على رجل منكم لينذركم } ، تقدم تفسيرها\n قال البيضاوي: وفي ذكر إجابة الأنبياء الكفرةَ عن كلماتهم الحمقاء بما أجابوا به والإعراض عن مقالتهم: كمال النصح والشفقة، وهضم النفس، وحسن المجادلة، وهكذا ينبغي لكل ناصح، وفي قوله: { وأنا لكم ناصح أمين }: تنبيه على أنهم عرفوه بالأمرين\n هـ\n ثم قال لهم: { واذكروا إذ جعلكم خلفاء من بعد قوم نوح } في مساكنهم، أو خلفاء في الأرض من بعدهم بأن جعلكم ملوكًا، فإن شداد بن عاد ممن ملك معمورة الأرض، من رمل عالج إلى بحر عمان، خوفهم أولاً من عقاب الله، ثم ذكرهم بإنعامه { وزادكم في الخلق بسطة } أي: قامة وقوة، فكانوا عظام الأجساد، فكان أصغرهم: ستين ذراعًا، وأطولهم: مائة ذراع\n { فاذكروا آلاء الله } أي: نعمه، تعميم بعد تخصيص، { لعلكم تفلحون } أي: لكي يفضي بكم ذكر النعم إلى شكرها المؤدي إلى الفلاح، ومن شكرها: الإيمان برسولهم\n { قالوا أجئتنا لنعبد الله وحده ونَذَرَ ما كان يعبد آباؤنا } من الأصنام، استبعدوا اختصاص الله بالعبادة والإعراض عما وجدوا عليه آباءهم انهماكًا في التقليد، وحبًا لما ألفوه مع اعترافهم بالربوبية، ولذلك قال لهم هود عليه السلام: { قد وقع عليكم من ربكم رجس وغضب } ، بعد أن قالوا: { فأْتنا بما تعدنا } من العذاب { إن كنت من الصادقين } فيه\n\n\n{ قال قد وقع } أي: وجب { عليكم من ربكم رجسٌ } عذاب { وغضب } إرادة الانتقام، { أتجادلونني في أسماء سميتموها أنتم وآباؤكم } أي: أتجادلونيي في عبادة مسميات أسماء، ففي الكلام حذف\n وأراد بقوله: { سميتموها أنتم وآباؤكم } أي: جعلتم لها أسماء، فدل ذلك على أنها محدثة، فلا يصح أن تكون آلهة، أو سميتموها آلهة من غير دليل، وهو معنى قوله: { ما نزَّل اللهُ بها من سلطان } أي: حجة تدل على استحقاقها للعبادة، فالمجادلة يحتمل أن تكون في عبادتها، أو في تسميتها آلهة، والمراد بالاسم ـ على الأول ـ المسمى، وعلى الثاني: التسمية\n قاله ابن جزي: { فانتظروا } نزول العذاب، الذي طلبتم حين أصررتم على العناد، { إني معكم من المنتظرين } نزوله\n قال تعالى: { فأنجيناه والذين معه برحمة منا } عليهم\n قال القشيري: لا رتبةَ فوق رتبة النبوة، ولا درجة أعلى من درجة الرسالة، وقد أخبر سبحانه: أنه نجَّى هودًا برحمته، وكذا نجَّى الذين آمنوا معه برحمته، ليُعلَم أن النجاة لا تكون باستحقاق العمل، وإنما تكون ابتداء فضلٍ من الله ورحمة، فما نَجَا مَن نَجَا إلا بفضل الله سبحانه وتعالى\n هـ\n { وقطعنا دابر الذين كذَّبوا بآياتنا } أي: استأصلناهم، { وما كانوا مؤمنين } ، تعريض بمن آمن منهم، وتنبيه على أن الفارق بين من نَجَا وبين من هلك: هو الإيمان\n رُوِي أنهم كانوا يعبدون الأصنام، فبعث الله إليهم هودًا فكذبوه، وزادوا عتوا، فأمسك الله عنهم المطر ثلاث سنين حتى جهدهم، وكان الناس حينئذٍ، مسلمهم ومشركهم، إذا نزل بهم بلاء توجهوا إلى البيت الحرام وطلبوا من الله الفرج، فجهزوا إليه \" قيل بن عنز \" ، ومرثد بن سعد، في سبعين من أعيانهم، وكان إذ ذاك بمكة العمالقة أولاد عمليق بن لاود بن سام، وسيدهم: معاوية بن بكر، فلما قدموا عليه، وهو بظاهر مكة، أنزلهم وأكرمهم، وكانوا أخواله وأصهاره، فلبثوا عنده شهرًا يشربون الخمر، وتغنى عليهم الجرادتان ـ قَينَتَانِ له ـ فلما رأى ذهولهم عما بعثوا له أهمه ذلك، واستحيا أن يكلمهم فيه مخافة أن يظنوا به ثقل مقامهم، فعلم المغنيتين بيتين من الشعر، وأمرهما أن تغنيا به وهما:\n\nفلما غنيتا به أزعجهم ذلك، فقال مرثد: والله لا يُسقون بدعائكم، ولكن إن أطعتم نبيكم، وتبتم إلى الله، سقيتم، فقالوا لمعاوية: أحبسه عنا، لا يقدمنّ معنا مكة فإنه قد أتبع دين هود، وترك ديننا، ثم دخلوا مكة، فقال قيل: اللهم اسق عادًا ما كنت تسقيهم، فأنشأ الله سحابات ثلاثًا بيضاء وحمراء وسوداء، ثم ناداه منادٍ من السماء: يا قيل اختر لنفسك ولقومك\n فقال: اخترت السوداء فإنها أكثرهن ماءً، فخرجت إلىعاد من وادي المغيث، فاستبشروا بها، وقالوا: هذا عارض ممطرنا، فجاءتهم، فيها ريح عقيم، فأهلكتهم، رُوِي أنها لما قربت من ديارهم حملت أنعامهم في الهواء، كأنها جراد، فاستمرت عليهم سبع ليالٍ وثمانية أيام، شدخَت رؤوسهم إلى الحجارة حتى هلكوا جميعًا، ونجا هو والمؤمنون معه، فأتوا مكة وعبدوا الله حتى هلكوا\n\n\nقاله البيضاوي وغيره\n وهاهنا بحث وهو أن البيت إنما بناه إبراهيم عليه السلام حسبما في الصحيح، ولم تعمر مكة إلا بعد إنزال إسماعيل فيها، وهود كان قبل إبراهيم، والبيت حينئذٍ خرب، كان خربه الطوفان، فكيف يتوجهون إليه وهو لم يكن؟\n ويمكن الجواب: بأنهم كانوا يلتجؤون إلى رسومه وخربته التي بقيت بعد الطوفان لأن أول من بناه آدم عليه السلام فلما خربه الطوفان بقي أثره، فكانوا يتبركون به، وفي بعض التواريخ: أن العماليق بنوه قبل إبراهيم، فكانوا يطوفون به ويتبركون، ثم هُدم، وبناه بعدهم خليل الله إبراهيم\n وبهذا ـ إن صح - يزول الإشكال\n والله تعالى أعلم\n وأما من قال: إن هودًا تعدد، فغير سديد\n الإشارة: قد تضمنت موعظة هود عليه السلام لقومه خصلتين، بهما النجاة من كل هول وشر، والفوز بكل خير، وهما: التوحيد والتقوى، وهي الطاعة لله ولرسوله فيما جاء به من أمر ونهي\n فالتوحيد تطهير الباطن من الشرك الجلي والخفي، والتقوى: حفظ الجوارح من المخالفة في السر والعلانية، وهاتان الخصلتان هما أساس الطريق ونهايته\n والله تعالى أعلم\n ثم ذكر قصة صالح عليه السلام، فقال: { وَإِلَىٰ ثَمُودَ أَخَاهُمْ صَالِحاً }\n\n",
      "translations": []
    }
  ]
}