{
  "chapter": "الأعراف",
  "text": "والى عاد اخاهم هودا قال يقوم اعبدوا۟ الله ما لكم من اله غيره افلا تتقون",
  "translations": [
    {
      "translation": "And to 'Ad We sent their brother Hud, who said, 'My people, worship Allah! You have no other god than Him. So will you not have taqwa?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Hud, their brother, to the people of 'Ad. He said: \"O you people, worship God, for you have no other god but He. Will you not take heed for yourselves?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to 'Ad We sent forth their brother Hud. He said: 'O my people! Serve Allah; you have no other god than Him. Will you, then, not avoid evil?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Hud to his brethren, the tribe of `Ad, who told them, \"Worship God for He is your only Lord. Will you not become pious?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Hud to the people of Aad from their own community; he said, “O my people! Worship Allah – you do not have any God except Him; so do you not fear?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to `Ad (the people, We sent) their brother Hud. He said: \"O my people! Worship Allah! You have no other god but Him. Will you then not have Taqwa\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Ad (We sent) their brother Hud. He said: O my people! serve Allah, you have no god other than Him; will you not then guard (against evil)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Ad their brother Hood; he said, 'O my people, serve God! You have no god other than He; will you not be godfearing?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto (the tribe of) A'ad (We sent) their brother, Hud. He said: O my people! Serve Allah. Ye have no other Allah save Him. Will ye not ward off (evil)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the people of 'Ad We sent their brother, Hud. He said, \"O my people, worship God, you have no other god but He. Then will you not be God-fearing?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto 'Ad We sent their brothers Hud. He said: O my people! worship Allah, no god ye have but He; Fear ye not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to [the people of] ‘Ad [We sent] Hud, their brother. He said, ‘O my people, worship Allah! You have no other god besides Him. Will you not then be wary [of Him]?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the 'Ad people, (We sent) Hud, one of their (own) brethren: He said: O my people! worship Allah! ye have no other god but Him will ye not fear (Allah)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to 'Ad (people, We sent) their brother Hud. He said: \"O my people! Worship Allah! You have no other Ilah (God) but Him. (La ilaha ill-Allah: none has the right to be worshipped but Allah). Will you not fear (Allah)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to (the people of) Aad We sent their brother, Hood. He said: 'Worship Allah, my nation, for you have no god except He. Will you not then be cautious'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Aad, their brother Hud. He said, “O my people! Worship God; you have no god other than Him. Will you not take heed?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to the 'Aad [We sent] their brother Hud. He said, \"O my people, worship Allah; you have no deity other than Him. Then will you not fear Him?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:65] And, We sent, to, the earlier, ‘Ād their brother Hūd. He said, ‘O my people, worship God, affirm His Oneness! You have no god other than Him. Will you not fear?’, will you [not] fear Him, and so believe?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيجوز أن يكون العطف من عطف الجمل بأن يقدّر بعد واو العطف «أرسلنا» لدلالة حرف ( إلى ) عليه ، مع دلالة سبق نظيره في الجملة المعطوف عليها ، والتّقدير وأرسلنا إلى عادٍ ، فتكون الواو لمجرّد الجمع اللّفظي من عطف القصّة على القصّة وليس من عطف المفردات ، ويجوز أن يكون من عطف المفردات : عَطَفت الواو { هوداً } على { نوحاً } \\[ الأعراف : 59 \\] ، فتكون الواو نائية عن العامل وهو { أرسلنا } \\[ الأعراف : 59 \\] ، والتّقدير : «لقد أرسلنا نوحاً إلى قومه وهوداً أخا عاد إليهم وقدمت ( إلى ) فهو من العطف على معمولي عامل واحدٍ ، وتقديم ( إلى ) اقتضاه حسن نظم الكلام في عود الضّمائر ، والوجه الأوّل أحسن .وقدّم المجرور على المفعول الأصلي ليتأتى الإيجاز بالإضمار حيث أريد وصف هود بأنّه من إخوة عاد ومن صميمهم ، من غير احتياج إلى إعادة لفظ عاد ، ومع تجنّب عود الضّمير على متأخر لفظاً ورتبةً ، فقيل وإلى عاد أخاهم هوداً و { هوداً } بدل أو بيان من { أخاهم }.وعادٌ أمّة عظيمة من العرب العاربة البائدة ، وكانوا عشر قبائل ، وقيل ثلاث عشرة قبيلة وهم أبناء عاد بن عُوص ، وعوص هو ابن إرَمَ بن سَام بننِ نوح ، كذا اصطلح المؤرّخون .وهود اختلف في نسبه ، فقيل : هو من ذرّية عاد ، فقال القائلون بهذا : هو ابن عبد الله بن رَبَاح بن الخلود بن عَاد ، وقيل : هو من ذرّية سام جدّ عادٍ ، وليس من ذرّية عاد ، والقائلون بهذا قالوا هو هُود بن شالخ بن أرفخشد بن سام بن نوح ، وذكر البغوي عن عَلي : أنّ قبر هُود بحضرَمَوتَ في كثيب أحمر ، وعن عبد الرحمن بن سابط : أنّ قبْرَ هود بين الرّكن والمَقام وزمزم .وعَادٌ أريد به القبيلة وساغ صرفه لأنه ثلاثي ساكن الوسط ، وكانت منازل عاد ببلاد العرب بالشِّحْر بكسر الشّين المعجمة وسكون الحاء المهملة من أرض اليمن وحَضر موت وعُمَان والأحقاففِ ، وهي الرّمال التي بين حضر موت وعُمَان .والأخُ هنا مستعمل في مطلق القريب ، على وجه المجاز المرسل ومنه قولهم يا أخَا العرب ، وقد كان هود من بني عادٍ ، وقيل : كان ابنَ عم إرَم ، ويطلق الأخ مجازاً أيضاً على المصاحب الملازم ، كقولهم : هو أخو الحَرْب ، ومنه { إنّ المبَذّرين كانُوا إخوانَ الشّياطين } \\[ الإسراء : 27 \\] وقوله { وإخوانهمُ يمدّونهم في الغي } \\[ الأعراف : 202 \\]. فالمراد أنّ هوداً كان من ذوي نسب قومه عاد ، وإنَّما وصف هود وغيره بذلك ، ولم يُوصف نوح بأنّه أخ لقومه : لأنّ النّاس في زمن نوح لم يكونوا قد انقسموا شعوباً وقبائل ، والعرب يقولون : للواحد من القبيلة : أخو بني فلان ، قصداً لعزوه ونسبته تمييزاً للنّاس إذ قد يشتركون في الأعلام ، ويؤخذ من هذه الآية ونظائرها أنّ نظام القبائل مَا حدث إلاّ بعد الطُّوفان .وفُصِلت جملة : { قال يا قوم } ولم تعطف بالفاء كما عطف نظيرها المتقدّم في قصّة نوح؛ لأنّ الحال اقتضى هنا أن تكون مستأنفة استئنافاً بيانياً لأنّ قصّة هود لما وردت عقب قصّة نوح المذكور فيها دعوتُه قومه صار السّامع مترقباً معرفة ما خاطب به هود قومه حيث بعثه الله إليهم ، فكان ذلك مثار سؤال في نفس السّامع أن يقول : فماذا دَعا هُودٌ قومه وبماذا أجابوا؟ فيقع الجواب بأنّه قال : يا قوم اعبدوا الله إلخ مع ما في هذا الاختلاف من التّفنّن في أساليب الكلام ، ولأنّ الفعل المفرع عنه القولُ بالعطف لما كان محذوفاً لم يكن التّفريع حسناً في صورة النّظم .والرّبطُ بين الجمل حاصل في الحالتين لأنّ فاء العطف رابط لفظيٌ للمعطوف بالمعطوف عليه ، وجواب السؤال رابط جملة الجواب بجملة مثار السؤال ربطاً معنوياً .وجملة : { ما لكم من إله غيره } مستأنفة ابتدائيّة . وقد شابهت دعوةُ هود قومَه دعوةَ نوح قومَه في المهم من كلامها : لأنّ الرّسل مرسَلون من الله والحكمة من الإرسال واحدة ، فلا جرم أن تتشابه دعواتهم ، وفي الحديث : \" الأنبياء أبناء عَلاّتٍ \" وقال تعالى : { شَرع لكم من الدّين مَا وصّى به نوحاً والذي أوحينا إليك وما وصّينا به إبراهيم وموسى وعيسى } \\[ الشورى : 13 \\].وجملة : { أفلا تتقون } استفهامية إنكارية معطوفة بفاء التّفريع على جملة : { ما لكم من إله غيره }. والمراد بالتّقوى الحذر من عقاب الله تعالى على إشراكهم غيرَه في العبادة واعتقادِ الإلهيّة . وفيه تعريض بوعيدهم إن استمروا على ذلك . وإنَّما ابتدأ بالإنكار عليهم إغلاظاً في الدّعوة وتهويلاً لفظاعة الشّرك ، إن كان قال ذلك في ابتداء دعوته ، ويحتمل أنّ ذلك حكاية قوللٍ من أقواله في تكرير الدّعوة بعد أن دعاهم المرّة بعد المرة ووعظهم ، كما قال نوح { إني دعوتُ قومي ليلا ونهاراً } \\[ نوح : 5 \\] كما اقتضاه بعض توجيهات تجريد حكاية كلامه عن فاء التّفريع المذكور آنفاً .\n\n",
      "translations": [
        {
          "translation": "164 (And unto (the tribe of) 'Aad) and We sent to 'Aad (their brother) their prophet (Hud. He said: my people! Serve Allah) profess Allah's divine Oneness. (Ye have no other God save Him) save the One to whom I am calling you. (Will ye not ward off (evil)) the worship of other than Him?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أرسلنا أيضاً { إِلَىٰ } قوم { عَادٍ } حين خرجوا عن ربقة الإيمان وعرى التقوى { أَخَاهُمْ هُوداً } أضافه إليهم بالأخوة\n لكمال الشفقة ووفور الأعطاف { قَالَ } منادياً لهم مضيفاً لهم إلى نفسه\n ليقبلوا قوله ويمتثلوا بما جاء به من ربه: { يَاقَوْمِ ٱعْبُدُواْ ٱللَّهَ } المظهر الموجد لكم من كتم العدم ورباكم بأنواع اللطف والكرم\n واعتقدوا يقيناً أنه { مَا لَكُمْ مِّنْ إِلَـٰهٍ } موجد مرب { غَيْرُهُ } فعليكم أن تعبدون إيماناً به وعملاً بما جاء عنده لأنبيائه حتى يتحققوا بمقر التوحيد\n أتنكرون وحدة الحق وتعبدون غيره من الآلهة الباطلة { أَفَلاَ تَتَّقُونَ } [الأعراف: 65] عن بشطه وأخذه؟!\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أخاهم }: عطف على نوح\n و { هودًا }: عطف بيان أو بدل\n وكذلك { أخاهم صالحًا } وما بعده حيث وقع\n يقول الحقّ جلّ جلاله: { و } أرسلنا { إلى } قبيلة { عادٍ أخاهم } أي: واحد من قبيلتهم\n كقولهم: يا أخا العرب\n فإنه هود بن عبدالله بن رباح بن الخلود بن عاد بن عوص بن إرم بن سام بن نوح\n وقيل: هو هود بن شالح بن أرفخشذ بن سام بن نوح\n فهو ابن عم أبي عاد\n وإنما أرسل إليهم منهم لأنهم أفهم لقوله\n وأعرف بحاله\n وأرغب في أتباعه\n ثم وعظهم فقال: { يا قوم اعبدوا الله } وحده { ما لكم من إله غيره أفلا تتقون } عذاب الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:50",
      "similarity": 0.8557884545699117
    },
    {
      "verse": "26:124",
      "similarity": 0.7354042925271913
    },
    {
      "verse": "5:51",
      "similarity": 0.4733551397178928
    },
    {
      "verse": "11:53",
      "similarity": 0.47105197979709995
    },
    {
      "verse": "11:60",
      "similarity": 0.4663589856500942
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007065.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007065.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:65.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}