{
  "chapter": "الأعراف",
  "text": "قالوا۟ اجئتنا لنعبد الله وحده ونذر ما كان يعبد ءاباؤنا فاتنا بما تعدنا ان كنت من الصدقين",
  "translations": [
    {
      "translation": "They said, 'Have you come to us to make us worship Allah alone and abandon what our fathers used to worship? Then bring us what you have promised us if you are telling the truth.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They answered: \"Have you come to say to us that we should worship only one God, abandoning those our ancestors had worshipped? If so, bring on us what you threaten us with, if what you say is true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'Have you come to us that we should worship none other than Allah and forsake all whom our forefathers were wont to worship? Then bring upon us the scourge with which you have threatened us if you are truthful?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Have you come to make us worship God alone and give up what our fathers worshipped? If you are truthful, let the torment with which you have threatened us, strike us\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Have you come to us in order that we worship only Allah, and abandon those whom our ancestors worshipped?! So bring upon us what you promise us, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"You have come to us that we should worship Allah Alone and forsake that which our fathers used to worship. So bring us that wherewith you have threatened us if you are of the truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Have you come to us that we may serve Allah alone and give up what our fathers used to serve? Then bring to us what you threaten us with, if you are of the truthful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Why, hast thou come to us that we may serve God alone, and forsake that our fathers served? Then bring us that thou promisest us, if thou speakest truly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Hast come unto us that we should serve Allah alone, and forsake what our fathers worshipped? Then bring upon us that wherewith thou threatenest us if thou art of the truthful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Have you come to tell us to serve God alone and to forsake the gods our forefathers served? Bring us then what you threaten us with, if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: art thou come unto us that we should worship God alone and leave that which our fathers were wont to worship? Bring thou then upon us that wherewith thou threatenest us if thou sayest sooth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘Have you come to [tell] us that we should worship Allah alone and abandon what our fathers have been worshiping? Then bring us what you threaten us with, should you be truthful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Comest thou to us, that we may worship Allah alone, and give up the cult of our fathers? bring us what thou threatenest us with, if so be that thou tellest the truth!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"You have come to us that we should worship Allah Alone and forsake that which our fathers used to worship. So bring us that wherewith you have threatened us if you are of the truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'Have you come to us in order that we worship Allah alone and renounce that which our fathers worshipped? Bring down that with which you threaten us if you are from the truthful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Did you come to us to make us worship God alone, and abandon what our ancestors used to worship? Then bring us what you threaten us with, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Have you come to us that we should worship Allah alone and leave what our fathers have worshipped? Then bring us what you promise us, if you should be of the truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:70] They said, ‘Have you come to us that we should worship God alone, and forsake, abandon, what our fathers worshipped? Then bring upon us what you promised us, of chastisement, if you are of the truthful’, in what you say.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said: Hast thou come unto us that we should serve Allah alone, and forsake what our fathers worshipped) the many gods that our fathers worshipped? (Then bring upon us that wherewith thou threatenest us) of torment (if thou art of the Truthful).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما بالغ في نصحهم وإرشادهم وبذل جهده في أداء الرسالة والتبليغ { قَالُوۤاْ } في جوابه من غاية قسوتهم ونهاية حميتهم مستفهماً مقرعاً: { أَجِئْتَنَا } أيها الكذاب السفيه { لِنَعْبُدَ ٱللَّهَ } الذي ادعيت أنت أنه { وَحْدَهُ } لا شريك له ولا إله سواه { وَنَذَرَ مَا كَانَ يَعْبُدُ آبَاؤُنَا } من الآلهة\n فاذهب أنت وإلهك إذ لا نؤمن بك وبه أصلاً\n وإن شئت { فَأْتِنَا بِمَا تَعِدُنَآ } من العذاب والنكال { إِن كُنتَ مِنَ ٱلصَّادِقِينَ } [الأعراف: 70] في دعواك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:11",
      "similarity": 0.6301124593985682
    },
    {
      "verse": "75:21",
      "similarity": 0.44090500093542695
    },
    {
      "verse": "44:36",
      "similarity": 0.41645813101740553
    },
    {
      "verse": "46:22",
      "similarity": 0.3844659430258968
    },
    {
      "verse": "21:92",
      "similarity": 0.3543654616622179
    }
  ]
}