{
  "chapter": "الأعراف",
  "text": "قال قد وقع عليكم من ربكم رجس وغضب اتجدلوننى فى اسماء سميتموها انتم وءاباؤكم ما نزل الله بها من سلطن فانتظروا۟ انى معكم من المنتظرين",
  "translations": [
    {
      "translation": "He said, 'Punishment and anger have come down on you from your Lord. Do you argue with me regarding names which you and your forefathers invented and for which Allah has sent down no authority? Wait, then; I am waiting with you.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: \"You have already been beset with punishment and the wrath of God. Why dispute with me about names invented by you and your ancestors for which no sanction was sent down? So wait (for what is to come), I am waiting with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hud warned them: 'Surely punishment and wrath from your Lord have befallen upon you. Do you dispute with me about mere names that you and your forefathers have concocted and for which Allah has sent down no sanction? Wait, then, and I too am with you among those who wait.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied, \"You will certainly be afflicted by wickedness and the wrath of God. Do you dispute with me about the names of that which you and your fathers have invented? God has given no authority to those names. Wait for God's decree and I, too, am waiting with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Indeed the punishment and the wrath of your Lord have fallen upon you; what! You needlessly dispute with me regarding the names you and your ancestors have fabricated? Allah has not sent down any proof concerning them; therefore wait – I too await with you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Hud) said: \"Rijs (torment) and wrath have already fallen on you from your Lord. Dispute you with me over names which you have named -- you and your fathers -- with no authority from Allah Then wait, I am with you among those who wait.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Indeed uncleanness and wrath from your Lord have lighted upon you; what! do you dispute with me about names which you and your fathers have given? Allah has not sent any authority for them; wait then, I too with you will be of those who wait.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said he, 'Anger and wrath from your Lord have fallen upon you. What, do you dispute with me regarding names you have named, you and your fathers, touching which God has sent down never authority? Then watch and wait; I shall be with you watching and waiting.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Terror and wrath from your Lord have already fallen on you. Would ye wrangle with me over names which ye have named, ye and your fathers, for which no warrant from Allah hath been revealed? Then await (the consequence), lo! I (also) am of those awaiting (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Your Lord's wrath and indignation have already fallen upon you. Would you dispute with me about mere names, which you and your fathers have invented, and for which God has revealed no authority? Wait then if you will: I am waiting alongside you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: surely there have befallen you wrath and indignation from your Lord. Dispute ye with me over names ye have named, ye and your fathers, for which Allah hath sent down no warranty? Wait then; I also will be with you of those who wait.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Punishment and wrath from your Lord has become due against you. Do you dispute with me regarding names, which you have named—you and your fathers—for which Allah has not sent down any authority? So wait! I too am waiting along with you.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Punishment and wrath have already come upon you from your Lord: dispute ye with me over names which ye have devised - ye and your fathers,- without authority from Allah? then wait: I am amongst you, also waiting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Hud) said: \"Torment and wrath have already fallen on you from your Lord. Dispute you with me over names which you have named - you and your fathers, with no authority from Allah? Then wait, I am with you among those who wait.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He answered: 'The punishment and wrath of your Lord has already fallen upon you. Would you dispute with me about names which you and your fathers have invented, and for which no authority has been sent down from Allah? Wait if you will, I am waiting with you'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Condemnation and wrath have befallen you from your Lord. Are you arguing with me over names, which you and your ancestors invented, for which God sent down no authority? Just wait; I am waiting with you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Hud] said, \"Already have defilement and anger fallen upon you from your Lord. Do you dispute with me concerning [mere] names you have named them, you and your fathers, for which Allah has not sent down any authority? Then wait; indeed, I am with you among those who wait.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:71] He said, ‘Already, terror, chastisement, and wrath from your Lord have fallen, [they] must be [sent down], on you. Do you dispute with me concerning names which you have named, that is, with which you, you and your fathers, have named idols that you worship, for which, that is, for the worship of which, God has not revealed any warrant?, any definitive argument or proof? Then await, the chastisement. Truly I shall be with you waiting’, for that, on account of your denial of me: thus a blighting wind was unleashed against them [cf. Q. 51:4].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفأجابهم بأن أخبرهم بأنّ الله قد غضب عليهم ، وأنّهم وقع عليهم رجس من الله .والأظهر أنّ : { وقع } معناه حَق وثبت ، من قولهم للأمر المحقّق : هذا وَاقع ، وقولهم للأمر المكذوب : هذا غير واقع ، فالمعنى حَقّ وقُدر عليكم رجس وغضب . فالرّجس هو الشّيء الخبيث ، أطلق هنا مجازاً على خبث الباطن ، أي فساد النّفس كما في قوله تعالى : { فزادتهم رجساً إلى رجسهم } \\[ التوبة : 125 \\] وقوله { كذلك يجعل الله الرّجس على الذين لا يؤمنون } \\[ الأنعام : 125 \\]. والمعنى أصاب الله نفوسهم بالفساد لكفرهم فلا يقبلون الخير ولا يصيرون إليه ، وعن ابن عبّاس أنّه فَسَّر الرّجس هنا باللّعنة ، والجمهور فسّروا الرّجس هنا بالعذاب ، فيكون فعل : { وقَعَ } من استعمال صيغة المضي في معنى الاستقبال ، إشعاراً بتحقيق وقوعه؟ ومنهم من فسّر الرّجس بالسّخط ، وفسّر الغضب بالعذاب ، على أنّه مجاز مرسَل لأنّ العذاب أثر الغضب ، وقد أخبَر هود بذلك عن علم بوحي في ذلك الوقت أو من حين أرسله الله ، إذْ أعلمه بأنّهم إن لم يرجعوا عن الشّرك بعد أن يُبَلِّغهم الحجّة فإنّ عدم رجوعهم علامة على أنّ خبث قلوبهم متمكّن لا يزول ، ولا يرجى منهم إيمان ، كما قال الله لنوح : { لن يُؤمن من قومك إلاّ مَن قد آمن } \\[ هود : 136 \\].وغضب الله تقديره : الإبعاد والعقوبة والتّحقير ، وهي آثار الغضب في الحوادث ، لأنّ حقيقة الغضب : انفعال تنشأ عنه كراهيّة المغضوب عليه وإبعادُه وإضراره .وتأخير الغضب عن الرّجس لأنّ الرّجس ، وهو خبث نفوسهم ، قد دلّ على أنّ الله فطرهم على خبث بحيث كان استمرارهم على الضّلال أمراً جِبلّياً ، فدلّ ذلك على أنّ الله غضب عليهم . فوقوع الرجس والغضب عليهم حاصل في الزّمن الماضي بالنّسبة لوقت قول هود . واقترانُه ب { قد } للدّلالة على تقريب زمن الماضي من الحال : مثل قَد قامت الصّلاة .وتقديم : { عليكم من ربّكم } على فاعل الفعل للاهتمام بتعجيل ذكر المغضوب والغاضب ، إيقاظاً لبصائرهم لعلّهم يبادرون بالتّوبة ، ولأنّ المجرورين متعلّقان بالفعل فناسب إيلاؤهما إياه ، ولو ذُكرا بعد الفاعل لتُوهِّم أنّهما صفتان له ، وقدم المجرور الذي هو ضميرهم ، على الذي هو وصف ربّهم لأنّهم المقصود الأوّل بالفعل .ولمّا قَدّم إنذارهم بغضب الله عاد إلى الاحتجاج عليهم بفساد معتقدهم فأنكر عليهم أن يجادلوا في شأن أصنامهم . والمجادلة : المحاجة .وعبّر عن الأصنام بأنّها أسماء ، أي هي مجرّد أسماء ليست لها الحقائق التي اعتقدوها ووضعوا لها الأسماء لأجل استحضارها ، فبذلك كانت تلك الأسماء الموضوعة مجرّد ألفاظ ، لانتفاء الحقائق التي وضعوا الأسماء لأجلها . فإنّ الأسماء توضع للمسمّيات المقصودة من التّسمية ، وهم إنّما وضعوا لها الأسماء واهتمّوا بها باعتبار كون الإلهيّة جزءاً من المسمَّى الموضوع له الاسم ، وهو الدّاعي إلى التّسميّة ، فمعاني الإلهية وما يتبعها ملاحظةٌ لمن وَضَع تلك الأسماء ، فلمّا كانت المعاني المقصودة من تلك الأسماء منتفية كانت الأسماء لا مسمّياتتٍ لها بذلك الاعتبار ، سواء في ذلك ما كان منها له ذوات وأجسام كالتّماثيل والأنصاب ، وما لم تكن له ذات ، فلعلّ بعص آلهة عاد كان مجرّد اسم يذكرونه بالإلهيّة ولا يجعلون له تمثالاً ولا نُصباً ، مثل ما كانت العزى عند العرب ، فقد قيل : إنهم جعلوا لها بيتاً ولم يجعلوا لها نصباً وقد قال الله تعالى في ذلك : { إن هي إلاّ أسماء سمّيتموها أنتم وآباؤكم ما أنزل الله بها من سلطان } \\[ النجم : 23 \\].وذكر أهل الأخبار أنّ عادا اتّخذوا أصناماً ثلاثة وهي ( صَمُود ) بفتح الصّاد المهملة بوزن زَبُور . و { صُداء } بضمّ الصّاد المهملة مضبوطاً بخط الهَمَذاني محشي «الكشاف» في نسخة من حاشيته المسمّاة «توضيح المشكلات» ومنسوخة بخطّه ، وبدال مهملة بعدها ألف ولم أقف على ضبط الدّال بالتّشديد أو بالتّخفيف : وقد رأيت في نسخة من «الكشاف» مخطوطة موضوعاً على الدّال علامة شدّ ، ولستُ على تمام الثّقة بصحّة النّسخة ، وبعد الألف همزة كما هو في نسخ «الكشاف» و«تفسير البغوي» ، وكذلك هو في أبيات موضوعة في قصّة قوم عاد في كتب القَصص . ووقع في نسخة «تفسير ابن عطيّة» وفي «مروج الذّهب» للمسعودي ، وفي نسخه من شرح ابن بدرون على قصيدة ابن عبدون الأندلسِي بدون همزة بعد الألف ). و ( الهباء ) بالمدّ في آخره مضبوطاً بخطّ الهمذاني في نسخة حاشيته على «الكشاف» ، وفي نسخة «الكشاف» المطبوعة ، وفي «تفسيري» البغوي والخازن ، وفي الأبيات المذكورة آنفاً . ووقع في نسخة قلمية من «الكشاف» بألف دون مدّ . ولم أقف على ضبط الهاء ، ولم أر ذكر صداء والهباء فيما رأيت من كتب اللّغة .وعطف على ضمير المخاطبين : { وآبَاؤكم } لأنّ من آبائهم من وضع لهم تلك الأسماء ، فالواضعون وضعوا وسَمَّوْا ، والمقلّدون سمَّوْا ولم يضَعوا ، واشترك الفريقان في أنّهم يذكرون أسماء لا مسمّيات لها .و { سمّيتموها } معناه : ذكرتموها بألسنتكم ، كما يقال : سمّ الله ، أي ذاكر اسمه ، فيكون سمّى بمعنى ذكر لفظ الاسم ، والألفاظ كلّها أسماء لمدلولاتها ، وأصل اللّغة أسماء قال تعالى : { وعلم آدم الأسماء كلّها } \\[ البقرة : 31 \\] ، وقال لبيد :إلى الحول ثمّ اسمُ السّلامُ عليكُما ... أي لفظه . وليس المراد من التّسمية في الآية وضع الاسم للمسمّى ، كما يقال : سمّيت ولدي كذا ، لأنّ المخاطبين وكثيراً من آبائهم لاحظّ لهم في تسميّة الأصنام ، وإنّما ذلك من فعل بعض الآباء وهم الذين انتحلوا الشّرك واتّخذوه ديناً وعلَّموه أبناءهم وقومهم ، ولأجل هذا المعنى المقصود من التّسمية لم يُذكر لفعل «سمّيتم» مفعول ثان ولا متعلِّق ، بل اقتصر على مفعول واحد .والسلطانُ : الحجّة التي يصدّق بها المخالفُ ، سمّيت سلطاناً لأنّها تتسلّط على نفس المعارض وتقنعه ، ونَفَى أن تكون الحجّة منزلة من الله لأنّ شأن الحجّة في مثل هذا أن يكون مخبَراً بها من جانب الله تعالى ، لأنّ أمور الغيب ممّا استأثر الله بعلمه . وأعظم المغيَّبات ثبوت الإلهيّة لأنّها قد يَقصر العمل عن إدراكها فمن شأنها أن تُتلقى من قبل الوحي الإلهي .والفاء في قوله : { فانتظروا } لتفريع هذا الإنذار والتّهديد السّابق ، لأنّ وقوع الغضب والرّجس عليهم ، ومكابرتهم واحتجاجهم لما لا حجّة له ، ينشأ عن ذلك التّهديد بانتظار العذاب .وصيغة الأمر للتّهديد مثل : { اعملوا ما شئتم } \\[ فصلت : 40 \\]. والانتظار افتعال من النّظر بمعنى التّرقّب ، كأنّ المخاطب أمِر بالتّرقّب فارْتقبَ .ومفعول : { انتظروا } محذوف دلّ عليه قوله : { رجس وغضب } أي فانتظروا عقاباً .وقوله : { إني معكم من المنتظرين } استيناف بياني لأنّ تهديده إياهم يثير سؤالاً في نفوسهم أن يقولوا : إذا كنّا ننتظر العذاب فماذا يكون حالُك ، فبيّن أنّه ينتظر معهم ، وهذا مقام أدب مع الله تعالى كقوله تعالى تَلْقِيناً لرسوله محمّد صلى الله عليه وسلم «وما أدري ما يفعل بي ولا بكم» فهودٌ يخاف أن يشمله العذاب النّازل بقومه وذلك جائز كما في الحديث : أنّ أمّ سلمة قالت : «أنهلك وفينا الصّالحون» قال : \" نعم إذا كثر الخبث \" . وفي الحديث الآخر : \" ثمّ يحشرون على نيّاتهم \" ويجوز أن ينزّل بهم العذاب ويراه هود ولكنّه لا يصيبه ، وقد روي ذلك في قصّته ويجوز أن يبعده الله وقد روي أيضاً في قصته بأن يأمره بمبارحة ديار قومه قبل نزول العذاب :\n\n",
      "translations": [
        {
          "translation": "(He said: Terror) torment (and wrath from your Lord have already fallen on you) have been decreed upon you. (Would ye wrangle) argue (with me over names) idols (which ye have named, ye and your fathers) they you named as gods, (for which) for the worship of which (no warrant) no scripture or proof (from Allah hath been revealed? Then await) my destruction, (Lo! I (also) am of those awaiting) your destruction.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { رِجْسٌ } معناهُ عَذابٌ وغَضبٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \" {Rijsun} \" means punishment and anger.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما أيس هو من هدايتهم وصلاحهم { قَالَ قَدْ وَقَعَ } وجب وحق { عَلَيْكُمْ مِّن رَّبِّكُمْ رِجْسٌ } عذاب شديد تضطرون به { وَغَضَبٌ } نازل من عنده بحيث يستأصلكم بالمرة { أَتُجَٰدِلُونَنِي } أيها المغضوبون بغضب الله { فِيۤ أَسْمَآءٍ } أشياءٍ { سَمَّيْتُمُوهَآ أَنْتُمْ وَآبَآؤكُمُ } من تلقاء أنفسكم آلهة تعبدونها كعبادة الله مع أنه { مَّا نَزَّلَ ٱللَّهُ بِهَا مِن سُلْطَانٍ } حجةٍ وبرهانٍ تستدلون بها على عبادة هؤلاء التماثيل العاطلة والمفتريات الباطلة وبعدما ظهر الحق فلم تقبلوا أيها المسرفون { فَٱنْتَظِرُوۤاْ } نزول العذاب { إِنِّي مَعَكُمْ مِّنَ ٱلْمُنْتَظِرِينَ } [الأعراف: 71]\n\n\nروي أنهم كانوا يعبدون الأصنام: فلما بُعث إليهم هود كذبوه وأصروا على ما هم عليه عتواً وعناداً التماثيل العاطلة\n فأمسك الله القطر عنهم ثلاث سنين حتى جهدهم\n وكان من عادتهم إذا نزل عليهم البلاء توجهوا نحو البيت الحرام\n وتقربوا عندها وطبوا من الله الفرج: فجهزوا إليها قيل بن عنز\n ومرثد بن سعد في سبعين من أعيانهم\n وكان إذ ذاك بمكة العمالقة أولاد عمليق بن لاوذ بن سام بن نوح\n وسيدهم معاوية بن بكر\n فلما قدموا عليه وهو بظاهر مكة أنزلهم وأكرمهم\n فلبثوا عنده شهراً\n ثم قصدوا البيت ليدعوا\n\n\nقال مرثد: والله لا يسقون بدعائكم\n ولكنكم إن أطعتم نبيكم وتبتم إلى الله لأسقيتم\n فقالوا لمعاوية: احبس منا مرثداً لا يقدمن معنا مكة\n فإنه قد اتبع دين هود\n وترك ديننا\n فحبسه ثم دخلوا مكة\n\n\nفقال قيل: الله اسق ما كنت تسقيهم\n فأنشأ الله سحابات ثلاث: بيضاء وحمراء وسوداء\n ثم نادى منادٍ من جانب السماء: اختر يا قيل لنفسك ولقومك منها\n قال: اخترت السوداء\n لأنها أكثرهن ماء\n فخرجت على عادٍ من وادي المغيث\n فاستبشروا بها واستعجلوا لنزولها\n وقالوا: هذا عارض ممطرنا\n بل ما استعجلتم به ريح فيها عذاب أليم\n فجاءتهم ريح عقيم فأهلكتهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولذلك قال لهم هود عليه السلام: { قد وقع عليكم من ربكم رجس وغضب } \n بعد أن قالوا: { فأْتنا بما تعدنا } من العذاب { إن كنت من الصادقين } فيه\n\n{ قال قد وقع } أي: وجب { عليكم من ربكم رجسٌ } عذاب { وغضب } إرادة الانتقام\n { أتجادلونني في أسماء سميتموها أنتم وآباؤكم } أي: أتجادلونيي في عبادة مسميات أسماء\n ففي الكلام حذف\n وأراد بقوله: { سميتموها أنتم وآباؤكم } أي: جعلتم لها أسماء\n فدل ذلك على أنها محدثة\n فلا يصح أن تكون آلهة\n أو سميتموها آلهة من غير دليل\n وهو معنى قوله: { ما نزَّل اللهُ بها من سلطان } أي: حجة تدل على استحقاقها للعبادة\n فالمجادلة يحتمل أن تكون في عبادتها\n أو في تسميتها آلهة\n والمراد بالاسم ـ على الأول ـ المسمى\n وعلى الثاني: التسمية\n قاله ابن جزي: { فانتظروا } نزول العذاب\n الذي طلبتم حين أصررتم على العناد\n { إني معكم من المنتظرين } نزوله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:100",
      "similarity": 0.48589243082117806
    },
    {
      "verse": "9:125",
      "similarity": 0.432528966391668
    },
    {
      "verse": "9:95",
      "similarity": 0.3733756340412841
    },
    {
      "verse": "33:33",
      "similarity": 0.282629131986392
    },
    {
      "verse": "40:56",
      "similarity": 0.2623934674676188
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007071.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007071.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:71.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}