{
  "chapter": "الأعراف",
  "text": "قال قد وقع عليكم من ربكم رجس وغضب اتجدلوننى فى اسماء سميتموها انتم وءاباؤكم ما نزل الله بها من سلطن فانتظروا۟ انى معكم من المنتظرين",
  "translations": [
    {
      "translation": "He said, 'Punishment and anger have come down on you from your Lord. Do you argue with me regarding names which you and your forefathers invented and for which Allah has sent down no authority? Wait, then; I am waiting with you.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: \"You have already been beset with punishment and the wrath of God. Why dispute with me about names invented by you and your ancestors for which no sanction was sent down? So wait (for what is to come), I am waiting with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hud warned them: 'Surely punishment and wrath from your Lord have befallen upon you. Do you dispute with me about mere names that you and your forefathers have concocted and for which Allah has sent down no sanction? Wait, then, and I too am with you among those who wait.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied, \"You will certainly be afflicted by wickedness and the wrath of God. Do you dispute with me about the names of that which you and your fathers have invented? God has given no authority to those names. Wait for God's decree and I, too, am waiting with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Indeed the punishment and the wrath of your Lord have fallen upon you; what! You needlessly dispute with me regarding the names you and your ancestors have fabricated? Allah has not sent down any proof concerning them; therefore wait – I too await with you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Hud) said: \"Rijs (torment) and wrath have already fallen on you from your Lord. Dispute you with me over names which you have named -- you and your fathers -- with no authority from Allah Then wait, I am with you among those who wait.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Indeed uncleanness and wrath from your Lord have lighted upon you; what! do you dispute with me about names which you and your fathers have given? Allah has not sent any authority for them; wait then, I too with you will be of those who wait.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said he, 'Anger and wrath from your Lord have fallen upon you. What, do you dispute with me regarding names you have named, you and your fathers, touching which God has sent down never authority? Then watch and wait; I shall be with you watching and waiting.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Terror and wrath from your Lord have already fallen on you. Would ye wrangle with me over names which ye have named, ye and your fathers, for which no warrant from Allah hath been revealed? Then await (the consequence), lo! I (also) am of those awaiting (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Your Lord's wrath and indignation have already fallen upon you. Would you dispute with me about mere names, which you and your fathers have invented, and for which God has revealed no authority? Wait then if you will: I am waiting alongside you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: surely there have befallen you wrath and indignation from your Lord. Dispute ye with me over names ye have named, ye and your fathers, for which Allah hath sent down no warranty? Wait then; I also will be with you of those who wait.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Punishment and wrath from your Lord has become due against you. Do you dispute with me regarding names, which you have named—you and your fathers—for which Allah has not sent down any authority? So wait! I too am waiting along with you.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Punishment and wrath have already come upon you from your Lord: dispute ye with me over names which ye have devised - ye and your fathers,- without authority from Allah? then wait: I am amongst you, also waiting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Hud) said: \"Torment and wrath have already fallen on you from your Lord. Dispute you with me over names which you have named - you and your fathers, with no authority from Allah? Then wait, I am with you among those who wait.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He answered: 'The punishment and wrath of your Lord has already fallen upon you. Would you dispute with me about names which you and your fathers have invented, and for which no authority has been sent down from Allah? Wait if you will, I am waiting with you'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Condemnation and wrath have befallen you from your Lord. Are you arguing with me over names, which you and your ancestors invented, for which God sent down no authority? Just wait; I am waiting with you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Hud] said, \"Already have defilement and anger fallen upon you from your Lord. Do you dispute with me concerning [mere] names you have named them, you and your fathers, for which Allah has not sent down any authority? Then wait; indeed, I am with you among those who wait.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:71] He said, ‘Already, terror, chastisement, and wrath from your Lord have fallen, [they] must be [sent down], on you. Do you dispute with me concerning names which you have named, that is, with which you, you and your fathers, have named idols that you worship, for which, that is, for the worship of which, God has not revealed any warrant?, any definitive argument or proof? Then await, the chastisement. Truly I shall be with you waiting’, for that, on account of your denial of me: thus a blighting wind was unleashed against them [cf. Q. 51:4].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said: Terror) torment (and wrath from your Lord have already fallen on you) have been decreed upon you. (Would ye wrangle) argue (with me over names) idols (which ye have named, ye and your fathers) they you named as gods, (for which) for the worship of which (no warrant) no scripture or proof (from Allah hath been revealed? Then await) my destruction, (Lo! I (also) am of those awaiting) your destruction.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { رِجْسٌ } معناهُ عَذابٌ وغَضبٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما أيس هو من هدايتهم وصلاحهم { قَالَ قَدْ وَقَعَ } وجب وحق { عَلَيْكُمْ مِّن رَّبِّكُمْ رِجْسٌ } عذاب شديد تضطرون به { وَغَضَبٌ } نازل من عنده بحيث يستأصلكم بالمرة { أَتُجَٰدِلُونَنِي } أيها المغضوبون بغضب الله { فِيۤ أَسْمَآءٍ } أشياءٍ { سَمَّيْتُمُوهَآ أَنْتُمْ وَآبَآؤكُمُ } من تلقاء أنفسكم آلهة تعبدونها كعبادة الله مع أنه { مَّا نَزَّلَ ٱللَّهُ بِهَا مِن سُلْطَانٍ } حجةٍ وبرهانٍ تستدلون بها على عبادة هؤلاء التماثيل العاطلة والمفتريات الباطلة وبعدما ظهر الحق فلم تقبلوا أيها المسرفون { فَٱنْتَظِرُوۤاْ } نزول العذاب { إِنِّي مَعَكُمْ مِّنَ ٱلْمُنْتَظِرِينَ } [الأعراف: 71]\n\n\n\n\nروي أنهم كانوا يعبدون الأصنام: فلما بُعث إليهم هود كذبوه وأصروا على ما هم عليه عتواً وعناداً التماثيل العاطلة، فأمسك الله القطر عنهم ثلاث سنين حتى جهدهم، وكان من عادتهم إذا نزل عليهم البلاء توجهوا نحو البيت الحرام، وتقربوا عندها وطبوا من الله الفرج: فجهزوا إليها قيل بن عنز، ومرثد بن سعد في سبعين من أعيانهم، وكان إذ ذاك بمكة العمالقة أولاد عمليق بن لاوذ بن سام بن نوح، وسيدهم معاوية بن بكر، فلما قدموا عليه وهو بظاهر مكة أنزلهم وأكرمهم، فلبثوا عنده شهراً، ثم قصدوا البيت ليدعوا\n\n\n\n\nقال مرثد: والله لا يسقون بدعائكم، ولكنكم إن أطعتم نبيكم وتبتم إلى الله لأسقيتم، فقالوا لمعاوية: احبس منا مرثداً لا يقدمن معنا مكة، فإنه قد اتبع دين هود، وترك ديننا، فحبسه ثم دخلوا مكة\n\n\n\n\nفقال قيل: الله اسق ما كنت تسقيهم، فأنشأ الله سحابات ثلاث: بيضاء وحمراء وسوداء، ثم نادى منادٍ من جانب السماء: اختر يا قيل لنفسك ولقومك منها، قال: اخترت السوداء؛ لأنها أكثرهن ماء، فخرجت على عادٍ من وادي المغيث، فاستبشروا بها واستعجلوا لنزولها، وقالوا: هذا عارض ممطرنا، بل ما استعجلتم به ريح فيها عذاب أليم، فجاءتهم ريح عقيم فأهلكتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:100",
      "similarity": 0.48589243082117806
    },
    {
      "verse": "9:125",
      "similarity": 0.432528966391668
    },
    {
      "verse": "9:95",
      "similarity": 0.3733756340412841
    },
    {
      "verse": "33:33",
      "similarity": 0.282629131986392
    },
    {
      "verse": "40:56",
      "similarity": 0.2623934674676188
    }
  ]
}