{
  "chapter": "الأعراف",
  "text": "فانجينه والذين معه برحمة منا وقطعنا دابر الذين كذبوا۟ بـايتنا وما كانوا۟ مؤمنين",
  "translations": [
    {
      "translation": "So We rescued him and those with him by mercy from Us, and We cut off the last remnant of those who denied Our Signs and were not muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We saved him and those on his side by Our grace, and destroyed to the very last those who rejected Our signs and denied the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We delivered Hud and his companions by Our mercy, and We utterly cut off the last remnant of those who called the lie to Our signs and would not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Through Our mercy, We saved him and his companions and destroyed the unbelievers who called Our revelations mere lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We therefore rescued him and those with him by a great mercy from Us, and We cut off the lineage of those who denied Our signs – and they were not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We saved him and those who were with him out of mercy from Us, and We severed the roots of those who belied Our Ayat; and they were not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We delivered him and those with him by mercy from Us, and We cut off the last of those who rejected Our communications and were not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We delivered him, and those with him, by a mercy from Us; and We cut off the last remnant of those who cried lies to Our signs and were not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We saved him and those with him by a mercy from Us, and We cut the root of those who denied Our revelations and were not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We saved him and those who were with him, by Our mercy; We annihilated those who denied Our signs and would not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We delivered him and those with him by a mercy from Us, and We utterly cut off those who belied Our signs, and would not be believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We delivered him and those who were with him by a mercy from Us, and We rooted out those who denied Our signs and were not faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We saved him and those who adhered to him. By Our mercy, and We cut off the roots of those who rejected Our signs and did not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We saved him and those who were with him by a Mercy from Us, and We cut the roots of those who belied Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), and they were not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We saved him and all who were with him through Our Mercy and annihilated those who belied Our verses. They were not believers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We saved him and those with him, by mercy from Us, and We cut off the roots of those who rejected Our revelations and were not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We saved him and those with him by mercy from Us. And We eliminated those who denied Our signs, and they were not [at all] believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:72] So We delivered him, namely, Hūd, and those with him, from among the believers, by a mercy from Us, and We cut the root of those, people, who denied Our signs, that is, We extirpated them, and were not believers (wa-mā kānū mu’minīna is a supplement to kadhdhabū, ‘[those who] denied’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We saved him) i.e. Hud (and those with him by a mercy from Us) for them, (and We cut the root of those who denied Our revelations) We exterminated those who denied Our Scripture and Messenger Hud (and were not believers) those who were destroyed were all disbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَأَنجَيْنَاهُ } أي: هوداً { وَٱلَّذِينَ } آمنوا { مَعَهُ بِرَحْمَةٍ } نازلة { مِّنَّا } لإيمانهم وانقيادهم { وَقَطَعْنَا دَابِرَ ٱلَّذِينَ كَذَّبُواْ بِآيَاتِنَا } بأن استأصلناهم { وَ } هم { مَا كَانُواْ مُؤْمِنِينَ } [الأعراف: 72] بنبينا وكتابنا، ولا من شأنهم التصديق\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:45",
      "similarity": 0.6491927966486589
    },
    {
      "verse": "15:66",
      "similarity": 0.5448726576709277
    },
    {
      "verse": "21:93",
      "similarity": 0.42123442890979756
    },
    {
      "verse": "79:5",
      "similarity": 0.413691258487128
    },
    {
      "verse": "37:90",
      "similarity": 0.4041362221628212
    }
  ]
}