{
  "chapter": "الأعراف",
  "text": "فانجينه والذين معه برحمة منا وقطعنا دابر الذين كذبوا۟ بـايتنا وما كانوا۟ مؤمنين",
  "translations": [
    {
      "translation": "So We rescued him and those with him by mercy from Us, and We cut off the last remnant of those who denied Our Signs and were not muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We saved him and those on his side by Our grace, and destroyed to the very last those who rejected Our signs and denied the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We delivered Hud and his companions by Our mercy, and We utterly cut off the last remnant of those who called the lie to Our signs and would not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Through Our mercy, We saved him and his companions and destroyed the unbelievers who called Our revelations mere lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We therefore rescued him and those with him by a great mercy from Us, and We cut off the lineage of those who denied Our signs – and they were not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We saved him and those who were with him out of mercy from Us, and We severed the roots of those who belied Our Ayat; and they were not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We delivered him and those with him by mercy from Us, and We cut off the last of those who rejected Our communications and were not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We delivered him, and those with him, by a mercy from Us; and We cut off the last remnant of those who cried lies to Our signs and were not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We saved him and those with him by a mercy from Us, and We cut the root of those who denied Our revelations and were not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We saved him and those who were with him, by Our mercy; We annihilated those who denied Our signs and would not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We delivered him and those with him by a mercy from Us, and We utterly cut off those who belied Our signs, and would not be believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We delivered him and those who were with him by a mercy from Us, and We rooted out those who denied Our signs and were not faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We saved him and those who adhered to him. By Our mercy, and We cut off the roots of those who rejected Our signs and did not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We saved him and those who were with him by a Mercy from Us, and We cut the roots of those who belied Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), and they were not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We saved him and all who were with him through Our Mercy and annihilated those who belied Our verses. They were not believers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We saved him and those with him, by mercy from Us, and We cut off the roots of those who rejected Our revelations and were not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We saved him and those with him by mercy from Us. And We eliminated those who denied Our signs, and they were not [at all] believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:72] So We delivered him, namely, Hūd, and those with him, from among the believers, by a mercy from Us, and We cut the root of those, people, who denied Our signs, that is, We extirpated them, and were not believers (wa-mā kānū mu’minīna is a supplement to kadhdhabū, ‘[those who] denied’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالفاء للتّعقيب : أي فعجّل الله استيصال عاد ونجَّى هوداً والذين معه أي المؤمنين من قومه ، فالمعقّب به هو قطع دابر عاد ، وكان مقتضى الظّاهر أن يكون النّظم هكذا : فقطعْنا دابر الذين كذّبوا إلخ ونجينا هوداً إلخ ، ولكن جرى النّظم على خلاف مقتضى الظّاهر للاهتمام بتعجيل الإخبار بنجاة هود ومن آمَن معه ، على نحو ما قرّرتُه في قوله تعالى : { فكذّبوه فأنجيناه والذين معه في الفلك وأغرقنا الذين كذّبوا بآياتنا } \\[ الأعراف : 64 \\] في قصّة نوح المتقدّمة ، وكذلك القول في تعريف الموصوليّة في قوله : { والذين معه }. والّذين معه هم من آمن به من قومه ، فالمعيّة هي المصاحبة في الدّين ، وهي معيّة مجازيّة ، قيل إنّ الله تعالى أمر هوداً ومن معه بالهجرة إلى مكّة قبل أن يحلّ العذاب بعادٍ ، وإنّه توفي هنالك ودفن في الحِجْر ولا أحسب هذا ثابتاً لأنّ مكّة إنّما بناها إبراهيم وظاهر القرآن في سورة هود أنّ بين عاد وإبراهيم زمناً طويلاً لأنّه حكى عن شعيب قولَه لقومه : { أنْ يصيبكم مثلُ ما أصاب قوم نوح أو قوم هود أو قوم صالح وما قومُ لوط منكم ببعيد } \\[ هود : 89 \\] فهو ظاهر في أنّ عاداً وثموداً كانوا بعيدين من زمن شعيب وأنّ قوم لوط غير بعيدين ، والبعد مراد به بعد الزّمان ، لأنّ أمكنة الجميع متقاربة ، وكان لوط في زمن إبراهيم فالأولى أن لا نعين كيفية إنجاء هود ومن معه . والأظهر أنّها بالأمر بالهجرة إلى مكان بعيد عن العذاب ، وروي عن عليّ أنّ قَبْر هود بحضر موت وهذا أقرب .وقوله : { برحمة منا } الباء فيه للسّببيّة ، وتنكير { رحمة } للتّعظيم ، وكذلك وصفها بأنّها من الله للدّلالة على كمالها ، و ( من ) للابتداء ، ويجوز أن تكون الباءُ للمصاحبة ، أي : فأنجيناه ورحمناه ، فكانت الرّحمَة مصاحبة لهم إذ كانوا بمحلّ اللّطف والرّفق حيثما حَلّوا إلى انقضاء آجالهم ، وموقع ( مِنَّا ) على هذا الوجه موقع رشيق جدّا يؤذن بأن الرّحمة غير منقطعة عنهم كقوله { فإنّك بأعيننا } \\[ الطور : 48 \\].وتفسير قوله : { وقطعنا دابر الذين كذبوا } نظير قوله تعالى : { فقُطع دابر القوم الذين ظلموا } في سورة الأنعام ( 45 ) ، وقد أرسل عليهم الرّيح الدّبُور فأفناهم جميعاً ولم يبق منهم أحد . والظّاهر أنّ الذين أنجاهم الله منهم لم يكن لهم نسل . وأمّا الآية فلا تقتضي إلاّ انقراض نسل الذين كذّبوا ونزل بهم العذاب والتّعريف بطريق الموصوليه تقدّم في قوله : { وأغرقنا الذين كذّبوا بآياتنا } \\[ الأعراف : 64 \\] في قصّة نوح آنفاً ، فهو للإيماء إلى وجه بناء الخبر وهو قطع دابرهم .{ وما كانوا مؤمنين } عطف على { كذّبوا } فهو من الصّلة ، وفائدة عطفه الإشارة إلى أن كلتا الصّلتين موجب لقطع دابرهم : وهما التّكذيب والإشراك ، تعريضاً بمشركي قريش ، ولِموعظتهم ذكرت هذه القصص . وقد كان ما حَلّ بعاد من الاستيصال تطهيراً أوّل لبلاد العرب من الشّرك ، وقطعاً لدابر الضّلال منها في أوّل عصور عمرانها ، أعداداً لما أراد الله تعالى من انبثاق نور الدّعوة المحمّديّة فيها .\n\n",
      "translations": [
        {
          "translation": "(And We saved him) i.e. Hud (and those with him by a mercy from Us) for them, (and We cut the root of those who denied Our revelations) We exterminated those who denied Our Scripture and Messenger Hud (and were not believers) those who were destroyed were all disbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَأَنجَيْنَاهُ } أي: هوداً { وَٱلَّذِينَ } آمنوا { مَعَهُ بِرَحْمَةٍ } نازلة { مِّنَّا } لإيمانهم وانقيادهم { وَقَطَعْنَا دَابِرَ ٱلَّذِينَ كَذَّبُواْ بِآيَاتِنَا } بأن استأصلناهم { وَ } هم { مَا كَانُواْ مُؤْمِنِينَ } [الأعراف: 72] بنبينا وكتابنا\n ولا من شأنهم التصديق",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { فأنجيناه والذين معه برحمة منا } عليهم\n قال القشيري: لا رتبةَ فوق رتبة النبوة\n ولا درجة أعلى من درجة الرسالة\n وقد أخبر سبحانه: أنه نجَّى هودًا برحمته\n وكذا نجَّى الذين آمنوا معه برحمته\n ليُعلَم أن النجاة لا تكون باستحقاق العمل\n وإنما تكون ابتداء فضلٍ من الله ورحمة\n فما نَجَا مَن نَجَا إلا بفضل الله سبحانه وتعالى\n هـ\n { وقطعنا دابر الذين كذَّبوا بآياتنا } أي: استأصلناهم\n { وما كانوا مؤمنين } \n تعريض بمن آمن منهم\n وتنبيه على أن الفارق بين من نَجَا وبين من هلك: هو الإيمان\n رُوِي أنهم كانوا يعبدون الأصنام\n فبعث الله إليهم هودًا فكذبوه\n وزادوا عتوا\n فأمسك الله عنهم المطر ثلاث سنين حتى جهدهم\n وكان الناس حينئذٍ\n مسلمهم ومشركهم\n إذا نزل بهم بلاء توجهوا إلى البيت الحرام وطلبوا من الله الفرج\n فجهزوا إليه \" قيل بن عنز \" \n ومرثد بن سعد\n في سبعين من أعيانهم\n وكان إذ ذاك بمكة العمالقة أولاد عمليق بن لاود بن سام\n وسيدهم: معاوية بن بكر\n فلما قدموا عليه\n وهو بظاهر مكة\n أنزلهم وأكرمهم\n وكانوا أخواله وأصهاره\n فلبثوا عنده شهرًا يشربون الخمر\n وتغنى عليهم الجرادتان ـ قَينَتَانِ له ـ فلما رأى ذهولهم عما بعثوا له أهمه ذلك\n واستحيا أن يكلمهم فيه مخافة أن يظنوا به ثقل مقامهم\n فعلم المغنيتين بيتين من الشعر\n وأمرهما أن تغنيا به وهما:\nفلما غنيتا به أزعجهم ذلك\n فقال مرثد: والله لا يُسقون بدعائكم\n ولكن إن أطعتم نبيكم\n وتبتم إلى الله\n سقيتم\n فقالوا لمعاوية: أحبسه عنا\n لا يقدمنّ معنا مكة فإنه قد أتبع دين هود\n وترك ديننا\n ثم دخلوا مكة\n فقال قيل: اللهم اسق عادًا ما كنت تسقيهم\n فأنشأ الله سحابات ثلاثًا بيضاء وحمراء وسوداء\n ثم ناداه منادٍ من السماء: يا قيل اختر لنفسك ولقومك\n فقال: اخترت السوداء فإنها أكثرهن ماءً\n فخرجت إلىعاد من وادي المغيث\n فاستبشروا بها\n وقالوا: هذا عارض ممطرنا\n فجاءتهم\n فيها ريح عقيم\n فأهلكتهم\n رُوِي أنها لما قربت من ديارهم حملت أنعامهم في الهواء\n كأنها جراد\n فاستمرت عليهم سبع ليالٍ وثمانية أيام\n شدخَت رؤوسهم إلى الحجارة حتى هلكوا جميعًا\n ونجا هو والمؤمنون معه\n فأتوا مكة وعبدوا الله حتى هلكوا\n\nقاله البيضاوي وغيره\n وهاهنا بحث وهو أن البيت إنما بناه إبراهيم عليه السلام حسبما في الصحيح\n ولم تعمر مكة إلا بعد إنزال إسماعيل فيها\n وهود كان قبل إبراهيم\n والبيت حينئذٍ خرب\n كان خربه الطوفان\n فكيف يتوجهون إليه وهو لم يكن؟\n ويمكن الجواب: بأنهم كانوا يلتجؤون إلى رسومه وخربته التي بقيت بعد الطوفان لأن أول من بناه آدم عليه السلام فلما خربه الطوفان بقي أثره\n فكانوا يتبركون به\n وفي بعض التواريخ: أن العماليق بنوه قبل إبراهيم\n فكانوا يطوفون به ويتبركون\n ثم هُدم\n وبناه بعدهم خليل الله إبراهيم\n وبهذا ـ إن صح - يزول الإشكال\n والله تعالى أعلم\n وأما من قال: إن هودًا تعدد\n فغير سديد\n الإشارة: قد تضمنت موعظة هود عليه السلام لقومه خصلتين\n بهما النجاة من كل هول وشر\n والفوز بكل خير\n وهما: التوحيد والتقوى\n وهي الطاعة لله ولرسوله فيما جاء به من أمر ونهي\n فالتوحيد تطهير الباطن من الشرك الجلي والخفي\n والتقوى: حفظ الجوارح من المخالفة في السر والعلانية\n وهاتان الخصلتان هما أساس الطريق ونهايته\n والله تعالى أعلم\n ثم ذكر قصة صالح عليه السلام\n فقال: { وَإِلَىٰ ثَمُودَ أَخَاهُمْ صَالِحاً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:45",
      "similarity": 0.6491927966486589
    },
    {
      "verse": "15:66",
      "similarity": 0.5448726576709277
    },
    {
      "verse": "21:93",
      "similarity": 0.42123442890979756
    },
    {
      "verse": "79:5",
      "similarity": 0.413691258487128
    },
    {
      "verse": "37:90",
      "similarity": 0.4041362221628212
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007072.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007072.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:72.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}