{
  "chapter": "الأعراف",
  "text": "والى ثمود اخاهم صلحا قال يقوم اعبدوا۟ الله ما لكم من اله غيره قد جاءتكم بينة من ربكم هذه ناقة الله لكم ءاية فذروها تاكل فى ارض الله ولا تمسوها بسوء فياخذكم عذاب اليم",
  "translations": [
    {
      "translation": "And to Thamud We sent their brother Salih, who said, 'My people, worship Allah! You have no other god than Him. A Clear Sign has come to you from your Lord. This is the She-Camel of Allah as a Sign for you. Leave her alone to eat on Allah's earth and do not harm her in any way or a painful punishment will afflict you.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent to Thamud their brother Saleh. \"O you people,\" said he, \"worship God, for you have no other god but He. Clear proof has come to you already from your Lord, and this she-camel of God is the token for you. Leave her free to graze upon God's earth, and do not molest her lest a grievous punishment should befall you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Thamud We sent forth their brother. Salih. He said to them: 'O my people! Serve Allah, you have no other god than Him. Truly there has come to you a clear proof from your Lord. This she-camel from Allah is a Divine portent for you. So leave her alone to pasture on Allah's earth, and touch her with no evil lest a painful chastisement should seize you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Salih to his brethren, the tribe of Thamud, who told them, \"Worship God your only Lord. Authoritative evidence has come to you from your Lord and this she-camel is the evidence for you from God. Let her graze in the land of God. Do not give her any trouble lest a painful torment will strike you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Saleh to the tribe of Thamud, from their own community; he said, “O my people! Worship Allah – you do not have any God except Him; indeed a clear proof has come to you from your Lord; this is Allah’s she-camel – a sign for you – so leave her free to feed in Allah’s earth, and do not touch her with evil intentions for a painful punishment will seize you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Thamud (people, We sent) their brother Salih. He said: \"O my people! Worship Allah! You have no other god but Him. Indeed there has come to you a clear sign from your Lord. This she-camel of Allah is a sign unto you; so you leave her to graze in Allah's earth, and touch her not with harm, lest a painful torment should seize you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Samood (We sent) their brother Salih. He said: O my people! serve Allah, you have no god other than Him; clear proof indeed has come to you from your Lord; this is (as) Allah's she-camel for you-- a sign, therefore leave her alone to pasture on Allah's earth, and do not touch her with any harm, otherwise painful chastisement will overtake you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Thamood their brother Salih; he said, 'O my people, serve God! You have no god other than He; there has now come to you a clear sign from your Lord -- this is the She-camel of God, to be a sign for you. Leave her that she may eat in God's earth, and do not touch her with evil, lest you be seized by a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to (the tribe of) Thamud (We sent) their brother Salih. He said: O my people! Serve Allah. Ye have no other Allah save Him. A wonder from your Lord hath come unto you. Lo! this is the camel of Allah, a token unto you; so let her feed in Allah's earth, and touch her not with hurt lest painful torment seize you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the Thamud We sent their brother Salih. He said, \"O my people, worship God; you have no other god but Him. A veritable proof has come to you from your Lord: this is God's she-camel, a sign for you, so let her feed in God's land and do not harm her in any way, or you will be overwhelmed by a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Thamud We sent their brother, Salih He said: my people! worship Allah, no god ye have but He; surely there hath come unto you an evidence from your Lord. Yonder is the she-camel of Allah: a sign unto you; so leave her alone, pasturing on Allah's earth, and touch her not with evil, lest there seize you a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to [the people of] Thamud [We sent] Salih, their brother. He said, ‘O my people, worship Allah! You have no other god besides Him. There has certainly come to you a manifest proof from your Lord. This she-camel of Allah is a sign for you. Let her alone to graze [freely] in Allah’s land, and do not cause her any harm, for then you shall be seized by a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the Thamud people (We sent) Salih, one of their own brethren: He said: \"O my people! worship Allah: ye have no other god but Him. Now hath come unto you a clear (Sign) from your Lord! This she-camel of Allah is a Sign unto you: So leave her to graze in Allah's earth, and let her come to no harm, or ye shall be seized with a grievous punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Thamud (people, We sent) their brother Salih (Saleh). He said: \"O my people! Worship Allah! You have no other Ilah (God) but Him. (La ilaha ill-Allah: none has the right to be worshipped but Allah). Indeed there has come to you a clear sign (the miracle of the coming out of a huge she-camel from the midst of a rock) from your Lord. This she-camel of Allah is a sign unto you; so you leave her to graze in Allah's earth, and touch her not with harm, lest a painful torment should seize you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Thamood We sent their brother Salih. He said: 'Worship Allah, my nation, for you have no god except He. A clear proof has come to you from your Lord. Here is the shecamel of Allah, a sign for you. Leave her to graze in the earth of Allah and do not touch her with evil, lest a painful punishment seizes you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Thamood, their brother Saleh. He said, “O my people! Worship God; you have no god other than Him. Clarification has come to you from your Lord. This she-camel of God is a sign for you. So leave her to graze on God’s earth, and do her no harm, lest a painful penalty seizes you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to the Thamud [We sent] their brother Salih. He said, \"O my people, worship Allah; you have no deity other than Him. There has come to you clear evidence from your Lord. This is the she-camel of Allah [sent] to you as a sign. So leave her to eat within Allah 's land and do not touch her with harm, lest there seize you a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:73] And, We sent, to Thamūd (Thamūda, read without declining [the noun], as denoting the tribe [of Thamūd] itself) their brother Sālih. He said, ‘O my people, worship God! You have no god other than Him. Truly there has come to you a clear proof, an illustration, from your Lord, of my truthfulness, this is the she-camel of God, a sign for you (lakum āyatan is a circumstantial qualifier operated by the import of the demonstrative noun [hādhihi, ‘this’]), they had asked him to make it come out of a [specific] rock which they had designated. So leave her to feed throughout God’s earth, and do not touch her with harm, either by hamstringing or beating her, lest you be seized by a painful chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And to (the tribe of) Thamud) We sent (their brother) their prophet, it is also said that he was their brother in lineage but not in religion (Salih. He said: my people! Serve Allah) profess Allah's divine Oneness. (Ye have no other God save Him) save the One I am commanding you to believe in. (A wonder from your Lord hath come unto you) an exposition from your Lord has come to you. (Lo! this is the camel of Allah, a token unto you) a sign for Allah's message; (so let her feed in Allah's earth) eat its grass unhindered, (and touch 165 her not with hurt) hamstrung her not (lest painful torment seize you) after you hurt her.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ هذه نَاقة الله لكُم آية } الناقة لصالح عليه السلام كالعصا لموسى عليه السلام والحمار لعيسى والبراق لمحمد عليهما السلام، فإنّ لكل أحد من الأنبياء وغيرهم مركباً هو نفسه الحيوانية الحاملة لحقيقته التي هي النفس الإنسانية وتنتسب بالصفة الغالبة إلى ما يتّصف بتلك الصفة من الحيوانات فيطلق عليه اسمه، فمن كانت نفسه مطواعة منقادة من غاية اللين حمولة قوية متذللة فمركبه ناقة ونسبتها إلى الله لكونها مأمورة بأمره مختصة به في طاعته وقربه\n وما قيل: إنّ الماء قسم بينها وبينهم، لها شرب يوم ولهم شرب يوم، إشارة إلى أنّ مشربهم من القوة العاقلة العملية، ومشربها من العاقلة النظرية\n وما روي أنها يوم شربها كانت تتفحج فيحلب منها اللبن حتى ملؤوا أوانيهم، إشارة إلى أنّ نفسه تستخرج بالفكر من علومه الكلية الفطرية العلوم النافعة للناقصين من علوم الأخلاق والشرائع والآداب\n وخروجها من الجبل: ظهورها من بدن صالح عليه السلام\n هذا هو التأويل مع أن الإقرار بظاهرها واجب، فإن ظهور المعجزات وخوارق العادات حق لا ننكر شيئاً منها\n وما يؤيد التأويل تسوية النبي عليه الصلاة والسلام عاقرها بقاتل عليّ عليه السلام، حيث قال:\n\n \" يا علي، أتدري من أشقى الأوّلين؟ قال: الله ورسوله أعلم\n قال صلى الله عليه وسلم: \" عاقر ناقة صالح \" ، ثم قال صلى الله عليه وسلم: \" أتدري من أشقى الآخرين؟ \" ، قال: الله ورسوله أعلم\n قال صلى الله عليه وسلم: \" قاتِلك \" \" \n\nوروي أنه قال صلى الله عليه وسلم:\n\n \" من خَضَبَ هذا بهذا \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أرسلنا أيضاً { إِلَىٰ ثَمُودَ أَخَاهُمْ صَالِحاً قَالَ يَاقَوْمِ ٱعْبُدُواْ ٱللَّهَ مَا لَكُمْ مِّنْ إِلَـٰهٍ غَيْرُهُ قَدْ جَآءَتْكُمْ بَيِّنَةٌ } معجزة ظاهرة الدلالة على صدقي في دعواي نازلة { مِّن رَّبِّكُمْ هَـٰذِهِ نَاقَةُ ٱللَّهِ } أظهرها { لَكُمْ آيَةً } دالة على صدقي في قولي { فَذَرُوهَا تَأْكُلْ فِيۤ أَرْضِ ٱللَّهِ } حيث شاءت { وَ } عليكم أن { لاَ تَمَسُّوهَا بِسُوۤءٍ } وإن آذيتموها بسوء { فَيَأْخُذَكُمْ عَذَابٌ أَلِيمٌ } [الأعراف: 73] مؤلم مفظع مستأصل\n فعليكم أن تحفظوها حتى لا ينزل عليكم العذاب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { آية }: حال، والعامل فيها: الإشارة، و { بيوتًا }: حال من الجبال\n يقول الحقّ جلّ جلاله: { و } أرسلنا { إلى ثمود } قبيلة أخرى من العرب، سُموا باسم أبيهم الأكبر: ثمود بن غابر بن إرم بن سام، وقيل: سُموا به لقلة ما بهم من التثميد، وهو الماء القليل، وكانت مساكنهم الحجرَ، بين الحجاز والشام إلى وادي القرى، وقد دخلها رسول الله صلى الله عليه وسلم وأصحابه، فقال لهم صلى الله عليه وسلم:\n\n \" لاَ تدخُلُوا عَلَى هَؤُلاَءِ المُعَذَّبِينَ إلاَّ أن تَكُونُوا بَاكِينَ مخافة أن يُصيبَكم مِثلُ مَا أصَابَهُم \"\n \n\nأرسلنا إليهم { أخاهم صالحًا } ، وهو صالح بن عُبَيد بن أسف بن ماسَح بن عبيد بن حاذر بن ثمود\n وقال وهب بن منبه: بعث الله صالحًا حين راهق الحلم\n وقال الكواشي: أنه مات ابن ثمان وخمسين سنة، وأقام في قومه ينذرهم عشرين\n هـ\n { قال يا قوم اعبدوا ما لكم من إله غيره قد جاءتكم بينة من ربكم } معجزة ظاهرة الدلالة على صحة نبوتي، وهي: { هذه ناقة الله لكم آية } لأنها جاءت من عند الله بلا وسائط وأسباب، على ما سيأتي، { فذروها } أي: اتركوها، { تأكل في أرض الله } العشب، { ولا تمسوها بسوء } ، نهى عن المس، الذي هو مقدمة الإصابة بالسوء الجامع لأنواع الأذى مبالغةً في الأمر وإزاحة للعذر\n قاله البيضاوي\n { فيأخذكم } إن مستموها بسوء { عذاب أليم } ، وهو الهلاك بالصيحة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:64",
      "similarity": 0.8064800455841618
    },
    {
      "verse": "17:59",
      "similarity": 0.61814870624824
    },
    {
      "verse": "26:155",
      "similarity": 0.5908228493928394
    },
    {
      "verse": "91:13",
      "similarity": 0.5719015000090807
    },
    {
      "verse": "54:27",
      "similarity": 0.5295730576280321
    }
  ]
}