{
  "chapter": "الأعراف",
  "text": "والى ثمود اخاهم صلحا قال يقوم اعبدوا۟ الله ما لكم من اله غيره قد جاءتكم بينة من ربكم هذه ناقة الله لكم ءاية فذروها تاكل فى ارض الله ولا تمسوها بسوء فياخذكم عذاب اليم",
  "translations": [
    {
      "translation": "And to Thamud We sent their brother Salih, who said, 'My people, worship Allah! You have no other god than Him. A Clear Sign has come to you from your Lord. This is the She-Camel of Allah as a Sign for you. Leave her alone to eat on Allah's earth and do not harm her in any way or a painful punishment will afflict you.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent to Thamud their brother Saleh. \"O you people,\" said he, \"worship God, for you have no other god but He. Clear proof has come to you already from your Lord, and this she-camel of God is the token for you. Leave her free to graze upon God's earth, and do not molest her lest a grievous punishment should befall you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Thamud We sent forth their brother. Salih. He said to them: 'O my people! Serve Allah, you have no other god than Him. Truly there has come to you a clear proof from your Lord. This she-camel from Allah is a Divine portent for you. So leave her alone to pasture on Allah's earth, and touch her with no evil lest a painful chastisement should seize you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Salih to his brethren, the tribe of Thamud, who told them, \"Worship God your only Lord. Authoritative evidence has come to you from your Lord and this she-camel is the evidence for you from God. Let her graze in the land of God. Do not give her any trouble lest a painful torment will strike you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Saleh to the tribe of Thamud, from their own community; he said, “O my people! Worship Allah – you do not have any God except Him; indeed a clear proof has come to you from your Lord; this is Allah’s she-camel – a sign for you – so leave her free to feed in Allah’s earth, and do not touch her with evil intentions for a painful punishment will seize you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Thamud (people, We sent) their brother Salih. He said: \"O my people! Worship Allah! You have no other god but Him. Indeed there has come to you a clear sign from your Lord. This she-camel of Allah is a sign unto you; so you leave her to graze in Allah's earth, and touch her not with harm, lest a painful torment should seize you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Samood (We sent) their brother Salih. He said: O my people! serve Allah, you have no god other than Him; clear proof indeed has come to you from your Lord; this is (as) Allah's she-camel for you-- a sign, therefore leave her alone to pasture on Allah's earth, and do not touch her with any harm, otherwise painful chastisement will overtake you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Thamood their brother Salih; he said, 'O my people, serve God! You have no god other than He; there has now come to you a clear sign from your Lord -- this is the She-camel of God, to be a sign for you. Leave her that she may eat in God's earth, and do not touch her with evil, lest you be seized by a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to (the tribe of) Thamud (We sent) their brother Salih. He said: O my people! Serve Allah. Ye have no other Allah save Him. A wonder from your Lord hath come unto you. Lo! this is the camel of Allah, a token unto you; so let her feed in Allah's earth, and touch her not with hurt lest painful torment seize you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the Thamud We sent their brother Salih. He said, \"O my people, worship God; you have no other god but Him. A veritable proof has come to you from your Lord: this is God's she-camel, a sign for you, so let her feed in God's land and do not harm her in any way, or you will be overwhelmed by a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Thamud We sent their brother, Salih He said: my people! worship Allah, no god ye have but He; surely there hath come unto you an evidence from your Lord. Yonder is the she-camel of Allah: a sign unto you; so leave her alone, pasturing on Allah's earth, and touch her not with evil, lest there seize you a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to [the people of] Thamud [We sent] Salih, their brother. He said, ‘O my people, worship Allah! You have no other god besides Him. There has certainly come to you a manifest proof from your Lord. This she-camel of Allah is a sign for you. Let her alone to graze [freely] in Allah’s land, and do not cause her any harm, for then you shall be seized by a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the Thamud people (We sent) Salih, one of their own brethren: He said: \"O my people! worship Allah: ye have no other god but Him. Now hath come unto you a clear (Sign) from your Lord! This she-camel of Allah is a Sign unto you: So leave her to graze in Allah's earth, and let her come to no harm, or ye shall be seized with a grievous punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Thamud (people, We sent) their brother Salih (Saleh). He said: \"O my people! Worship Allah! You have no other Ilah (God) but Him. (La ilaha ill-Allah: none has the right to be worshipped but Allah). Indeed there has come to you a clear sign (the miracle of the coming out of a huge she-camel from the midst of a rock) from your Lord. This she-camel of Allah is a sign unto you; so you leave her to graze in Allah's earth, and touch her not with harm, lest a painful torment should seize you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Thamood We sent their brother Salih. He said: 'Worship Allah, my nation, for you have no god except He. A clear proof has come to you from your Lord. Here is the shecamel of Allah, a sign for you. Leave her to graze in the earth of Allah and do not touch her with evil, lest a painful punishment seizes you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Thamood, their brother Saleh. He said, “O my people! Worship God; you have no god other than Him. Clarification has come to you from your Lord. This she-camel of God is a sign for you. So leave her to graze on God’s earth, and do her no harm, lest a painful penalty seizes you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to the Thamud [We sent] their brother Salih. He said, \"O my people, worship Allah; you have no deity other than Him. There has come to you clear evidence from your Lord. This is the she-camel of Allah [sent] to you as a sign. So leave her to eat within Allah 's land and do not touch her with harm, lest there seize you a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:73] And, We sent, to Thamūd (Thamūda, read without declining [the noun], as denoting the tribe [of Thamūd] itself) their brother Sālih. He said, ‘O my people, worship God! You have no god other than Him. Truly there has come to you a clear proof, an illustration, from your Lord, of my truthfulness, this is the she-camel of God, a sign for you (lakum āyatan is a circumstantial qualifier operated by the import of the demonstrative noun [hādhihi, ‘this’]), they had asked him to make it come out of a [specific] rock which they had designated. So leave her to feed throughout God’s earth, and do not touch her with harm, either by hamstringing or beating her, lest you be seized by a painful chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالواو في قوله : { وإلى ثمود } مثلها في قوله : { وإلى عاد أخاهم هوداً } \\[ الأعراف : 65 \\] ، وكذلك القول في تفسيرها إلى قوله تعالى : { من إله غيره }.وثمود أمّة عظيمة من العرب البائدة وهم أبناء ثمود بن جَاثَر بجيم ومثلّثة كما في «القاموس» ابن إرَم بن سام بن نوح فيلتقون مع عاد في ( إرَم ) وكانت مساكنهم بالحِجْر بكسر الحاء وسكون الجيم بَين الحجاز والشّام ، وهو المكان المسمّى الآن مَدائِن صالح وسُمّي في حديث غزوة تبوك : حِجْرَ ثَمُودَ .وصالحٌ هو ابن عَبِيل بلام في آخره وبفتح العينْ ابن آسف بن ماشج أو شالخ بن عَبيل بن جاثر ويقال كاثرَ ابن ثمود . وفي بعض هذه الأسماء اختلاف في حروفها في كتب التاريخ وغيرها أحسبه من التّحريف وهي غير مضبوطة سوى عبيل فإنّه مضبوط في سَميه الذي هو جَد قبيلةٍ ، كما في «القاموس» .وثمودَ هنا ممنوع من الصّرف لأنّ المراد به القبيلة لا جدّها . وأسماء القبائل ممنوعة من الصّرف على اعتبار التّأنيث مع العلميّة وهو الغالب في القرآن ، وقد ورد في بعض آيات القرآن مصروفاً كما في قوله تعالى : { ألاَ إنّ ثموداً كفروا ربّهم } \\[ هود : 68 \\] على اعتبار الحيّ فينتفي موجب منع الصّرف لأنّ الاسم عربي .وقوله : { ما لكم من إله غيره } يدلّ على أنّ ثمود كانوا مشركين ، وقد صُرح بذلك في آيات سورة هود وغيرها . والظّاهر أنّهم عبدوا الأصنام التي عبدتها عاد لأنّ ثمود وعادا أبناء نسب واحد ، فيشبه أن تكون عقائدهم متماثلة . وقد قال المفسّرون : أنّ ثمود قامت بعد عاد فنمَتْ وعظمت واتسعت حضارتها ، وكانوا مُوحدين ، ولعلّهم اتّعظوا بما حلّ بعاد ، ثمّ طالت مدّتهم ونعم عيشهم فَعَتوا ونسُوا نعمة الله وعَبَدوا الأصنام فأرسل الله إليهم صالحاً رسولاً يدعوهم إلى التّوحيد فلم يتَّبعه إلاّ قليل منهم مُستضعفون ، وعصاه سادتهم وكبراؤهم ، وذكر في آية سورة هود أنّ قومه لم يغلظوا له القول كما أغلظت قوم نوح وقوم هود لرسولهم ، فقد : { قالوا يا صالح قد كنتَ فينا مرجُوّا قبل هذا أتَنْهَانا أن نعبد ما يَعْبُد آباؤُنا لفي شكّ ممَّا تدعُونا إليه مُريب } \\[ هود : 62 \\]. وتدلّ آيات القرآن وما فُسّرت به من القصص على أنّ صالحاً أجَّلهم مدّة للتّأمّل وجعل النّاقة لهم آية ، وأنّهم تَارَكُوها ولم يُهيجوها زمناً طويلاً .فقد أشعرت مجادلتهم صالحاً في أمر الدّين على أنّ التّعقّل في المجادلة أخذ يدبّ في نفوس البشر ، وأنّ غُلواءهم في المكابرة أخذت تقصر ، وأنّ قناة بأسهم ابتدأت تلين ، للفرق الواضح بين جواب قوم نوح وقوممِ هود ، وبين جواب قوم صالح .ومن أجل ذلك أمهلهم الله ومادّهم لينظروا ويفكّروا فيما يدعوهم إليه نبئهم ولِيَزِنوا أمرهم ، وجعل لهم الانكفاف عن مسّ النّاقة بسوء علامة على امتداد الإمهال؛ لأنّ انكفافهم ذلك علامة على أنّ نفوسهم لم تحْنق على رسولهم ، فرجاؤه إيمانهم مستمرّ ، والإمهال لهم أقطعُ لعذرهم ، وأنهض بالحجّه عليهم ، فلذلك أخّر الله العذاب عنهم إكراماً لنبيّهم الحريص على إيمانهم بقدر الطّاقة ، كما قال تعالى لنوح :{ أنّه لم يؤمن من قومك إلاّ من قد آمن فلا تبتئس بما كانوا يفعلون } \\[ هود : 36 \\].وجملة : { قد جاءتكم بينة من ربكم } إلخ ، هي من مقوللِ صالححٍ في وقت غير الوقت الذي ابتدأ فيه بالدّعوة ، لأنّه قد طوي هنا جواب قومه وسُؤَالُهم إياه آية كما دلّت عليه آيات سورة هود وسورة الشّعراء ، ففي سورة هود ( 61 ، 62) : { قال يا قوم اعبدوا الله ما لكم من إله غيره هو أنشأكم من الأرض واستعمركم فيها فاستغفروه ثمّ تُوبوا إليه إنّ ربّي قريب مجيب قالوا يا صالح قد كنتَ فِينا مرجُوّا قبل هذا } الآية . وفي سورة الشّعراء ( 153 155) : { قالوا إنّما أنت من المسحرين ما أنت إلاّ بشر مثلنا فأتتِ بآية إن كنت من الصّادقين قال هذه ناقة لها شرب } الآية .فجملة : قد جاءتكم بينة من ربكم } تعليل لجملة : { اعبدوا الله } ، أي اعبدوهُ وحده لأنّه جعل لكم آية على تصديقي فيما بلغتُ لكم ، وعلى انفراده بالتّصرف في المخلوقات .وقوله : { هذه ناقة الله } يقتضي أن النّاقة كانت حاضرة عند قوله : { قد جاءتكم بينة من ربكم } لأنّها نفس الآية .والبيّنة : الحجّة على صدق الدّعوى ، فهي ترادف الآية ، وقد عُبّر بها عن الآية في قوله تعالى : { لم يكن الذين كفروا من أهل الكتاب والمشركين مُنفكِّينَ حتى تأتيهم البيّنة } \\[ البينة : 1 \\].و { هذه } إشارة إلى النّاقة التي جعلها الله آية لصدق صالح ولما كانت النّاقة هي البيّنة كانت جملة : { هذه ناقة الله لكم آية } منزّلة من التي قبلها منزلة عطف البيان .وقوله : { آية } حال من اسم الإشارة في قوله : { هذه ناقة الله } لأنّ اسم الإشارة فيه معنى الفعل ، واقترانَه بحرف التّنبيه يقوي شبهه بالفعل ، فلذلك يكون عاملاً في الحال بالاتّفاق ، وتقدّم عند قوله : { ذلك نتلوه عليك من الآيات } في سورة آل عمران ( 58 ) ، وسنذكر قصّة في هذا عند تفسير قوله تعالى : { وهذا بعلي شيخاً } في سورة هود ( 72 ).وأكّدت جملة : قد جاءتكم بينة } ، وزادت على التّأكيد إفادةُ ما اقتضاه قوله { لكم } من التّخصيص وتثبيت أنّها آية ، وذلك معنى اللاّم ، أي هي آية مقنِعة لكم ومجعولة لأجلكم .فقوله : { لكم } ظرف مستقرّ في موضع الحال من { آية } ، وأصله صفة فلمّا قُدم على موصوفه صار حالاً ، وتقديمه للاهتمام بأنّها كافية لهم على ما فيهم من عناد .وإضافة ناقة إلى اسم الله تعالى تشريف لها لأنّ الله أمر بالإحسان إليها وعدم التّعرّض لها بسوء ، وعظَّم حرمتها ، كما يقال : الكعبة بيت الله ، أو لأنّها وُجدت بكيفية خارقة للعادة ، فلانتفاء ما الشانُ أن تضاف إليه من أسباب وجود أمثالها أضيفت إلى اسم الجلالة كما قيل : عيسى عليه السّلام كلمةُ الله .وأمّا إضافة { أرض } إلى اسم الجلالة فالمقصود منه أنّ للنّاقة حقّاً في الأكل من نبات الأرض لأنّ الأرض لله وتلك النّاقة من مخلوقاته فلها الحقّ في الانتفاع بما يصلح لانتفاعها .وقوله : { هذَا } مقدمةٌ لقوله : { ولا تمسوها بسوء } أي بسوء يعوّقها عن الرّعي إمّا بموت أو بجرح ، وإمّا لأنّهم لما كذّبوه وكذّبوا معجزته راموا منع النّاقة من الرّعي لتموت جوعا على معنى الإلجاء النّاشىء عن الجهالة .والأرض هنا مراد بها جنس الأرض كما تقتضيه الإضافة .وقد جعل الله سلامة تلك النّاقة علامة على سلامتهم من عذاب الاستيصال للحكمة التي قدّمتُها آنفاً ، وأن ما أوصى الله به في شأنها شبيه بالحَرَم ، وشبيه بحمى الملوك لما فيه من الدّلالة على تعظيم نفوس القوم لمن تُنسب إليه تلك الحُرمة ، ولذلك قال لهم صالح : { فَذروها تأكلْ في أرض الله ولا تمسّوها بسوء } لأنّهم إذا مسّها أحد بسوء ، عن رضى من البَقيّة ، فقد دلُّوا على أنّهم خلعوا حرمة الله تعالى وحنقوا على رسوله عليه السّلام .وجُزم { تأكل } على أنّ أصله جواب الأمر بتقدير : إنْ تذروها تأكُل ، فالمعنى على الرّفع والاستعمالُ على الجزم ، كما في قوله تعالى : { قل لعبادي الذين آمنوا يقيموا الصّلاة } \\[ إبراهيم : 31 \\] أي يقيمون وهو كثير في الكلام ، ويُشبه أن أصل جزم أمثاله في الكلام العربي على التّوهم لوجود فِعل الطّلب قبل فعللٍ صالح للجزم ، ولعلّ منه قوله تعالى : { وأذّنْ في النّاس بالحجّ يأتوك رجالا } \\[ الحج : 27 \\] وانتصب قوله : { فيأخُذكم } في جواب النّهي لِيُعتبر الجواب للمنهي عنه لأنّ حرف النّهي لا أثر له : أي إن تمسُّوها بسوءٍ يأخذْكم عذاب .وأنيط النّهي بالمس بالسّوء لأنّ المس يصدق على أقل اتّصال شيء بالجسم ، فكلّ ما ينالُها ممّا يراد منه السّوء فهو منهي عنه ، وذلك لأنّ الحيوان لا يسوؤه إلاّ ما فيه ألم لذاته ، لأنّه لا يفقه المعاني النّفسانيّه .والباء في قوله : { بسوء } للملابسة ، وهي في موضع الحال من فاعل تَمسوها أي بقصد سوء .\n\n",
      "translations": [
        {
          "translation": "(And to (the tribe of) Thamud) We sent (their brother) their prophet, it is also said that he was their brother in lineage but not in religion (Salih. He said: my people! Serve Allah) profess Allah's divine Oneness. (Ye have no other God save Him) save the One I am commanding you to believe in. (A wonder from your Lord hath come unto you) an exposition from your Lord has come to you. (Lo! this is the camel of Allah, a token unto you) a sign for Allah's message; (so let her feed in Allah's earth) eat its grass unhindered, (and touch 165 her not with hurt) hamstrung her not (lest painful torment seize you) after you hurt her.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ هذه نَاقة الله لكُم آية } الناقة لصالح عليه السلام كالعصا لموسى عليه السلام والحمار لعيسى والبراق لمحمد عليهما السلام\n فإنّ لكل أحد من الأنبياء وغيرهم مركباً هو نفسه الحيوانية الحاملة لحقيقته التي هي النفس الإنسانية وتنتسب بالصفة الغالبة إلى ما يتّصف بتلك الصفة من الحيوانات فيطلق عليه اسمه\n فمن كانت نفسه مطواعة منقادة من غاية اللين حمولة قوية متذللة فمركبه ناقة ونسبتها إلى الله لكونها مأمورة بأمره مختصة به في طاعته وقربه\n وما قيل: إنّ الماء قسم بينها وبينهم\n لها شرب يوم ولهم شرب يوم\n إشارة إلى أنّ مشربهم من القوة العاقلة العملية\n ومشربها من العاقلة النظرية\n وما روي أنها يوم شربها كانت تتفحج فيحلب منها اللبن حتى ملؤوا أوانيهم\n إشارة إلى أنّ نفسه تستخرج بالفكر من علومه الكلية الفطرية العلوم النافعة للناقصين من علوم الأخلاق والشرائع والآداب\n وخروجها من الجبل: ظهورها من بدن صالح عليه السلام\n هذا هو التأويل مع أن الإقرار بظاهرها واجب\n فإن ظهور المعجزات وخوارق العادات حق لا ننكر شيئاً منها\n وما يؤيد التأويل تسوية النبي عليه الصلاة والسلام عاقرها بقاتل عليّ عليه السلام\n حيث قال:\n \" يا علي\n أتدري من أشقى الأوّلين؟ قال: الله ورسوله أعلم\n قال صلى الله عليه وسلم: \" عاقر ناقة صالح \" \n ثم قال صلى الله عليه وسلم: \" أتدري من أشقى الآخرين؟ \" \n قال: الله ورسوله أعلم\n قال صلى الله عليه وسلم: \" قاتِلك \" \" \nوروي أنه قال صلى الله عليه وسلم:\n \" من خَضَبَ هذا بهذا \" \nوأشار بيده إلى لحيته ورأسه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أرسلنا أيضاً { إِلَىٰ ثَمُودَ أَخَاهُمْ صَالِحاً قَالَ يَاقَوْمِ ٱعْبُدُواْ ٱللَّهَ مَا لَكُمْ مِّنْ إِلَـٰهٍ غَيْرُهُ قَدْ جَآءَتْكُمْ بَيِّنَةٌ } معجزة ظاهرة الدلالة على صدقي في دعواي نازلة { مِّن رَّبِّكُمْ هَـٰذِهِ نَاقَةُ ٱللَّهِ } أظهرها { لَكُمْ آيَةً } دالة على صدقي في قولي { فَذَرُوهَا تَأْكُلْ فِيۤ أَرْضِ ٱللَّهِ } حيث شاءت { وَ } عليكم أن { لاَ تَمَسُّوهَا بِسُوۤءٍ } وإن آذيتموها بسوء { فَيَأْخُذَكُمْ عَذَابٌ أَلِيمٌ } [الأعراف: 73] مؤلم مفظع مستأصل\n فعليكم أن تحفظوها حتى لا ينزل عليكم العذاب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { آية }: حال\n والعامل فيها: الإشارة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:64",
      "similarity": 0.8064800455841618
    },
    {
      "verse": "17:59",
      "similarity": 0.61814870624824
    },
    {
      "verse": "26:155",
      "similarity": 0.5908228493928394
    },
    {
      "verse": "91:13",
      "similarity": 0.5719015000090807
    },
    {
      "verse": "54:27",
      "similarity": 0.5295730576280321
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007073.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007073.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:73.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}