{
  "chapter": "الأعراف",
  "text": "واذكروا۟ اذ جعلكم خلفاء منۢ بعد عاد وبواكم فى الارض تتخذون من سهولها قصورا وتنحتون الجبال بيوتا فاذكروا۟ ءالاء الله ولا تعثوا۟ فى الارض مفسدين",
  "translations": [
    {
      "translation": "Remember when He appointed you successors to 'Ad and settled you in the land. You built palaces on its plains and carved out houses from the mountains. Remember Allah's blessings and do not go about the earth, corrupting it.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember, how you were made leaders after the people of 'Ad, and were settled on the land so that you could construct on the plains palaces, and carve dwellings out of mountains. So think of the favours of God, and do not act with corruption in the land.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And call to mind when He made you successors after 'Ad and gave you power in the earth so that you took for yourselves palaces in its plains and hewed out dwellings in the mountains. Remember, then, the wondrous bounties of Allah and do not go about creating mischief in the land.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall (the time) when We settled you in the land as the heirs of the tribe of Ad and how you established mansions in the plains and carved homes out of the mountains. Give thanks to God for His favors and do not commit evil in the land.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And remember when He made you successors of A’ad and gave you a region in the earth, so you now build palaces in the soft plains and carve houses in rocks; therefore remember Allah’s favours and do not roam the earth spreading turmoil.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when He made you successors (generations) after `Ad and gave you habitations in the land, you build for yourselves palaces in plains, and carve out homes in the mountains. So remember the graces (bestowed upon you) from Allah, and do not go about making mischief on the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when He made you successors after Ad and settled you in the land-- you make mansions on its plains and hew out houses in the mountains-- remember therefore Allah's benefits and do not act corruptly in the land, making mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when He appointed you successors after Ad, and lodged you in the land, taking to yourselves castles of its plains, and hewing its mountains into houses. Remember God's bounties, and do not mischief in the earth, working corruption.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember how He made you viceroys after A'ad and gave you station in the earth. Ye choose castles in the plains and hew the mountains into dwellings. So remember (all) the bounties of Allah and do not evil, making mischief in the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when He made you successors to the 'Ad and settled you in the land. You built palaces on its plains and carved houses out of the mountains. Remember God's blessings and do not spread corruption in the land,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember what time He made you successors after 'Ad and inherited you in earth; ye take for yourselves palaces in the plains whereof and ye hew out the mountains as houses. Remember ye wherefore the benefits of Allah and commit not evil on the earth as corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when He made you successors after [the people of] ‘Ad, and settled you in the land: you build palaces in its plains, and hew houses out of the mountains. So remember Allah’s bounties, and do not act wickedly on the earth, causing corruption.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember how He made you inheritors after the 'Ad people and gave you habitations in the land: ye build for yourselves palaces and castles in (open) plains, and carve out homes in the mountains; so bring to remembrance the benefits (ye have received) from Allah, and refrain from evil and mischief on the earth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when He made you successors after 'Ad (people) and gave you habitations in the land, you build for yourselves palaces in plains, and carve out homes in the mountains. So remember the graces (bestowed upon you) from Allah, and do not go about making mischief on the earth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember, that He has made you the successor of 'Aad, and lodged you in the land. You have built palaces on its plains and hewed out houses in the mountains. Remember the favor of Allah and do not act mischievously in the earth, corrupting'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And remember how He made you successors after Aad, and settled you in the land. You make for yourselves mansions on its plains, and carve out dwellings in the mountains. So remember God’s benefits, and do not roam the earth corruptingly.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when He made you successors after the 'Aad and settled you in the land, [and] you take for yourselves palaces from its plains and carve from the mountains, homes. Then remember the favors of Allah and do not commit abuse on the earth, spreading corruption.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:74] And remember how He made you vicegerents, on earth, after ‘Ād, and gave you habitations in the land, making castles in its plains, in which you lodge during summer, and hewing its mountains into houses, in which you lodge during winter (buyūtan, ‘houses’, is in the accusative because of the implied circumstantial qualifier). So remember God’s bounties and do not be degenerate in the earth, seeking corruption’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And remember how He made you vicegerents after 'Aad) after the destruction of the people of 'Aad (and gave you station) He made you dwell (in the earth. Ye choose castles) for the summer (in the plains) using their mud (and hew the mountains into dwellings) for the winter. (So remember (all) the bounties of Allah) and believe in Him (and do not evil, making mischief in the earth) do not commit transgressions on the earth and call to other than Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱذْكُرُوۤاْ } أيها المتنعمون نعم الله عليكم، سيما { إِذْ جَعَلَكُمْ خُلَفَآءَ مِن بَعْدِ عَادٍ وَبَوَّأَكُمْ فِي ٱلأَرْضِ } مكنكم ووطنكم وكثركم في الأرض التي هم فيها حال { تَتَّخِذُونَ مِن سُهُولِهَا } لبناً وآجراً، وتبنون { قُصُوراً } عاليات تسكنون فيها مترفهين { وَتَنْحِتُونَ } تشقون بالمعاول { ٱلْجِبَالَ } المتحجرة { بُيُوتاً } لحفظ أمتعتكم { فَٱذْكُرُوۤاْ آلآءَ ٱللَّهِ } المترادفة المتوالية عليكم، وقوموا بشكرها؛ ليزيد عليكم سبحانه ويديم لكم { وَلاَ تَعْثَوْا } أي: لا تظهروا { فِي ٱلأَرْضِ مُفْسِدِينَ } [الأعراف: 74] بغرور الأموال والأولاد والأمتعة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { واذكروا إذ جعلكم خلفاء من بعد عاد وبوّأكم } أي: هيأ لكم القرار { في الأرض } أي: أرض الحجاز، { تتخذون من سهولها قصورًا } أي: تبنون مما انبسط منها قصورًا، فالسهل ضد الجبل، { وتنحتون الجبال بيوتًا } أي: تنجُرون بيوتًا من الجبال، وكانوا يسكنون القصور في الصيف والجبال في الشتاء\n { فاذكروا آلاء الله ولا تعثوا في الأرض مفسدين } بالمعاصي والكفر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:82",
      "similarity": 0.28871308040870547
    },
    {
      "verse": "37:95",
      "similarity": 0.24953099816999474
    },
    {
      "verse": "26:183",
      "similarity": 0.21274237904963836
    },
    {
      "verse": "29:36",
      "similarity": 0.2081390128517525
    },
    {
      "verse": "11:85",
      "similarity": 0.19519334393119583
    }
  ]
}