{
  "chapter": "الأعراف",
  "text": "قال الملا الذين استكبروا۟ من قومه للذين استضعفوا۟ لمن ءامن منهم اتعلمون ان صلحا مرسل من ربه قالوا۟ انا بما ارسل به مؤمنون",
  "translations": [
    {
      "translation": "The ruling circle of those of his people who were arrogant said to those who were oppressed - those among them who had iman - 'Do you know that Salih has been sent from his Lord?' They said, 'We have iman in what he has been sent with.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chiefs among the people who were arrogant towards the weaker ones among them who believed, asked: \"Do you really know that Saleh has been sent by his Lord?\" They said: \"Indeed we believe in the message he has brought.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The haughty elders of his people said to those believers who had been oppressed: 'Do you know that Salih is one sent forth with a message from his Lord?' They, replied: 'Surely we believe in the message with which he has been sent.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The proud ones among Salih's people asked his oppressed followers, \"Do you (really) know that Salih is a Messenger of his Lord?\" They replied, \"We have faith in the Message which he preaches\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The proud leaders of his people (mockingly) said to the weak Muslims, “Do you know that Saleh is (really) the Noble Messenger of his Lord?” They said, “We believe in whatever he has been sent with.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The leaders of those who were arrogant among his people said to those who were counted weak -- to such of them as believed: \"Know you that Salih is one sent from his Lord.\" They said: \"We indeed believe in that with which he has been sent.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chief of those who behaved proudly among his people said to those who were considered weak, to those who believed from among them: Do you know that Salih is sent by his Lord? They said: Surely we are believers in what he has been sent with\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said the Council of those of his people who waxed proud to those that were abased, to those of them who believed, 'Do you know that Salih is an Envoy from his Lord?' They said, 'In the Message he has been sent with we are believers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chieftains of his people, who were scornful, said unto those whom they despised, unto such of them as believed: Know ye that Salih is one sent from his Lord? They said: Lo! In that wherewith he hath been sent we are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but the arrogant leaders of his people said to the believers who were deemed weak, \"Do you know for certain that Salih is one sent from his Lord?\" They replied, \"We believe in the message which has been sent through him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chiefs of those who were stiff-necked amongst His people said unto those who were counted weak -unto such of them as believed: know ye that Salih is a sent one of his Lord? They said: verily we are believers in that wherewith he hath been sent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The elite of his people who were arrogant said to those who were oppressed—to those among them who had faith—‘Do you know that Salih has been sent by his Lord?’ They said, ‘We indeed believe in what he has been sent with.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The leaders of the arrogant party among his people said to those who were reckoned powerless - those among them who believed: \"know ye indeed that Salih is a messenger from his Lord?\" They said: \"We do indeed believe in the revelation which hath been sent through him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The leaders of those who were arrogant among his people said to those who were counted weak - to such of them as believed: \"Know you that Salih (Saleh) is one sent from his Lord.\" They said: \"We indeed believe in that with which he has been sent.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The proud assembly of his nation said to the weak? amongst them who believed: 'Do you really believe that Salih is sent from his Lord' They answered: 'We believe in that with which he was sent'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The elite of his people, who were arrogant, said to the common people who had believed, “Do you know that Saleh is sent from his Lord?” They said, “We are believers in what he was sent with.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said the eminent ones who were arrogant among his people to those who were oppressed - to those who believed among them, \"Do you [actually] know that Salih is sent from his Lord?\" They said, \"Indeed we, in that with which he was sent, are believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:75] Said the council of those of his people who waxed proud, [who] disdained belief in him, to those who were oppressed, to such of them as believed, that is, from among his people (li-man āmana minhum, ‘to such of them as believed’, is a substitution for the preceding clause [li’lladhīna istud‘ifū, ‘to those who were oppressed’], repeating the preposition [li-, ‘to’]): ‘Are you aware that Sālih has been sent, to you, from his Lord?’ They said, ‘Yes! Truly we believe in the Message with which he has been sent.’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The chieftains of his people, who were scornful) towards believing, (said unto those whom they despised) those who were overpowered, (unto such of them as believed) among the weak: (Know ye that Salih is one sent from his Lord) to you? (They said: Lo! In that wherewith he) Salih (has been sent we are believers) .\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما سمعوا منه ما سمعوا { قَالَ ٱلْمَلأُ ٱلَّذِينَ ٱسْتَكْبَرُواْ } عن الإيمان والاتباع له { مِن قَوْمِهِ لِلَّذِينَ ٱسْتُضْعِفُواْ } غياهم واستذلهم { لِمَنْ آمَنَ مِنْهُمْ } على سبيل التهكم والاستهزاء { أَتَعْلَمُونَ } يقيناً أيها الحمقى المصدقون له المؤمنون { أَنَّ صَالِحاً مُّرْسَلٌ مِّن رَّبِّهِ } الذي ادعى وحدته واستقلاله في الألوهية والربوبية { قَالُوۤاْ } أي: المؤمنون المخلصون من صفاء عقائدهم ونجاة طينتهم على سبيل التأكيد والمبالغة: { إِنَّا بِمَآ أُرْسِلَ } أي: بجميع ما أرسل { بِهِ } من عند ربه { مُؤْمِنُونَ } [الأعراف: 75] مصدقون موقنون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال الملأ الذين استكبروا من قومه } عن الإيمان\n { للذين استضعفوا } أي: للذين استضعفوهم واستذلوهم ـ أعني لمن آمن منهم ـ: { أتعلمون أن صالحًا مرسل من ربه }؟\n قالوه على وجه الاستهزاء\n { قالوا إنا بما أرسل به مؤمنون } \n لم يقولوا في الجواب: نعم تنبيهًا على أن إرساله أظهر من أن يشك فيه عاقل أو يخفى على ذي رأي\n وإنما الكلام فيمن آمن ومن كفر فلذلك قال: { قال الذين استكبروا إنا بالذي آمنتم به كافرون } على المقابلة\n ووضعوا { آمنتم به } موضع { أُرسل به } ردًا لما جعلوه معلومًا مسلمًا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:60",
      "similarity": 0.4981171464557785
    },
    {
      "verse": "43:46",
      "similarity": 0.47270003294293694
    },
    {
      "verse": "23:46",
      "similarity": 0.47148899372462466
    },
    {
      "verse": "33:68",
      "similarity": 0.44090001428141473
    },
    {
      "verse": "7:109",
      "similarity": 0.43146940583066445
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/7:75.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/7:75.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:75.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}