{
  "chapter": "الأعراف",
  "text": "فعقروا۟ الناقة وعتوا۟ عن امر ربهم وقالوا۟ يصلح ائتنا بما تعدنا ان كنت من المرسلين",
  "translations": [
    {
      "translation": "And they hamstrung the She-Camel, spurning their Lord's command, and said, 'Salih! Bring us what you have promised us if you are one of the Messengers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they hamstrung the she-camel and rebelled against the command of their Lord, and said: \"Bring, O Saleh, on us the affliction you promise, if you are one of the sent ones.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they hamstrung the she-camel, disdainfuliy disobeyed the commandment of their Lord, and said: 'O Salih! Bring upon us the scourge with which you threatened us if you are truly a Messenger [of Allah].'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They then slew the camel and rebelled against the orders of their Lord saying, \" Salih, if you are truly a Messenger, let that torment with which you have threatened us come to pass.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they hamstrung the she-camel and rebelled against the command of their Lord and said, “O Saleh! Bring upon us what you promise us, if you are a Noble Messenger.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they killed the she-camel and insolently defied the commandment of their Lord, and said: \"O Salih! Bring about your threats if you are indeed one of the Messengers (of Allah).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they slew the she-camel and revolted against their Lord's commandment, and they said: O Salih! bring us what you threatened us with, if you are one of the apostles.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they hamstrung the She-camel and turned in disdain from the commandment of their Lord, saying, 'O Salih, bring us that thou promisest us, if thou art an Envoy.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they hamstrung the she-camel, and they flouted the commandment of their Lord, and they said: O Salih! Bring upon us that thou threatenest if thou art indeed of those sent (from Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they hamstrung the she-camel, and insolently defied the commandment of their Lord, saying, \"O Salih! Bring upon us what you threaten us with if you are indeed a messenger.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they hamstrung the she camel and disdained the commandment of their Lord, and said: Salih! bring upon us that wherewith thou hast threatened us if thou art in sooth of the sent ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they hamstrung the She-camel and defied the command of their Lord, and they said, ‘O Salih, bring us what you threaten us with, if you are one of the apostles.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they ham-strung the she-camel, and insolently defied the order of their Lord, saying: \"O Salih! bring about thy threats, if thou art a messenger (of Allah)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they killed the she-camel and insolently defied the Commandment of their Lord, and said: \"O Salih (Saleh)! Bring about your threats if you are indeed one of the Messengers (of Allah).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Then) they hamstrung the shecamel and defied the order of their Lord, saying to Salih: 'Bring down that which you have promised us if you truly are one of the Messengers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they hamstrung the she-camel, and defied the command of their Lord, and said, “O Saleh, bring upon us what you threaten us with, if you are one of the messengers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they hamstrung the she-camel and were insolent toward the command of their Lord and said, \"O Salih, bring us what you promise us, if you should be of the messengers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:77] The she-camel was given the water one day and then, another; but they soon tired of this: So they   hamstrung the she-camel — Qudār hamstrung her by their command, killing her with a sword — and flouted the commandment of their Lord, and said, ‘O Sālih, bring upon us that which you promised us, in the way of chastisement for [our] killing it, if you are indeed a messenger’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So they hamstrung) killed (the she-camel, and they flouted the commandment of their Lord) they refused to accept the commands of their Lord with which Salih enjoined them, (and they said: Salih! Bring upon us that which thou threatenest) of torment (if thou art indeed of those sent (from Allah)) they said this out of mockery.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَعَتَوْاْ عَنْ أَمْرِ رَبِّهِمْ } معناه تَجبّروا وأَنكرُوا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And they were stern in refusing to believe in the matter of their Lord}, means that they were obstinate and denied it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما كفروا وكذبوا مصرين { فَعَقَرُواْ } أي: نحروا { ٱلنَّاقَةَ } التي هي آية الله عليهم ووديعة الله عندهم، قد أوصاهم سبحانه ألاَّ تمسوها بسوء، وهم قد هلكوها عناداً { وَعَتَوْاْ عَنْ أَمْرِ رَبِّهِمْ } استكباراً { وَقَالُواْ } لنبيه؛ بطراً واستهزاء: { يَاصَالِحُ } الكذاب المدعي { ٱئْتِنَا بِمَا تَعِدُنَآ } من العذاب { إِن كُنتَ } صدقت أنك { مِنَ ٱلْمُرْسَلِينَ } [الأعراف: 77] فلما فعلوا ما فعلوا وقالوا ما قالوا استحقوا ما وعدوا وأوعدوا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فعقروا الناقة } نحروها، أسند إلى جميعهم فعل بعضهم كما يأتي لأنه كان برضاهم، { وعتوا عن أمر ربهم } أي: استكبروا عن امتثال أمره، وهو ما بلغهم صالح بقوله: { فذروها تأكل في أرض الله ولا تمسوها بسوء } ، { وقالوا يا صالح ائتنا بما تعدنا إن كنت من المرسلين فأخذتهم الرجفة } أي: صيحة جبريل، { فأصبحوا في دارهم جاثمين } باركين على ركبهم، ميتين\n\n\nرُوِي: أنهم بعد عادٍ عمروا بلادهم وخلفوهم، وكثروا، وعُمروا أعمارًا طِوالاً لا تفي بها الأبنية، فنحتوا البيوت من الجبال، وكانوا في خِصب وسعة، فتعوا وأفسدوا في الأرض، وعبدوا الأصنام، فبعث الله إليهم صالحًا من أشرافهم فأنذرهم، فسألوه آية، فقال لهم: أيّ آية تريدون؟ فقالوا: اخرج معنا إلى عيدنا فتدعو إلهك وندعو آلهتنا، فمن استجيب له اتبع، فخرج معهم، فدعوا أصنامهم فلم تجبهم، ثم أشار سيدهم \" جندع بن عمرو \" إلى صخرة منفردة يقال لها: \" الكاثبة \" ، قال له: أخرج من هذه الصخرة ناقةً مخترجة جوفاء وبراء، فإن فعلت صدقناك، فأخذ عليهم صالح مواثيقهم: لئن فعلتُ ذلك لتؤمنن؟ قالوا: نعم، فصلى، ودعا ربه، فتمخضت الصخرة تَمَخَّضَ النتوج بولدها، فانصدعت عن ناقة عُشَرَاءَ، جوفاء وبراء كما وَصَفُوا، وهم ينظرون، ثم أنتجت ولدًا مثلها في العظم، فآمن به جندع في جماعة، ومنع الناس من الإيمان: ذُؤاب بن عمرو، والحباب صاحب أصنامهم، ورباب كاهنهم\n فمكثت الناقة مع ولدها ترعى الشجر، وترد الماء غِبًّا، فما ترفع رأسها من البئر حتى تشرب كل ما فيها، ثم تنفحج، فيحلبون ما شاؤوا حتى تمتلىء أوانيهم، فيشربون ويدخرون، وكانت تصيف بظهر الوادي فتهرب منها أنعامهم إلى بطنه، وتشتو ببطنه فتهرب مواشيهم إلى ظهره فشق ذلك عليهم، فزينت عقرها لهم \" عنيزة أم غنم \" وصدقة بنت المختار، فعقروها واقتسموا لحمها، وعاقرها: الأحمر، واسمه قدار \" استعان برجل آخر، فلما شربت أختبأ لها في جانب تل، فضربها صاحبه بالسهم، وعقرها قدار بسيفه، واقتسموا لحمها، فرقى ولدها جبلاً اسمه: قارة، فرغى ثلاثًا، ودخل صخرة أمه، فقال لهم صالح عليه السلام: أدركوا الفصيل، عسى أن يرفع عنكم العذاب، فلم يقدروا عليه حيث دخل الصخرة بعد رغائه، فقال لهم صالح عليه السلام: تصبح وجوهكم غدًا مصفرة، وبعد غد محمرة، واليوم الثالث مسودة، ويصبحكم العذاب، فلما رأوا العلامات طلبوا أن يقتلوه، فأنجاه الله إلى أرض فلسطين\n ولما كان ضحوة اليوم الرابع: تحنطوا وتكفنوا بالأنطاع، فأتتهم صيحة من السماء فتقطعت قلوبهم فهلكوا\n { فتولّى عنهم وقال يا قوم لقد أبلغتكم رسالة ربي ونصحتُ لكم ولكن لا تُحبون الناصحين } ، ظاهره: أن توليته عنهم بعد أن أبصرهم جاثمين ولعله خاطبهم به بعد هلاكهم، كما خاطب رسول الله صلى الله عليه وسلم أهل قليب بدر، وقال لهم:\n\n \" قد وَجَدنَا مَا وَعَدَنَا رَبُّنَا حَقًا، فَهَل وَجَدتُم مَا وَعَدَ رَبُّكُم حَقًا؟ \" \n\nأو ذَكَرَ ذلك على سبيل التحسّر عليهم\n قاله البيضاوي\n الإشارة: كل ما قصّ علينا الحقّ ـ جلّ جلاله ـ من قصص الأمم الماضية، فالمراد به: تخويف هذه الأمة المحمدية وزيادة في يقينهم، فالواجب على من أراد السلامة في الدارين أن يتمسك بما جاء به الرسول صلى الله عليه وسلم من غير زيادة ولا نقصان، ويتحرى في ذلك جهده يقصد بذلك رضا الله ورسوله\n\n\n[آل عمران:101]، ومن سلك الطريق المستقيم وصل إلى النعيم المقيم\n والله تعالى أعلم\n ثم ذكر قصة لوط عليه السلام، فقال: { وَلُوطاً إِذْ قَالَ لِقَوْمِهِ أَتَأْتُونَ ٱلْفَاحِشَةَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:8",
      "similarity": 0.5884345949387518
    },
    {
      "verse": "91:13",
      "similarity": 0.48759898766515375
    },
    {
      "verse": "26:155",
      "similarity": 0.485316773111204
    },
    {
      "verse": "54:27",
      "similarity": 0.46029389818692373
    },
    {
      "verse": "11:64",
      "similarity": 0.45485548391350844
    }
  ]
}