{
  "chapter": "الأعراف",
  "text": "فعقروا۟ الناقة وعتوا۟ عن امر ربهم وقالوا۟ يصلح ائتنا بما تعدنا ان كنت من المرسلين",
  "translations": [
    {
      "translation": "And they hamstrung the She-Camel, spurning their Lord's command, and said, 'Salih! Bring us what you have promised us if you are one of the Messengers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they hamstrung the she-camel and rebelled against the command of their Lord, and said: \"Bring, O Saleh, on us the affliction you promise, if you are one of the sent ones.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they hamstrung the she-camel, disdainfuliy disobeyed the commandment of their Lord, and said: 'O Salih! Bring upon us the scourge with which you threatened us if you are truly a Messenger [of Allah].'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They then slew the camel and rebelled against the orders of their Lord saying, \" Salih, if you are truly a Messenger, let that torment with which you have threatened us come to pass.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they hamstrung the she-camel and rebelled against the command of their Lord and said, “O Saleh! Bring upon us what you promise us, if you are a Noble Messenger.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they killed the she-camel and insolently defied the commandment of their Lord, and said: \"O Salih! Bring about your threats if you are indeed one of the Messengers (of Allah).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they slew the she-camel and revolted against their Lord's commandment, and they said: O Salih! bring us what you threatened us with, if you are one of the apostles.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they hamstrung the She-camel and turned in disdain from the commandment of their Lord, saying, 'O Salih, bring us that thou promisest us, if thou art an Envoy.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they hamstrung the she-camel, and they flouted the commandment of their Lord, and they said: O Salih! Bring upon us that thou threatenest if thou art indeed of those sent (from Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they hamstrung the she-camel, and insolently defied the commandment of their Lord, saying, \"O Salih! Bring upon us what you threaten us with if you are indeed a messenger.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they hamstrung the she camel and disdained the commandment of their Lord, and said: Salih! bring upon us that wherewith thou hast threatened us if thou art in sooth of the sent ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they hamstrung the She-camel and defied the command of their Lord, and they said, ‘O Salih, bring us what you threaten us with, if you are one of the apostles.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they ham-strung the she-camel, and insolently defied the order of their Lord, saying: \"O Salih! bring about thy threats, if thou art a messenger (of Allah)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they killed the she-camel and insolently defied the Commandment of their Lord, and said: \"O Salih (Saleh)! Bring about your threats if you are indeed one of the Messengers (of Allah).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Then) they hamstrung the shecamel and defied the order of their Lord, saying to Salih: 'Bring down that which you have promised us if you truly are one of the Messengers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they hamstrung the she-camel, and defied the command of their Lord, and said, “O Saleh, bring upon us what you threaten us with, if you are one of the messengers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they hamstrung the she-camel and were insolent toward the command of their Lord and said, \"O Salih, bring us what you promise us, if you should be of the messengers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:77] The she-camel was given the water one day and then, another; but they soon tired of this: So they   hamstrung the she-camel — Qudār hamstrung her by their command, killing her with a sword — and flouted the commandment of their Lord, and said, ‘O Sālih, bring upon us that which you promised us, in the way of chastisement for [our] killing it, if you are indeed a messenger’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالفاء للتّعقيب لِحكاية قول الذين استكبروا : { إنّا بالذي آمنتم به كافرون } \\[ الأعراف : 76 \\] ، أي قالوا ذلك فعقروا ، والتّعقيب في كلّ شيء بحسبه ، وذلك أنّهم حينَ قالوا ذلك كانوا قد صدعوا بالتّكذيب ، وصمّموا عليه ، وعجزوا عن المحاجة والاستدلال ، فعزموا على المصير إلى النّكاية والإغاظة لصالح عليه السّلام ومن آمنَ به ، ورسموا لابتداء عملهم أن يعتدوا على النّاقة التي جعلها صالح عليه السّلام لهم ، وأقامها بينَه وبينهم علامة موادعة ما داموا غير متعرّضين لها بسوء ، ومقصدهم من نيّتهم إهلاك النّاقة أن يزيلوا آية صالح عليه السّلام لئلا يزيد عدد المؤمنِين به ، لأنّ مشاهدة آية نبوءته سالمة بينهم تثير في نفوس كثير منهم الاستدلال على صدقه والاستئناس لذلك بسكوت كبرائهم وتقريرهم لها على مرعاها وشِربها ، ولأنّ في اعتدائهم عليها إيذاناً منهم بتحفزهم للإضرار بصالح عليه السّلام وبمن آمن به بعدَ ذلك وليُرُوا صالحاً عليه السّلام أنّهم مستخفّون بوعيده إذ قال لهم : { ولا تمسوها بسوء فيأخذكم عذاب أليم } \\[ الأعراف : 73 \\].والضّمير في قوله : { فعقروا } عائد إلى { الذين استكبروا } \\[ الأعراف : 75 \\] ، وقد أسند العقر إليهم وإن كان فاعله واحداً منهم لأنّه كان عن تمالىء ورضى من جميع الكبراء ، كما دلّ عليه قوله تعالى في سورة القمر ( 29) : { فَنادَوْا صاحبَهم فتعاطى فعَقر } وهذا كقول النّابغة في شأن بني حُنّ :وهم قتلوا الطاءيّ بالجوّ عنوة ... وإنَّما قتله واحد منهموذُكر في الأثر : أنّ الذي تولّى عقر النّاقة رجل من سادتهم اسمه ( قُدار ) بضم القاف ودال مهملة مخففة وراء في آخره ابن سالف . وفي حديث البخاري أنّ النبي ذكر في خطبته الذي عقر الناقة فقال : انبعثَ لها رجل عزيز عَارِم منيعٌ في رهطه مثل أبي زمْعة .والعَقْر : حقيقته الجرح البليغ ، قال امرؤ القيس :تقول وقد مال الغبيط بِنَا معا ... عَقَرْتَ بعيري يا امرأ القيس فانزلأي جرحتَه باحتكاك الغبيط في ظهره من مَيله إلى جهةٍ ، ويطلق العقر على قطع عضو الحيوان ، ومنه قولهم ، عَقَرَ حمارَ وحش ، أي ضربه بالرّمح فقطع منه عضواً ، وكانوا يعقرون البعير المرادَ نحرُه بقطع عضوٍ منه حتّى لا يستطيع الهروب عند النّحر ، فلذلك أطلق العقر عن النّحر على وجه الكناية قال امرؤ القيس :ويَومَ عَقَرْتُ للعذارَى مطيَّتي ... وما في هذه الآية كذلك .والعُتوّ تجاوز الحد في الكِبْر ، وتعديته ب ( مَن ) لتضمينه معنى الإعراض .وأمرُ ربّهم هو ما أمرهم به على لسان صالح عليه السّلام من قوله : { ولا تمسوها بسوء } \\[ الأعراف : 73 \\] فعُبّر عن النّهي بالأمر لأنّ النّهي عن الشّيء مقصود منه الأمر بفعل ضدّه ، ولذلك يقول علماء الأصول إنّ النّهي عن الشّيء يستلزم الأمرَ بضدّه الذي يحصل به تحقّق الكفّ عن المنهي عنه .وأرادوا : { بما تعدنا } العذاب الذي توعَّدهم به مجملاً .وجيء بالموصول للدّلالة على أنّهم لا يخشون شيئاً ممّا يريده من الوعيد المجمل . فالمراد بما تتوعدنا به وصيغت صلة الموصول من مادة الوعد لأنه أخف من مادة الوعد .وقد فرضوا كونَه من المرسلين بحرف ( إنْ ) الدّال على الشكّ في حصول الشّرط ، أي إن كنتَ من الرّسل عن الله فالمراد بالمرسلين من صَدق عليهم هذا اللّقب . وهؤلاء لجهلهم بحقيقة تصرّف الله تعالى وحكمته ، يحسبون أنّ تصرّفات الله كتصرّفات الخلق ، فإذا أرسل رسولاً ولم يصدّقْه المرسَل إليهم غَضِب الله واندَفع إلى إنزال العقاب إليهم ، ولا يعلمون أنّ الله يُمهل الظّالمين ثمّ يأخذهم متى شاء .\n\n",
      "translations": [
        {
          "translation": "(So they hamstrung) killed (the she-camel, and they flouted the commandment of their Lord) they refused to accept the commands of their Lord with which Salih enjoined them, (and they said: Salih! Bring upon us that which thou threatenest) of torment (if thou art indeed of those sent (from Allah)) they said this out of mockery.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَعَتَوْاْ عَنْ أَمْرِ رَبِّهِمْ } معناه تَجبّروا وأَنكرُوا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And they were stern in refusing to believe in the matter of their Lord}, means that they were obstinate and denied it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما كفروا وكذبوا مصرين { فَعَقَرُواْ } أي: نحروا { ٱلنَّاقَةَ } التي هي آية الله عليهم ووديعة الله عندهم\n قد أوصاهم سبحانه ألاَّ تمسوها بسوء\n وهم قد هلكوها عناداً { وَعَتَوْاْ عَنْ أَمْرِ رَبِّهِمْ } استكباراً { وَقَالُواْ } لنبيه\n بطراً واستهزاء: { يَاصَالِحُ } الكذاب المدعي { ٱئْتِنَا بِمَا تَعِدُنَآ } من العذاب { إِن كُنتَ } صدقت أنك { مِنَ ٱلْمُرْسَلِينَ } [الأعراف: 77] فلما فعلوا ما فعلوا وقالوا ما قالوا استحقوا ما وعدوا وأوعدوا\n\n\n{ فَأَخَذَتْهُمُ ٱلرَّجْفَةُ } الصيحة الهائلة { فَأَصْبَحُواْ فِي دَارِهِمْ جَاثِمِينَ } [الأعراف: 78] أي: صار كل منهم جائماً جامداً إلى حيث لا يتحرك منهم أحد\n\n\nروي أنهم كانوا في منازل عاد يعيشون فيها متنعمين مترفهين إلى أن كثرهم الله وعمرهم أعماراً طوالاً\n واقتضى طول أملهم أن نحتوا من الجبال بيوتاً يخزنون فيها أمتعتهم ويبنون قصوراً عاليات في السهول\n إذ كانوا في خصب وسعة\n فقروا على ما هم عليه وأفسدوا في الأرض بأنواع الفسادات\n وبالغوا في عبادة الأصنام\n فبعث الله إليهم صالحاً وهو من أشرافهم فدعاهم إلى الإيمان والتوحيد\n فسألوا منه آية فقال: آية آية تريدون؟\n\nقالوا: أخرج معنا إلى عيدنا\n فادع إلهك ندعو إلهنا فمن استجيب اتبع\n فخرج معهم فدعوا أصنامهم فلم يجابوا\n ثم اشار سيدهم جندع بن عمرو إلى صخرة منفردة يقال لها: الكائبة\n وقال لصالح: أخرج من هذه الصخرة ناقة جوفاء وبراء\n فإن خرجت صدقناك وآمنا بك\n\n\nفأخذ صالح عليه السلام عنهم المواثيق إن أخرجت لتؤمنوا له\n فعهدوا\n فصلى ودعا ربه فمتخضمت الصخرة تمخص النتوج بولدها\n فانصدعت عنه ناقة عشراء جوفاء وبراء كما وصفوا وهم ينظرون\n ثم أنتجت ولداً مثلها في الكبر\n فآمن له جندع في جماعة ومنع الباقين دوار بن عمرو\n والخباب صاحب أوثانهم\n ورباب بن صمغر كاهنهم\n فمكثت الناقة مع ولدها ترعى الشجر وترد الماء غباً\n فما ترفع رأسها من البئر حتى تشرب كل ما فيها\n ثم تتفجج فيحلبون ما شاءوا حتى تمتلئ أوانيهم ويدخرون\n وكانت تصيف في ظهر الوادي فتهرب منها مواشيهم\n وتشتو في بطنه فتهرب أنعامهم إلى ظهره\n فشق ذلك عليهم فهموا بقتلها\n وزينت لهم قتلها أم غنم وصدقتها بنت المختار\n فعقروها واقتسموا لحمها\n\nفرقى ولدها جبلاً اسمه قارة\n فرغا ثلاثاً\n فقال صال عليه السلام: أدركوا الفصيل عسى أن يرفع عنك العذاب\n فلم يقدروا عليه\n وانفتحت الصخرة بعد رغائه فدخلها\n\n\nفقال صالح عليه السلام: تصبح وجوهكم غداً مصفرة وبعد غد محمرةً\n واليوم الثالث مسودة\n ثم يصحبكم العذاب\n فلما رأوا العلامات هموا أن يقتلوه\n فأنجاه الله تعالى إلى أرض فلسطين\n ولما كانت ضحوة اليوم الرابع وتكفنوا بالأنطاع\n فأتتهم صيحة من السماء فتقعطت قلوبهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فعقروا الناقة } نحروها\n أسند إلى جميعهم فعل بعضهم كما يأتي لأنه كان برضاهم\n { وعتوا عن أمر ربهم } أي: استكبروا عن امتثال أمره\n وهو ما بلغهم صالح بقوله: { فذروها تأكل في أرض الله ولا تمسوها بسوء } \n { وقالوا يا صالح ائتنا بما تعدنا إن كنت من المرسلين فأخذتهم الرجفة } أي: صيحة جبريل\n { فأصبحوا في دارهم جاثمين } باركين على ركبهم\n ميتين\n\nرُوِي: أنهم بعد عادٍ عمروا بلادهم وخلفوهم\n وكثروا\n وعُمروا أعمارًا طِوالاً لا تفي بها الأبنية\n فنحتوا البيوت من الجبال\n وكانوا في خِصب وسعة\n فتعوا وأفسدوا في الأرض\n وعبدوا الأصنام\n فبعث الله إليهم صالحًا من أشرافهم فأنذرهم\n فسألوه آية\n فقال لهم: أيّ آية تريدون؟ فقالوا: اخرج معنا إلى عيدنا فتدعو إلهك وندعو آلهتنا\n فمن استجيب له اتبع\n فخرج معهم\n فدعوا أصنامهم فلم تجبهم\n ثم أشار سيدهم \" جندع بن عمرو \" إلى صخرة منفردة يقال لها: \" الكاثبة \" \n قال له: أخرج من هذه الصخرة ناقةً مخترجة جوفاء وبراء\n فإن فعلت صدقناك\n فأخذ عليهم صالح مواثيقهم: لئن فعلتُ ذلك لتؤمنن؟ قالوا: نعم\n فصلى\n ودعا ربه\n فتمخضت الصخرة تَمَخَّضَ النتوج بولدها\n فانصدعت عن ناقة عُشَرَاءَ\n جوفاء وبراء كما وَصَفُوا\n وهم ينظرون\n ثم أنتجت ولدًا مثلها في العظم\n فآمن به جندع في جماعة\n ومنع الناس من الإيمان: ذُؤاب بن عمرو\n والحباب صاحب أصنامهم\n ورباب كاهنهم\n فمكثت الناقة مع ولدها ترعى الشجر\n وترد الماء غِبًّا\n فما ترفع رأسها من البئر حتى تشرب كل ما فيها\n ثم تنفحج\n فيحلبون ما شاؤوا حتى تمتلىء أوانيهم\n فيشربون ويدخرون\n وكانت تصيف بظهر الوادي فتهرب منها أنعامهم إلى بطنه\n وتشتو ببطنه فتهرب مواشيهم إلى ظهره فشق ذلك عليهم\n فزينت عقرها لهم \" عنيزة أم غنم \" وصدقة بنت المختار\n فعقروها واقتسموا لحمها\n وعاقرها: الأحمر\n واسمه قدار \" استعان برجل آخر\n فلما شربت أختبأ لها في جانب تل\n فضربها صاحبه بالسهم\n وعقرها قدار بسيفه\n واقتسموا لحمها\n فرقى ولدها جبلاً اسمه: قارة\n فرغى ثلاثًا\n ودخل صخرة أمه\n فقال لهم صالح عليه السلام: أدركوا الفصيل\n عسى أن يرفع عنكم العذاب\n فلم يقدروا عليه حيث دخل الصخرة بعد رغائه\n فقال لهم صالح عليه السلام: تصبح وجوهكم غدًا مصفرة\n وبعد غد محمرة\n واليوم الثالث مسودة\n ويصبحكم العذاب\n فلما رأوا العلامات طلبوا أن يقتلوه\n فأنجاه الله إلى أرض فلسطين\n ولما كان ضحوة اليوم الرابع: تحنطوا وتكفنوا بالأنطاع\n فأتتهم صيحة من السماء فتقطعت قلوبهم فهلكوا\n { فتولّى عنهم وقال يا قوم لقد أبلغتكم رسالة ربي ونصحتُ لكم ولكن لا تُحبون الناصحين } \n ظاهره: أن توليته عنهم بعد أن أبصرهم جاثمين ولعله خاطبهم به بعد هلاكهم\n كما خاطب رسول الله صلى الله عليه وسلم أهل قليب بدر\n وقال لهم:\n \" قد وَجَدنَا مَا وَعَدَنَا رَبُّنَا حَقًا\n فَهَل وَجَدتُم مَا وَعَدَ رَبُّكُم حَقًا؟ \" \nأو ذَكَرَ ذلك على سبيل التحسّر عليهم\n قاله البيضاوي\n الإشارة: كل ما قصّ علينا الحقّ ـ جلّ جلاله ـ من قصص الأمم الماضية\n فالمراد به: تخويف هذه الأمة المحمدية وزيادة في يقينهم\n فالواجب على من أراد السلامة في الدارين أن يتمسك بما جاء به الرسول صلى الله عليه وسلم من غير زيادة ولا نقصان\n ويتحرى في ذلك جهده يقصد بذلك رضا الله ورسوله\n\n[آل عمران:101]\n ومن سلك الطريق المستقيم وصل إلى النعيم المقيم\n والله تعالى أعلم\n ثم ذكر قصة لوط عليه السلام\n فقال: { وَلُوطاً إِذْ قَالَ لِقَوْمِهِ أَتَأْتُونَ ٱلْفَاحِشَةَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:8",
      "similarity": 0.5884345949387518
    },
    {
      "verse": "91:13",
      "similarity": 0.48759898766515375
    },
    {
      "verse": "26:155",
      "similarity": 0.485316773111204
    },
    {
      "verse": "54:27",
      "similarity": 0.46029389818692373
    },
    {
      "verse": "11:64",
      "similarity": 0.45485548391350844
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007077.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007077.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:77.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}