{
  "chapter": "الأعراف",
  "text": "فاخذتهم الرجفة فاصبحوا۟ فى دارهم جثمين",
  "translations": [
    {
      "translation": "So the earthquake seized them and morning found them lying flattened in their homes.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they were seized by an earthquake, and lay overturned on the ground in their homes in the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon a shocking catastrophe seized them, so that they lay prostrate in their dwellings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Suddenly, an earthquake jolted them and they were left motionless in their homes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore the earthquake seized them, so at morning they remained lying flattened in their homes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the earthquake seized them, and they lay (dead), prostrate in their homes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the earthquake overtook them, so they became motionless bodies in their abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the earthquake seized them, and morning found them in their habitation fallen prostrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the earthquake seized them, and morning found them prostrate in their dwelling-place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the earthquake overwhelmed them, and morning found them prostrate in their dwelling places.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whereupon an earthquake seized them, so that they lay prone in their dwellings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon the earthquake seized them, and they lay lifeless prostrate in their homes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the earthquake took them unawares, and they lay prostrate in their homes in the morning!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the earthquake seized them, and they lay (dead), prostrate in their homes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon the earthquake seized them, at morning in their dwellings they were crouched, dead.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whereupon the quake overtook them, and they became lifeless bodies in their homes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the earthquake seized them, and they became within their home [corpses] fallen prone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:78] So the Trembling, a violent earthquake and a cry from the heaven, seized them, and they lay lifeless prostrate in their habitations, keeled over their knees, dead.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So the earthquake) and the loud noise announcing their torment (seized them, and morning found them prostrate) dead without a movement (in their dwelling-place) in their town.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { جَاثِمِينَ } معناهُ بعضُهم عَلَى بَعضٍ جثُوم\n والجَاثمُ: المَيتُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {They are those who are} [i.e., the people of Paradise], some of them on top of others, [i.e., in different levels], dead.\n\n\nAnd the corpse: the deceased",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَأَخَذَتْهُمُ ٱلرَّجْفَةُ } الصيحة الهائلة { فَأَصْبَحُواْ فِي دَارِهِمْ جَاثِمِينَ } [الأعراف: 78] أي: صار كل منهم جائماً جامداً إلى حيث لا يتحرك منهم أحد\n\n\n\n\nروي أنهم كانوا في منازل عاد يعيشون فيها متنعمين مترفهين إلى أن كثرهم الله وعمرهم أعماراً طوالاً، واقتضى طول أملهم أن نحتوا من الجبال بيوتاً يخزنون فيها أمتعتهم ويبنون قصوراً عاليات في السهول؛ إذ كانوا في خصب وسعة، فقروا على ما هم عليه وأفسدوا في الأرض بأنواع الفسادات، وبالغوا في عبادة الأصنام، فبعث الله إليهم صالحاً وهو من أشرافهم فدعاهم إلى الإيمان والتوحيد، فسألوا منه آية فقال: آية آية تريدون؟\n\n\n\nقالوا: أخرج معنا إلى عيدنا، فادع إلهك ندعو إلهنا فمن استجيب اتبع، فخرج معهم فدعوا أصنامهم فلم يجابوا، ثم اشار سيدهم جندع بن عمرو إلى صخرة منفردة يقال لها: الكائبة، وقال لصالح: أخرج من هذه الصخرة ناقة جوفاء وبراء، فإن خرجت صدقناك وآمنا بك\n\n\n\n\nفأخذ صالح عليه السلام عنهم المواثيق إن أخرجت لتؤمنوا له، فعهدوا، فصلى ودعا ربه فمتخضمت الصخرة تمخص النتوج بولدها، فانصدعت عنه ناقة عشراء جوفاء وبراء كما وصفوا وهم ينظرون، ثم أنتجت ولداً مثلها في الكبر، فآمن له جندع في جماعة ومنع الباقين دوار بن عمرو، والخباب صاحب أوثانهم، ورباب بن صمغر كاهنهم، فمكثت الناقة مع ولدها ترعى الشجر وترد الماء غباً، فما ترفع رأسها من البئر حتى تشرب كل ما فيها، ثم تتفجج فيحلبون ما شاءوا حتى تمتلئ أوانيهم ويدخرون، وكانت تصيف في ظهر الوادي فتهرب منها مواشيهم، وتشتو في بطنه فتهرب أنعامهم إلى ظهره، فشق ذلك عليهم فهموا بقتلها، وزينت لهم قتلها أم غنم وصدقتها بنت المختار، فعقروها واقتسموا لحمها\n\n\nفرقى ولدها جبلاً اسمه قارة، فرغا ثلاثاً، فقال صال عليه السلام: أدركوا الفصيل عسى أن يرفع عنك العذاب، فلم يقدروا عليه، وانفتحت الصخرة بعد رغائه فدخلها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:91",
      "similarity": 1.0000000000000002
    },
    {
      "verse": "29:37",
      "similarity": 0.9950428171854234
    },
    {
      "verse": "11:67",
      "similarity": 0.6883552107107908
    },
    {
      "verse": "11:94",
      "similarity": 0.5762586306738982
    },
    {
      "verse": "79:6",
      "similarity": 0.5340509891864611
    }
  ]
}