{
  "chapter": "الأعراف",
  "text": "والوزن يومئذ الحق فمن ثقلت موزينه فاو۟لئك هم المفلحون",
  "translations": [
    {
      "translation": "The weighing that Day will be the truth. As for those whose scales are heavy, they are the successful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the weighing will be just on that Day. Then those whose (deeds) are heavier in the balance will find fulfilment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The weighing on that Day will be the true weighing: those whose scales are heavy will prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Everyone's deeds) will certainly be weighed (and evaluated) on the Day of Judgment. Those whose good deeds weigh heavier than their bad deeds will have everlasting happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on that Day, the weighing will truly be done; so those whose scales prove heavy are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the weighing on that Day will be the true (weighing). So, as for those whose scale (of good deeds) will be heavy, they will be the successful (by entering Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the measuring out on that day will be just; then as for him whose measure (of good deeds) is heavy, those are they who shall be successful;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The weighing that day is true; he whose scales are heavy -- they are the prosperers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The weighing on that day is the true (weighing). As for those whose scale is heavy, they are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truth alone will be of weight that Day. Those whose scales are heavy shall be successful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the weighing on that Day is certain, then whosesoever balances will be heavy, those! they shall fare well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The weighing [of deeds] on that Day is a truth. As for those whose deeds weigh heavy in the scales—it is they who are the felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The balance that day will be true (to nicety): those whose scale (of good) will be heavy, will prosper:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the weighing on that day (Day of Resurrection) will be the true (weighing). So as for those whose scale (of good deeds) will be heavy, they will be the successful (by entering Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, the weighing is true. He whose scales are heavy those are the prosperers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The scales on that Day will be just. Those whose weights are heavy—it is they who are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the weighing [of deeds] that Day will be the truth. So those whose scales are heavy - it is they who will be the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:8] The weighing, of deeds or of the scrolls of these [deeds] shall be — in a balance that has a tongue and two palms [as scales], as reported in a hadīth — on that day, that is, on the day of the questioning mentioned, namely, the Day of Resurrection, the true [weighing], the fair [weighing] (al-haqq, ‘the true’, is an adjectival qualification of al-wazn, ‘the weighing’). As for those whose scales are heavy, with good deeds, they are the successful, the triumphant.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The weighing) of works (on that day) the Day of Judgement (is the true) just ((weighing). As for those whose scale is heavy) with good deeds, (they are the successful) the ones who escape Allah's wrath and torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱلْوَزْنُ يَوْمَئِذٍ ٱلْحَقُّ } معناهُ العَدلُ\n\n\n\n\nوقوله تعالى: { فَمَن ثَقُلَتْ مَوَازِينُهُ } معناهُ حَسَنَاتُهُ { وَمَنْ خَفَّتْ مَوَازِينُهُ } معناهُ سَيئاتُهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the weight [of] that day is the truth.\n\n\nAnd His saying, {those whose scales are heavy [with good deeds]} means his good deeds, {and those whose scales are light [with bad deeds]} means his bad deeds.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلْوَزْنُ } الموضوع لانتقاد أعمال العباد { يَوْمَئِذٍ } أي: وقت كشف السرائر وانكشاف الحجب { ٱلْحَقُّ } أي: الثابت المحقق؛ لئلا يبقى للعصاة مجادلة مع الله { فَمَن ثَقُلَتْ مَوَازِينُهُ } بكثرة الطاعات ووفور الخيرات والمبرات { فَأُوْلَـٰئِكَ } السعداء المبرورون { هُمُ ٱلْمُفْلِحُونَ } [الأعراف: 8] الفائزون بالمثوبة العظمى والمرتبة العليا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { الوزن }: مبتدأ، و { يومئذٍ }: خبره، و { الحق }: صفته، أي: الوزن العدل حاصل يومئذٍ\n يقول الحقّ جلّ جلاله: { والوزن } أي: وزن الأعمال، على نعت الحق والعدل، حاصل يوم القيامة، حين يسأل الرسل والمُرسل إليهم\n والجمهور على أن صحائف الأعمال تُوزن بميزان له لسان وكفتان، ينظر إليه الخلائق إظهارًا للمعدلة وقطعًا للمعذرة، كما يسألهم عن أعمالهم، فتعترف بها ألسنتهم، وتشهد بها جوارحهم، ويؤيده ما رُوِي:\n\n \" أن الرجل يُؤتى به إلى الميزان، فيُنشَر عليه تسعَةٌ وتِسعُونَ سِجلاًّ، كُلُّ سِجِلًّ مَد البَصَرِ، فَتُخرَحُ لَهُ بطَاقة فِيهَا كَلِمةُ الشهَادِة، فَتُوضَعُ السِّجِلاَّتُ فِي كِفةٍ، والبطاقة في كفّة، فَتثقُل البطاقةُ، وتَطِيشُ السِّجلاَّتُ \"\n \n\nوقيل: توزن الأشخاص لما رُوِي عنه صلى الله عليه وسلم أنه قال:\n\n \" إنّهُ ليأتِي العَظِيمُ السَّمِينُ يَومَ القِيَامَة لا يَزنُ عندَ اللهِ تَعالى جَنَاحَ بَعُوضَةٍ \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:102",
      "similarity": 0.9586280384951078
    },
    {
      "verse": "101:6",
      "similarity": 0.7574934354130993
    },
    {
      "verse": "55:8",
      "similarity": 0.48049428757935775
    },
    {
      "verse": "99:2",
      "similarity": 0.4564690865261356
    },
    {
      "verse": "73:5",
      "similarity": 0.428376951839885
    }
  ]
}