{
  "chapter": "الأعراف",
  "text": "انكم لتاتون الرجال شهوة من دون النساء بل انتم قوم مسرفون",
  "translations": [
    {
      "translation": "You come with lust to men instead of women. You are indeed a depraved people.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In preference to women you satisfy your lust with men. Indeed you are a people who are guilty of excess.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You approach men lustfully in place of women. You are a people who exceed all bounds.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You engage in lustful activities with people instead of women. You have become transgressing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“You lustfully go towards men, instead of women! In fact, you have transgressed the limits.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, you practice your lusts on men instead of women. Nay, but you are a people transgressing beyond bounds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most surely you come to males in lust besides females; nay you are an extravagant people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See, you approach men lustfully instead of women; no, you are a people that do exceed.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! ye come with lust unto men instead of women. Nay, but ye are wanton folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You lust after men rather than women! You transgress all bounds!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily ye go in lustfully unto men instead of women! Aye! ye are a people extravagant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed you come to men with desire instead of women! Indeed, you are a profligate lot.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For ye practise your lusts on men in preference to women: ye are indeed a people transgressing beyond bounds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, you practise your lusts on men instead of women. Nay, but you are a people transgressing beyond bounds (by committing great sins).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You approach men lustfully instead of women. Truly, you are a nation who exceed (in sin)'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“You lust after men rather than women. You are an excessive people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, you approach men with desire, instead of women. Rather, you are a transgressing people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:81] Do you (read a-innakum, pronouncing both hamzas, or by not pronouncing the second one, but in both cases inserting an alif between the two; a variant reading has innakum, ‘indeed you … ’) come lustfully to men instead of women? Nay, you are a wanton folk’, transgressing [the bounds], [going] from what is lawful to what is unlawful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوجملة : { إنكم لتأتون الرجال } مبيّنة لجملة { أتأتون الفاحشة } ، والتّأكيد بإنّ واللاّم كناية عن التّوبيخ لأنّه مبني على تنزيلهم منزلة من ينكر ذلك لكونهم مسترسلون عليه غير سامعين لنهي النّاهي . والإتيان كناية عن عمل الفاحشة .وقرأ نافع ، والكسائي ، وحفص عن عاصم ، وأبو جعفر : { إنكم } بهمزة واحدة مكسورة بصيغة الخبر ، فالبيان راجع إلى الشيء المنكَر بهمزة الإنكار في { أتأتون الفاحشة } ، وبه يعرف بيان الإنكار ، ويجوز اعتباره خبراً مستعملاً في التّوبيخ ، ويجوز تقدير همزة استفهام حذفت للتّخفيف ولدلالة ما قبلها عليها . وقرأه البقيّة : { أإنّكم } بهمزتين على صِيغة الاستفهام فالبيان للإنكار ، وبه يعرف بيان المنكرَ ، فالقراءتان مستويتان .والشّهوة : الرّغبة في تحصيل شيء مرغوب ، وهي مصدر شَهِي كرضى ، جاء على صيغة الفَعْلة وليس مراداً به المرة .وانتصب { شهوة } على المفعول لأجله . والمقصود من هذا المفعول تفظيع الفاحشة وفاعِليها بأنّهم يشتهون ما هو حقيق بأن يُكره ويستفظع .وقوله : { من دون النساء } زيادة في التّفظيع وقطععِ للعذر في فعل هذه الفاحشة ، وليس قيداً للإنكار ، فليس إتيان الرّجال مع إتيان النّساء بأقلّ من الآخر فظاعة ، ولكن المراد أنّ إتيان الرّجال كلّه واقع في حالة من حقّها إتيان النّساء ، كما قال في الآية الأخرى : { وتذَرون ما خلق لكم ربّكم من أزواجكم } \\[ الشعراء : 166 \\].و { بل } للاضراب الانتقالي ، للانتقال من غرض الإنكار إلى غرض الذمّ والتّحقير والتّنبيه إلى حقيقة حالهم .والإسراف مجاوزة العمل مقدار أمثاله في نوعه ، أي المُسرفون في الباطل والجرم ، وقد تقدّم عند قوله تعالى : { ولا تأكلوها إسرافاً } في سورة النّساء ( 6 ) وعند قوله تعالى : { ولا تسرفوا إنه لا يحبّ المسرفين } في سورة الأنعام ( 141 ).ووصفُهم بالإسراف بطريق الجملة الاسميّة الدّالة على الثّبات ، أي أنتم قوم تمكَّن منهم الإسراف في الشّهوات فلذلك اشتهوا شهوة غريبة لما سئموا الشهوات المعتادة . وهذه شنشنة الاسترسال في الشّهوات حتّى يصبح المرء لا يشفي شهوته شيء ، ونحوه قوله عنهم في آية أخرى : { بل أنتم قوم عادون } \\[ الشعراء : 166 \\].ووجه تسمية هذا الفعل الشّنيع فاحشة وإسرافاً أنّه يشتمل على مفاسد كثيرة : منها استعمال الشّهوة الحيوانية المغروزة في غير ما غرزت عليه ، لأنّ الله خلق في الإنسان الشّهوة الحيوانيّة لإرادة بقاء النّوع بقانون التّناسل ، حتّى يكون الدّاعي إليه قهري ينسَاق إليه الإنسان بطبعه ، فقضاء تلك الشّهوة في غير الغرض الذي وضعها الله لأجله اعتداء على الفطرة وعلى النّوع ، ولأنّه يغير خصوصية الرُجلة بالنّسبة إلى المفعول به إذ يصير في غير المنزلة التي وضعه الله فيها بخلقته ، ولأنّ فيه امتهاناً محضاً للمفعول به إذ يُجعل آلة لقضاء شهوة غيره على خلاف ما وضع الله في نظام الذّكورة والأنوثة من قضاء الشّهوتين معاً ، ولأنّه مفض إلى قطع النّسل أو تقليله ، ولأنّ ذلك الفعل يجلب أضراراً للفاعل والمفعول بسبب استعمال محليّن في غير ما خلقا له .وحدثت هذه الفاحشة بين المسلمين في خلافة أبي بكر من رجل يسمّى الفجَاءة ، كتب فيه خالد بن الوليد إلى أبي بكر الصّدّيق أنّه عمل عمل قوم لوط وإذ لم يُحفظ عن النّبيء صلى الله عليه وسلم فيها حدّ معروف جمع أبو بكر أصحاب النبي صلى الله عليه وسلم واستشارهم فيه ، فقال عليّ : أرى أن يحرق بالنّار ، فاجتمع رأي الصّحابة على ذلك فكتب أبو بكر إلى خالد بن الوليد أن يحرقه فأحرقه ، وكذلك قضى ابن الزّبير في جماعة عملوا الفاحشة في زمانه ، وهشام بن الوليد ، وخالد القَسري بالعراق ، ولعلّه قيَاس على أنّ الله أمْطر عليهم ناراً كما سيأتي .وقال مالك : يرجم الفاعل والمفعولُ به ، إذا أطاع الفاعلَ وكانا بالغين ، رَجْمَ الزّاني المحصن . سواء أُحصنا أم لم يُحصنا ، وقاس عقوبتهم على عقوبة الله لقوم لوط إذ أمطر عليهم حجارة ، والذي يؤخذ من مذهب مالك أنّه يجوز القياس على ما فعله الله تعالى في الدّنيا . وروي أنّه أخذ في زمان ابن الزّبير أربعةٌ عمِلوا عمل قوم لوط ، وقد أُحصنوا . فأمر بهم فأخرجوا من الحرم فرجموا بالحجارة حتّى ماتوا ، وعنده ابنُ عمر وابنُ عبّاس فلم ينكرا عليه .وقال أبو حنيفة : يعزّر فاعله ولا يبلغ التّعزير حدّ الزّنى ، كذا عزا إليه القرطبي ، والذي في كتب الحنفيّة أنّ أبا حنيفة يرى فيه التّعزير إلاّ إذا تكرّر منه فيقتل ، وقال أبو يوسف ومحمّد : فيه حدّ الزّنى ، فإذا اعتاد ذلك ففيه التّعزير بالإحراق ، أو يهدم عليه جدار ، أو ينكس من مكان مرتفع ويتبع بالأحجار ، أو يسجن حتّى يموت أو يتوب . وذكر الغزنوي في «الحاوي» أنّ الأصح عن أبي يوسف ومحمّد التّعزير بالجلد ( أي دون تفصيل بين الاعتياد وغيره ) وسياق كلامهم التّسوية في العقوبة بين الفاعل والمفعول به .وقال الشّافعي : يحدّ حدّ الزّاني : فإن كان محصناً فحدّ المحصن ، وإن كان غير محصن فحدّ غير المحصن . كذا حكاه القرطبي . وقال ابن هبيرة الحنبلي ، في كتاب «اختلاف الأيمّة» : إنّ للشّافعي قولين : أحدهما هذا ، والآخر أنّه يرجم بكلّ حال ، ولم يذكر له ترجيحاً ، وقال الغزالي ، في «الوجيز» : «للواط يوجب قتل الفاعل والمفعول على قول ، والرّجمَ بكلّ حال على قول ، والتّعزيرَ على قول ، وهو كالزّني على قول» وهذا كلام غير محرّر .وفي كتاب «اختلاف الأيمّة» لابن هبيرة الحنبلي : أن أظهر الرّوايتين عن أحمد أنّ في اللّواط الرّجم بكلّ حال ، أي محصناً كان أو غير محصن ، وفي رواية عنه أنّه كالزّنى ، وقال ابن حزم ، في «المحلى» : إنّ مذهب داود وجميعَ أصحابه أنّ اللّوطي يجلد دون الحد ، ولم يصرّح ، فيما نقلوا عن أبي حنيفة وصاحبيْه ، ولا عن أحد ، ولا الشّافعي بمساواة الفاعل والمفعول به في الحكم إلاّ عند مالك ، ويؤخذ من حكاية ابن حزم في «المحلّى» : أنّ أصحاب المذاهب المختلفة في تعزير هذه الفاحشة لم يفرّقوا بين الفاعل والمفعول إلاّ قولاً شاذا لأحَدِ فقهاء الشّافعيّة رأى أنّ المفعول أغلظ عقوبة من الفاعل .وروى أبو داود والتّرمذي ، عن عكرمة عن ابن عبّاس ، والتّرمذيُّ عن أبي هريرة ، وقال في إسناده ، مَقال عن النّبيء صلى الله عليه وسلم أنّه قال : \" مَن وجدتموه يعمل عمل قوم لوط فاقتلوا الفاعل والمفعول به \" وهو حديث غريب ( لم يرو عن غير عكرمة عن ابن عبّاس ) وقد علمت استشارة أبي بكر في هذه الجريمة ، ولو كان فيها سند صحيح لظهر يومئذ .\n\n",
      "translations": [
        {
          "translation": "(Lo! ye come with lust) you find more lust (unto men) in men's behinds (instead of women) instead of the vaginas of women. (Nay, but ye, are wanton folk) in idolatry; you transgress from the lawful to that which is prohibited.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّكُمْ } أيها المتجاوزون عن حدود الله ومقتضى حكمته { لَتَأْتُونَ ٱلرِّجَالَ شَهْوَةً } أي: حال كونكم متلذذين مشتهين لإتيانهم { مِّن دُونِ ٱلنِّسَآءِ } مع أن الحكمة تقتضي إتيانهن\n وما هو من جهلكم بقبحها وخباثتها { بَلْ أَنْتُمْ قَوْمٌ مُّسْرِفُونَ } [الأعراف: 81] في الفساد والخروج عن مقتضى الحكمة الإلهية بمتابعة أهويتكم الباطلة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { شهوة }: مفعول له\n أو مصدر في موضع الحال\n يقول الحقّ جلّ جلاله: { و } أرسلنا { لوطًا إذ قال لقومه } \n واعظًا لهم: { أتأتون الفاحشةَ } أي: اللواط توبيخًا وتقريعًا على تلك الفعلة المتناهية في القبح\n { ما سبقكُم بها من أحدٍ من العالمين } أي: ما فعلها أحد قبلكم\n وبخهم على أمرين: إتيان الفاحشة\n واختراعها أولاً\n ثم قال لهم: { إنكم لتأتون الرجال شهوة من دون النساء } \n وصفهم بالشهوة البهيمية\n وفيه تنبيه على أن العاقل ينبغي أن يكون الداعي له إلى المباشرة: طلب الولد وإبقاء النوع لا قضاء الوطر\n { بل أنتم قومٌ مسرفون } أي: عادتكم السرف في كل شيء\n حتى تجاوزتم ما أحل الله لكم من النساء إلى ما حرم عليكم من إيتان الذكور\n وهو إضراب عن الإنكار إلى الإخبار بحالهم التي أدت بهم إلى ارتكاب أمثالها وهي اعتياد الإسراف في كل شيء\n أو عن الإنكار عليها إلى الذم لم على جميع معايبهم\n أو عن محذوف\n مثل: لا عذر لكم فيه\n بل أنتم قوم عادتكم الإسراف\n قاله البيضاوي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:55",
      "similarity": 0.7421301362179711
    },
    {
      "verse": "16:57",
      "similarity": 0.5551167744593937
    },
    {
      "verse": "41:31",
      "similarity": 0.5341892496948687
    },
    {
      "verse": "77:42",
      "similarity": 0.499092133765611
    },
    {
      "verse": "56:21",
      "similarity": 0.4045873236478281
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007081.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007081.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:81.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}