{
  "chapter": "الأعراف",
  "text": "والى مدين اخاهم شعيبا قال يقوم اعبدوا۟ الله ما لكم من اله غيره قد جاءتكم بينة من ربكم فاوفوا۟ الكيل والميزان ولا تبخسوا۟ الناس اشياءهم ولا تفسدوا۟ فى الارض بعد اصلحها ذلكم خير لكم ان كنتم مؤمنين",
  "translations": [
    {
      "translation": "And to Madyan We sent their brother Shu'ayb who said, 'My people, worship Allah! You have no other god than Him. A Clear Sign has come to you from your Lord. Give full measure and full weight. Do not diminish people's goods. Do not cause corruption in the land after it has been put right. That is better for you if you are muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember, We sent to Midian their brother Shu'aib. \"O you people,\" he said, \"worship God, for you have no other god but He. Clear proof has come to you from your Lord; so give in full measure and full weight; do not keep back from people what is theirs, and do not corrupt the land after it has been reformed. This is best for you if you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Midian We sent forth their brother Shu'ayb He exhorted them: O my people! Serve Allah, you have no god but Him. Indeed a clear proof has come to you from your Lord. So give just weight and measure and diminish not to men their things ' and make no mischief on the earth after it has been set in good order. That is to your own good, if you truly believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent to the people of Midian their brother Shu'ayb who also told his people to worship God their only Lord. He said, \"A guidance has come to you from your Lord. Maintain proper measures and weights in trade. Do not cause any deficiency in people's property or destroy the land after it has been reformed. This is for your own good, if you have any faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Shuaib to Madyan from their community; he said, “O my people! Worship Allah – you do not have any God except Him; indeed a clear proof has come to you from your Lord, so measure and weigh in full and do not give the people their goods diminished, and do not spread turmoil in the earth after it is organised; this is for your good, if you believe.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to (the people of) Madyan, (We sent) their brother Shu`ayb. He said: \"O my people! Worship Allah! You have no other God but Him. Verily, a clear proof (sign) from your Lord has come unto you; so give full measure and full weight and wrong not men in their things, and do not do mischief on the earth after it has been set in order, that will be better for you, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Madyan (We sent) their brother Shu'aib. He said: O my people! serve Allah, you have no god other than Him; clear proof indeed has come to you from your Lord, therefore give full measure and weight and do not diminish to men their things, and do not make mischief in the land after its reform; this is better for you if you are believers:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Midian their brother Shuaib; he said, 'O my people, serve God! You have no god other than He; there has now come to you a clear sign from your Lord. So fill up the measure and the balance, and diminish not the goods of the people; and do not corruption in the land, after it has been set right; that is better for you, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Midian (We sent) their brother, Shu'eyb. He said: O my people! Serve Allah. Ye have no other Allah save Him. Lo! a clear proof hath come unto you from your Lord; so give full measure and full weight and wrong not mankind in their goods, and work not confusion in the earth after the fair ordering thereof. That will be better for you, if ye are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Midian We sent their brother Shu'ayb. He said, \"O my people, worship God; you have no other god but Him. A clear Sign has indeed come to you from your Lord. So give full measure and full weight, and do not deliver short. Do not corrupt the land after it has been set in order. This is for your own good, if you are true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto Madyan We sent their brother Shu'aib. He said: O my people! worship Allah, no god ye have buthe; surely there hath come unto you an evidence from your Lord. So give full measure and weight, and defraud not people of their things, and act not corruptly on the earth after the ordering thereof; thatis best for you if ye be believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to [the people of] Midian [We sent] Shu‘ayb, their brother. He said, ‘O my people, worship Allah! You have no other god besides Him. There has certainly come to you a manifest proof from your Lord. Observe fully the measure and the balance, and do not cheat the people of their goods, and do not cause corruption on the earth after its restoration. That is better for you, if you are faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the Madyan people We sent Shu'aib, one of their own brethren: he said: \"O my people! worship Allah; Ye have no other god but Him. Now hath come unto you a clear (Sign) from your Lord! Give just measure and weight, nor withhold from the people the things that are their due; and do no mischief on the earth after it has been set in order: that will be best for you, if ye have Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to (the people of) Madyan (Midian), (We sent) their brother Shu'aib. He said: \"O my people! Worship Allah! You have no other Ilah (God) but Him. [La ilaha ill-Allah (none has the right to be worshipped but Allah)].\" Verily, a clear proof (sign) from your Lord has come unto you; so give full measure and full weight and wrong not men in their things, and do not mischief on the earth after it has been set in order, that will be better for you, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Midian, their brother Shu'aib. He said: 'Worship Allah, my nation, for you have no god except He. A clear sign has come to you from your Lord. Give just weight, and full measure; and do not diminish the goods of people. Do not corrupt the land after it has been set right, that is best for you, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Median, their brother Shuaib. He said, “O my people, worship God; you have no god other than Him. A clear proof has come to you from your Lord. Give full measure and weight, and do not cheat people out of their rights, and do not corrupt the land once it has been set right. This is better for you, if you are believers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to [the people of] Madyan [We sent] their brother Shu'ayb. He said, \"O my people, worship Allah; you have no deity other than Him. There has come to you clear evidence from your Lord. So fulfill the measure and weight and do not deprive people of their due and cause not corruption upon the earth after its reformation. That is better for you, if you should be believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:85] And, We sent, to Midian their brother Shu‘ayb. He said, ‘O my people, worship God! You have no god other than Him. Verily there has come to you a clear proof, a miracle, from your Lord, to [prove] my truthfulness. So give full measure and weight and do not defraud, diminish [the value of], people’s goods, and do not work corruption in the earth, by way of unbelief and acts of disobedience, after it has been set right, through the sending of messengers [thereto]. That, mentioned, is better for you, if you are believers, [if you are] seekers of faith, so hasten to it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتفسير صدر هذه الآية هو كتفسير نظيرها في قصّة ثمود ، سوى أنّ تجريد فعل { قال يا قوم } من الفاء هنا يترجّح أنّه للدّلالة على أنّ كلامه هذا ليس هو الذي فاتحهم به في ابتداء رسالته بل هو مِمّا خاطبهم به بعدَ أن دعاهم مِراراً ، وبعدَ أن آمنَ به مَن آمن منهم كما يأتي .ومَدْيَن أمّة سُمّيت باسم جَدّها مَدْيَنَ بننِ إبراهيم الخليللِ عليه السّلام ، من زوجه الثّالثة التي تزوّجها في آخر عُمره وهي سرية اسمُها قَطُورَا . وتزوّج مَدْيَنُ ابنةَ لوط عليه السّلام وولد له أبناء : هم ( عيفة ) و ( عفر ) و ( حنوك ) و ( أبيداع ) و ( ألْدَعة ) وقد أسكنهم إبراهيم عليه السّلام في ديارهم ، وسطاً بين مسكن ابنه إسماعيل عليه السّلام ومسكن ابنه إسحاق عليه السّلام ، ومن ذرّيتهم تفرّعت بطون مَدْين ، وكانوا يعدّون نحو خمسة وعشرين ألفاً ، ومواطنهم بين الحجاز وخليج العقبة بقرب ساحل البحر الأحمر ، وقاعدة بلادهم ( وَجّ ) على البحر الأحمر وتنتهي أرضهم من الشّمال إلى حدود مَعان من بلاد الشّام ، وإلى نحو تبوك من الحجاز ، وتسمّى بلادهم ( الأيْكَة ). ويقال : إنّ الأيكة هي ( تبوك ) فعلى هذا هي من بلاد مَدين ، وكانت بلادهم قرى وبوادي ، وكان شعيب عليه السّلام من القرية وهي ( الأيْكَة ) ، وقد تَعرّبوا بمجاورة الأمم العربيّة وكانوا في مدّة شعيب عليه السّلام تحت ملوك مصر ، وقد اكتسبوا بمجاورة قبائل العرب ومخالطتهم لكونهم في طريق مصر ، عربيّة فأصبحوا في عداد العرب المستعربة ، مثل بني إسماعيل عليه السّلام ، وقد كان شاعر في الجاهلية يعرف بأبي الهَمَيْسَع هو من شعراء مَدْيَن وهو القائل :إن تَمْنَعِي صَوْبَككِ صوب المدمع ... يجْري على الخدّ كضئب الثَّغْثَعمن طَمْحَةٍ صبيرُها جَحْلَنْجَعِ ... ويقال : إنّ الخطّ العربي أوّل ما ظهر في مدْين .وشعيب عليه السّلام هو رسولٌ لأهل مدين ، وهو من أنفسهم ، اسمُه في العربيّه شُعيب عليه السّلام واسمه في التّوراة : ( يَثْرُون ) ويسمّى أيضاً ( رَعْوَئِيلَ ) وهو ابن ( نويلى أو نويب ) بن ( رَعْويل ) بن ( عيفا ) بن ( مدين ). وكان موسى عليه السّلام لمّا خرج من مصر نزل بلاد مديَن وزوّجَه شعيبٌ ابنتَه المسمّاة ( صَفورَه ) وأقام موسى عليه السّلام عنده عشر سنين أجيراً .وقد خبط في نسب مدين ونسب شُعيب عليه السّلام جمع عظيم من المفسّرين والمؤرّخين ، فما وجدتَ ممّا يخالف هذا فانبذه . وعَدّ الصفدي شعيباً في العِميان ، ولم أقف على ذلك في الكتب المعتمدة . وقد ابتدأ الدّعوة بالإيمان لأنّ به صلاح الاعتقاد والقلب ، وإزالة الزّيف من العقل .وبيِّنة شعيب عليه السّلام التي جاءت في كلامه : يجوز أن تكون أطلقت على الآية لمعجزة أظهرها لقومه عَرفوها ولم يذكرها القرآن ، كما قال ذلك المفسّرون ، والأظهر عندي أن يكون المراد بالبيّنة حجّة أقامها على بطلان ما هم عليه من الشّرك وسوء الفعل ، وعجزوا عن مجادلته فيها ، فقامت عليهم الحجّة مثل المجادلة التي حكيت في سورة هود فتكون البيّنة أطلقت على ما يُبيّن صدق الدّعوى ، لا على خصوص خارق العادة ، أو أن يكون أراد بالبيّنة ما أشار إليه بقوله : { فاصبروا حتى يحكم الله بيننا } أي يكون أنذرهم بعذاب يحلّ بهم إن لم يؤمنوا ، كما قال في الآية الأخرى{ فأسقط علينا كِسْفا من السّماء إن كنت من الصّادقين } \\[ الشعراء : 187 \\] فيكون التّعبير بالماضي في قوله : { قد جاءتكم } مراداً به المستقبل القريب ، تنبيهاً على تحقيق وقوعه ، أو أن يكون عَرض عليهم أن يظهر لهم آية ، أي معجزة ليؤمنوا ، فلم يسألوها وبادروا بالتّكذيب ، فيكون المعنى مثلَ ما حكاه الله تعالى عن موسى عليه السّلام : { قد جئتكم ببينة من ربّكم فأرسل معي بني إسرائيل قال إن كنتَ جئتَ بآية فأتتِ بها } \\[ الأعراف : 105 ، 106 \\] الآية ، فيكون معنى : { قد جاءتكم } قد أعِدّت لأنّ تجيئكم إذا كنتم تؤمنون عند مجيئها .والفاء في قوله : { فأوفوا الكيل والميزان } للتّفريع على مضمون معنى { بينة } لأنّ البيّنة تدلّ على صدقه ، فلمّا قام الدّليل على صدقه وكان قد أمرهم بالتّوحيد بادىء بدء ، لما فيه من صلاح القلب ، شرع يأمرهم بالشّرائع من الأعمال بعد الإيمان ، كما دلّ عليه قوله الآتي : { إن كنتم مؤمنين } فتلك دعوة لمن آمن من قومه بأن يكملوا إيمانهم بالتزام الشّرائع الفرعيّة ، وإبلاغٌ لمن لم يؤمن بما يلزمهم بعد الإيمان بالله وحده . وفي دعوة شعيب عليه السّلام قومه إلى الأعمال الفرعيّة بعد أن استقرت الدّعوة إلى التّوحيد ما يؤذن بأنّ البشر في ذلك العصر قد تطوّرت نفوسهم تطوّراً هيّأهم لقبول الشّرائع الفرعيّة ، فإنّ دعوة شعيب عليه السّلام كانت أوسع من دعوة الرّسل من قبله هودٍ وصالححٍ عليهم السّلام إذ كان فيها تشريع أحكام فرعيّة وقد كان عصر شعيب عليه السّلام قد أظَلّ عَصْرَ موسى عليه السّلام الذي جاء بشريعة عظيمة ماسّةٍ نواحيَ الحياة كُلَّها .والبخس فسّروه بالنّقص ، وزاد الرّاغب في «المفردات» قيداً ، فقال : نقص الشّيء على سبيل الظلم ، وأحسن ما رأيت في تفسيره قول أبي بكر بن العربي في «أحكام القرآن» : «البخس في لسان العرب هو النّقص بالتعييب والتّزهيد أو المخادعة عن القيمة أو الاحتيال في التزيد في الكيل والنّقصان منه» فلنبن على أساس كلامه فنقول : البخس هو إنقاص شيء من صفة أو مقدار هو حقيق بكماللٍ في نوعه . ففيه معنى الظلم والتّحيّل ، وقد ذكر ابن سيدة في «المخصص» البَخس في باب الذهاب بحقّ الإنسان ، ولكنّه عندما ذكره وقع فيما وقع فيه غيره من مدوّني اللّغة ، فالبَخس حدث يتّصف به فاعل وليس صفة للشّيء المبْخوس في ذاته ، إلاّ بمعنى الوصف بالمصدر ، كما قال تعالى : { وشَرَوه بثمنٍ بَخس }\\[ يوسف : 20 \\] أي دون قيمة أمثاله ، ( أي تساهل بائعوه في ثمنه لأنّهم حصّلوه بغير عوض ولا كلفة ). وأعلم أنّه قد يكون البَخس متعلّقاً بالكمّية كما يقول المشتري : هذا النِّحْي لا يزن أكثر من عشرة أرطال ، وهو يعلم أنّ مثله يزن اثني عشر رطلاً ، أوْ يقولُ : ليس على هذا النّخل أكثر من عشرة قناطير تمراً في حين أنّه يعلم أنّه يبلغ عشرين قنطاراً ، وقد يكون متعلّقاً بالصّفة كما يقول : هذا البعير شَرود وهو من الرّواحل ، ويكون طريق البَخس قولاً ، كما مثَّلنا ، وفعلاً كما يكون من بذل ثمننٍ رخيصصٍ في شيء من شأنه أن يباع غالياً ، والمقصود من البَخس أن ينتفع البَاخس الرّاغب في السّلعة المبْخوسة بأنْ يصرف النَّاس عن الرّغبة فيها فتبقى كَلاَّ على جالبها فيضطرّ إلى بيعها بثمن زهيد ، وقد يقصد منه إلقاء الشكّ في نفس جالب السّلعة بأنّ سلعته هي دون ما هو رائج بين النّاس ، فيدخله اليأس من فوائد نتاجه فتكسل الهِمَم .وما وقع في «اللّسان» من معاني البَخس : أنّه الخسيس فلعلّ ذلك على ضرب من المجاز أو التّوسّع ، وبهذا تعلم أنّ البَخس هو بمعنى النّقص الذي هو فعل الفاعل بالمفعول ، لا النّقص الذي هو صفة الشّيء النّاقص ، فهو أخص من النّقص في الاستعمال ، وهو أخص منه في المعنى أيضاً .ثمّ إنّ حقّ فعله أن يتعدّى إلى مفعول واحد ، كقوله تعالى : { ولا يبْخس منه شيئاً } \\[ البقرة : 282 \\] فإذا عُدّي إلى مفعولين كما في قوله هنا : { ولا تبْخسوا النّاس أشياءهم } فذلك على معنى التّحويل لتحصيل الإجمال ثمّ التّفصيل ، وأصل الكلام : «ولا تبْخسوا أشياءَ النّاس» فيكون قوله : { أشياءهم } بدل اشتمال من قوله : { الناس } وعلى هذا فلو بني فعل { بخس } للمجهول لقلت بُخِس فلان شيئُه برفع فلان ورفع شيئه . وقد جعله أبو البقاء مفعولاً ثانياً ، فعلى إعرابه لو بني الفعل للمجهول لبَقي ( أشياءهم ) منصوباً . وعلى إعرابنا لو بني الفعل للمجهول لصار أشياؤُهم مرفوعاً على البدليّة من النّاس ، وبهذا تَعلم أنّ بيْن البَخس والتَّطفيف فرقاً قد خفي على كثير .وحاصل ما أمر به شعيب عليه السّلام قومَه ، بعد الأمر بالتّوحيد ينحصر في ثلاثة أصول : هي حفظ حقوق المعاملة الماليّة ، وحفظ نظام الأمّة ومصالحها ، وحفظُ حقوق حرّية الاستهداء .فالأوّل قوله : { فأوفوا الكيل والميزان ولا تبخسوا الناس أشياءهم } فإيفاء الكيل والميزان يرجع إلى حفظ حقوق المشترين ، لأنّ الكائل أو الوازن هو البائع ، وهو الذي يحمله حبّ الاستفضال على تطْفيف الكيل أو الوزن ، ليكون باع الشّيءَ النّاقص بثمن الشّيء الوافي ، كما يحسبه المشتري .وأمّا النَّهي عن بخس النّاس أشياءهم فيرجع إلى حفظ حقوق البائع لأنّ المشتري هو الذي يبْخس شيء البائع ليهيّئه لقبول الغبن في ثمن شيئه ، وكلا هذين الأمرين حيلة وخداع لتحصيل ربح من المال .والكيل مصدر ، ويطلق على ما يكال به ، وهو المِكيال كقوله تعالى : { ونزداد كيل بعير } \\[ يوسف : 65 \\] وهو المراد هنا : لمقابلته بالميزان ، ولقوله في الآية الأخرى : { ولا تنقصوا المكيال والميزان } \\[ هود : 84 \\] ومعنى . إيفاء المكيال والميزان أن تكون آلة الكيل وآلة الوزن بمقدار ما يقدّر بها من الأشياء المقدّرة . وإنَّما خَصّ هذين التحيلين بالأمر والنّهي المذكورين : لأنَّهما كانا شائعين عند مَدْيَن ، ولأنّ التّحيلات في المعاملة الماليّة تنحصر فيهما إذ كان التّعامل بين أهل البوادي منحصراً في المبادلات بأعيان الأشياءِ : عرْضاً وطَلَباً .وبهذا يَظهر أنّ النّهي في قوله : { ولا تبخسوا النّاس أشياءَهم } أفاد معنى غير الذي أفاده الأمر في قوله : { فأوفوا الكيل والميزان }. وليس ذلك النّهي جارياً مجرى العلّة للأمر ، أو التّأكيد لمضمونه ، كما فسّر به بعض المفسّرين .وما جاء في هذا التّشريع هو أصل من أصول رواج المعاملة بين الأمّة لأنّ المعاملات تعتمد الثّقة المتبادَلة بين الأمّة ، وإنَّما تحصل بشيوع الأمانة فيها ، فإذا حصل ذلك نشط النّاس للتّعامل فالمُنتج يزداد إنتاجاً وعَرْضاً في الأسواق ، والطَّالبُ من تاجر أو مُستهلك يُقبِل على الأسواق آمِناً لا يخشى غبناً ولا خديعة ولا خِلابة ، فتتوفّر السّلع في الأمّة ، وتستغني عن اجتلاب أقواتها وحاجياتها وتحسينياتها ، فيقوم نَماء المدينة والحضارة على أساس متين ، ويَعيش النّاس في رخاء وتحابب وتآخ ، وبضد ذلك يختلّ حال الأمّة بمقدار تفشي ضدّ ذلك .وقوله : { ولا تفسدوا في الأرض بعد إصلاحها } هذا الأصل الثّاني من أصول دعوة شعيب عليه السّلام للنّهي عن كلّ ما يفضي إلى إفساد ما هو على حالة الصّلاح في الأرض . وقد تقدّم القول في نظير هذا التّركيب عند قوله تعالى : { ولا تفسدوا في الأرض بعد إصلاحها وادعوه خوفاً وطمعاً } في أوائل هذه السّورة ( 56 ).والإشارة { بذلكم } إلى مجموع ما تضمّنه كلامه ، أي ذلك المذكورُ ، ولذا أفرد اسم الإشارة . والمذكور : هو عبادة الله وحده ، وإيفاءُ الكيل والميزان ، وتجنب بخس أشياء النّاس ، وتجنبُ الفساد في الأرض . وقد أخبر عنه بأنّه خير لَهم ، أي نفع وصلاح تنتظم به أمورهم كقوله تعالى : { والبدن جعلناها لكم من شعائر الله لكم فيها خير } \\[ الحج : 36 \\]. وإنّما كان ما ذُكر خيراً : لأنّه يوجب هناء العيش واستقرار الأمن وصفاءَ الودّ بين الأمّة وزوال الإحَن المفضية إلى الخصومات والمقاتلات ، فإذا تمّ ذلك كثرت الأمّة وعزّت وهابها أعداؤُها وحسنت أحدوثتها وكثر مالها بسبب رغبة النّاس في التّجارة والزّراعة لأمْن صاحب المال من ابتزاز ماله . وفيه خير الآخرة لأنّ ذلك إنْ فعلوه امتثالاً لأمر الله تعالى بواسطة رسوله أكسبهم رضى الله ، فنجَوْا من العذاب ، وسكنوا دار الثّواب ، فالتّنكير في قوله : { خير } للتعظيم والكمال لأنّه جامعُ خيري الدّنيا والآخرة .وقوله : { إن كنتم مؤمنين } شرط مُقَيِّد لقوله : { ذلكم خير لكم } والمؤمنون لقب للمتّصفين بالإيمان بالله وحده ، كما هو مصطلح الشّرائع وحملُ المؤمنين على المصدّقين لقوله ، ونصحه ، وأمانته : حملٌ على ما يأبَاه السّياق ، بل المعنى ، أنّه يكون خيراً إن كنتم مؤمنين بالله وحدَه ، فهو رجوع إلى الدّعوة للتّوحيد بمنزلة ردّ العجز على الصّدر في كلامه ، ومعناه أنّ حصول الخير من الأشياء المشارِ إليها لا يكون إلاّ مع الإيمان ، لأنّهم إذا فعلوها وهم مشركون لم يحصل منها الخير لأنّ مفاسد الشّرك تُفسد ما في الأفعال من الخَير ، أمّا في الآخرة فظاهر ، وأمَّا في الدّنيا فإنّ الشّرك يدعو إلى أضداد تلك الفضائل كما قال الله تعالى :{ وما زَادوهم غَيْر تَتَبيب } \\[ هود : 101 \\] أو يدعو إلى مفاسد لا يَظهر معها نفع تلك المصالح . والحاصل أنّ المراد بالتّقييد نفي الخير الكامل عن تلك الأعمال الصّالحة إن لم يكن فاعلوها مؤمنين بالله حقّ الإيمان ، وهذا كقوله تعالى : { فَكّ رقبة أو إطعام في يوم ذي مسغبة يتيماً ذا مَقْرَبة أو مسكيناً ذا مَتْرَبة ثمّ كَان من الذين آمنوا } \\[ البلد : 13 17 \\] وتأويل الآية بغير هذا عدول بها عَن مهيع الوضوح .\n\n",
      "translations": [
        {
          "translation": "(And unto Midian) and We sent to Midian (their brother) their prophet (Shu'ayb. He said: my people! Serve Allah) profess Allah's divine Oneness. (Ye have no other God save Him) save Him in whom I am enjoining you to believe. (Lo! a clear proof) an exposition (hath come unto you from your Lord) regarding Allah's message; (so give full measure and full weight and wrong not mankind in their goods, and work not confusion in the earth) by committing transgressions and calling to other than Allah and by not giving full measure and full weight (after the fair ordering thereof) through acts of obedience, calling to Allah and giving full measure and scale. (That) the profession of Allah's divine Oneness and giving full measure and weight (will be better for you) than that in which you are now, (if ye are believers) in what I say to you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تَبْخَسُواْ ٱلنَّاسَ أَشْيَاءَهُمْ } معناه لا تَنقُصُوهُم ولا تَظْلِمُوهُمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Do not wrong the people by taking their things\" means do not cheat or harm them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً أرسلنا { إِلَىٰ } قوم { مَدْيَنَ } وهم قرية شعيب عليه السلام { أَخَاهُمْ } وابن عمهم { شُعَيْباً } عليه السلام حين أفرطوا في التطفيف والتخسير { قَالَ } لهم منادياً على وجه الشفقة والنصيحة: { يَاقَوْمِ ٱعْبُدُواْ ٱللَّهَ } المتوحد المستقل في الألوهية\n واعلموا أنه { مَا لَكُمْ مِّنْ إِلَـٰهٍ } يعبد بالحق { غَيْرُهُ } وأنه { قَدْ جَآءَتْكُمْ بَيِّنَةٌ } عظيمة { مِّن رَّبِّكُمْ } الذي رباكم بأنواع اللطف والكرم دالة على القسط العدالة في المعاملات الصورية\n ليفوزوا بها إلى الاعتدال المعنوي والقسط الإلهي { فَأَوْفُواْ ٱلْكَيْلَ } أي: وفوا حقه { وَ } أقيموا { ٱلْمِيزَانَ وَ } بالجملة: { لاَ تَبْخَسُواْ ٱلنَّاسَ أَشْيَاءَهُمْ } أي: لا تنقصوا من حقوقهم شيئاً { وَ } عليكم أن { لاَ تُفْسِدُواْ } مطلقاً { فِي ٱلأَرْضِ } التي وضعت للعدالة والصلاح سيما { بَعْدَ إِصْلاَحِهَا } أي: بعد إصلاحنا أمرها بإرسال الرسل وإنزال الكتب { ذٰلِكُمْ } أي: العدل والصلاح وامتثال الأوامر { خَيْرٌ لَّكُمْ إِن كُنتُمْ مُّؤْمِنِينَ } [الأعراف: 85] موقنين بعدل الله وصراطه المستقيم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { و } أرسلنا { إلى مدين أخاهم شعيبًا } \n ومدين: قبيلة من أولاد مدين بن إبراهيم\n شعيب بن ميكائيل بن يشجر بن مدين بن إبراهيم الخليل\n على ما قيل\n وقد تقدم في البقرة أن مدين ومدان من ولد إبراهيم عليه السلام\n وشعيب هذا يسمى خطيب الأنبياء لحسن مراجعته قومه\n { قال يا قوم اعبدوا الله ما لكم من إلهِ غيره قد جاءتكم بينةٌ من ربكم } يريد المعجزة التي كانت له\n وليس في القرآن بيان ما هي معجزته\n وحمل الواحدي البينة على الموعظة\n وقال في الكشاف: ومن معجزات شعيب: ما رُوِي من محاربة عصا موسى التنين\n حين دفع إليه غنمه\n وولادة الغنم الدرع خاصة\n حين وعده أن يكون له الدرع من أولادها\n ووقوع عصا آدم في يده في المرات السبع\n وغير ذلك من الآيات\n هـ\n وفيه نظر لأن هذه وقعت بعد مقالته لقومه\n وإنما كانت إرهاصات لموسى عليه السلام\n وفي حديث البخاري:\n \" مَا بَعَثَ الله نَبِيًّا إلاَّ وآتاهُ مَا مِثلُه آمَنِ عليه البشرُ\n وإنما كَان الذي أُوتِيتُه وحيًا\n وأرجوُ أن أكون أكَثَرهُم تابعًا يومَ القيامَةِ \" \nوهو صريح في أنه لا بد من الآية لكل رسول\n ولعل الله تعالى لم يذكر معجزة شعيب وهود في القرآن مع وجودها لظاهر الحديث\n ثم قال لهم: { فأوفوا الكيلَ والميزانَ } \n وكانوا مطففين\n أي: فأوفوا المكيال الذي هو آلة الكيل\n أي: كبروها بدليل قوله: { والميزان } الذي هو الآلة\n ويحتمل أن يريد بهما المصدر\n أي الكيل والوزن\n { ولا تَبخسوا الناس أشياءهم } أي: لا تنقصوهم حقوقهم\n وإنما قال: { أشياءَهم } \n للتعميم تنبيهًا على أنهم كانوا يبخسون الجليل والحقير\n والقليل والكثير\n وقيل: كانوا مكَّاسين لا يدعون شيئًا إلا مكسوه\n { ولا تُفسدوا في الأرض } بالكفر والظلم\n { بعد إصلاحها } بإقامة الشرائع وظهور العدل\n { ذلكم خيرٌ لكم إن كنتم مؤمنين } أي: ذلك الذي أمرتكم به ونهيتكم عنه هو خير لكم من إبقائكم على ما أنتم عليه\n ومعنى الخيرية: الزيادة مطلقًا إذ لا خير فيما هم فيه\n أو: في الإنسانية وحسن الأحدوثة وجمع المال\n قاله البيضاوي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:84",
      "similarity": 0.620510845694913
    },
    {
      "verse": "11:85",
      "similarity": 0.5911577356347802
    },
    {
      "verse": "11:15",
      "similarity": 0.4504928839600134
    },
    {
      "verse": "29:36",
      "similarity": 0.39608806054077633
    },
    {
      "verse": "26:183",
      "similarity": 0.3919838330859164
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007085.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007085.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:85.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}