{
  "chapter": "الأعراف",
  "text": "ولا تقعدوا۟ بكل صرط توعدون وتصدون عن سبيل الله من ءامن به وتبغونها عوجا واذكروا۟ اذ كنتم قليلا فكثركم وانظروا۟ كيف كان عقبة المفسدين",
  "translations": [
    {
      "translation": "Do not lie in ambush to intimidate and divert from the path of God those who believe in Him, nor seek obliquity in it. Remember the day when you were few and He increased your numbers. So consider the fate of those who were evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not lie in ambush by every path [of life] seeking to overawe or to hinder from the path of Allah those who believe, nor seek to make the path crooked. Remember, how you were once few, and then He multiplied you, and keep in mind what was the end of mischiefmakers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not ambush the believers or hinder them from every path that leads them to God just because you wish to make such ways seem crooked. Recall the time when you were just a few in number and God multiplied you. Consider how terrible the end of the evil-doers was!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And do not be seated on every road in order to scare the travellers, and to prevent from Allah’s path the people who believe in Him, wishing to distort it; and remember when you were few and He increased your numbers; and see what sort of fate befell the mischievous!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And sit not on every road, threatening, and hindering from the path of Allah those who believe in Him, and seeking to make it crooked. And remember when you were but few, and He multiplied you. And see what was the end of the mischief-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not lie in wait in every path, threatening and turning away from Allah's way him who believes in Him and seeking to make it crooked; and remember when you were few then He multiplied you, and consider what was the end of the mischief-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not sit in every path, threatening and barring from God's way those who believe in Him, desiring to make it crooked. And remember when you were few, and He multiplied you; and behold, how was the end of the workers of corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lurk not on every road to threaten (wayfarers), and to turn away from Allah's path him who believeth in Him, and to seek to make it crooked. And remember, when ye were but few, how He did multiply you. And see the nature of the consequence for the corrupters!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not lie in ambush on every pathway, threatening people, barring those who believe from the Way of God, seeking to make it appear crooked. Remember when you were few in number and He multiplied you. Consider the fate of those who used to spread corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And beset not every highway menacing and turning aside from the path of Allah those who believe in Him, and seeking to make it crooked. And remember when ye were small, and He thereafter multiplied you; and behold what like was the end of the corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not lie in wait on every road to threaten and bar those who have faith in Him from the way of Allah, seeking to make it crooked. Remember when you were few, and He multiplied you, and observe how was the fate of the agents of corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And squat not on every road, breathing threats, hindering from the path of Allah those who believe in Him, and seeking in it something crooked; But remember how ye were little, and He gave you increase. And hold in your mind's eye what was the end of those who did mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And sit not on every road, threatening, and hindering from the Path of Allah those who believe in Him. and seeking to make it crooked. And remember when you were but few, and He multiplied you. And see what was the end of the Mufsidun (mischief-makers, corrupts, liars).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not sit in every road, threatening and barring from the Path of Allah those who believed it, nor seek to make it crooked. Remember how He multiplied you when you were few in number. Consider the end of the corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And do not lurk on every path, making threats and turning away from the path of God those who believe in Him, seeking to distort it. And remember how you were few, and how He made you numerous. So note the consequences for the corrupters.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not sit on every path, threatening and averting from the way of Allah those who believe in Him, seeking to make it [seem] deviant. And remember when you were few and He increased you. And see how was the end of the corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:86] And do not sit in every path, [every] route, threatening, terrifying people by seizing their garments, or by charging them excise [tax], and barring, driving away, from God’s way, [from] His religion, those who believe in Him — when you threaten to kill them — and desiring that it, seeking that the path, be crooked.   And remember when you were but few, and then He multiplied you. And behold what was the end of the agents of corruption, before you, for denying their messengers, that is, [behold] how destruction was the conclusion of their affair.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lurk not on every road) that people use (to threaten) and beat, scare and take the clothes of strangers, (and to turn away from Allah's path) from Allah's religion and obedience (him who believeth in him) in Shu'ayb (Jethro), (and to seek to make it crooked) and seek to make it other than what it is. (And remember, when you were but few) in number, (how He did multiply you) in number. (And see the nature of the consequence for the corrupters!) see how was the end result of the idolaters before you through destruction.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَتَبْغُونَهَا عِوَجاً } وهو الاعوِجَاجُ فِي الدِّينِ\n والعَوَجُ: المَيْلُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوعليكم أن تتوجهوا نحو طريق الحق بالعزيمة الصحيحة { وَلاَ تَقْعُدُواْ } أي: لا تترصدوا { بِكُلِّ صِرَاطٍ } طريق ومذهب من الطرق الباطلة حال كونكم { تُوعِدُونَ } وتخوفون الناس عن سلوك طريق الحق { وَتَصُدُّونَ عَن سَبِيلِ ٱللَّهِ } ضعفاء { مَنْ آمَنَ بِهِ } بإلقاء الشبه والرخص في قلوبهم { وَ } بالجلمة: { تَبْغُونَهَا عِوَجاً } أي: تطلبون أن تنسبوا عوجاً وانحرافاً إلى سبيل الحق والطريق المستقيم؛ لينصرف الناس عنه، وعليكم ألاَّ تميلوا عن مخالفة أمر الله ونهيه { وَٱذْكُرُوۤاْ } نعمه عليكم { إِذْ كُنْتُمْ قَلِيلاً } عَدداً وعُدداً { فَكَثَّرَكُمْ } قؤاكم وأظهركم، واشكروا نعمه عليكم؛ ليدوم وزيد ولا تكفروها { وَٱنْظُرُواْ كَيْفَ كَانَ عَاقِبَةُ ٱلْمُفْسِدِينَ } [الأعراف: 86] المكفرين لنعم الحق من الأمم الهالكة واعتبروا من حالهم ومآلهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا تقعُدُوا بكل صِراطٍ } أي: طريق { تُوعِدُون } من أراد الإيمان بالعقوبة، وكانوا يجلسون على الطرقات والمراصد، يقولون لمن يريد شعيبًا: إنه كذاب فلا يفتنك عن دينك ويوعدون من آمن، وقيل: كانوا يقطعون الطريق\n { وتَصُدُّون عن سبيل الله } أي: تصدون الناس عن طريق الله، وهو الإيمان به وبرسوله، وهو الذي قعدوا لأجله في كل طريق، وقوله: { من آمن به } من أراد الإيمان به، أو من آمن حقيقة كانوا يصدونه عن العمل، { وتبغونها عِوَجًا } أي: وتطلبون لطريق الله عوجًا بإلقاء الشُّبَه فيها، أو بوصفها للناس بأنها مُعوَجَّة\n\n\n{ واذكروا إذ كنتم قليلاً } عَددكم وعُدَدِكم { فكثَّرَكُم } بالبركة في النسل والمال، { وانظروا كيف كان عاقبةِ المفسدين } من الأمم قبلكم، فاعتبروا بهم",
      "translations": []
    }
  ]
}