{
  "chapter": "الأعراف",
  "text": "وان كان طائفة منكم ءامنوا۟ بالذى ارسلت به وطائفة لم يؤمنوا۟ فاصبروا۟ حتى يحكم الله بيننا وهو خير الحكمين",
  "translations": [
    {
      "translation": "There is a group of you who have iman in what I have been sent with and a group who do not, so be steadfast until Allah judges between us. He is the best of judges.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If some of you believe what has been sent through me, and some of you do not, have patience until God decide between us, for He is the best of all judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if there are some among you who believe in the message that I bear while some do not believe, have patience till Allah shall judge between us. He is the best of those who judge.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If there are some of you who believe in the Message that I have been commanded to preach and there are others who do not, exercise patience until God judges among us. He is the best Judge.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And if a group among you believes in what I have been sent with, and another group does not believe, then wait until Allah judges between us; and Allah’s judgement is the best of all.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if there is a party of you who believes in that with which I have been sent and a party who does not believe, so be patient until Allah judges between us, and He is the best of judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if there is a party of you who believe in that with which am sent, and another party who do not believe, then wait patiently until Allah judges between us; and He is the best of the Judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if there is a party of you who believe in the Message I have been sent with, and a party who believe not, be patient till God shall judge between us; He is the best of judges.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if there is a party of you which believeth in that wherewith I have been sent, and there is a party which believeth not, then have patience until Allah judge between us. He is the Best of all who deal in judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if there is a group of you which believes in My message and others who disbelieve it, be patient until God shall judge between us. He is the best of judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if there be a party of you who believeth in that wherewith I am sent and a party who believeth not, then have patience until Allah judgeth between us, and He is the Best of judges.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a group of you have believed in what I have been sent with, and a group have not believed, be patient until Allah judges between us, and He is the best of judges.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if there is a party among you who believes in the message with which I have been sent, and a party which does not believe, hold yourselves in patience until Allah doth decide between us: for He is the best to decide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if there is a party of you who believes in that with which I have been sent and a party who do not believe, so be patient until Allah judges between us, and He is the Best of judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If there are some among you who believe in that which I have been sent and others who disbelieve it, be patient until Allah shall judge between us. He is the best of judges'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Since some of you believed in what I was sent with, and some did not believe, be patient until God judges between us; for He is the Best of Judges.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if there should be a group among you who has believed in that with which I have been sent and a group that has not believed, then be patient until Allah judges between us. And He is the best of judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:87] And if there is a party of you who believe in that with which I have been sent, and a party who do not believe, in it, then be patient, wait, until God judges between us, and you, by delivering the affirmer [of this truth] and destroying the denier [of it]. He is the best of judges’, the fairest of them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if there is) there was indeed (a party of you which believes in that wherewith I have been sent, and there is a party which believeth not, then have patience until Allah judge between us) and you. (He is the best of all who deal in judgement.)\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِن كَانَ طَآئِفَةٌ مِّنكُمْ آمَنُواْ بِٱلَّذِيۤ أُرْسِلْتُ بِهِ } من العدالة الصورية والمعنوية { وَطَآئِفَةٌ لَّمْ يْؤْمِنُواْ } عناداً واستكباراً { فَٱصْبِرُواْ } وانتظروا { حَتَّىٰ يَحْكُمَ ٱللَّهُ } يمقتضى عدله { بَيْنَنَا } أي: بين الفريقين بالنصر على من آمن والقهر على من كفر واستكبر { وَهُوَ } سبحانه في ذاته { خَيْرُ ٱلْحَاكِمِينَ } [الأعراف: 87] يحكم بمقتضى حكمته المتقنة المتفرعة على العدالة الحقيقية\n\n\nوبعدما سمعوا منه ما سمعوا { قَالَ ٱلْمَلأُ ٱلَّذِينَ ٱسْتَكْبَرُواْ مِن قَوْمِهِ } على وجه المبالغة والتأكيد وعدم المبالاة: { لَنُخْرِجَنَّكَ } البتة { يٰشُعَيْبُ وَٱلَّذِينَ آمَنُواْ مَعَكَ } وصدقوا قولك { مِن قَرْيَتِنَآ } كرهاً وإجلاً { أَوْ لَتَعُودُنَّ } أنت ومن معك { فِي مِلَّتِنَا } التي كنتم عليها من قبل { قَالَ } عليه لسلام مستبعداً مستنكراً: { أَوَلَوْ كُنَّا } في الأيام السالفة أيضاً { كَارِهِينَ } [الأعراف: 88] منكرين ملتكم التي أنتم عليها\n فتعيدوننا إليها\n وكيف نعود؟!\n\n{ قَدِ ٱفْتَرَيْنَا } البتة { عَلَى ٱللَّهِ كَذِباً إِنْ عُدْنَا } وصرنا { فِي مِلَّتِكُمْ } سيما { بَعْدَ إِذْ نَجَّانَا ٱللَّهُ } المنجي لعباده عن ظلمة الكفر { مِنْهَا } وألهمنا بطلان ما أنتم عليه { وَ } بالجملة: { مَا يَكُونُ } يجوز ويصح { لَنَآ أَن نَّعُودَ } ونرجع { فِيهَآ إِلاَّ أَن يَشَآءَ ٱللَّهُ } عودنا ومصيرنا إليه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وهو خير الحاكمين } إذ لا معقب لحكمه\n ولا حيف فيه\n { قال الملأ الذين استكبروا من قومه } في جوابه عن وعظه: { لنُخرجنّك يا شعيب والذين آمنوا معك من قريتنا أو لتُعودنَّ في ملتنا } أي: ليكونن أحد الأمرين إما إخراجكم من القرية أو عودكم في الكفر\n وشعيب عليه السلام لم يكن في ملتهم قط لأن الأنبياء ـ عليهم السلام ـ لا يجوز عليهم الكفر مطلقًا\n لكنهم غلّبوا الجماعة على الواحد فخُوطب هو وقومه بخطابهم\n وعلى ذلك أجرى الجواب في قوله: { قال أوَ لو كنا كارهين }\n قاله البيضاوي\n وقال ابن عطية: وعاد: قد يكون بمعنى صار\n فلا يقتضي تقدم ذلك المحال\n قلت: ويؤيده ما في حديث الجَهنميين:\n \" قد عادوا حممًا \" \nأي: صاروا\n ثم قال شعيب عليه السلام: { قد افترينا على الله كذبًا إن عُدنا في ملتكم بعد إذ نجانا الله منها } أي: إن رجعنا إلى ملتكم بعد الخلاص منها\n فقد اختلقنا على الله الكذب\n وهذا كله في حق قومه كما تقدم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:109",
      "similarity": 0.4839621580163186
    },
    {
      "verse": "56:17",
      "similarity": 0.4588198561529994
    },
    {
      "verse": "49:5",
      "similarity": 0.4236220744705287
    },
    {
      "verse": "7:201",
      "similarity": 0.4132581928318936
    },
    {
      "verse": "3:72",
      "similarity": 0.38188161889925565
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/7:87.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/7:87.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/7:87.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}