{
  "chapter": "الأعراف",
  "text": "قال الملا الذين استكبروا۟ من قومه لنخرجنك يشعيب والذين ءامنوا۟ معك من قريتنا او لتعودن فى ملتنا قال اولو كنا كرهين",
  "translations": [
    {
      "translation": "The ruling circle of those of his people who were arrogant said, 'We will drive you out of our city, Shu'ayb, you and those who have iman along with you, unless you return to our religion.' He said, 'What, even though we detest it?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The arrogant leaders of the people replied: \"We shall drive you away from our land, O Shu'aib, and those who are with you, unless you come back to your faith.\" But he remarked: \"Even if we are disgusted with it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The haughty elders of his people said: 'O Shu'ayb! We shall certainly banish you and your companions-in-faith from our town, or else you shall return to our faith.' Shu'ayb said: 'What! Even though we abhor [your faith]?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A proud group among Shu'ayb's people said, \"We must expel you (Shu'ayb) and your followers from our town unless you give-up your faith and live as our own people.\" Shu'ayb asked them, \"Will you use force against us?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The proud leaders of his people said, “O Shuaib, we swear we will banish you and the Muslims who are with you, from our town or you must return to our religion”; he said, “Even though we detest it?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chiefs of those who were arrogant among his people said: \"We shall certainly drive you out, O Shu`ayb and those who have believed with you from our town, or else you (all) shall return to our religion.\" He said: \"Even though we hate it\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chiefs, those who were proud from among his people said: We will most certainly turn you out, O Shu'aib, and (also; those who believe with you, from our town, or you shall come back to our faith. He said: What! though we dislike (it)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said the Council of those of his people who waxed proud, 'We will surely expel thee, O Shuaib, and those who believe with thee, from our city, unless you return into our creed.' He said, 'What, even though we detest it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chieftains of his people, who were scornful, said: Surely we will drive thee out, O Shu'eyb, and those who believe with thee, from our township, unless ye return to our religion. He said: Even though we hate it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The arrogant leaders of his people said, \"Shu'ayb, we will expel you and your fellow believers from our town unless you return to our faith.\" He said, \"Even though we detest it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chiefs of those who were stiff-necked amongst his people said: surely we shall drive you forth, Shu'aib! and those who have believed with thee from our city, or else ye shall return unto our faith. He said: what! even though we be averse!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The elite of his people who were arrogant said, ‘O Shu'ayb, we will surely expel you and the faithful who are with you from our town, or else you shall revert to our creed.’ He said, ‘What! Even if we should be unwilling?!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The leaders, the arrogant party among his people, said: \"O Shu'aib! we shall certainly drive thee out of our city - (thee) and those who believe with thee; or else ye (thou and they) shall have to return to our ways and religion.\" He said: \"What! even though we do detest (them)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chiefs of those who were arrogant among his people said: \"We shall certainly drive you out, O Shu'aib, and those who have believed with you from our town, or else you (all) shall return to our religion.\" He said: \"Even though we hate it!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The proud assembly of his nation said: 'We will expel you Shu'aib and those who believe with you from our village unless you return to our creed' He replied: 'Even though we hate it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The arrogant elite among his people said, “O Shuaib, We will evict you from our town, along with those who believe with you, unless you return to our religion.” He said, “Even if we are unwilling?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said the eminent ones who were arrogant among his people, \"We will surely evict you, O Shu'ayb, and those who have believed with you from our city, or you must return to our religion.\" He said, \"Even if we were unwilling?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:88] Said the council of those of his people who were disdainful, of believing: ‘Surely we will expel you, O Shu‘ayb, and those who believe with you, from our city, unless you return to our creed’, our religion (the plural person predominates over the singular in their address [to Shu‘ayb] because Shu‘ayb was never part of their religious community; and so in the same [plural] way he responded:) He said, ‘What, should we return to it, even though we are averse, to it? (the interrogative is meant as a disavowal).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nكان جوابهم عن حجّة شعيب جوابَ المفحَم عن الحجّة ، الصائر إلى الشدّة ، المزدهي بالقوة ، المتوقّععِ أن يكثر معاندوه ، فلذلك عدلوا إلى إقصاء شعيب وأتباعه عن بلادهم خشية ظهور دعوته بين قومهم ، وبث أتنباعه دعوته بين الناس ، فلذلك قالوا : { لنخرجنّك يا شعيب والذين آمنوا معك من قريتنا }.وتفسير صدر الآية هو كتفسير نظيره من قصّة ثمود .وإيثار وصفهم بالاستكبار هنا دون الكفر ، مع أنّه لم يحك عنم هنا خطاب المستضعفين ، حتّى يكون ذكر الاستكبار إشارة إلى أمّهم استضعفوا المؤمنين كما اقتضته قصة ثمود ، فاختير وصف الاستكبار هنا لمناسبة مخاطبتهم شعيباً بالإخراج أو الإكراه على اتّباع دينهم ، وذلك من فعل الجبّارين أصحاب القوة .وكان إخراج المغضوب عليه من ديار قبيلته عقوبة متّبعة في العرب إذا أجمعت القبيلة على ذلك ويسمّى هذا الإخراج عند العرب بالخَلْع ، والمخرَج يسمّى خليعاً .قال امرؤ القيس :به الذئبُ يعوي كالخليع المعيل ... وأكدوا التوعّد بلام القسم ونون التوكيد : ليوقن شعيب بأنّهم منجزو ذلك الوعيد .وخطابهم إيّاه بالنداء جار على طريقة خطاب الغضب ، كما حكى الله قول آزر خطاباً لإبراهيم عليه السلام { أراغب أنت عن آلهتي يا إبراهيم } \\[ مريم : 46 \\].وقوله : { معك } متعلّق ب { لنخرجنّك } ، ومتعلّق { آمنوا } محذوف ، أي بك ، لأنهم لا يصفونهم بالإيمان الحقّ في اعتقادهم .والقرية ( المدينة ) لأنها يجتمع بها السكان . والتقرّي : الاجتماع . وقد تقدم عند قوله تعالى : { أوْ كالذي مرّ على قرية } \\[ البقرة : 259 \\] ، والمراد بقريتهم هنا هي ( الأيكة ) وهي ( تبوك ) وقد رددوا أمر شعيب ومن معه بين أن يُخرجوا من القرية وبين العود إلى ملة الكفر .وقد جعلوا عود شعيب والذين معه إلى ملّة القوم مقسماً عليه فقالوا : { أو لتعودُن } ولم يقولوا : لنخرجنّكم من أرضنَا أو تعودن في ملّتنا ، لأنّهم أرادوا ترديد الأمرين في حيز القسم لأنهم فاعلون أحد الأمرين لا محالة وأنّهم ملحّون في عودهم إلى ملّتهم .وكانوا يظنّون اختياره العود إلى ملّتهم ، فأكدوا هذا العود بالقسم للإشارة إلى أنّه لا مَحيد عن حصوله عوضاً عن حصول الإخراج لأن أحد الأمرين مُرضضٍ للمقسمين ، وأيضاً فإن التوكيد مؤذن بأنّهم إن أبوا الخروج من القرية فإنهم يكرهون على العود إلى ملّة القوم كما دل عليه قول شعيب في جوابهم : { أوَلْو كُنّا كارهين } ولما كان المقام للتوعّد والتّهديد كان ذكر الإخراج من أرضهم أهم ، فلذلك قدموا القسم عليه ثم أعقبوه بالمعطوف بحرف ( أوْ ).والعَوْد : الرجوع إلى ما كان فيه المرء من مكان أو عمل ، وجعلوا موافقة شعيب إياهم على الكفر عوداً لأنهم يحسبون شعيباً كان على دينهم ، حيث لم يكونوا يعلمون منه ما يخالف ذلك ، فهم يحسبونه ، موافقاً لهم من قبل أن يدعو إلى ما دعا إليه .وشأن الذين أرادهم الله للنبوءة أن يكونوا غير مشاركين لأهل الضلال من قومهم ولكنّهم يكونون قبل أن يُوحى إليهم في حالة خلو عن الإيمان حتى يهديهم الله إليه تدريجاً ، وقومهم لا يعلمون باطنهم فلا حيرة في تسمية قومه مُوافقته إيّاهم عوداً .وهذا بناء على أن الأنبياء معصومون من الشرك قبل النبوءة ، وذلك قول جميع المتكلمين من المسلمين ، وقد نبّه على ذلك عياض في «الشفاء» في القسم الثالث وأورد قول شعيب : { إنْ عُدنا في ملّتكُم } \\[ الأعراف : 89 \\] وتأول العود بأنّه المصير ، وذلك تأويل كثير من المفسرين لهذه الآية . ودليل العصمة من هذا هو كمالهم ، والدليل مبني على أن خلاف الكمال قبل الوحي يُعد نقصاً ، وليس في الشريعة دليل قاطع على ذلك ، وإنّما الإشكال في قول شعيب { إنْ عدنا في ملّتكم } \\[ الأعراف : 89 \\] فوجهه أنّه أجراه على المشاكلة والتغليب . وكلاهما مصحّح لاستعمال لفظ العود في غير معناه بالنسبة إليه خاصة ، وقد تولى شعيب الجواب عمّن معه من المؤمنين ليقينه بصدق إيمانهم .والملّة : الدين ، وقد تقدم في قوله تعالى : { ومن يرغب عن ملّة إبراهيم إلاّ مَنْ سَفِه نفسَه } في سورة البقرة ( 130 ).وفصل جملة : { قال الملأ } لوقوعها في المحاورة على ما بيناه عند قوله تعالى : { قالوا أتجعل فيها من يفسد فيها } في سورة البقرة ( 30 ).فصل جملة { قال . . } لوقوعها في سياق المحاورة .والاستفهام مستعمل في التعجب تعجباً من قولهم : { أو لتعودن في ملّتنا } المؤذننِ ما فيه من المؤكّدات بأنّهم يُكرهونهم على المصير إلى ملّة الكفر ، وذلك التعجب تمهيد لبيان تصميمه ومن معه على الإيمان ، ليعلم قومه أنّه أحاط خبراً بما أرادُوا من تخييره والمؤمنين معه بين الأمرين : الإخراج أو الرجوع إلى ملّة الكفر ، شأنَ الخصم اللبيب الذي يأتي في جوابه بما لا يغادر شيئاً مما أراده خصمه في حوارِه ، وفي كلامه تعريض بحماقة خصومه إذ يحاولون حمله على ملّتهم بالإكراه ، مع أن شأن المُحقّ أن يشرك للحق سلطانه على النفوس ولا يتوكّأ على عصا الضّغط والإكراه ، ولذا قال الله تعالى : { لا إكراه في الدين قد تبين الرشد من الغيّ } \\[ البقرة : 256 \\]. فإن التزام الدين عن إكراه لا يأتي بالغرض المطلوب من التّديّن وهو تزكية النفس وتكثير جند الحق والصلاح المطلوب .والكاره مشتق من كره الذي مصدره الكَرهُ بفتح الكاف وسكون الراء وهو ضد المحبة ، فكاره الشيء لا يدانيه إلاّ مغصوباً ويقال للغصب إكراه ، أي مُلجَئين ومغصوبين وتقدم في قوله تعالى : { كتب عليكم القتال وهو كُرهٌ لكم } في سورة البقرة ( 216 ).و ( لو ) وصلية تفيد أن شرطها هو أقصى الأحوال التي يحصل معها الفعل الذي في جوابها ، فيكون ما بعدها أحرى بالتعجب . فالتقدير : أتعيدوننا إلى ملّتكم ولو كنا كارهين . وقد تقدم تفصيل ( لو ) هذه عند قوله تعالى : { فلن يقبل من أحدهم ملء الأرض ذهباً ولو افتدى به }في سورة آل عمران ( 91 ). وتقدم معنى الواو الداخلة عليها وأنها واو الحال .\n\n",
      "translations": [
        {
          "translation": "(The chieftains of his people, who were scornful) towards believing, (said: Surely we will drive you out, Shu'ayb, and those who believe with thee, from our township, unless ye return to) embrace (our religion. He) Jethro (said: Even though we hate it?) would you force us to do this even though we hate it?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:90",
      "similarity": 0.5675877778704335
    },
    {
      "verse": "26:177",
      "similarity": 0.5031017723763627
    },
    {
      "verse": "14:13",
      "similarity": 0.4506724110806604
    },
    {
      "verse": "11:87",
      "similarity": 0.37477527428202884
    },
    {
      "verse": "7:92",
      "similarity": 0.3733752557798612
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007088.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007088.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:88.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}