{
  "chapter": "الأعراف",
  "text": "ومن خفت موزينه فاو۟لئك الذين خسروا۟ انفسهم بما كانوا۟ بـايتنا يظلمون",
  "translations": [
    {
      "translation": "And those whose (deeds) are lighter in the scale shall perish for violating Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and those whose scales are light will be the losers, for they, are the ones who have been unjust to Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those whose bad deeds weigh heavier, they will lose their souls for their injustice to Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those whose scales are light are the people who put themselves to ruin – the recompense of the injustice they used to do to Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those whose scale will be light, they are those who will lose themselves for their wrongful behavior with Our Ayat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for him whose measure (of good deeds) is light those are they who have made their souls suffer loss because they disbelieved in Our communications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and he whose scales are light -- they have lost their soul for wronging Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those whose scale is light: those are they who lose their souls because they used to wrong Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and those whose good deeds are light [in the balance] will be the ones who have lost themselves because they wrongfully rejected Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosesoever balances will be light - those are they who have lost themselves in respect of Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those whose deeds weigh light in the scales—it is they who have ruined their souls, because they used to wrong Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whose scale will be light, will be their souls in perdition, for that they wrongfully treated Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those whose scale will be light, they are those who will lose their ownselves (by entering Hell) because they denied and rejected Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but he whose scales are light those have lost their souls because they were harmful towards Our verses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those whose weights are light—it is they who have lost their souls, because they used to mistreat Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those whose scales are light - they are the ones who will lose themselves for what injustice they were doing toward Our verses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:9] And as for those whose scales are light, because of evil deeds, those are the ones who have lost their souls, by causing them to travel towards the Fire, because they mistreated, they [knowingly] denied, Our signs.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And as for those whose scale is light) with good deeds: (those are they who lose their souls) by being punished (because they disbelieved Our revelations) Muhammad (pbuh) and the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَنْ خَفَّتْ مَوَازِينُهُ } بقلة الطاة وكثرة المعاصي { فَأُوْلَـۤئِكَ } الأشقياء المردودون هم { ٱلَّذِينَ خَسِرُوۤاْ أَنْفُسَهُم } وما ربحوا لها في دار الابتلاء { بِمَا كَانُواْ } أي: بسبب ما كانوا { بِآيَاتِنَا } الدالة على توحيدنا { يِظْلِمُونَ } [الأعراف: 9] يكذبونها ظلماً وعداوناً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}