{
  "chapter": "الأعراف",
  "text": "وقال الملا الذين كفروا۟ من قومه لئن اتبعتم شعيبا انكم اذا لخسرون",
  "translations": [
    {
      "translation": "The chiefs among his people who did not believe said (to them): \"If you follow Shu'aib and his way you will surely be ruined.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The elders of his people who disbelieved said: 'Should you follow Shu'ayb, you will be utter losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A group of the unbelievers among his people told the others, \"If you follow Shu'ayb, you will certainly lose a great deal.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the disbelieving leaders of his people said, “If you obey Shuaib, you will indeed be in a loss.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chiefs of those who disbelieved among his people said (to their people): \"If you follow Shu`ayb, be sure then you will be the losers!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the chiefs of those who disbelieved from among his people said: If you follow Shu'aib, you shall then most surely be losers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said the Council of those of his people who disbelieved, 'Now, if you follow Shuaib, assuredly in that case you will be losers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the chieftains of his people, who were disbelieving, said: If ye follow Shu'eyb, then truly ye shall be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The leading men of his people who were bent on denying the truth, said, \"If you follow Shu'ayb, you will certainly be the losers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the chiefs of those who disbelieved amongst his people said: should ye follow Shu'aib, lo! verily ye will be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The elite of his people who were faithless said, ‘If you follow Shu'ayb, you will indeed be losers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The leaders, the unbelievers among his people, said: \"If ye follow Shu'aib, be sure then ye are ruined!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chiefs of those who disbelieved among his people said (to their people): \"If you follow Shu'aib, be sure then you will be the losers!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the unbelieving assembly of his nation said: 'If you follow Shu'aib, you shall assuredly be losers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The elite of his people who disbelieved said, “If you follow Shuaib, you will be losers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said the eminent ones who disbelieved among his people, \"If you should follow Shu'ayb, indeed, you would then be losers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:90] Said the council of those of his people who disbelieved, that is, some said to others: ‘Verily if (la-in: the lām is for oaths) you follow Shu‘ayb, you shall indeed be losers’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But the chieftains of his people, who were disbelieving, said) to the lowly among people: (If ye follow Shu'ayb) in his religion, (then truly you shall be the losers) ignorant and duped. 167\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن حسن محاورة شعيب عليه السلام مع أمته ومجاملته معه لقب بالخطيب بين الأنبياء\n\n\n\n\n{ وَ } بعدما سمعوا منه ما سمعوا { قَالَ ٱلْمَلأُ ٱلَّذِينَ كَفَرُواْ مِن قَوْمِهِ } لمتابعيهم ترهيباً وتهديداً على وجه المبالغة والتأكيد: والله { لَئِنِ ٱتَّبَعْتُمْ شُعَيْباً } عليه السلام وآمنتم له وسمعتم قوله في ترك البخس والتطفيف { إِنَّكُمْ إِذاً لَّخَاسِرُونَ } [الأعراف: 90] في بضاعتكم ومعاملتكم، ثم لما بالغوا في الضلال والإضلال استحقوا الانتقام والنكال\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقال الملأُ الذين كفروا من قومه لئن اتبعتُم شعيبًا } وتركتم دينكم { إنكم إذًا } أي: إذا اتبعتموه { لخاسرون } لاستبدالكم ضلالته بهداكم، أو لفوات ما يحصل لكم من البخس والتطفيف",
      "translations": []
    }
  ]
}