{
  "chapter": "الأعراف",
  "text": "الذين كذبوا۟ شعيبا كان لم يغنوا۟ فيها الذين كذبوا۟ شعيبا كانوا۟ هم الخسرين",
  "translations": [
    {
      "translation": "As for those who denied Shu'ayb, it was as if they had never lived there. It was the people who denied Shu'ayb who were the lost.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They who called Shu'aib a liar (disappeared) as though they had never existed; and those who called Shu'aib a liar were the ones who were ruined!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who had charged Shu'ayb with lying became as though-they had never lived there; it is they who became utter losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who called Shu'ayb a liar were destroyed as though they never existed. They certainly were the ones to lose a great deal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As if those who denied Shoaib had never lived in those homes; those who denied Shoaib, were themselves ruined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who belied Shu`ayb, became as if they had never dwelt there (in their homes). Those who belied Shu`ayb, they were the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who called Shu'aib a liar were as though they had never dwelt therein; those who called Shu'aib a liar, they were the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who cried lies to Shuaib, as if never they dwelt there; those who cried lies to Shuaib, they were the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who denied Shu'eyb became as though they had not dwelt there. Those who denied Shu'eyb, they were the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who had denied Shu'ayb became as though they had never lived there. Those who denied Shu'ayb, were themselves the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who belied Shu'aib became as though they had never dwelt therein; those who belied Shu'aib, it is they who became the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who impugned Shu'ayb became as if they had never lived there. Those who impugned Shu‘ayb were themselves the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The men who reject Shu'aib became as if they had never been in the homes where they had flourished: the men who rejected Shu'aib - it was they who were ruined!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who belied Shu'aib, became as if they had never dwelt there (in their homes). Those who belied Shu'aib, they were the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It seemed as if those who had belied Shu'aib had never lived there. Those who belied Shu'aib were the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who rejected Shuaib—as if they never prospered therein. Those who rejected Shuaib—it was they who were the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who denied Shu'ayb - it was as though they had never resided there. Those who denied Shu'ayb - it was they who were the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:92] Those who denied Shu‘ayb (alladhīna kadhdhabū Shu‘ayban, this constitutes the subject [of the sentence], the predicate of which is [introduced by the following ka-an, ‘as if’]), it is as if (ka-an, has been softened, its subject omitted, in other words [understand it as] ka-annahum) they had never dwelt, [never] had residence, there, in those dwelling-places of theirs; those who denied Shu‘ayb, they were the losers (the emphasis effected by the repetition of the relative clause [alladhīna kadhdhabū Shu‘ayban, ‘those who denied Shu‘ayb’] and what follows it is intended as a refutation of what they had said previously [sc. ‘if you follow Shu‘ayb, you shall indeed be losers’]).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who denied Shu'ayb) were destroyed and (became as though they had not dwelt there. Those who denied Shu'ayb, they were the losers) in that they were punished.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كَأَن لَّمْ يَغْنَوْاْ فِيهَا } معناهُ لَّمْ يَنزِلُوا، وَلم يَعِيشوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { ٱلَّذِينَ كَذَّبُواْ شُعَيْباً كَأَن لَّمْ يَغْنَوْاْ فِيهَا } أي: استؤصلوا وانقرضوا إلى حيث صاروا كأن لم يسكنوا ولم يكونوا في تلك الديار أصلاً، بل الحق إن { ٱلَّذِينَ كَذَّبُواْ شُعَيْباً كَانُواْ هُمُ ٱلْخَاسِرِينَ } [الأعراف: 92] المقصورين على الخسران في النشأة الأولى والأخرى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { الذين كذَّبوا شعيبًا كأن لم يَغنَوا فيها } أي: استؤصلوا كأنهم لم يقيموا فيها ساعة\n { الذين كذَّبوا شعيبًا كانوا هم الخاسرين } دينًا ودُنيا، بخلاف الذين صدقوه واتبعوه كما زعموا فإنهم الرابحون، ولأجل التنبيه على هذا والمبالغة فيه كرر الموصول، واستأنف الجملتين وأتى بهما اسميتين\n\n",
      "translations": []
    }
  ]
}