{
  "chapter": "الأعراف",
  "text": "فتولى عنهم وقال يقوم لقد ابلغتكم رسلت ربى ونصحت لكم فكيف ءاسى على قوم كفرين",
  "translations": [
    {
      "translation": "So he turned away from them and said, 'My people, I transmitted My Lord's message to you and gave you good counsel. Why should I grieve for a kafir people?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Shu'aib turned away from them and said: \"O people, I conveyed to you the message of my Lord, and warned you. (But you paid no heed). How can I grieve for a people who do not believe?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shu'ayb then departed from his people, and said: 'O my people! Surely I conveyed to you the message of my Lord, and gave you sincere advice. How, then, can I mourn for a people who refuse to accept the truth?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He turned away from them saying, \"My people, I preached the Message of my Lord to you and gave you good advice. How could I be sorry for the unbelievers?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Shoaib turned away from them saying, “O my people! Indeed I did deliver my Lord’s message to you and gave you sound advice; so why should I grieve for the disbelievers?” (The people in the graves can hear the speech of those who are on earth.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he (Shu`ayb) turned from them and said: \"O my people! I have indeed conveyed my Lord's Messages unto you and I have given you good advice. Then how can I grieve over people who are disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he turned away from them and said: O my people! certainly I delivered to you the messages of my Lord and I gave you good advice; how shall I then be sorry for an unbelieving people?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he turned his back on them, and said, 'O my people, I have delivered to you the Messages of my Lord, and advised you sincerely; how should I grieve for a people of unbelievers?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he turned from them and said: O my people! I delivered my Lord's messages unto you and gave you good advice; then how can I sorrow for a people that rejected (truth)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he turned away from them, saying, \"My people, I delivered my Lord's messages to you and gave you sincere advice, so why should I grieve for people who refused to believe?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he turned from them, and said: my people! assuredly I delivered unto you the messages of my Lord, and counselled you good; how then should I lament over an unbelieving people?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he abandoned them [to their fate] and said, ‘O my people! Certainly, I communicated to you the messages of my Lord, and I was your well-wisher. So how should I grieve for a faithless lot?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Shu'aib left them, saying: \"O my people! I did indeed convey to you the messages for which I was sent by my Lord: I gave you good counsel, but how shall I lament over a people who refuse to believe!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he (Shu'aib) turned from them and said: \"O my people! I have indeed conveyed my Lord's Messages unto you and I have given you good advice. Then how can I sorrow for the disbelieving people's (destruction).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He turned away from them saying: 'I conveyed to you, my nation, the messages of my Lord and advised you. How can I grieve for the unbelieving nation'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he turned away from them, and said, “O my people, I have delivered to you the messages of my Lord, and I have advised you, so why should I grieve over a disbelieving people?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he turned away from them and said, \"O my people, I had certainly conveyed to you the messages of my Lord and advised you, so how could I grieve for a disbelieving people?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:93] So he turned back on them, and said, ‘O my people, I have conveyed to you the Messages of my Lord and advised you sincerely, but you believe not: so why should I grieve for a disbelieving people?’ (the interrogative is meant [rhetorically] as a negation).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So he turned from them) he departed from them before they were destroyed (and said: my people! I delivered my Lord's messages unto you) by explaining the commands and prohibitions (and gave you good advice) I warned you of Allah's torment and invited you to repent and believe; (then how can I sorrow for a people that rejected) Allah and therefore were destroyed?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَكَيْفَ آسَىٰ } معناهُ أَحْزنُ وأَتوجعُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {So how could I grieve} - this means that I am sad and in pain.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَتَوَلَّىٰ عَنْهُمْ } شعيب عليه السلام بعدما شاهد حالتهم واستحقاقهم للعذاب { وَقَالَ } متأسفاً متحزناً على مقتضى شفقته\n مضيفاً لهم إلى نفسه: { يٰقَوْمِ } المنهمكين في الغفلة المبالغين في الإصرار والاستكبار { لَقَدْ أَبْلَغْتُكُمْ رِسَـٰلَـٰتِ رَبِّي } حتى لا يلحق بكم ما لحق { وَنَصَحْتُ لَكُمْ } بإذنه سبحانه وبالغت في نصحي\n فلم تقبلوا مني نصحي ولم تصدقوا قولي\n ثم كذب هواجس نفسه وأنكر عليها\n خوفاً من غضب الله\n فقال: { فَكَيْفَ ءَاسَىٰ } أتحزن { عَلَىٰ قَوْمٍ } كانوا { كَٰفِرِينَ } [الأعراف: 93] لنعم الحق مكذبين لأوامره مستحقين لما نزل عليها بسوء معاملتهم مع الله بعد ورود ما ورد من الوعد والوعيد؟",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:21",
      "similarity": 0.6026716252642464
    },
    {
      "verse": "60:6",
      "similarity": 0.5881036551161591
    },
    {
      "verse": "7:79",
      "similarity": 0.5818109458222793
    },
    {
      "verse": "7:68",
      "similarity": 0.5541697517300657
    },
    {
      "verse": "7:62",
      "similarity": 0.5510302109230689
    }
  ]
}