{
  "chapter": "الأعراف",
  "text": "ثم بدلنا مكان السيئة الحسنة حتى عفوا۟ وقالوا۟ قد مس ءاباءنا الضراء والسراء فاخذنهم بغتة وهم لا يشعرون",
  "translations": [
    {
      "translation": "Then We gave them good in exchange for evil until they increased in number and said, 'Our forefathers too underwent both hardship and ease.' Then We seized them suddenly when they were not expecting it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when We changed hardship to ease, and they rose and prospered, (they forgot Our favours) and said: \"Our ancestors had also known suffering and joy.\" So We caught them unawares.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We changed adversity into ease until they throve and said: 'Our forefathers had also seen both adversity and prosperity.' So We suddenly seized them without their even perceiving it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We then replaced their misfortune with well-being until they were relieved and began saying, \"Our fathers had also experienced good and bad days.\" Suddenly, We struck them (with torment) while they were all unaware (of what was happening).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We changed the misfortune into prosperity to the extent that they became numerous and said, “Indeed grief and comfort did reach our ancestors” – so We seized them suddenly in their neglect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We changed the evil for the good, until they `Afaw (increased), and said: \"Our fathers were touched with evil and with good.\" So We seized them all of a sudden while they were unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We gave them good in the place of evil until they became many and said: Distress and happiness did indeed befall our fathers. Then We took them by surprise while they did not perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then We gave them in the place of evil good, till they multiplied, and said, 'Hardship and happiness visited our fathers.' So We seized them suddenly, unawares.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then changed We the evil plight for good till they grew affluent and said: Tribulation and distress did touch our fathers. Then We seized them unawares, when they perceived not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and then We changed their hardship into ease until they grew affluent and said, \"Our fathers had also experienced adversity and prosperity,\" then We seized them suddenly, unawares.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter We substituted ease in place of adversity until they abounded and said: even Thus tribulation and prosperity touched our fathers. Then We laid hold of them of a sudden, while they perceived not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We changed the ill [conditions] to good until they multiplied [in numbers] and said, ‘Adversity and ease befell our fathers [too].’ Then We seized them suddenly while they were unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We changed their suffering into prosperity, until they grew and multiplied, and began to say: \"Our fathers (too) were touched by suffering and affluence\"... Behold! We called them to account of a sudden, while they realised not (their peril).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We changed the evil for the good, until they increased in number and in wealth, and said: \"Our fathers were touched with evil (loss of health and calamities) and with good (prosperity, etc.).\" So We seized them of a sudden while they were unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We changed evil for good, until they multiplied and said: 'Our fathers were indeed touched by misfortune and adversity' So We seized them suddenly while they were unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We substituted prosperity in place of hardship. Until they increased in number, and said, “Adversity and prosperity has touched our ancestors.” Then We seized them suddenly, while they were unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We exchanged in place of the bad [condition], good, until they increased [and prospered] and said, \"Our fathers [also] were touched with hardship and ease.\" So We seized them suddenly while they did not perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:95] Then We gave them in place of evil, the chastisement, good, wealth and health, until they multiplied, and said, out of ingratitude towards this grace: ‘Hardship and happiness befell our fathers before’, just as it has befallen us, and this is nothing but the habit of time, and not the consequence of God, so remain firm in what you follow. God, exalted be He, says: So We seized them, with the chastisement, suddenly, while they perceived not, beforehand the time of its coming.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then changed We the evil plight for good) We replaced drought and lack of fruit with fertility, abundance and comfort (till they grew affluent and said: Tribulation and distress did touch our fathers) as they have touched us, but they held firm to their religion. We are just like them and their example we shall follow. (Then We seized them unawares) with torment, (when they perceived not) the descent of such a torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ بَدَّلْنَا مَكَانَ ٱلسَّيِّئَةِ ٱلْحَسَنَةَ حَتَّىٰ عَفَوْاْ } فقال زيد بن علي عليهما السَّلامُ: إنَّ السَّيِّئةَ الشّدةُ\n والحَسنةَ مكانُ الرَّخاءِ وحتَّى عَفَوا معناهُ سَرُّوا بِذَلك\n ويقال عَفَوا يعني كَثُروا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {Then We replaced the bad with the good, until they became forgiving} - Zayd ibn Ali said, \"The bad that is severe.\"\n\n\nAnd good deeds are the cause of happiness, and even if people do not realize their meaning, they are still happy with them.\n\n\nThis is said to mean \"they became too numerous.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } بعدما ضيقنا عليهم كشفنا عنهم بأن { بَدَّلْنَا مَكَانَ ٱلسَّيِّئَةِ } المضرة المؤلمة { ٱلْحَسَنَةَ } النافعة المسرة { حَتَّىٰ عَفَوْاْ } إلى أن كثروا وتكاثروا عَداداً وعدُداً { وَّقَالُواْ } بعدما صاروا مترفهين في سعة ورخاء مكان شكر وإظهار المنة منَّا: { قَدْ مَسَّ } ولحق { آبَاءَنَا } كما لحقنا { ٱلضَّرَّآءُ وَٱلسَّرَّآءُ } ومن عادة الزمان وديدنة الدهر تعاقب السراء بالضراء والجدب بالرخاء\n ومتى ظهر منهم كفكران النعم وعدم الرجوع إلينا بالشكر { فَأَخَذْنَاهُمْ بَغْتَةً } فجأة بلا سبق مقدمة وتقديم أمارة { وَهُمْ } حينئذ من غاية عمههم وسكرتهم { لاَ يَشْعُرُونَ } [الأعراف: 95] نزول العذاب والنكال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { وما أرسلنا في قرية من نبي } أي: رسول { إلا أخذنا أهلها بالبأساء والضراء } أي: بالبؤس والضر، كالقحط والأمراض، { لعلهم يضَّرَّعون } أي: يتضرعون ويتذللون، { ثم بدَّلنا مكانَ } الحالة { السيئةِ } الحالة { الحسنةَ } أي: أعطيناهم، بدل ما كانوا فيه من البلاء والشدة، السلامة والسعة، { حتى عَفَوا }: كثروا عَددًا وعُددًا، يقال: عفا النبات: إذا كثر، ومنه:\n\n \" اعفُو اللِّحى \" \n\n{ وقالوا قد مسَّ آباءنا الضراءُ والسراءُ } كُفرًا لنعمة الله عليهم، ونسيانًا لذكره، واعتقادًا بأنه من عادة الدهر يتعاقب في الناس بين السراء والضراء، فقد مس آباءنا منه شيء مثل ما مسنا، { فأخذناهم بَغتةً }: فجأة { وهم لا يشعرون } بنزول العذاب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:202",
      "similarity": 0.5710158492973374
    },
    {
      "verse": "39:55",
      "similarity": 0.5592967836827072
    },
    {
      "verse": "43:66",
      "similarity": 0.5064196440781691
    },
    {
      "verse": "29:53",
      "similarity": 0.47466709887023795
    },
    {
      "verse": "12:107",
      "similarity": 0.4744594701174817
    }
  ]
}