{
  "chapter": "الأعراف",
  "text": "اوامن اهل القرى ان ياتيهم باسنا ضحى وهم يلعبون",
  "translations": [
    {
      "translation": "Or do the people of the cities feel secure against Our violent force coming down on them in the day while they are playing games?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, are the people of the towns so unafraid that (even when) Our retribution comes upon them in the hours of the morning they remain engrossed in sport and play?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, do the people of those towns feel secure that Our punishment will not come to them by daylight while they are at play?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or that which could seize them during their busy hours of the day?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do the people of the dwellings not fear that Our wrath may come upon them during the day, while they are playing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, did the people of the towns then feel secure against the coming of Our punishment in the forenoon while they were playing\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! do the people of the towns feel secure from Our punishment coming to them in the morning while they play?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the people of the cities feel secure Our might shall not come upon them in daylight while they are playing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or are the people of the townships then secure from the coming of Our wrath upon them in the daytime while they play?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, do they feel secure against the coming of Our punishment upon them in the forenoon while they are at play?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, are the people of the township secure that Our wrath would not come upon them by daylight while they are disporting themselves?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the people of the towns feel secure from Our punishment overtaking them at midday while they are playing around?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or else did they feel secure against its coming in broad daylight while they played about (care-free)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, did the people of the towns then feel secure against the coming of Our Punishment in the forenoon while they play?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do the inhabitants of the villages feel secure from Our Might coming to them in the midmorning while they play?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do the people of the towns feel secure that Our might will not come upon them by day, while they play?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or did the people of the cities feel secure from Our punishment coming to them in the morning while they were at play?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:98] Or, do the people of the towns feel secure from the coming of Our might upon them in the daytime while they are playing?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or are the people of the townships then secure from the coming of Our wrath upon them in the daytime while they play) i.e. engaging in falsehood?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوَ أَمِنَ أَهْلُ ٱلْقُرَىٰ } ولم يترقبوا { أَن يَأْتِيَهُمْ بَأْسُنَا ضُحًى } في كمال إضاءة اليوم { وَهُمْ يَلْعَبُونَ } [الأعراف: 98] بأمور دنياهم على مقتضى مخايلهم ومناهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أوَ أمِنَ أهل القرى أن يأتيهم بأسنا } أيضًا { ضُحىً } ضحوة النهار { وهم يلعبون } من فرط الغفلة، أو يشتغلون بما لا ينفعهم، { أفأمِنُوا مكرَ الله } وهو أن يستدرجهم بالنعم حتى يأخذهم بغتة؟ { فلا يأمنُ مكرَ الله إلا القومُ الخاسرون } الذين خسروا أنفسهم، بترك النظر والاعتبار، حتى هلكوا، فلم ينفعهم حينئذٍ الندم\n الإشارة: إظهار المِحَن والمِنَن وتعاقبهما على الإنسان، حكمتها: الرجوع إلى الله، وتضرع العبد إلى مولاه، فمن فعل ذلك كان معتمدًا عليه في الحالتين، مغترفًا من بحر المنة بكلتا اليدين، ومن نزلت به المحن ثم أعقبته لطائف المنن، فلم يرجع إلى مولاه، ولا شكره على ما خوله من نعماه، بل قال: هذه عادة الزمان يتعاقب بالسراء والضراء على الإنسان، فهذا عبد منهمك في غفلته، قد اتسعت دائرة حسه، وانطمست بصيرة قدسه، يصدق عليه قوله تعالى:\n\n[الأعرَاف:179]\n وقال القشيري في قوله تعالى: { ولو أن أهل القرى آمنوا واتقوا\n\n\n } الآية: أي: لو آمنوا بالله واتَّقُوا الشرك { لفتحنا عليهم بركات من السماء والأرض } بأسباب العطاء، فإن سَبَقَ بخلافه القضاء فأبواب الرضا، والرضا أتم من العطاء\n ويقال: ليس العبرة بالنعمة العِبرة بالبركة في النعمة\n هـ\n قوله تعالى: { ولكن كذَّبوا } أي: شكُّوا في هذا الوعد فلم يتقوا بالإيمان والتقوى حتى يتركوا الأسباب، والشاك في الصادق المصدوق مكذب\n وقال الشيخ أبو العباس المرسي رضي الله عنه: للناس أسباب، وسببنا الإيمان والتقوى، ثم تلا هذه الآية: { ولو أن أهل القرى آمنوا واتقوا\n\n\n } الآية، وقد تقدم عند قوله:\n",
      "translations": []
    }
  ]
}