{
  "chapter": "الأعراف",
  "text": "افامنوا۟ مكر الله فلا يامن مكر الله الا القوم الخسرون",
  "translations": [
    {
      "translation": "Do they feel secure against Allah's devising? No one feels secure against Allah's devising except for those who are lost.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can they remain secure against the plan of God? Only they feel secure against the plan of God who are certain of being ruined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they feel secure against the design of Allah None can feel secure against the design of Allah except the utter losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did they consider themselves secure from the retribution of God? No one can have such attitude except those who are lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they oblivious to Allah’s secret plan? So none is unafraid of Allah’s secret plan except the people of ruin!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did they then feel secure against Allah's plan None feels secure from Allah's plan except the people who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! do they then feel secure from Allah's plan? But none feels secure from Allah's plan except the people who shall perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they feel secure against God's devising? None feels secure against God's devising but the people of the lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they then secure from Allah's scheme? None deemeth himself secure from Allah's scheme save folk that perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they feel secure against God's devising? No one feels secure against God's devising except for those doomed to ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are then they secure against the contrivance of Allah? And none feeleth secure against the contrivance of Allah except the people who are losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they feel secure from Allah’s devising? No one feels secure from Allah’s devising except the people who are losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did they then feel secure against the plan of Allah?- but no one can feel secure from the Plan of Allah, except those (doomed) to ruin!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did they then feel secure against the Plan of Allah. None feels secure from the Plan of Allah except the people who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(In reply to your devising) do they feel secure from the devising of Allah? None feels secure from the devising of Allah except the loosing nation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they feel safe from God’s plan? None feel safe from God’s plan except the losing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then did they feel secure from the plan of Allah? But no one feels secure from the plan of Allah except the losing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:99] And so do they feel secure from God’s plotting?, that is, His drawing them on by degrees, through graces, and then seizing them suddenly. None feels secure from God’s plotting but the people who are losers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Are they then secure from Allah's scheme) i.e. Allah's punishment? (None deemeth himself secure from Allah's scheme) Allah's punishment (save folk that perish) the disbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { أَفَأَمِنُواْ } أولئك المنهمكمون في الغفلة { مَكْرَ ٱللَّهِ } المراقب لجميع أحوالهم، ولم يخافوا ولم يحزنوا من أخذه وانتقامه، ولم يتفطنوا أن من أمن عن مكره وأخذه فقد خسر خسراناً مبيناً { فَلاَ يَأْمَنُ مَكْرَ ٱللَّهِ } المنتقم المقتدر { إِلاَّ ٱلْقَوْمُ ٱلْخَاسِرُونَ } [الأعراف: 99] المقصرون على الخسران الأبدي والشقاق السرمدي في أصل فطرتهم وقابلياتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:54",
      "similarity": 0.7433362515903899
    },
    {
      "verse": "71:22",
      "similarity": 0.7294236543317654
    },
    {
      "verse": "27:50",
      "similarity": 0.6392848144759864
    },
    {
      "verse": "6:123",
      "similarity": 0.45975208729895517
    },
    {
      "verse": "13:42",
      "similarity": 0.45175409729606425
    }
  ]
}