{
  "chapter": "عبس",
  "text": "او۟لئك هم الكفرة الفجرة",
  "translations": [
    {
      "translation": "Those are the dissolute kafirun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be the unbelievers, transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These will be the unbelievers, the wicked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These will be the faces of the sinful disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they, the disbelievers, the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such will be the disbelieving, the wicked evil doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who are unbelievers, the wicked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those -- they are the unbelievers, the libertines.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the disbelievers, the wicked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those will be ones who denied the truth and were immersed in iniquity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those! they are the infidels, the ungodly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who are the faithless, the vicious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such will be the Rejecters of Allah, the doers of iniquity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such will be the Kafarah (disbelievers in Allah, in His Oneness, and in His Messenger Muhammad (Peace be upon him), etc.), the Fajarah (wicked evil doers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those, they are the unbelievers, the immoral.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the faithless, the vicious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the disbelievers, the wicked ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[80:42] Those, the people of this predicament, are the disbelievers, the profligates, those who have combined disbelief with profligacy.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those) with such a trait (are the disbelievers) in Allah, (the wicked) the liars against Allah'. And of the surah in which 'when the sun is overthrown' is mentioned, which is all Meccan and consists of 29 verses, 104 words and 533 letters: Surah 81: The Overthrowing [al-Takwir) And of the surah in which 'when the sun is overthrown' is mentioned, which is all Meccan and consists of 29 verses, 104 words and 533 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { أُوْلَـٰئِكَ } البعداء عن ساحة عز القبول، المكدرون بكدورات الكفر والشرك، وأنواع الفسوق والفجور { هُمُ ٱلْكَفَرَةُ ٱلْفَجَرَةُ } [عبس: 42] الخارجون عن مقتضى الحدود الإلهية، ونور المعرفة والإيمان بمتابعة القوى البهيمية من الشهوية والغضبية؛ إذ كلتاهما مناظ عموم الشرور والخسران\n\n\nأعاذنا الله وعموم عباده من شرهما\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها المستنشط القاصد لتبشير الحق وتيسره أن تسمع نداء البشارة والتوفيق الإلهي من ألسنة عموم رسل الله وكتبه، فلك أن تقتفي أثر هؤلاء الكرام، وتمتثل بما في كتاب الله العليم العلام من الأوامر والنواهي، ومطلق الأحكام والعِبر والتذكيرات الموردة فيه، المتعلقة لتهذيب الظاهر والباطن من الميل والإلحاد إلى الأمور المؤدية إلى إفساد العقائد والعناد\n\n\n\n\nفلك الفرار عن أصحاب الزيغ والضلال، والانصراف عن مخالطتهم ومصاحبتهم في كل حال؛ حتى تكون من زمرة أصحاب المتنعمين في جنات النعيم، لا من الضالين المكذبين المخلدين في دركات الجحيم، المعذبين بالعذاب الأليم\n\n\n\n\nنسأل منك يا ذا القوة المتين الفوز بدرجات النعيم، والعوذ عن دركات الجحيم يا من فضله وكرمه عميم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وما فيه من معنى البُعد للإيذان ببُعد درجتهم في السوء، أي: أولئك الموصوفون بسواد الوجوه وغبرتها هم الكفرة { الفجرةُ } أي: الجامعون بين الكفر والفجور، ولذلك جمع الله لهم بين السواد والغبرة\n نسأل الله السلامة والعافية\n الإشارة: فإذا جاءت الصاخة، أي: النفحة الإلهية التي تجذب القلوب إلى الحضرة القدسية فتأنّست القلوب بالله، وفرتْ مما سواه فترى الرجل حين تهب عليه هذه النفحة، بواسطة أو بغير واسطة، يفر من الخلق، الأقارب والأجانب، أُنساً بالله وشُغلاً بذكره، لا يزال هكذا حتى يصل إلى مولاه، ويتمكن من شهوده أيَّ تمكُّن، فحينئذ يخالط الناسَ بجسمه ويفارقهم بقلبه، كما قالت رابعة العدوية رضي الله عنها:\n\nقال القشيري: قالوا: الاستقامة أن تشهد الوقت قيامة، فَما مِن وَلِيًّ وعارفٍ إلاّ وهو اليومَ يَفرُّ بقلبه من الجميع لأنّ لكل شأناً يُغنيه، فالعارفُ مع الخَلْق لا بقلبه، ثم ذكر شعر رابعةُ\n\n\nوقال الورتجبي: أكّد الله أمر نصيحته لعباده ألاّ يعتمدوا إلى مَن سواه في الدنيا والآخرة، وأنَّ ما سواه لا ينقذه مِن قبض الله حتى يفرّ مما دون الله إلى الله\n هـ\n وقال في قوله تعالى: { لكل امرىء منهم يومئذ شأن يُغنيه }: لكل واحدٍ منهم شأن يشغله، وللعارف شأن مع الله في مشاهدته، يُغنيه عما سوى الله\n هـ\n قوله تعالى: { وجوه يومئذ مُسْفِرة ضاحكة مستبشِرة } كل مَن أَسفر عن ليل وجوده ضياءُ نهار معرفته، فوجهه يوم القيامة مُسْفِر بنور الحبيب ضاحك لشهوده، مستبشر بدوام إقباله ورضوانه\n وقال أبو طاهر: كشف عنها سُتور الغفلة، فضحكت بالدنو من الحق، واستبشرت بمشاهدته\n وقال ابن عطاء: أسفر تلك الوجوه نظرُها إلى مولاها، وأضحكها رضاه عنها\n هـ\n قال القشيري: ضاحكة مستبشرة بأسبابٍ مختلفة، فمنهم مَن استبشر بوصوله إلى حبيبه، ومنهم بوصوله إلى الحور، ومنهم، ومنهم، وبعضهم لأنه نظر إلى ربِّه فرأه، ووجوه عليها غبرة الفراقُ، يرهقها ذُلُّ الحجاب والبعاد\n هـ\n قال الورتجبي: { وجوه يومئذ مُسْفِرة } ، وجوه العارفين مُسْفرة بطلوع إسفار صبح تجلِّي جمال الحق فيها، ضاحِكة مِن الفرح بوصولها إلى مشاهدة حبيبها، مستبشرة بخطابه ووجدان رضاه، والعلم ببقائها مع بقاء الله\n ثم وصف وجوه الأعداء والمدّعين فقال: { ووجوه يومئذٍ عليه غبرةُ } الفراقِ يوم التلاق، وعليها قَتر ذل الحجاب، وظلمة العذاب ـ نعوذ بالله من العتاب ـ قال السري: ظاهر عليها حزن البعاد لأنها صارت محجوبة، عن الباب مطرودة، وقال سَهْلٌ: غلب عليها إعراض الله عنها، ومقته إياها، فهي تزداد في كل يوم ظلمة وقترة\n هـ\n اللهم أسفر وجوهنا بنور ذاتك، وأضحكنا وبَشِّرنا بين أوليائك في الدنيا والآخرة، إنك على كل شيء قدير، وصلّى الله على سيدنا محمد وآله وصحبه وسلّم تسليماً\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:1",
      "similarity": 0.9655979978770252
    },
    {
      "verse": "82:3",
      "similarity": 0.7563488191303716
    },
    {
      "verse": "75:5",
      "similarity": 0.7462160612581485
    },
    {
      "verse": "82:14",
      "similarity": 0.6876751533508827
    },
    {
      "verse": "71:27",
      "similarity": 0.6652642051577471
    }
  ]
}