{
  "chapter": "عبس",
  "text": "واما من جاءك يسعى",
  "translations": [
    {
      "translation": "But as for him who comes to you eagerly",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for him who comes to you striving (after goodness),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who comes to you running,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the one who comes to you earnestly (striving for guidance).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for him who came to you striving,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who came to you running,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as to him who comes to you striving hard,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he who comes to thee eagerly\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who cometh unto thee with earnest purpose\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but as for one who comes to you, eagerly\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for him who cometh Unto thee running,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for someone who comes hurrying to you,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as to him who came to thee striving earnestly,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as to him who came to you running.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to him who came to you eagerly\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who came to you seeking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for he who came to you striving [for knowledge]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[80:8] But as for him who comes to you hurrying (yas‘ā is a circumstantial qualifier referring to the subject of [the   verb] jā’a, ‘comes’)\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But as for him who cometh unto thee with earnest purpose) hastening for goodness\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَمَّا مَن جَآءَكَ } من أرباب الطلب والإخلاص { يَسْعَىٰ } [عبس: 8] ويسرع بطلب الخير والهداية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأمّا مَن جاءك يسعى } أي: حال كونه مسرعاً طالباً لِما عندك من أحكام الرشد، وخصال الخير، { وهو يخشى } الله تعالى أو الكفار، أي: أذاهم في إتيانك، أو: الكبوة، أي: السقطة، كعادة العميان، { فأنت عنه تَلَهَّى } تتشاغل، وأصله: تتلهى\n رُوي: أنه صلى الله عليه وسلم ما عبس بعدها في وجه فقير قط، ولا تصدَّى لغَني بعدُ\n { كلاَّ } أي: لا تَعُدْ إلى مثلها\n وحاصل العتاب: ترجيح الإقبال على مَن فيه القبول والأهلية للانتفاع، دون مَن ليس كذلك ممن فيه استغناء، وإن كان قصده عليه السلام صالحاً، ولكن نبَّهه اللّهُ ـ تعالى ـ على طريق الأولى في سلوك الدعوة إليه، وأنّ مظنة ذلك الفُقراء لتواضعهم، بخلاف الأغنياء، لتكبُّرهم وتعاظمهم\n ولذلك لم يتعرض صلى الله عليه وسلم لغَنِي بعدها، ولم يُعرض عن فقير، وكذلك ينبغي لفضلاء أمته من العلماء الدعاة إلى الله، وقد كان الفقراء في مجلس الثوري أُمراء\n ثم قال تعالى: { إِنها تذكرةٌ } موعظة يجب أن يُتعظ بها، ويُعمل بموجبها، وهو تعليل للردع عما ذكر ببيان رتبة القرآن العظيم الذي استغنى عنه مَن تصدّى له، { فمَن شاء ذّكَرَه } أي: فمَن شاء اللّهُ أن يذكره ذكره\n أي: ألهمه الله الاتعاظ به، أو: مَن شاء حفظه واتعظ به، ومَن رغب عنها، كما فعله المستغني، فلا حاجة إلى الاهتمام بأمره\n وذكّر الضمير لأنَّ التذكرة في معنى الذكر والوعظ\n وقال أبو السعود: الضميران للقرآن، وتأنيث الأول لتأنيث خبره، وقيل: الأول للسورة، أو للآيات السابقة، والثاني للتذكرة لأنها في معنى الذكر والوعظ، وليس بذلك فإنَّ السورة والآيات وإن كانت متصفة بما سيأتي من الصفات الشريفة، لكنها ليست مما ألقي على المستغنى عنه، واستحق بسبب ذلك ما سيأتي من الدعاء عليه، والتعجب مِن كفره المفرط، لنزولها بعد الحادثة، وأمّا مَن جَوْز رجوعهما إلى العتاب المذكور، فقد أخطأ وأساء الأدب، وخبط خبطاً يقضي منه العجب، فتأمّل\n هـ\n وحاصِلُ المعنى: أنَّ هذه الآيات ـ أي آيات القرآن ـ تذكرة، فمَن شاء فليتعظ بها، حاصلة { في صُحُفٍ } منتسخة من اللوح، { مُكَرَّمةٍ } عند الله عزّ وجل، { مرفوعةٍ } في السماء السابعة، أو: مرفوعة المقدار والمنزِلة، { مُطَهَّرةٍ } عن مساس أيدي الشياطين، أو: عما ليس من كلام الله تعالى أو: مِن خللٍ في اللفظ أو المعنى، { بأيدي سَفَرَةٍ } أي: كَتَبَة من الملائكة، يستنسخون الكتبَ من اللوح، على أنه جمع: \" سافِرٍ \" ، من السَّفْر، وهو الكتب، وقيل: بأيدي رسل من الملائكة يَسْفِرون بالوحي، بينه تعالى وبين أنبيائه، على أنه جمع \" سفير \" من السِفارة، وحَمْل \" السَفَرة \" على الأنبياء ـ عليهم السلام ـ أو على القُراء، لأنهم يقرؤون الأسفار، أو على الصحابة ـ رضوان الله عليهم ـ بعيد لأنَّ هذه اللفظة مختصة بالملائكة، لا تكاد تُطلق على غيرهم، وقال القرطبي: \" المراد بقوله تعالى في الواقعة:\n\n\n\n[الواقعة:79] هؤلاء السَفَرة \"\n { كِرام } عند الله تعالى، أو: متعطفين على المؤمنين يكلؤونهم ويستغفرون لهم، { بررةٍ } أتقياء، أو: مطيعين لله تعالى، من قولهم: فلان يبر خالقه، أي: يُطيعه، أو: صادقين، من قولهم: برّ في يمينه: صدق\n والله تعالى أعلم\n الإشارة: ينبغي للداعي إلى الله أن ينبسط عند الضعفاء، ويُقبل عليهم بكليته ويواجههم بالبشاشة والفرح، سواء كانوا ضعفاء الأموال، أو ضعفاء الأبدان، كالعُميان والمحبوسين والمرضى، أو: ضعفاء اليقين، إن أقبلوا إليه فقد كان الشيخ أبو العباس المرسي يحتفل بملاقاة أهل العصيان والجبابرة أكثر مِن غيرهم، فقيل له في ذلك، فقال: هؤلاء يأتونا فقراء منكسرين، بخلاف غيرهم من العلماء والصالحين\n قلت: وكذلك رأيتُ حال أشياخنا ـ رضي الله عنهم ـ يَبرون بالجبابرة وأهل العصيان، ليجرُّوهم بذلك إلى الله تعالى، قالوا: يأتينا الرجل سَبُع فنهلس عليه فيرجع ذئباً، ثم نهلس عليه فيرجع قِطاً، ثم نجعل السلسلة في عنقه ونقوده إلى ربه\n نَعَم إن تزاحم حق الفقراء وحق الجبابرة في وقت واحدٍ قدّم حقَّ الفقراء لشرفهم عند الله، إلاّ إن كانوا راسخين، فيُقَدِّم عليهم غيرهم لأنهم حينئذ يحبون الإيثار عليهم\n قال الورتجبي: بيَّن الله تعالى هنا ـ يعني في هذه الآية ـ درجةَ الفقر، وتعظيم أهله، وخِسّة الدنيا، وتحقير أهلها، وأنَّ الفقير إذا كان بنعت الصدق والمعرفة والمحبة كان شرفاً له، وهو من أهل الصُحبة، ولا يجوز الاشتغال بصُحبة الأغنياء، ودعوتهم إلى طريق الفقراء، إذا كان سجيتهم لم تكن بسجية أهل المعرفة، فإذا كان حالهم كذلك لا يأتون إلى طريق الحق بنعت التجريد، فالصُحبة معهم ضائعة، إلا ترى كيف عاتب الله نبيَّه بهذه الآية بقوله: { أمّا مَن استغنى\n\n } الآية، كيف يتزكَّى مَن خُلق على جبِلة حب الدنيا والعمى عن الآخرة والعُقبى\n هـ\n ثم دعا على مَ استغنى عن القرآن، فقال: { قُتِلَ ٱلإِنسَانُ مَآ أَكْفَرَهُ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "79:35",
      "similarity": 0.6771488092487803
    },
    {
      "verse": "88:9",
      "similarity": 0.6409227122964097
    },
    {
      "verse": "20:20",
      "similarity": 0.6389657066752031
    },
    {
      "verse": "21:94",
      "similarity": 0.6338056140878469
    },
    {
      "verse": "53:39",
      "similarity": 0.6269614012393128
    }
  ]
}