{
  "chapter": "التكوير",
  "text": "فلا اقسم بالخنس",
  "translations": [
    {
      "translation": "So, I call the receding stars to witness,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No indeed; I swear by the alternating stars\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I do not need to swear by the orbiting\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So by oath of those that revolve. (The planets.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But nay! I swear by Al-Khunnas.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But nay! I swear by the stars,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No! I swear by the slinkers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Oh, but I call to witness the planets,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I swear by the receding stars,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I swear by the receding stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So I swear by the stars that return,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So verily I call to witness the planets - that recede,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So verily, I swear by the planets that recede (i.e. disappear during the day and appear during the night).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather, I swear by the returning\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I swear by the galaxies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So I swear by the retreating stars -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[81:15] So I swear (fa-lā: lā is extra) by the receding [planets],\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Oh, but I call to witness) He says: I swear by (the planets) which appear at night and disappear during the day,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلاَ أُقْسِمُ بِٱلْخُنَّسِ ٱلْجَوَارِ ٱلْكُنَّسِ } فالخُنَّسُ هي النّجومُ تَخنُسُ بالنّهارِ\n والجَوَارُ الكُنَّسِ: هي النّجومُ، وهي خَمسةُ كَواكبٍ مرجان وزحل وعطارد وبهرام والزهرةُ\n ويقال الجَوَارُ الكُنَّسِ: بقرُ الوَحشِ والظباء\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما عدَّ سبحانه أحوال القيامة وأهوالها أشار إلى ما يدل على التأكيد والمبالغة في وقوعها فقال: { فَلاَ أُقْسِمُ } أي: لا حاجة إلى القسم؛ لإثبات هذه المذكورات؛ إذ هي في غاية السهولة والظهور عند القدرة الغالبة الإلهية، بل أقسم { بِٱلْخُنَّسِ } [التكوير: 15] أي: بالنفوس الزكية عن لوث الناسوت، الراجعة إلى عالم اللاهوت، وحضرة الرحموت قبل قيام الساعة؛ لصفاء مشربها، ونظافة طينتها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { فلا أُقسم } ، \" لا \" صلة، أي: أُقسم { بالخُنَّس } أي: بالكواكب الرواجع، مِن: خَنَس إذا تأخر، وهي ما عدا النيرين من الدراريّ الخمسة، وهي: بهرام [المريخ]، وزحل وعطارد، والزُّهرة، والمشتري، فترى النجم في آخر البرج إذا كرَّ راجعاً إلى أوله، { الجَوَارِ } أي: السيّارة { الكُنَّس } أي: المستترة، جمع كانس وكانسة، وذلك أنَّ هذه النجوم تجري مع الشمس والقمر، وترجع حتى تخفى تحت ضوء الشمس، فخنوسها: رجوعها، وكنوسها: اختفاؤها تحت ضوئها، من كُنس الوحش: إذا دخل كناسه، أي: بيته الذي يتخذه من أغصان الشجر، وقيل: هي جميع الكواكب، تختنس بالنهار، فتغيب عن العيون، وتكنس بالليل، أي: تطلع في أماكنها\n { والليلِ إِذا عسعس } أقبل بظلامه، أو: أدبر، فهو من الأضداد، وقال الفراء: أجمع المفسرون على أن معنى عسعس: أدبر، تقول العرب: عسعس الليل وسَعْسع: إذا أدبر ولم يبقَ منه إلاّ اليسير، قال الشاعر:\n\nوالحاصل: أنهما يرجعان إلى شيء واحد، وهو ابتداء الظلام في أوله وإدباره في آخره، { والصبح إّذا تنفس } امتدّ ضوؤه وارتفع حتى يصير نهاراً، ولمّا كان إقبال النهار يلازمه الروح والنسيم جعل ذلك نفساً له مجازاً، فقيل: تنفس الصبح\n وجواب القسم: { إِنه } أي: القرآن { لقولُ رسولٍ كريم } على ربه، وهو جبريل عليه السلام ـ قاله عن الله ـ عزّ وجل، وإنما أضيف القرآن إليه لأنه هو الذي نزل به\n { ذي قوةٍ } ذي قدرة على ما كلف به، لا يعجز عنه ولا يضعف، { عند ذي العرش مكينٍ } أي: عند الله ذا مكانة رفيعة ورتبة عالية، ولمّا كانت المكانة على حسب حال الممكن قال: { عند ذي العرش } ليدل على عظم منزلته ومكانته، والعندية: عندية تشريف وإكرام، لا عندية مكان\n { مطاعٍ ثَمَّ } أي: في السموات يُطيعه مَن فيها، أو عند ذي العرش تُطيعه ملائكتُه المقربون، يصدون عن أمره، ويرجعون إليه، وقال بعضهم: ومن طاعتهم له: فتحوا أبواب السموات ليلة المعراج باستفتاحه لرسول الله صلى الله عليه وسلم وفتح خزنةُ الجنة الجنةَ لمحمدٍ حتى دخلها، وكذا النار حتى نظر إليها\n هـ\n { أمين } على الوحي\n { وما صاحِبُكم } هو الرسول صلى الله عليه وسلم { بمجنونٍ } كما تزعم الكفرة، وهو عطف على جواب القسم، مدخول في المقسَم عليه، { ولقد رآه } أي: رآى محمدٌ صلى الله عليه وسلم جبريلَ على صورته التي خلقه اللهُ عليها، { بالأُفق المبين } أي: بمطلع الشمس الأعلى، وقال ابن عباس: قال النبي صلى الله عليه وسلم لجبريل:\n\n \" إني أُحب أن أراك في الصورة التي تكون عليها في السماء \" \n\nقال: أتقدر على ذلك؟ قال: \" بلى \" قال: فأين تشاء؟ قال: \" بالأبطح \" ، قال: لا يسعني، قال: \" بمِنىً \" ، قال: لا يسعني، قال: \" فبعرفات \" قال: ذلك بالحري أن يسعني، فواعده، فخرج النبي صلى الله عليه وسلم للوقت، فإذا هو قد أقبل من جبال عرفات بخشخشة وكلكلة، قد ملأ ما بين المشرق والمغرب، ورأسه في السماء، ورجلاه في الأرض، فلما رآه النبيُّ صلى الله عليه وسلم خرّ مغشيًّا عليه، فتحوّل جبريلُ في صورته، فضمّه إلى صدره، وقال: لا تخف، فكيف لو رأيت إسرافيل ورأسه من تحت العرش، ورجلاه في التخوم السابعة، وإنَّ العرش لعلى كاهله، وإنه ليتضاءل أحياناً من مخافة الله تعالى حتى يصير مثل الوصع أي: العصفورـ حتى ما يحمل عرش ربك إلاّ عظمته\n\n\nهـ\n أو: ولقد رأى جبريلَ عليه السلام ليلة المعراج\n أو: لقد رآى ربه، وكان محمد صلى الله عليه وسلم بالأُفق الأعلى\n { وما هو على الغيبِ } أي: وما محمد على الوحي، وما يخبر به من الغيوب { بضنين } ببخيل،على قراءة الضاد، من: ضنَّ بكذا: بخل به، أي: لا يبخل بالوحي كما يبخل الكهان رغبة في الحُلْوان، بل يُعلّمه لكل مَن يطلبه ولا يكتم شيئاً منه، أو: بمتهم على قراءة: المشالة، من الظنة وهي التهمة، أي: لا ينقص شيئاً مما أوحى إليه أو يزيد فيه، { وماهو بقول شيطان رجيم } طريد، وهو كقوله:\n\n[الشعراء:210] أي: ليس هو بقول المسترقة للسمع، وهو نفي لقولهم: إنه كهانة أو سحر\n { فأين تذهبون } وتتركون الحقَّ الواضح؟ وهو استضلال لهم، كما يقال لتارك الجادة وذهب في التيه: أين تذهب، مُثَّلت حالهم في تركهم الحقّ، وعدولهم عنه إلى الباطل، بمَن ترك طريق الجادة، وسلك في غير طريق\n وقال الزجاج: معناه: فأيُّ طريق تسلكون أبين من هذه الطريقة التي بيَّنْتُ لكم؟ وقال الجنيد: فأين تذهبون عنا، وإن من شيء إلاَّ عندنا: هـ\n والفاء لترتيب ما بعدها على ما قبلها، أي: لظهور أنه وحي مبين، وليس مما يقولون في شيء فأين تذهبون عنه؟ { إِن هو إِلاّ ذِكْرٌ للعالَمين } أي: موعظة وتذكير للخلق { لمَن شاء منكم }: بدل من العالمين بإعادة الجار، { إن يستقيم }: مفعول \" شاء \" أي: القرآن تذكير وموعظة لمَن شاء الاستقامة، يعني: إن الذي شاؤوا الاستقامة بالدخول في الإسلام هم المنتفعون بالذكر، فكأنه لم يوعظ به غيرهم، { وما تشاؤون } الاستقامة { إِلاّ أن يشاء الله }\n ولمّا نزل قوله تعالى: { لمَن شاء منكم أن يستقيم } قال أبو جهل: الأمر إلينا، إن شئنا استقمنا، وإن شئنا لم نستقم، فأنزل الله تعالى: { وما تشاؤون إِلاّ أن يشاء الله رب العالمين } أي: مالك الخلق ومربيهم أجمعين، قال ابن منبه: قرأت بضعاً وثمانين كتاباً مما أنزل الله، فوجدتُ فيها: مَن جعل لنفسه شيئاً من المشيئة فقد كفر\n\n\nوقال الواسطي: أعجزك في جميع أوصافك، فلا تشاء إلاّ بمشيئته، ولا تعمل إلاّ بقوته، ولا تطيع إلاّ بفضله، ولا تعصي إلاّ بخذلانه، فماذا يبقى لك، وبماذا تفتخر من أفعالك، وليس لك منها شيء؟\n هـ\n وقال الطيبي عن الإمام: إنَّ مشيئة الاستقامة موقوفة على مشيئة الله لأن مشيئة العبد محدثة، فلا بد لحدوثها من مشيئة أخرى، ثم قال: وقول المعتزلة: إن هذه المشيئة مخصوصة بمشيئة القهر والإلجاء ضغيف لأنَّا بيَّنَّا أنّ المشيئة الاختيارية حادثة، ولا بد من محدث يحدثها\n هـ\n الإشارة: فلا أُقسم بالخُنَّس الحواس الخمس، وهي: السمع والبصر والشم والذوق والوجدان الباطني، فإنها تخنس، أي: تتأخر عند سطوع حلاوة الشهود، وهي الجوار الكُنَّس لأنها تجري في تحصيل هواها عند الغفلة أو الفترة، وتستتر عند الذكر أو اليقظة، والليل إذا عسعس، أي: ليل القطيعة إذا أظلم على العبد برؤية وجوده ووقوفه مع عوائده، والصُبح، أي: صُبح الاستشراف على نهار المعرفة، إذا تنفَّس ثم تطلع شمسه شيئاً فشيئاً، إنه، أي: الوحي الإلهامي لَقَولُ رسول كريم واراد رباني، ذي قوة لأنه يأتي من حضرة قهّار قوي متين، فلا يُصادم شيئاً من المساوىء إلاّ دمغه، عند ذي العرش مكين، ولذلك تَمَكَّن صاحبه مع الحق، واكتسب مكانة عنده، حيث كان من المقرَّبين السابقين مطاع ثَمَّ أمين لأنّ الوارد الإلهي تجب طاعته لأنه يتجلّى من حضرة الحق، وهو أمين على ما يأتي به من العلوم، وما صاحبكم بمجنون، يعني العارف صاحب الواردات الألهية، ولقد رآه، أي: رأى ربه بعين البصيرة والبصر، بالأُفق المبين، وهو على الأسرار والمعاني، حيث عرج بروحه من عالم الحس إلى عالم المعنى، أو: من عالم الأشباح إلى عالم الأرواح، وما هو على الغيب بضنين، أي: ليس العارف الذي يُخبر عن أسرار التوحيد الخاص بمُتَّهَم، ولا بخيل، بل يجود به على مَن يستحقه، وما هو بقول شيطان رجيم، إذ لم يبقَ لهم شيطان حتى يخلط وسوسته بواردات قلوبهم، فأين تذهبون عن اتباع طريقة الموصلة إلى حضرة الحق، إن هو إلا ذكر للعالمين أي: ما جعله الله في كل زمان إلاّ ليُذَكِّر أهل زمانه، لمَن شاء أن يستقيم على طريق العبودية ويفضي إلى مشاهدة الربوبية، ولكن الأمر كله بيد الله، وما تشاؤون إلاّ أن يشاء الله رب العالمين\n اللهم شِئنا بفضلك، واقصدنا بعنايتك، وخصنا برعايتك، واجعلنا ممن سبقت لهم العناية الكبرى، آمين\n وصلّى الله على سيدنا محمد وآله وصحبه أجمعين\n\n",
      "translations": []
    }
  ]
}