{
  "chapter": "التكوير",
  "text": "وما تشاءون الا ان يشاء الله رب العلمين",
  "translations": [
    {
      "translation": "But you will not will unless Allah wills, the Lord of all the Worlds.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Though you cannot desire except as God will, the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but your wishing will not avail unless Allah, the Lord of the Universe, so wishes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, you will not be able to choose anything unless God, Lord of the Universe wills it to be so.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what will you wish, except if Allah wills – the Lord of the Creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you cannot will unless that Allah wills -- the Lord of all that exists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you do not please except that Allah please, the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but will you shall not, unless God wills, the Lord of all Being.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ye will not, unless (it be) that Allah willeth, the Lord of Creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But you cannot will it unless God, the Lord of the Universe, so wills it [to show you that way].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ye shall not will unless it be that Allah, the Lord of the worlds, willeth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but you will not wish unless it is wished by Allah, the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But ye shall not will except as Allah wills,- the Cherisher of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will not, unless (it be) that Allah wills, the Lord of the 'Alamin (mankind, jinns and all that exists).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but you shall not, unless Allah wills, the Lord of all the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But you cannot will, unless God wills—The Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you do not will except that Allah wills - Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[81:29] but you will not [wish], to go straight along the [path of] truth, unless God, the Lord of the Worlds, [of all] creatures, wills, that you should go straight along it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمَا تَشَاءُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ رَبُّ الْعَالَمِينَ (29)يجوز أن تكون تذييلاً أو اعتراضاً في آخر الكلام .ويجوز أن تكون حالاً . والمقصود التكميل والاحتراس في معنى لمن شاء منكم أن يستقيم ، أي ولمن شاء له ذلك من العالمين ، وتقدم في آخر سورة الإنسان قوله تعالى : { إن هذه تذكرة فمن شاء اتخذ إلى ربه سبيلاً وما تشاءون إلا أن يشاء اللَّه إن اللَّه كان عليماً حكيماً } \\[ الإنسان : 29 ، 30 \\] .والفرق بينهما أن في هذه الآية وُصف الله تعالى ب { ربُّ العالمين } وهو مفيد التعليل لارتباط مشيئة من شاء الاستقامة من العالمين لمشيئة الله ذلك لأنه رب العالمين فهو الخالق فيهم دواعيَ المشيئة وأسبابَ حصولها المتسلسلة وهو الذي أرشدهم للاستقامة على الحق ، وبهذا الوصف ظهر مزيد الاتصال بين مشيئة الناس الاستقامة بالقرآن وبين كون القرآن ذكراً للعالمين .وأما آية سورة الإنسان فقد ذيلت : { إنَّ الله كان عليماً حكيماً } \\[ الإنسان : 30 \\] أي فهو بعلمه وحكمته ينوط مشيئته لهم الاستقامة بمواضع صلاحيتهم لها فيفيد أن من لم يشأ أن يتخذ إلى ربه سبيلاً قد حرمه الله تعالى من مشيئته الخير بعلمه وحكمته كناية عن شقائهم .و { ما } نافية ، والاستثناء من مصادر محذوفة دل عليها قوله : { إلا أن يشاء اللَّه } وتقدم بيان ذلك في سورة الإنسان .وفي هذه الآية وآية سورة الإنسان إفصاح عن شرف أهل الاستقامة بكونهم بمحل العناية من ربّهم إذا شاء لهم الاستقامة وهيأهم لها ، وهذه العناية معنى عظيم تحير أهل العلم في الكشف عنه ، فمنهم من تطوح به إلى الجبر ومنهم من ارتمى في وهدة القدر ، ومنهم من اعتدل فجزم بقوة للعباد حادثة يكون بها اختيارهم لسلوك الخير أو الشر فسماها بعض هؤلاء قدرة حادثة وبعضهم سماها كسباً . وحملوا ما خالف ذلك من ظواهر الآيات والأخبار على مقام تعليم الله عبادَه التأدب مع جلاله .وهذا أقصى ما بلغت إليه الأفهام القويمة في مجامل متعارض الآيات القرآنية والأحاديث النبوية . ومن ورائه سلك دقيق يشُدّه قد تقصر عنه الأفهام .\n\n",
      "translations": [
        {
          "translation": "(And ye will not) conform with or believe in Allah's divine Oneness, (unless (it be) that Allah willeth) it for you, (the Lord of Creation) the Lord of all that which has a soul and creeps on the face of the earth, from the inhabitants of the heaven and of the earth'. And of the surah in which the Cleaving is mentioned, which is all Meccan and consists of 19 verses, 80 words and 107 letter: Surah 82: The Cleaving (al-lnfitar) And of the surah in which the Cleaving is mentioned, which is all Meccan and consists of 19 verses, 80 words and 107 letter:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } غاية ما في الباب: إنه { مَا تَشَآءُونَ } وتختارون طريق الهداية والرشاد لأنفسكم { إِلاَّ أَن يَشَآءَ ٱللَّهُ } هدايتكم\n ويوفقكم على الاستقامة والرشاد عنايةً منه وفضلاً\n إذ عموم أفعالكم إنما هي مستندة إلى الله\n صادرة منه سبحانه أصالة\n إذ هو سبحانه { رَبُّ ٱلْعَالَمِينَ } [التكوير: 29] لا مربي في الوجود سواه\n ولا مدِّبر في الشهود إلاَّ هو\n ومقتضى تربيته وتكميله: إرشاد عباده وتوفيقهم إلى ماهو أصلح لهم\n وأليق بحالهم\n\n\nوفقنا بفضلك وجودك بما تحب وترضى أنت عنَّا يا مولانا\n\n\nخاتمة السورة\n\nعليك أيها الطالب لتوفيق الحق\n وتربيته على الوجه الأصلح الأليق أن تفوِّض عموم أمورك\n وأعمالك وأحوالك كلها إلى مشيئة الله\n وتسلمها إليه سبحانه طوعاً ورغبةً بلا توهم تخيير واختيار منك\n وإرادة جزئية أو كلية\n إذ ليس لك من الأمر شيء\n بل الأمور الجارية كلها لله\n وبمقتضى تقديره وقضائه\n وليس لك إلاَّ التسليم والرضا بجميع ما جرى عليك من القضاء\n\n\nوإياك إياك الاغترار بحياة الدنيا\n الفرار الفرار\n وما فيها من المزخرفات الخداعة المكارة\n فإنها دار العتو والاعتبار\n لا منزل الإقامة والقرار\n واللائق بحال الفطن الذكي ألاَّ يتمكن فيها إلاَّ على وجه الضرورة والاضطرار\n ولا على سبيل الرضا والاختيار\n\n\nجعلنا الله ممن تثبه ببطلان الدنيا الدنيَّة وعموم ما فيها\n وعدم ثباتها وقرارها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "76:30",
      "similarity": 0.6591176419052409
    },
    {
      "verse": "37:164",
      "similarity": 0.4938230567402117
    },
    {
      "verse": "68:52",
      "similarity": 0.4660745183998875
    },
    {
      "verse": "81:28",
      "similarity": 0.4583729909987615
    },
    {
      "verse": "21:107",
      "similarity": 0.42367259146587655
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/081029.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/081029.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/81:29.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}