{
  "chapter": "التكوير",
  "text": "وما تشاءون الا ان يشاء الله رب العلمين",
  "translations": [
    {
      "translation": "But you will not will unless Allah wills, the Lord of all the Worlds.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Though you cannot desire except as God will, the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but your wishing will not avail unless Allah, the Lord of the Universe, so wishes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, you will not be able to choose anything unless God, Lord of the Universe wills it to be so.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what will you wish, except if Allah wills – the Lord of the Creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you cannot will unless that Allah wills -- the Lord of all that exists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you do not please except that Allah please, the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but will you shall not, unless God wills, the Lord of all Being.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ye will not, unless (it be) that Allah willeth, the Lord of Creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But you cannot will it unless God, the Lord of the Universe, so wills it [to show you that way].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ye shall not will unless it be that Allah, the Lord of the worlds, willeth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but you will not wish unless it is wished by Allah, the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But ye shall not will except as Allah wills,- the Cherisher of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will not, unless (it be) that Allah wills, the Lord of the 'Alamin (mankind, jinns and all that exists).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but you shall not, unless Allah wills, the Lord of all the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But you cannot will, unless God wills—The Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you do not will except that Allah wills - Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[81:29] but you will not [wish], to go straight along the [path of] truth, unless God, the Lord of the Worlds, [of all] creatures, wills, that you should go straight along it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And ye will not) conform with or believe in Allah's divine Oneness, (unless (it be) that Allah willeth) it for you, (the Lord of Creation) the Lord of all that which has a soul and creeps on the face of the earth, from the inhabitants of the heaven and of the earth'. And of the surah in which the Cleaving is mentioned, which is all Meccan and consists of 19 verses, 80 words and 107 letter: Surah 82: The Cleaving (al-lnfitar) And of the surah in which the Cleaving is mentioned, which is all Meccan and consists of 19 verses, 80 words and 107 letter:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } غاية ما في الباب: إنه { مَا تَشَآءُونَ } وتختارون طريق الهداية والرشاد لأنفسكم { إِلاَّ أَن يَشَآءَ ٱللَّهُ } هدايتكم، ويوفقكم على الاستقامة والرشاد عنايةً منه وفضلاً؛ إذ عموم أفعالكم إنما هي مستندة إلى الله، صادرة منه سبحانه أصالة؛ إذ هو سبحانه { رَبُّ ٱلْعَالَمِينَ } [التكوير: 29] لا مربي في الوجود سواه، ولا مدِّبر في الشهود إلاَّ هو، ومقتضى تربيته وتكميله: إرشاد عباده وتوفيقهم إلى ماهو أصلح لهم، وأليق بحالهم\n\n\n\n\nوفقنا بفضلك وجودك بما تحب وترضى أنت عنَّا يا مولانا\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها الطالب لتوفيق الحق، وتربيته على الوجه الأصلح الأليق أن تفوِّض عموم أمورك، وأعمالك وأحوالك كلها إلى مشيئة الله، وتسلمها إليه سبحانه طوعاً ورغبةً بلا توهم تخيير واختيار منك، وإرادة جزئية أو كلية؛ إذ ليس لك من الأمر شيء، بل الأمور الجارية كلها لله، وبمقتضى تقديره وقضائه، وليس لك إلاَّ التسليم والرضا بجميع ما جرى عليك من القضاء\n\n\n\n\nوإياك إياك الاغترار بحياة الدنيا، الفرار الفرار، وما فيها من المزخرفات الخداعة المكارة، فإنها دار العتو والاعتبار، لا منزل الإقامة والقرار، واللائق بحال الفطن الذكي ألاَّ يتمكن فيها إلاَّ على وجه الضرورة والاضطرار، ولا على سبيل الرضا والاختيار\n\n\n\n\nجعلنا الله ممن تثبه ببطلان الدنيا الدنيَّة وعموم ما فيها، وعدم ثباتها وقرارها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}