{
  "chapter": "التكوير",
  "text": "واذا النفوس زوجت",
  "translations": [
    {
      "translation": "when the selves are arranged into classes,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When souls are reunited (with the bodies)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when the souls shall be rejoined (with their bodies),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "souls are reunited with their bodies,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the souls are paired.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the souls are joined with their mates.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when souls are united,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when the souls shall be coupled,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when souls are reunited,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when the souls are divided into different classes,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the souls he paired,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when the souls are assorted,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the souls are sorted out, (being joined, like with like);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the souls shall be joined with their bodies;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when the souls are coupled (to their body),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the souls are paired.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the souls are paired\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[81:7] and when the souls are coupled, [when they are] paired up with their bodies;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when souls are reunited) in pairs; it is also said this means: when souls are reunited with their companions: the believer with the maiden of Paradise and the disbeliever with Satan; the righteous with the righteous and the sinful with the sinful,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِذَا ٱلنُّفُوسُ زُوِّجَتْ } معناه ضُمَّ إِليها قرناؤُها وأشكالُها ويقالُ: زُوجتْ أي ألقتْ\n ويقال: دُخولُ الأَرواحِ في الأجسادِ\n\n",
      "translations": [
        {
          "translation": "\nAnd when the souls are {joined together}, it means that their generations and their forms are joined together, and it is said: \"She is joined,\" meaning, \"She is cast.\"\n It is said that the souls enter the bodies",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِذَا ٱلنُّفُوسُ } يعني: الأرواح الفائضة على هياكل الأشباح من عالم الأمر الإلهي { زُوِّجَتْ } [التكوير: 7] وقرنت يومئذٍ ببواعثها التي هي الأسماء والصفات الإلهية، والأسباب اللاهوتية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِذا النفوس زُوِّجتْ } أي: قُرنت بأجسادها، أو: قرنت بشكلها، الصالح مع الصالح في الجنة، والطالح مع الطالح في النار، أو: بكتابها، أو بعملها، أو: نفوس المؤمنين بالحُور، ونفوس الكافرين بالشياطين\n { وإِذا الموؤدةُ } أي: المدفونة حية، وكانت العرب تئد البنات مخافة الإملاق، أو لخوف العار بهم من أجلهن، وقيل: كان الرجل إذا وُلد له بنت ألبسها جبة من صوف أو شعر، حتى إذا بلغت ست سنين ذهب بها إلى الصحراء، وقد حفر لها حفرة، فيلقيها فيها، ويهيل عليها التراب\n وقيل: كانت الحامل إذا اقترتب، حفرت حفرة، فتمتخض عليها، فإذا ولدت بنتاً رمت بها، وإذا ولدت ابناً ضَمّته، فإذا كان يوم القيامة { سُئِلَتْ بأيّ ذنبٍ قُتلتْ } ، وتوجيه السؤال لها لتسليتها، وإظهار كمال الغيظ والسخط لوائدها، وإسقاطه عن درجة الخطاب، والمبالغة في تبكيته\n\n\nوفيه دليل على أنَّ أطفال المشركين لا يُعذّبون، وأنَّ التعذيب لا يكون بغير ذنب\n { وإِذا الصُحفُ نُشِرَتْ } أي: صُحف الأعمال، فإنها تُطوى عند الموت وتُنشر عند الحساب، قال صلى الله عليه وسلم:\n\n \" يُحشرُ الناس يوم القيامةِ حُفَاةً عراة \" \n\nفقالت أمُ سلمة: فكيف بالنساء؟! فقال:\n\n \" شُغِل الناسُ يا أم سلمة \" \n\nفقالت: وما شغلهم؟ فقال:\n\n \" نَشْرُ الصُّحُفِ، فيها مثاقيلُ الذرِّ، ومثاقيلِ الخَرْدل \" \n\nوقيل: نُشرت: فُرقت على أصحابها، وعن مرثد بن وَداعة: إذا كان يوم القيامة تطايرت الصُحف من تحت العرش، فتقع صحيفة المؤمن في يده في جنة عالية، وتقع صحيفة الكافرين في يده في سموم وحميم، أي: مكتوب فيها ذلك، وهذه صحف غير الأعمال\n { وإِذا السماءُ كُشِطَتْ } ، قُطعت وأزيلت، كما يُكشط الجلد عن الذبيحة، والغطاء عن الشيء المستور، { وإِذا الجحيمُ سُعِّرتْ } أي: أوقدت إيقاداً شديداً، غضباً على العصاة، { وإِذا الجنة أُزْلِفَتْ } أي: قُربت من المتقين، كقوله تعالى:\n\n[قَ:31]\n عن ابن عباس رضي الله عنه: إن هذه ثِنتا عشرة خصلة، ستٌّ في الدنيا، فيما بين النفختين، وهن من أول السورة إلى قوله تعالى: { وإذا البحار سُجرتْ } على أنَّ المراد بحشر الوحوش: جمعها من كل ناحية، لا حشرها للقصاص، وستٌّ في الآخرة، أي: بعد النفخة الثانية\n والمشهور من أخبار البعث: أنَّ تلك الخصال كلها بعد البعث، فإنَّ الشمس تدنو من الناس في الحشر، فإذا فرغ من الحساب كُوِّرت، والنجوم إنما تسقط بعد انشقاق السماء وطيها، وأمّا الجبال ففيها اختلاف حسبما تقدّم، وأمّا العِشار فلا يتصور إهمالها إلاَّ بعد بعث أهلها\n وقوله تعالى: { علمتْ نفس ما أحضرت }: جواب \" إذا \" ، على أنَّ المراد زمان واحد ممتد، يسع ما في سياقها وسياق ما عطف عليها من الخصال، مبدؤه، النفخة الأولى، ومنتهاه: فصل القضاء بين الخلائق، أي: تيقنت كلُّ نفس ما أحضرت من أعمال الخير والشر، والمراد بحضورها: إمّا حضور صحائفها، كما يُعرب عنه نشرُها، وإمّا حضور أنفسها، على أنها تُشكّل بصورة مناسبة لها في الحُسن والقُبح، وعلى ذلك حمل قوله تعالى:\n\n[التوبة:49، العنكبوت:54]، وقوله تعالى:\n\n[النساء:10]، الآية، وقوله عليه السلام في حق مَن يشرب في آنية الذهب:\n\n \" إنما يُجَرْجرُ في بطنه نار جهنم \" \n\nولا بُعد في ذلك، ألا ترى أنَّ العِلم يظهر في عالم الخيال على صورة اللبن، كما لا يخفى على مَن له خبرة بأحوال الحضرات الخمس، وقد رُوي عن عباس رضي الله عنه أنه قال: \" يُؤتى بالأعمال الصالحة على صورة حسنة، وبالأعمال السيئة على صورة قبيحة، فتوضع في الميزان \" ، وأيًّا ما كان فإسناد إحضارها إلى النفس مع أنها تحضر بأمر الله عزّ وجل، كما نطق به قوله تعالى:\n\n\n\n[آل عمران:30] الآية لأنها لمّا عملتها في الدنيا فكأنها أحضرتها في الموقف، ومعنى علمها بها حنيئذ: أنها تُشاهد جزاءها، خيراً كان أو شرًّا\n الإشارة: اعلم أنَّ النفس والروح والسر أسماء لمسمَّى واحد، وهو اللطيفة اللاهوتية السارية في الأبدان، فما دامت تميل إلى المخالفة والهوى سُميت نفساً، فإذا تطهرت بالتقوى الكاملة سُميت روحاً فإذا تزكّت وأشرقت عليها أسرار الذات سُميت سرًّا، فالإشارة في قوله: { إذا الشمس كُورت } إلى تكوير النفس وطيها، حين انتقلت إلى مرتبة الروح، وإذا النجوم: نجوم علم الرسوم، انكدرت حين أشرقت عليها شمس العرفان، فلم يبقَ منها للعارف إلاّ ما يحتاج إليه من إقامة رسم العبودية، يعني يقع الاستغناء عنها، فإذا تنزل إليها حققها أكثر من غيره، إذا الجبال جبال العقل، سُيرت لأنّ نوره ضعيف كنور القمر مع طلوع الشمس، وإذا العِشارُ عُطلتْ، أي: النفوس الحاملة أثقال الأعمال والأحوال، وأعباء التدبير والاختيار، فيقع الغيبة عنها بأثقالها وإذا الوحوش، أي: الخواطر الردية حُشرتْ وغرقتْ في بحر الأحدية، وإذا البحارُ بحار الأحدية سُجرتْ، أي: فُجرت وانطبقت على الوجود، فصارت بحراً واحداً متصلاً أوله بآخره، وظاهره بباطنه، وإذا النفوس، أي: الأرواح، زُوجتْ بعرائس المعرفة في البقاء بعد الفناء، على سُرر التقريب والاجتباء\n وقال سهل: تآلفت نفس الطبع مع نفس الروح، ففرحت في نعيم الجنة، كما كانتا متآلفتين في الدنيا على إدامة الذكر\n هـ\n وإذا الموؤودة سُئِلَتْ بأيّ ذنبٍ قُتلتْ، أي: فكرة القلوب التي عطلت وأُميتت بحب الدنيا والفناء فيها، حتى انصرفت إلى التفكُّر في خوضها، وتدبير شؤونها، فتُسأل بأي ذنب قُتلت حتى تعطّلت فكرتها في أسرار التوحيد؟ وقال القشيري: هي الأعمال المشوبة بالرياء، المخلوطة بالسمعة والهوى\n هـ\n وإذا الصُحف الواردات الإلهية نُشرتْ على القلوب القدسية، فظهرت أنوارُها على الألسنة بالعلوم اللدنية، وعلى الجوارح بالأخلاق السنية، وإذا السماءُ كُشطتْ، إي سماء الحس تكشطت عن أسرار المعاني، وإذا الجحيم، نار القطيعة، سُعّرتْ لأهل الفرق، وإذا الجنة جنة المعارف، أُزلفت لأهل الجمع والوصال، علمت نفس ما أحضرت من المجاهدة عند كشف أنوار المشاهدة\n وبالله التوفيق\n ثم أقسم تعالى على حقيّة القرآن، فقال: { فَلاَ أُقْسِمُ بِٱلْخُنَّسِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:8",
      "similarity": 0.7202232242629546
    },
    {
      "verse": "51:49",
      "similarity": 0.5008775660857607
    },
    {
      "verse": "37:22",
      "similarity": 0.41820365081220545
    },
    {
      "verse": "56:7",
      "similarity": 0.39657835711190864
    },
    {
      "verse": "75:39",
      "similarity": 0.353746840946267
    }
  ]
}