{
  "chapter": "الإنفطار",
  "text": "يوم لا تملك نفس لنفس شيـا والامر يومئذ لله",
  "translations": [
    {
      "translation": "It is the Day when a self will have no power to help any other self in any way. The command that Day will be Allah's alone.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the day when no soul will have power to do the least for a soul, and God's alone will be done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the Day when no one shall have the power to do anything for another, and all command shall be Allah's.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day, no soul will be of any benefit to any other soul. On that day, all affairs will be in the hands of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day on which no soul will have the authority over any other soul; and on that day, the entire command belongs to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It will be) the Day when no person shall have power for another, and the Decision, that Day, will be with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day on which no soul shall control anything for (another) soul; and the command on that day shall be entirely Allah's.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A day when no soul shall possess aught to succour another soul; that day the Command shall belong unto God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A day on which no soul hath power at all for any (other) soul. The (absolute) command on that day is Allah's.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be a Day when no human being shall be of the least avail to any other human being, God [alone] will hold command on that Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is a Day whereon no soul shall own aught of power for any soul; and the command on that Day will be Allah's.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is a day when no soul will be of any avail to another soul and all command that day will belong to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It will be) the Day when no soul shall have power (to do) aught for another: For the command, that Day, will be (wholly) with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It will be) the Day when no person shall have power (to do) anything for another, and the Decision, that Day, will be (wholly) with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the Day when no soul can do a thing for another soul. That Day, the command belongs to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when no soul will avail another soul anything; and the decision on that Day is God’s.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the Day when a soul will not possess for another soul [power to do] a thing; and the command, that Day, is [entirely] with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[82:19] [It is] a day (read yawmu) when no soul will be of any avail, any use, to another soul, and the [absolute] command on that day will be God’s: there will be no [power of] command for anyone other than Him thereat, in other words, none has been given the power to mediate thereupon, in contrast to [situations] in this world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah the explained to him, saying: (A day on which no soul) no believing soul (hath power at all) no power to save or intercede (for any (other) soul) for any disbelieving soul. (The (absolute) command) sentencing and judging between people (on that day is Allah's) is in Allah's hands; none other than Him has that in his power and none will challenge Him about it'. And of the surah in which the Dealers in Fraud are mentioned, which was revealed between Mecca and Medina-it was revealed to the Messenger of Allah (pbuh) when he began his migration to Medina and its revelation was completed in Medina-and consists of 36 verses, 169 words and 730 letters: Surah 83: The Dealers in Fraud [al-Mutaffifin) And of the surah in which the Dealers in Fraud are mentioned, which was revealed between Mecca and Medina— it was revealed to the Messenger of Allah (pbuh) when he began his migration to Medina and its revelation was completed in Medina— and consists of 36 verses, 169 words and 730 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والأمرُ يومئذ لله } لا لغيره\n فهو القاضي فيه وحده دون غيره\n ولا شك أنَّ الأمر لله في الدارين\n لكن لمّا كان في الدنيا خفياً\n لا يعرفه إلاَّ العلماء بالله\n وأمّا في الآخرة فيظهر المُلك لله لكل أحدٍ\n خصّه به هناك\n والله تعالى أعلم\n الإشارة: قال القشيري: إنَّ الأبرار لفي نعيم الشهود والحضور\n وإنَّ الفجار لفي جحيم الحجاب والغيبة\n يَصْلونها يومَ الدين\n يحترقون بنار الحجاب\n ونيران الاحتجاب يوم الجزاء والثواب\n وما أدراك ما يوم الدين\n ثم ما أدراك ما يومُ الدين\n يُشير إلى التعجُّب من كُنه أمره\n وشأن شأنه\n يوم لا تملك نفسٌ لنفس شيئاً\n لفناء الكل\n ذاتاً وصفاتاً وأفعالاً\n\nهـ\n { والأمر يومئذ للّه } \n قال الواسطي: الأمر اليوم ويومئذ ولم يزل ولا يزال لله\n لكن الغيب بحقيقته لا يُشاهده إلاّ الأكابر من الأولياء\n وهذا خطاب للعموم\n إذا شاهدوا الغيب تيقّنوا أنَّ الأمر كله لله\n فأما أهل المعرفة فمُشَاهَد لهم الأمر كمشاهدتهم يومئذٍ\n لا تزيدهم مشاهدة الغيب عياناً على مشاهدته لهم تصديقاً\n كعامر بن عبد القيس\n حين يقول: لو كُشف الغطاء ما ازددت يقيناً\n هـ\n وقاله أيضاً عليّ رضي الله عنه\n وقال القشيري: الأمر يومئذ لله وقبله وبعده\n ولكن تنقطع الدعاوى ذلك اليوم\n ويتضح الأمر\n وتصير المعارف ضرورية\n هـ\n وقال الشيخ ابن عبّاد رضي الله عنه في رسائله الكبرى\n بعد كلام: وليت شعري\n أيّ وقت كان المُلك لسواه حتى يقع التقييد بقوله:\n[الحج:56] وقوله: { والأمر يومئذ لله } لولا الدعاوى العريضة من القلوب المريضة\n هـ\n وقال الورتجبي: دعا بهذه الآية العبادَ إلى الإقبال عليه بالكلية بنعت ترك ما سواه\n فإنَّ المُلك كله لله في الدنيا والآخرة\n يُضل مَن يشاء\n ويهدي مَن يشاء\n هـ\n وصلّى الله على سيدنا محمد وآله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "57:5",
      "similarity": 0.4333029309673454
    },
    {
      "verse": "3:80",
      "similarity": 0.4221488084875094
    },
    {
      "verse": "1:4",
      "similarity": 0.3635740782148292
    },
    {
      "verse": "36:54",
      "similarity": 0.3620622397252353
    },
    {
      "verse": "22:56",
      "similarity": 0.3605503781695154
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/082019.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/082019.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/82:19.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}