{
  "chapter": "الإنفطار",
  "text": "ان الابرار لفى نعيم",
  "translations": [
    {
      "translation": "The truly good will be in perfect Bliss.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The pious will surely be in heaven,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the virtuous shall be in Bliss,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The virtuous ones will live in bliss\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the virtuous are in serenity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, the Abrar (the righteous believers) will be in Delight;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most surely the righteous are in bliss,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the pious shall be in bliss,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! the righteous verily will be in delight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the virtuous will dwell in bliss,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the pious shall be in Delight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the pious shall be amid bliss,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the Righteous, they will be in bliss;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, the Abrar (pious and righteous) will be in delight (Paradise);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the righteous shall (live) in bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The virtuous will be in bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the righteous will be in pleasure,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[82:13] Indeed the pious, the believers who are sincere in their faith, shall be amid bliss, [in] Paradise,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! the righteous) who are true in their faith: Abu Bakr and his believing brothers (verily will be in delight) in the Garden whose bliss is everlasting. 737\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ ٱلأَبْرَارَ } البارين المبرورين { لَفِي نَعِيمٍ } [الانفطار: 13] ومسرة دائمة، وفوز عظيم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِنَّ الأبرارَ } أي: المؤمنين { لَفِي نعيم } عظيم، وهو نعيم الجنان { وإِنَّ الفُجَّار } أي: الكفار { لَفِي جحيم } كذلك، وفي تنكيرهما من التفخيم والتهويل ما لا يخفى، { يَصْلَونها يومَ الدِّين } يُقاسون حرها يوم الجزاء، وهو استئناف بياني منبىء عن سؤال نشأ عن تهويلها، كأنه قيل: ما حالهم فيها؟ فقال: يحترقون فيها يوم الدين، الذي كانوا يُكذِّبون به، { وما هم عنها بغائبين } طرفة عين بعد دخولها، وقيل: معناه: وما كانوا عنها غائبين قبل ذلك، بل كانوا يجدون سمومها في قبورهم، حسبما قال صلى الله عليه وسلم:\n\n \" القَبْر رَوْضَةٌ مِن رِيَاضِ الجَنَّة، أو حُفْرة مِنْ حُفَرِ النَّار \"\n \n\n{ وما أدراك ما يومُ الدين ثم ما أدراك ما يومُ الدين } ، هو تهويل وتفخيم لشأن يوم الدين الذي يُكذِّبون به، ببيان أنه خارج عن دائرة دراية الخلق فعلى أيّ صورة تصوروه، فهو فوقها، وكيفما تخيلوه فهو أهم من ذلك وأعظم، أي: أيُّ شيء جعلك دارياً ما هو يوم الدين؟ على أنَّ \" ما \" الاستفهامية خبر \" يوم \" ، كما هو رأي سيبويه، لما مَرّ من أنّ مدار الإفادة هو الخبر لا المبتدأ، ولا ريب أنّ مناط إفادة التهويل والفخامة هنا هو: ما يوم الدين أيّ شيء عجيب هو في الهول والفضاعة؟ انظر أبا السعود\n قال ابن عباس رضي الله عنه: كل ما في القرآن من قوله تعالى: { وما أدراك } فقد دراه، وكل ما فيه من قوله: { وما يدريك } فقد طوي عنه\n هـ\n وينتقض بقوله تعالى:\n\n[عبس:3]\n ثم بيَّن شأن ذلك اليوم إجمالاً، فقال: { يومَ لا تملك نفسٌ لنفسٍ شيئاً } أي: لا تستطيع دفعاً عنها، ولا نفعاً لها بوجه، وإنما تملك الشفاعة به بالإذن، ويوم: مرفوع على أنه خبر مبتدأ محذوف، أو بدل من يوم الدين، ومَن نصب فبإضمار \" اذكر \" ، كأنه قيل بعد تفخيم أمر يوم الدين وشويقه صلى الله عليه وسلم إلى معرفته: اذكر يوم لا تملك نفس إلى آخره، فإنه يُدريك ماهو، { والأمرُ يومئذ لله } لا لغيره، فهو القاضي فيه وحده دون غيره، ولا شك أنَّ الأمر لله في الدارين، لكن لمّا كان في الدنيا خفياً، لا يعرفه إلاَّ العلماء بالله، وأمّا في الآخرة فيظهر المُلك لله لكل أحدٍ، خصّه به هناك\n والله تعالى أعلم\n الإشارة: قال القشيري: إنَّ الأبرار لفي نعيم الشهود والحضور، وإنَّ الفجار لفي جحيم الحجاب والغيبة، يَصْلونها يومَ الدين، يحترقون بنار الحجاب، ونيران الاحتجاب يوم الجزاء والثواب، وما أدراك ما يوم الدين، ثم ما أدراك ما يومُ الدين، يُشير إلى التعجُّب من كُنه أمره، وشأن شأنه، يوم لا تملك نفسٌ لنفس شيئاً، لفناء الكل، ذاتاً وصفاتاً وأفعالاً\n\n\nهـ\n { والأمر يومئذ للّه } ، قال الواسطي: الأمر اليوم ويومئذ ولم يزل ولا يزال لله، لكن الغيب بحقيقته لا يُشاهده إلاّ الأكابر من الأولياء، وهذا خطاب للعموم، إذا شاهدوا الغيب تيقّنوا أنَّ الأمر كله لله\n فأما أهل المعرفة فمُشَاهَد لهم الأمر كمشاهدتهم يومئذٍ، لا تزيدهم مشاهدة الغيب عياناً على مشاهدته لهم تصديقاً، كعامر بن عبد القيس، حين يقول: لو كُشف الغطاء ما ازددت يقيناً\n هـ\n وقاله أيضاً عليّ رضي الله عنه\n وقال القشيري: الأمر يومئذ لله وقبله وبعده، ولكن تنقطع الدعاوى ذلك اليوم، ويتضح الأمر، وتصير المعارف ضرورية\n هـ\n وقال الشيخ ابن عبّاد رضي الله عنه في رسائله الكبرى، بعد كلام: وليت شعري، أيّ وقت كان المُلك لسواه حتى يقع التقييد بقوله:\n\n[الحج:56] وقوله: { والأمر يومئذ لله } لولا الدعاوى العريضة من القلوب المريضة\n هـ\n وقال الورتجبي: دعا بهذه الآية العبادَ إلى الإقبال عليه بالكلية بنعت ترك ما سواه، فإنَّ المُلك كله لله في الدنيا والآخرة، يُضل مَن يشاء، ويهدي مَن يشاء\n هـ\n وصلّى الله على سيدنا محمد وآله\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "83:22",
      "similarity": 1.0000000000000002
    },
    {
      "verse": "52:28",
      "similarity": 0.7548812583315822
    },
    {
      "verse": "80:16",
      "similarity": 0.6814468950534656
    },
    {
      "verse": "83:18",
      "similarity": 0.5600431059751758
    },
    {
      "verse": "2:224",
      "similarity": 0.5012748484557016
    }
  ]
}