{
  "chapter": "الإنفطار",
  "text": "يايها الانسن ما غرك بربك الكريم",
  "translations": [
    {
      "translation": "O man! what has deluded you in respect of your Noble Lord?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man, what seduced you from your munificent Lord\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man! What has deceived you about your generous Lord\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Human being, what evil has deceived you about your Gracious Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man! What has deceived you away from your Lord, the Most Beneficent?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man! What has made you careless about your Lord, the Most Generous\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man! what has beguiled you from your Lord, the Gracious one,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Man! What deceived thee as to thy generous Lord\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man! What hath made thee careless concerning thy Lord, the Bountiful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man! What is it that lures you away from your bountiful Sustainer,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man! what hath beguiled thee concerning thy Lord, the Bountiful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man! What has deceived you about your generous Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man! What has seduced thee from thy Lord Most Beneficent?-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man! What has made you careless concerning your Lord, the Most Generous?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O human! What has deceived you concerning your Generous Lord\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man! What deluded you concerning your Lord, the Most Generous?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, what has deceived you concerning your Lord, the Generous,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[82:6] O, disbelieving, man! What has deceived you with regard to your generous Lord?, so that you have disobeyed Him,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 man!) i.e. disbelieving man; here referring specifically to Kildah Ibn Usayd (What hath made thee careless concerning thy Lord) when you disbelieved in Him, (the Bountiful) the Forgiving,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ما غرّك } إنكار للغرور بكرمه، أي: إن كان كونه كريماً يسوغ الغرور ويسهله لكن له من النعم الكثيرة والمنن العظيمة والقدرة الكاملة ما يمنع من ذلك أكثر من تجويز الكرم إياه، والكرام الكاتبون هم النفوس السماوية والقوى الفلكية المنتقشة بما يصدرعنهم من الأفعال، أي: ارتدعوا عن الغرور بالكلام بل إنما عصيانهم للتكذيب بالجزاء أصلاً الذي هو أعظم من الغرور\n وإن الكرام الأشراف التي كرمت عن الكون والفساد يحفظون أفعالكم ويكتبونها عليكم فضلاً عن الملكين الموكلين بكم، كما قال تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ نادى سبحانه مظهر الإنسان، المصور بصورة الرحمن بداءً معاتبةً وتخجيلاً على ما عرض عليه من الغفلة والنيسان، مع أنه جُبل على فطرة التوحيد والعرفان، فقال: { يٰأَيُّهَا ٱلإِنسَٰنُ } المنعم عليك بأنواع الإنعام والإحسان { مَا غَرَّكَ } أي: أيّ شيء خدعك ومكر بك حتى جبرك على الكفر والعصيان { بِرَبِّكَ ٱلْكَرِيمِ } [الانفطار: 6]؟!\n\n\n\n{ ٱلَّذِي خَلَقَكَ } أوجدك وصوَّرك في أحسن تقويم { فَسَوَّاكَ } أي: سوَّى أعضاءك وجوارحك سليمة عن مطلق العيوب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الإِنسانُ ما غرّكَ بربك الكريم } أيّ شيءٍ خدعك وجرّأك على عصيانه، وقد علمتَ ما بين يديك من الدواهي التامة، والعواطب الطَامّة، وما سيكون حينئذ من مشاهدة ما قَدَّمتَ من أعمالِك، وما أخّرت؟ والتعرُّض لعنوان كرمه تعالى للإيذان بأنه مما لا يصلح أن يكون مداراً للاغترار، حسبما يغويه الشيطان، ويقول: افعل ما شئتَ فإنَّ ربك كريم، قد تفضّل عليك في الدنيا، وسيفعل مثله في الآخرة، فإنه قياس عقيم، وتمنية باطلة، بل هو مما يُوجب الإقبال على الإيمان والطاعة، والاجتناب عن الكفر والعصيان، كأنه قيل: ما حملك على عصيان ربك، الموصوف بالصفات الزاجرة عنه، الداعية إلى خلافه\n رُوي أنه صلى الله عليه وسلم لمّا قرأها قال:\n\n \" غرَّه جهلُه \" \n\nوعن عمر رضي الله عنه: غرّه حُمقه، وقال قتادة: غرّه عدوه المسلّط عليه ـ يعني الشيطان ـ وقيل للفضيل: لو أقامك اللهُ تعالى يوم القيامة بين يديه فقال لك: { ما غرَّك بربك الكريم } ماذا كنتَ تقول؟ قال: أقول: ستُورك المرخاة، لأنَّ الكريم هو الستّار وأنشدوا:\n\nوقال مقاتل: غرّه عفو الله حين لم يعجل عليه العقوبة، وقال السدي: غرّه رفق الله به، وقال يحيى بن معاذ: لو أقامني بين يديه، فقال لي: ما غرّك بي؟ لقلتُ: غرّني بك بِرّك سالفاً وآنفاً، وقال آخر: أقول: غرّني حلمك، وقال أبو بكر الورّاق: لو قال لي: ما غرَّك بي؟ لقلتُ: غرّني بك كرم الكريم\n وهذا السر في التعبير بالكريم، دون سائر الصفات، كأنه لقَّنه الإجابة حتى يقول: غرّني كرم الكريم، وهكذا قال أبو الفضل العابد: غرّني تقييد تهديدك بالكريم، وقال منصور بن عمّار: لو قيل لي: ما غرّك؟ قلت: ما غرّني إلا ما علمتُه من فضلك على عبادك، وصفحك عنهم\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:5",
      "similarity": 0.6737146710027374
    },
    {
      "verse": "31:33",
      "similarity": 0.5125118142261682
    },
    {
      "verse": "67:20",
      "similarity": 0.49523473503793775
    },
    {
      "verse": "3:196",
      "similarity": 0.48259185724999865
    },
    {
      "verse": "4:120",
      "similarity": 0.4718524851946648
    }
  ]
}