{
  "chapter": "المطففين",
  "text": "كلا ان كتب الابرار لفى عليين",
  "translations": [
    {
      "translation": "No indeed! The book of the truly good is in 'llliyun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the ledger of the pious will be in 'Illiyun (heights above the heights).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No indeed! Verily, the deeds of the virtuous shall be in the record of the exalted ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, the records of the deeds of the virtuous ones will certainly be in Illiyin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the record of the virtuous is in the highest place, the Illiyin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! Verily, the Record of Al-Abrar (the righteous believers) is (preserved) in `Illiyyin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! Most surely the record of the righteous shall be in the Iliyin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No indeed; the book of the pious is in Illiyun;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but the record of the righteous is in 'Illiyin -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But, the record of the righteous is [preserved] in the 'Illiyyin --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By no means! Verily the record of the virtuous shall be in 'Illiyun.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the record of the pious is in Illeeyun.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, verily the record of the Righteous is (preserved) in 'Illiyin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! Verily, the Record (writing of the deeds) of Al-Abrar (the pious who fear Allah and avoid evil), is (preserved) in 'Illiyyun.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But, the Book of the righteous is in the 'Illiyoon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No indeed; the record of the righteous is in Elliyyeen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No! Indeed, the record of the righteous is in 'illiyyun.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[83:18] Nay!, verily, the record of the pious, that is, the record of the deeds of the believers who were sincere in their faith, is in ‘Illiyyūn — this is said to be the book [containing] all the good deeds of the angels and the believers from among the two heavy ones [sc. mankind and jinn]; but it is also said to be a place below the Throne in the seventh heaven;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay) truly, Muhammad, (but the record of the righteous) the works of those who are true in their faith (is in 'Illiyyin\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كَلاَّ إِنَّ كِتَابَ ٱلأَبْرَارِ لَفِي عِلِّيِّينَ } معناه تَحتَ العَرشِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Indeed, the Register of the righteous is in [the Record of] Illiyin}, [means that it is] under the Throne.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ كرر سبحانه لفظة: { كَلاَّ } ردعاً لهم بعد ردع، تأكيداً وتقريعاً؛ وليكون توطئة وتمهيداً لتعقيب وعيدهم بوعد المؤمنين، مع أن في هذا التعقيب زيادة زجر وتقريع عليهم بما اقترفوا من الآثام والعصيان، المؤدية إلى دار الندامة والحرمان { إِنَّ كِتَابَ ٱلأَبْرَارِ } أي: ما كتب فيه عموم آثارهم الصالحة، الصادرة عنهم إيماناً واحتساباً، ثقةً بالله، وخوفاً من غضبه، محفوظة فيه جميع ما ذكر، محكوم عليهم بمقتضى ما فيه، إنهم { لَفِي عِلِّيِّينَ } [المطففين: 18] أي: متمكنون في أعلى درجات الجنة، وأرفع مقاماتها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { كلاَّ } ، ردع للمكذبين، ثم بيّن حال الأبرار، فقال: { إنَّ كتاب الأبرارِ } أي: ما كتب من أعمالهم، والأبرار: المؤمنون المطيعون، لأنه ذُكر في مقابلة الفُجَّار، وعن الحسن: البرّ: الذي لا يؤذي الذرّ، { لفي عليين } ، قال الفراء: هو اسم على صيغة الجمع لا واحد له، وقيل: واحده \" عِلِّيّ \" ، و \" علِّيه \" وأيًّا ما كان فهو موضع في أعلى الجنة، يسكنه المقربون\n قال ابن عمر رضي الله عنه: إنّ أهل عليين لينظرون إلى أهل الجنة من كوى، فإذا أشرف رجل أشرقت له الجنة، وقالوا: قد اطلع علينا رجل من أهل عليين، وقال في البدور: \" إنَّ الرجل من أهل عليين ليخرج فيسير في ملكه، فلا تبقى خيمة من خيام الجنة إلا ويدخلها ضوء من وجهه، حتى إنهم يستنشقون ريحه ويقولون: واهاً لهذه الريح الطيبة\n\n \" الحديث\n\n وتقدّم قوله صلى الله عليه وسلم:\n\n \" أكثر أهل الجنة البُله، وعليون لذوي الألباب \" \n\nوانظره في سورة المجادلة، وفي حديث البراء: قال النبي صلى الله عليه وسلم:\n\n \" عليون في السماء السابعة تحت العرش \" \n\nوفيه ديوان أعمال السعداء، فإذا عمل العبدُ عملاً صالحاً عرج به وأثبت في ذلك الديوان، وقد رُوي في الأثر:\n\n \" أن الملائكة تصعد بصحيفةٍ فيها عمل العبد، فإن رضيه الله قال: اجعلوه في عليين وإن لم يرضه قال: اجعلوه في سجين \"\n \n\nثم نوّه بقَدْره فقال: { وما أدراك ما عليون كتابٌ مرقومٌ } أي: موضع كتاب، أو فيه كتاب مرقوم { يشهده المقربون } أي: الملائكة المقربون، أو أرواح المقربين لأنَّ عليين محل الكروبيين وأرواح المقربين\n { إِنَّ الأبرار } من أهل اليمين { لفي نعيمٍ } عظيم، { على الأرائك } على الأسرّة في الحِجال، { ينظرون } إلى كرامة الله ونِعمه التي أولاهم، أو: إلى أعدائهم يعذّبون في النار، وما تحجب الحجال أبصارهم عن الإدْراك، { تعرف في وجوههم نضرةَ النعيم } أي: بهجة التنعُّم وطراوته ورونقه\n والخطاب لكل أحد مما له حظ من الخطاب للإيذان بأنَّ حالهم من أثر النعمة وأحكام البهجة، بحيث لا يختص برؤيته راءٍ دون راءٍ\n { يُسقون من رحيقٍ } شراب خالص لا شوب فيه، وقيل: هو الخمر الصافية، { مختومٌ } مغلق عليه، { ختامه مِسْكٌ } أي: مختوم أوانيه وأكوابه بالمسك مكان الطين، كما يفعل أهل الدنيا بأوانيهم إذا أرادوا حِفظها وصيانتها، ولعله تمثيل لكمال نفاسته، أو: أخره وتمامُه مسك، أي: يجد الشارب عند آخر شربه رائحة المسك\n وقُرىء \" خاتِمَه \" بكسر التاء وفتحها\n { وفي ذلك } الرحيق أو ما تقدّم من نعيم الجنان { فليتنافس المتنافسون } فليرغب الراغبون، وليجتهد المجتهدون، أو فليسبق المستبقون، وذلك بالمبادرة إلى الخيرات، والكفّ عن السيئات\n\n\nوأصل التنافس: التغالب في الشيء النفيس، وهو من النفس لعزتها، وقال البغوي: وأصله: من الشيء النفيس الذي تحرص عليه النفوس، ويريده كل أحد لنفسه، وينفَسُ به على غيره، أي: يضِنُّ به\n قوله تعالى: { ومِزَاجُه من تسنيمٍ }: عطف على خِتامه صفة أخرى للرحيق، وما بينهما اعتراض مقرر لنفاسته، أي: ما يمزَج به ذلك الرحيق هو من ماء التسنيم، والتسنيم اسم لعين بعينها في الفردوس الأعلى، سُميت بالتسنيم الذي هو مصدر من \" سنّمه \" إذا رفعه، لأنها أرفع شراب في الجنة، ثم فسّرها بقوله: { عيناً } ، فهو منصوب على المدح أو الاختصاص، أو على الحال مع جمودها لوصفها بقوله: { يشربُ بها } أي: منها { المقربون } ، قال ابن عباس وابن مسعود رضي الله عنهما: فيشربها المقربون صِّرفاً، وتمزج لأصحاب اليمين\n هـ\n والمقربون هم أهل الفناء في الذات، أهل الشهود والعيان، والأبرار أهل الدليل والبرهان، وهم أهل اليمين، وذلك أنَّ المقربين لَمّا أخلصوا محبتهم لله، ولم يُحبوا معه شيئاً من الدنيا خلُصَ لهم الشراب في الآخرة وأهل اليمين، لَمّا خلطوا في محبيتهم خلّط شرابهم، فالدنيا مزرعة الآخرة، فمن صَفّا صُفيَ له، ومَن كَدّر كُدّر عليه\n فإن قلتَ: لِمَ أمر بالتنافس في الرحيق ولم يأمر به في التسنيم، مع كونه أرفع؟ قلتُ: قال بعضهم: إشارة إلى أن شربه لا يُنال بسبب، بل بالسابقة، وقيل: إنه مُقدّم من تأخير، وإن التنافس حاصل في الجميع، أو يؤخذ بالأحْرى لأنه إذا أمرَ بالتنافس في المفضول كان التنافس في الأفضل أحرى\n والله تعالى أعلم\n الإشارة: قال الورتجبي: كتاب الأبرار كتابٌ مرقوم برقم الله، رقمه بسعادتهم الأزلية، وولايتهم الأبدية، وذلك الكتاب عنده لا يطلع عليه إلاَّ المقربون المخاطبون بحديثه وكلامه، المكاشفون بالحقائق الغيبية قال أبو عثمان المغربي: الكتاب المرقوم: هو ما يُجري اللّهُ على جوارحك من الخير والشر، رقمها بذلك، وهو لا يخاف ما رقم به، وذلك الرقْم معلّق بالقضاء والقدر عن القدرة بمشيئته تعالى عليه، ولا نزوع عن ذلك ولا حيلة له فيه، فهو في ذلك معذور في الظاهر، غير معذور في الحقيقة، هذا لعوام الخلق، وأمّا للخواص والأولياء وأهل الحقائق فإنه رقْم الله على كل شيء أوجده، لم يُشْرف على ذلك الرقْم إلاَّ المقربون، فهم أهل الإشراف فمَن شاهد ذلك الرقْم من المقربين عرف صاحبه بما رقم به من الولاية والعداوة، فيُخبر عنه، وهو الإشراف والفراسة، كما كان لعُمر حين أخبر عنه صلى الله عليه وسلم بقوله:\n\n \" كان في الأمم مُكلَّمون\n\n\n \" \n\nالحديث، أي: فعُمر ممن أشرف على حقائق الرقْم، وعلى معاني الكتاب المرقوم فمَن كان بذلك الحال فهو المكلّم من جهة الحق بلا واسطة\n قال الجريري: رقْمٌ رَقَم اللّهُ به قلوبَ عباده بما قضى عليهم في الأزل من السعادة والشقاوة، وبذلك الرقْم خَفي في أسرار العباد، وظهر على هياكلهم، كما قال صلى الله عليه وسلم:\n\n\n\n \" كُلٌّ مُيَسَّرٌ لما خُلق له \"\n \n\nوالحاصل: أنَّ الكتاب المرقوم: هو ما سطر لكل أحد في الأزل، فإن رقم له بالسعادة جعلَ في عليين، إشارة إلى أنَّ صاحبه يلحق به، وإن رقم بالشقاوة جعل في سجين، إشارة إلى لحوق صاحبه به\n وقوله تعالى: { يشهده المقربون } أي: يشهدونه بعلوم أفكارهم ومكاشفة أسرارهم، وقد ينطقون بذلك في حال الفيض أو الجذب، وهؤلاء هم المكلَّمون، وفي الحديث:\n\n \" قد كان في الأمم مكلَّمون، وإن يكن في أمتي فعُمر \" \n\nوالمقربون هم أهل الفناء والبقاء\n ثم قال تعالى: { إنَّ الأبرار لفي نعيم } لذة الطاعات وحلاوة المناجاة، على أرائك المقامات ينظرون ما يفعل الله بهم\n وقال القشيري: ينظرون في روضات الجنان الروحية والسرية والقلبية، لكل منهم روضة مخصوصة\n هـ\n ولعل نظرهم علمياً لا ذوقياً، لأنَّ الذوق للمقربين، تَعْرِفُ في وجوههم نضرة النعيم، وهو ما يظهر على وجوههم من بهجة المحبة ونضرة القُربة ولعل المراد بالأبرار هنا السائرون، ولذلك قال: { يُسقَون من رحيق } خمرة المحبة الأزلية، الصافية من كدر الهوى، مختوم عليه في قلوب العارفين\n قال القشيري: أواني ذلك الشراب هي قلوب الأصفياء والأولياء، خِتامه مسك، وهو محبة الحق، لا يشرب من تلك الأواني المختومة إلاَّ الطالبون الصادقون في طريق السلوك إلى الله\n هـ\n وفي ذلك فليتنافس المتنافسون، فمَن فاته حظه من هذه الخمرة فهو محروم، كما قال ابن الفارض:\n\nوقال القشيري: وتنافسهم فيه بالمبادرة إلى الأعمال الصالحة، وتعليق القلب بالله، والانسلاخ من الأخلاق الدنية، وجولان الهمم في الملكوت، واستدامة المناجاة\n هـ\n ومِزاجه من تسنيم وهو عين بحر الوحدة الصافية، التي قال فيها القطب ابن مشيش رضي الله عنه: وأغرقني في بحر الوحدة\n\n الخ، ولذلك فسّرها تعالى بقوله: { عيناً يشرب بها المقربون } فالمقربون يشربونه صرفاً في الدنيا والآخرة، ويمزج لغيرهم، قال بعضهم: لأنه ليس مَن احتمل حمل الصفات كمن قَوِي على مشاهدة الذات، وشربها المقربون صرْفاً لحملهم الذات والصفات جميعاً\n هـ\n ولأنهم صفّوا محبتهم في الدنيا من شوائب الهوى، فصفّى شرابهم في دار البقاء، وفي هذا المقام ينبغي التنافس الحقيقي، كما قال الشاعر:\n\nفتنافس الأبرار في حيازة النعيم، وتنافس المقربين في حيازة المنعِم، تنافسُ الأبرار في نعيم الأشباح وتنافس المقربين في نعيم الأرواح، ورضوان من الله أكبر، ذلك هو الفوز العظيم، جعلنا الله من أهل التنافس فيه وفي شهوده، آمنين\n ثم شفع بأضداد هؤلاء، فقال: { إِنَّ ٱلَّذِينَ أَجْرَمُواْ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "82:13",
      "similarity": 0.5600431059751758
    },
    {
      "verse": "83:22",
      "similarity": 0.5600431059751758
    },
    {
      "verse": "52:28",
      "similarity": 0.5226911698988246
    },
    {
      "verse": "74:54",
      "similarity": 0.5133391360828659
    },
    {
      "verse": "80:11",
      "similarity": 0.5133391360828659
    }
  ]
}