{
  "chapter": "المطففين",
  "text": "ان الذين اجرموا۟ كانوا۟ من الذين ءامنوا۟ يضحكون",
  "translations": [
    {
      "translation": "Those who did evil used to laugh at those who had iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sinners indeed laughed at believers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, the wicked were wont to laugh at the believers:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sinners had been laughing at the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the guilty used to laugh at the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who committed crimes used to laugh at those who believed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely they who are guilty used to laugh at those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, the sinners were laughing at the believers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! the guilty used to laugh at those who believed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The wicked used to laugh at the believers --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Veriiy those who have sinned were wont at those who had believed to laugh,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the guilty used to laugh at the faithful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those in sin used to laugh at those who believed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! (During the worldly life) those who committed crimes used to laugh at those who believed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sinners laughed at the believers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who committed crimes used to laugh at those who believed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who committed crimes used to laugh at those who believed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[83:29] Verily the guilty, like Abū Jahl and his ilk, used to laugh at the believers, such as ‘Ammār [b. Yāsir] and Bilāl [the Ethiopian] and those like them, in mockery of them;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! the guilty) the idolaters, Abu Jahl and his host (used to laugh at those who believed) used to mock and poke fun at 'AN and his fellow believers,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ } المشركين المسرفين { ٱلَّذِينَ أَجْرَمُواْ } بالجرائم العظام الموجبة لأنواع الانتقام، من جملتها: إنهم { كَانُواْ مِنَ ٱلَّذِينَ آمَنُواْ يَضْحَكُونَ } [المطففين: 29] ويستهزئون بفقراء المؤمنين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِنَّ الذين أجرموا } كفروا، كأبي جهل والوليد والعاص بن وائل وأضرابهم، { كانوا من الذين آمنوا } كعمّار وصُهيب وخباب وبلال { يضحكون } استهزاء بهم، { وإِذا مَرُّوا بهم يتغامزون } يُشير بعضهم إلى بالعين طعناً فيهم وعيباً لهم، وقيل: جاء عليٌّ في نفر من المسلمين، فسخر منهم المنافقون، وضحكوا وتغامزوا، وقالوا: أترون هذا الأصلع؟ فنزلت قبل أن يصل إلى رسول الله صلى الله عليه وسلم، فتكون الآية على هذا مدنية، { وإِذا انقلبوا إلى أهلهم } أي: إذا رجع الكفار إلى منازلهم { انقلبوا فاكهين } ، متلذذين بذكرهم بالسوء، أو متعجبين، وقرأ حفص: { فكهين } بالقصر، أي: أشرين أو فرحين، وقال الفراء: هما سواء كطاعن وطعن\n { وإِذا رَأَوهم } أي: رأى الكافرون المؤمنين { قالوا إِنَّ هؤلاء لضالُّون } أي: مخدوعون، أي: خدع محمدٌ هؤلاء فضلُّوا وتركوا اللذّات لما يرجونه في الآخرة من الكرامات، فقد تركوا العاجل بالآجل، والحقيقة بالخيال وهذا عين الضلال، ولم يشعر هؤلاء الكفرة أنَّ ما اغترُّوا به وانهمكوا فيه هو عين الضلال، قال تعالى: { وما أُرسلوا عليهم حافظين } أي: وما أرسل الكفّار على المسلمين، يحفظون أعمالهم ويرقبون أحوالهم\n والجملة حال، أي: قالوا ذلك والحال أنهم ما أُرسلوا من جهة الله تعالى موكّلين بهم، مهيمنين على أعمالهم، يشهدون برُشدهم وضلالهم، بل أُمروا بإصلاح أنفسهم، فاشتغالهم بذلك أولى من تتبُّع عورات غيرهم\n { فاليومَ الذين آمنوا من الكفارِ يضحكون } ، حين يرونهم مغلولين أذلاء قد غشيتهم فنون العذاب والصغَار بعد العزة والاستكبار، وهم { على الأرائك } آمنون ووجه ذلك: أنهم لمَّا كانو أعداءهم في الدنيا جعل لهم سروراً في تعذيبهم، وقال كعب: بين الجنة والنار كُوَىً، فإذا أراد المؤمن أن ينظر إلى عدوه الذي كان له في الدنيا نظر إليه، دليله:\n\n[الصافات:55] فضحكوا منهم في الآخرة كما كانوا يضحكون منهم في الدنيا جزاءً وفاقاً\n { على الأرائك ينظرون } حال، أي: يضحكون منهم ناظرين إليهم وإلى ما هم فيه من سوء الحال، وقيل: يُفتح إلى الكفار باب إلى الجنة، فيُقال لهم: هَلمُّوا إليها، فإذا وصلوا إليها أغلق دونهم، يفعل ذلك بهم مراراً، ويضحك المؤمنون، ويأباه قوله تعالى: { هل ثُوِّب الكفارُ ما كانوا يفعلون } فإنه صريح في أنَّ ضحك المؤمنين منهم جبراً لضحكهم منهم في الدنيا، فلا بد من المجانسة والمشاكلة\n والتثويب والإثابة: المجازاة، أي: ينظرون هل جُوزي الكفار بما كانوا يفعلون من السخرية بالمؤمنين أم لا؟ ويحتمل أن يكون مفعول: \" ينظرون \" محذوفاً أي: ينظرون إلى أعدائهم في النار، أو إلى ما هم فيه من نعيم الجنان، ثم استأنف بقوله: { هل ثُوِّب الكفارُ ما كانوا يفعلون } أي: هل جُوزوا بذلك إذا فعل بهم هذا العذاب المهين، و \" هل \" على هذا للتقرير، قال الرضي: وتختص \" هل \" بحكمين دون الهمزة، وهما: كونها للتقرير في الإثبات، كقوله تعالى: { هل ثوب الكفار } أي: ألم يَثوبوا، وإفادتها للنفي حتى جاز أن يجيء بعدها \" إلاَّ \" قصداً للإيجاب، كقوله تعالى:\n\n\n\n[الرحمن:60] وقول الشاعر:\n\nالإشارة: ما قاله الكفرة في ضعفاء المسلمين قاله أهل الغفلة في المنتسبين الذاكرين، حرفاً بحرف، وما أُرسلوا عليهم حافظين، فإذا تحققت الحقائق، ورُفع الذاكرون مع المقربين، وبقي أهل الغفلة مع الغافلين في أهل اليمين، يضحكون منهم كما ضحكوا منهم في الدنيا\n وبالله التوفيق، وهو الهادي إلى الطريق، وصلّى الله عليى سيدنا محمد وآله وصحبه وسلّم\n\n",
      "translations": []
    }
  ]
}