{
  "chapter": "المطففين",
  "text": "الذين اذا اكتالوا۟ على الناس يستوفون",
  "translations": [
    {
      "translation": "Those who, when they take a measure from people, exact full measure,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who insist on being given full when they take from others,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who, when they take from others by measure, take their full share;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who demand a full measure from others\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who when they take the measure from others, take it in full!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who, when they have to receive by measure from men, demand full measure,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who, when they take the measure (of their dues) from men take it fully,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when they measure against the people, take full measure\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who when they take the measure from mankind demand it full,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who demand of other people full measure for themselves,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who, when they take by measure from mankind, exact the full,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who, when they measure [a commodity bought] from the people, take the full measure,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who, when they have to receive by measure from men, exact full measure,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who, when they have to receive by measure from men, demand full measure,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who, when people measure for them, take full measure,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who, when they take a measure from people, they take in full.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who, when they take a measure from people, take in full.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[83:2] those who, when they take measure from people, demand [it] in full, the measure;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then explained who these defrauders are, saying: (Those who when they take the measure from mankind) those who, when they buy from people and weigh or measure that which they buy for themselves, (demand it full) they weigh and measure their merchandise in full, 738\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفي الحديث - صلوات الله وسلامه على قائله: \" ما نقص العهد قوم إلاَّ سلَّط الله عليهم عدوهم، وما حكموا بغير ما أنزل الله إلاَّ فشا فيهم الفقر، وما ظهرت فيهم الفاحشة إلاَّ فشا فيهم الموت، ولا طففوا الكيل إلاَّ منعوا الثبات، وأخذوا بالسنين، ولا منعوا الزكاة إلاَّ حبس عليهم الفطر \" ، وهم { ٱلَّذِينَ إِذَا ٱكْتَالُواْ عَلَى ٱلنَّاسِ } أي: أخذوا منهم لأنفسهم { يَسْتَوْفُونَ } [المطففين: 2] ويزيدون على المكيال قليلاً قليلاً ترجيحاً لأنفسهم عليهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nثم فسّر التطفيف الذي استحقوا عليه الذم والدعاء عليهم بالويل، فقال: { الذين إذا اكتالوا على الناس يستوفُون } أي: إذا أخذوا بالكيل من الناس بالشراء ونحوه يأخذون حقوقهم وافية تامة، ولمّا كان اكتيالهم من الناس اكتيالاً يضرّهم، ويتحامل فيه عليهم أبدل \" على \" مكان \" مِنْ \" للدلالة على ذلك، ويجوز أن يتعلّق \" على \" بـ \" يستوفون \" ، وتقدّم المفعول على الفعل لإفادة الاختصاص، أي: يستوفون على الناس خاصة، وقال الفراء: \" مِنْ \" و \" على \" يتعاقبان في هذا الموضع لأنه حقّ عليه، فإذا قال: اكتلت عليه، فكأنه قال: أخذت ما عليه، وإذا قال: اكتلت منه فكأنه قال: استوفيت منه\n هـ",
      "translations": []
    }
  ]
}