{
  "chapter": "الإنشقاق",
  "text": "بلى ان ربه كان به بصيرا",
  "translations": [
    {
      "translation": "Why not? His Lord was always watching him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But no; (how would he not revert)? His Lord was ever watching him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a fact. Their Lord is Well-Aware of (all that they do).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely yes, why not? Indeed his Lord is seeing him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes! Verily, his Lord has been ever beholding him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yea! surely his Lord does ever see him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes indeed; his Lord had sight of him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but lo! his Lord is ever looking on him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he will indeed! His Lord was ever watching him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yea! his Lord had ever been beholding him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes, his Lord had been watching him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, nay! for his Lord was (ever) watchful of him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes! Verily, his Lord has been ever beholding him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes indeed, his Lord was ever watching him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact, his Lord was watching him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But yes! Indeed, his Lord was ever of him, Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[84:15] Nay!, he will return to Him; indeed his Lord is ever Seer of him, knowing that he would return to Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay, but lo! his Lord) when He created him (is ever looking on him!) knew that He will raise him again after death\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { بَلَىٰ } ردعاً عما قبله، وتصديقاً لما بعده على سبيل التعريض { إِنَّ رَبَّهُ } الذي ربَّاه على فطرة المعرفة، وجبله على نشأة التوحيد { كَانَ بِهِ بَصِيراً } [الانشقاق: 15] عالمّاً بتفاصيل أعماله الصادرة عنه على وجه الخبرة والبصارة، بحيث لا يشذ عن حيطة علمه شيء من أعماله وأحواله، فلا يهمله، بل يعيده ويجازيه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { بلى } جواب النفي، أي: يرجع لا محالة، { إِنَّ ربه كان به بصيراً } أي: إنَّ ربه الذي خلقه كان به وبأعماله الموجبة للجزاء \" بصيراً \" بحيث لا تخفى عليه منها خافية، فلا بد من رجعه وحسابه عليها حتماً\n الإشارة: يا أيها الإنسان الطالب الوصول، إنك كادح إلى ربك كدحاً بالمجاهدة والمكابدة فمُلاقيه بالمشاهدة المعاينة في مقام الفناء والبقاء، فأمّا مَن أُوتي كتابه السابق له في الأزل \" بيمينه \" بكونه من أهل اليمين والسعادة \" فسوف يُحاسب حساباً يسيراً \" فيُؤدب في الدنيا إن وقع منه سوء أدب، \" وينقلب إلى أهله \" إخوانه في الله \" مسروراً \" بوصوله إلى مولاه\n قال الورتجبي: مسروراً بلقاء ربه، وما نال من قُربه ووصاله، وهذا للمتوسطين، ومَن بلغ إلى حقيقة الوصال وصار أهلاً له لا ينقلب عنه إلى غيره\n هـ\n وأمّا مَن أُوتي كتابه السابق بخذلانه في الأزل، وراء ظهره، بحيث غفل عن التوجه إلى الله، واتخذه وراء ظهره، فسوف يدعو ثبوراً، فيتمنى يوم القيامة أن لم يكن شيئاً ويصلى سعير القطيعة والبُعد إنه كان في أهله مسروراً منبسطاً في الدنيا، مواجَهاً بالجمال من أهله وعشيرته، ليس له مَن يؤذيه، وهذا من علامة الاستدراج، ولذلك لا تجد وليًّا إلاَّ وله مَن يُؤذيه، يُحركه إلى ربه، قال بعض الصوفية: قَلَّ أن تجد وليًّا إلاَّ وتحته امرأة تؤذيه\n هـ\n \" إنه \" أي: الجاهل ظنّ أن لن يحور إلى ربه في الدنيا ولا في الآخرة، بل يرده اللهُ ويُحاسبه على النقير والقطمير، إنه كان به بصيراً بظاهره وباطنه\n ثم أقسم على رجوعهم إليه، فقال: { فَلاَ أُقْسِمُ بِٱلشَّفَقِ }\n\n",
      "translations": []
    }
  ]
}