{
  "chapter": "الإنشقاق",
  "text": "واذنت لربها وحقت",
  "translations": [
    {
      "translation": "hearkening to its Lord as it is bound to do!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hearkens to its Lord and is dutiful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and hearkens to the command of its Lord, doing what it should.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in obedience to the commands of its Lord which are incumbent on it, (the human being will receive due recompense for his deeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it listens to the command of its Lord – and that befits it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And listens to and obeys its Lord -- and it must do so.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obeys its Lord and it must.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and gives ear to its Lord, and is fitly disposed!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And attentive to her Lord in fear!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and obeys its Lord as it must,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it hearkeneth to its Lord, and is duteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and gives ear to its Lord as it should.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hearkens to (the Command of) its Lord,- and it must needs (do so);- (then will come Home the full reality).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And listens and obeys its Lord, and it must do so;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "obeying its Lord, as it must do!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hearkens to its Lord, as it must.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And has responded to its Lord and was obligated [to do so] -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[84:5] and heeds, [and] in this respect, gives ear to and obeys, its Lord, as it should: all of this will be on the Day of Resurrection (the response to idhā, ‘when’, and [to] all that is supplemented thereto, has been omitted; but it is indicated by what follows it, and is implied to be [something like] laqiya’l-insānu ‘amalahu, ‘man will encounter his deeds’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And attentive) and obeys and listens (to her Lord in fear!) and it behoves her do so.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَذِنَتْ لِرَبِّهَا } في الإلقاء والتخلية { وَحُقَّتْ } [الانشقاق: 5] لها للاستئذان والإصغاء\n ولاقتضاء مرتبة العبودية ذلك\n حينئذٍ انكشفت لها جزاء ما كسبت واقترفت في نشأة الاختبار\n\n\nثمَّ نادى سبحانه الإنسان نداء تنبيه وتخطية\n وتحريك حمية فطرية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأَذِنَتْ لربها } أي: استمعت في إلقاء ما في بطنها، وتخليتها عنه، { وحُقتْ } أي: وهي حقيقة بأن تنقاد لربها ولا تمتنع، ولكن لا بُعد إن لم تكن كذلك، بل في نفسها وحَد ذَاتِها، من قولهم: هو محقوق بكذا، أو حقيق به، والمعنى: انقادت لربها وهي حقيقة بذلك مِن ذاتها، وكذلك يقال في انشقاق السماء\n انظر أبا السعود\n وجواب إذا محذوف، ليذهب المقدِّر كلَّ مذهب، أي: كان من الأمر الهائل ما يقصر عنه الوصف، أو حذف اكتفاءً بما تقدّم في سورة التكوير والانفطار، أو ما دلّ عليه { فملاقيه } أي: إذا السماء انشقت لاقى الإنسان كدْحَهُ\n والله تعالى أعلم\n الإشارة: إذا السماء، أي: سماء الأرواح انشقت عن ظلمة الأشباح انشقاق الفجر عن ظلمة الليل، فتغيب ظلمة الأشباح في نور عالَم الأرواح فحينئذ تظهر حقائق الأشياء على ما كانت عليه في الحقيقة الأزلية، فينتفي الحدث ويبقى القِدم\n قال الورتجبي: إذا أراد الله قلع الكون، يلقي على السموات والأرض أثقال هيبة عظمته وكبريائه، فتنشق السماء، وتمد الأرض من عكس تجلي عظمته وكبريائه، وحق لهما أن تتصدّعا، لِما عليهما من أثقال قهريات جبروته، حيث يشققهما، وهما طائعتان لربهما، وكيف لا تكون منهما طاعة، وهما في قبضة قهر جلاله أقل من خردلة، ألا ترى كيف قال صلى الله عليه وسلم:\n\n \" الكونُ في يمين الرحمن أقلِّ من خَردلةٍ \" \n\nوكذلك يتجلّى لسماء أرواح العارفين وأرض قلوب المحبين بنعت العظمة والكبرياء، فتنشق الأرواح وتزلزل القلوب من وقوع نور هيبته عليها، وبهذا الوصف وصف قلوب المقرّبين عند نزول خطاب الهيبة، قال الله تعالى:\n\n\n\n[سبأ:23] الآية\n قال بعضهم: خطاب الأمر إذا وقع على الهياكل فهي بين مطيع وعاصٍ، وخطاب الهيبة إذا وردت تفني وتُعجز الإقرار معه كقوله: { إذا السماء انشقت } وَرَدَ عليها صفةُ الهيبة فانشقت وأذِنَتْ لربها وأطاعت وانقادت، وحُق لها ذلك، وهو الذي أوجدها\n هـ وإذا الأرض أرض البشرية مُدت، أي: بُسطت ولانت لأحكام الربوبية بالمجاهدة والرياضة، وألقت ما فيها من الخبائث والعيوب، وتخلّت عنها، وأذنت لربها في أحكام العبودية والعبادة، وحُقَّتْ بذلك لأنَّ في ذلك شرفَها وعزَّها، وجواب \" إذا \" محذوف، أي: كان من الأسرار والأنوار والمعارف ما لا يدخل تحت دوائر العبارة، ولا تحيط به الإشارة\n ثم حَثَّ على السير إلى ما ينال به هذا السر العظيم، فقال: { يٰأَيُّهَا ٱلإِنسَانُ إِنَّكَ كَادِحٌ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "84:2",
      "similarity": 1.0000000000000002
    },
    {
      "verse": "22:39",
      "similarity": 0.3897127589732651
    },
    {
      "verse": "97:4",
      "similarity": 0.3747183994353218
    },
    {
      "verse": "69:1",
      "similarity": 0.3676236943537237
    },
    {
      "verse": "38:84",
      "similarity": 0.3642533024795245
    }
  ]
}