{
  "chapter": "الإنشقاق",
  "text": "يايها الانسن انك كادح الى ربك كدحا فملقيه",
  "translations": [
    {
      "translation": "O man, you have to strive and go on striving towards your Lord, then will you meet Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man, you are striving unto your Lord and you will meet Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Human being, you strive hard to get closer to your Lord, and so you will certainly receive the recompense (of your deeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man, indeed you have to surely run towards your Lord, and to meet him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man! Verily, you are returning towards your Lord with your deeds and actions, a sure returning, and you will meet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man! surely you must strive (to attain) to your Lord, a hard striving until you meet Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Man! Thou art labouring unto thy Lord laboriously, and thou shalt encounter Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou, verily, O man, art working toward thy Lord a work which thou wilt meet (in His presence).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man, having striven hard towards your Lord, you shall meet Him:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man! verily thou art toiling toward thy Lord a painful toiling, and art about to meet Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man! You are labouring toward your Lord laboriously, and you will encounter Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O thou man! Verily thou art ever toiling on towards thy Lord- painfully toiling,- but thou shalt meet Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man! Verily, you are returning towards your Lord with your deeds and actions (good or bad), a sure returning, so you will meet (i.e. the results of your deeds which you did).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O human, you are working hard towards your Lord and you will meet Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O man! You are laboring towards your Lord, and you will meet Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, indeed you are laboring toward your Lord with [great] exertion and will meet it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[84:6] O man! Verily you are labouring, exerting your efforts, toward, the encounter with, your Lord, that is, death, laboriously, and you will encounter it, that is, you will encounter your mentioned good or evil deeds on the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thou, verily, man) disbelieving man, in reference to Abu'l-Aswad Ibn Kildah Ibn Usayd Ibn Khalaf, (art working) He says: you are working something in your state of disbelief and shall return with it (towards thy Lord) in the Hereafter (a work which you will meet (in His presence)) whether your work is righteous or evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يٰأَيُّهَا ٱلإِنسَانُ إِنَّكَ كَادِحٌ إِلَىٰ رَبِّكَ كَدْحاً } معناه عَامِلٌ كَاسِبٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ نادى سبحانه الإنسان نداء تنبيه وتخطية، وتحريك حمية فطرية، وسلسلة جبلية فقال: { يٰأَيُّهَا ٱلإِنسَٰنُ } المصور على صورة الرحمن، المنتخب من بين سائر المظاهر لحكمة الخلافة والنيابة، ومصلحة المعرفة في التوحيد، فاعرف قدرك، ولا تغفل عن حقيقتك { إِنَّكَ كَادِحٌ } ساعٍ للتقرب والتوحيد { إِلَىٰ رَبِّكَ كَدْحاً } وسعياً منتهياً إلى إفناء هويتك في هوية الحق، وبالجملة: { فَمُلاَقِيهِ } [الانشقاق: 6] يعني: أنت ملاقٍ ربك بمقتضى سعيك واجتهادك، فلك ألاَّ تفترق ما يوصلك إليه، ويفنيك فيه بعد جذب من جانب الحق، وتوفيق من لدنه؛ لتكون من أرباب اليمن والكرامة، الموسومين بأصحاب اليمين، المؤتين لهم صحف أعمالهم من قِبَل أيمانهم التي هي علامة إيمانهم وعرفانهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الإِنسانُ } خطاب الجنس { إِنك كادِحٌ إِلى ربك كَدْحاً فمُلاقِيهِ } أي: جاهدٌ جادٌّ في السير إلى ربك\n فالكدح في اللغة: الجد والاجتهاد، أي: إنك في غاية الاجتهاد في السير إلى ربك، لأنَّ الزمان يطير طيراً وأنت في كل لحظة تقطع حظًّا من عمرك القصير، فإنك سائر مسرع إلى الموت، ثم تلاقي ربك\n قال الطيبي عن الإمام: في الآية نكتة لطيفة، وهي: أنها تدل على انتهاء الكدح والتعب للمؤمن بانتهاء هذه الحياة الدنيوية، ويحصل بعد ذلك محض سعادته وراحته الأبدية\n هـ\n قلتُ: إن كان كدحه في طلب مولاه حصل له بعد موته دوام الوصال، وصار إلى روح وريحان، وجنات ورضوان، وإن كان كدحه في طلب الحُور والقصور، بُشّر بدوام السرور، وربما اتصلت روحه بما كان يتمنى، وإن كان كدحه في طلب الدنيا مع إقامة الدين أفضى إلى الراحة من تعبه، وإن كان في طلب الحظوظ والشهوات مع التقصير، انتقل من تعب إلى تعبٍ والعياذ بالله\n وقال أبو بكر بن طاهر: إنك تُعامل ربك معاملة ستعرض عليك في المشهد الأعلى، فاجتهد ألاَّ تخجَل من معاملتك مع خالقك\n أهـ",
      "translations": []
    }
  ]
}