{
  "chapter": "البروج",
  "text": "وهو الغفور الودود",
  "translations": [
    {
      "translation": "He is the forgiving and the loving,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and He is the Ever Forgiving, the Most Loving\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the All-forgiving, the Most Loving One,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He only is the Oft Forgiving, the Beloved of His bondmen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is Oft-Forgiving, Al-Wadud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is the Forgiving, the Loving,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and He is the All-forgiving, the All-loving,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is the Forgiving, the Loving,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and He is the Forgiving and Loving One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is the Fogiving, the Loving,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and He is the All-forgiving, the All-affectionate,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is the Oft-Forgiving, Full of Loving-Kindness,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is Oft-Forgiving, full of love (towards the pious who are real true believers of Islamic Monotheism),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is the Forgiving, and the Loving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is the Forgiving, the Loving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is the Forgiving, the Affectionate,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[85:14] and He is the Forgiving, to sinning believers, the Loving, the One Who shows love to His friends through [His acts of] generosity,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And He is the Forgiving) He forgives he who repents of disbelief and believes in Allah, (the Loving) He loves His friends; and it is also said this means: He loves those who obey Him,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَهُوَ ٱلْغَفُورُ ٱلْوَدُودُ } معناه الحبيبُ القَريبُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَهُوَ } سبحانه بمقتضى سعة جوده ورحمته { ٱلْغَفُورُ } الستار المحاء لذنوب من تاب ورجع نحوه مخلصاً نادماً، وإن كبرت وكثرت، فإن رحمته أوسع منه وأشمل { ٱلْوَدُودُ } [البروج: 14] المحب لإخلاص المذنبين، وتوبة المستغفرين، وضراعة الخائفين المخبتين، المستحيين من الله، النادمين على ما صدر عنهم وقت الغفلة والغرور\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وهو الغفورُ } الساتر للعيوب، الغافر للذنوب، { الودودُ } المحب لأوليائه، أو: الفاعل بأهل طاعته ما يفعله الودود، من إعطائهم ما أرادوا، { ذو العرش } أي: خالقه ومالكه، وقيل: المراد بالعرش: المُلك، أي: ذو السلطة القاهرة { المجيدُ } بالجر صفة للعرش، وبالرفع صفة لذُو، أي: العظيم في ذاته، فإنه واجب الوجود، تام القدرة { فعَّالٌ لما يُريد } بحيث لا يتخلّف عن إرادته مراد من أفعاله تعالى وأفعال عباده، ففيه دلالة على خلق أفعال العباد، وهو خبر عن محذوف\n { هل أتاك حديثُ الجنود } أي: قد أتاك حديث الطاغية والأمم الخالية\n وهو استفهام تشويق مقرر لشدّة بشطه تعالى بالظَلَمة العصاة والكفرة العتاة\n وكونه فعال لما يُريد مع تسليته صلى الله عليه وسلم بأنه سيصيب قومه صلى الله عليه وسلم ما أصاب تلك الجنود\n { فرعونَ وثمودَ } بدل من الجنود لأنَّ المراد بفرعون هو وقومه\n والمراد بحديثهم: ما صدر منهم من التمادي على الكفر والضلال، وما حلّ بهم من العذاب والنكال، أي: قد أتاك حديثهم، وعرفت ما فعل بهم، فذكّر قومك ببطش الله تعالى، وحذّرهم أن يُصيبهم مثل ما أصاب أمثالهم\n { بل الذين كفروا في تكذيبٍ } ، إضراب عن مماثلتهم، وبيان لكونهم أشد منهم في الكفر والطغيان، كأنه قيل: ليسوا مثلهم في ذلك، بل هم أشد منهم في استحقاق العذاب واستيجاب العقاب، فإنهم مستقرُّون في تكذيبٍ شديد للقرآن الكريم، أو كأنه قيل: ليست جنايتهم مجرد عدم التذكُّر والاتعاظ بما سمعوا من حديثهم، بل هم مع ذلك في تكذيب شديدٍ للقرآن الناطق بذلك، لكن لا أنهم يكذبون بوقوع تلك الحادثات، بل لكون ما نطق به قرآناً من عند الله تعالى مع وضوح أمره، وظهور حاله، بالبينات الباهرة\n\n\n{ واللهُ من ورائهم محيط } عالم بأحوالهم، قادر عليهم، لا يفوتونه\n وهو تمثيل لعدم نجاتهم من بأس الله تعالى بعدم فوات المحاط المحيط\n { بل هو قرآن مجيد } أي: بل هذا الذي كذّبوا به قرآن شريف عالي الطبقة في الكتب السماوية، وفي نظمه وإعجازه، وهو رد لكفرهم وإبطال لتكذيبهم، وتحقيق للحق، أي: ليس الأمر كما قالوا، بل هو كتاب شريف { في لوح محفوظ } من التحريف والتبديل\n وقرأ نافع بالرفع صفة للقرآن، والباقي بالجر صفة للوح، أي: محفوظ من وصول الشياطين إليه\n واللوح عند الحسن: شيء يلوح للملائكة يقرؤونه، وعن ابن عباس رضي الله عنه: هو من درّة بيضاء، طوله ما بين السماء والأرض، وعرضه ما بين المشرق والمغرب، قلمه نور، وكل شيءٍ فيه مسطور\n قال مقاتل: هو عن يمين العرش، وقيل: أعلاه معقود بالعرش، وأسفله في حِجْرِ ملَك كريم هـ\n الإشارة: إنَّ الذين آمنوا إيماناً حقيقيًّا شهوديًّا، وعملوا الصالحات بأيدي القلوب والأرواح والأسرار، يعني العمل الباطني، لهم جنات المعارف، تجري من تحتها أنهار العلوم والحِكم، ذلك هو الفوز الكبير والسعادة العظمى\n إنَّ بطش ربك بأهل الإنكار الجاحدين لأهل الخصوصية لَشَدِيد، وهو غم الحجاب وسوء الحساب، إنه هو يُبدىء ويُعيد، يُبدىء الحجاب للمحجوبين، ويُعيد الشهود للعارفين، وهو الغفور للتائبين المتوجهين، الودود للسائرين المحبين\n قال الورتجبي: الغفور للجنايات، الودود بكشف المشاهدات\n هـ\n ذو العرش: ذو السلطة القاهرة على العوالم العلوية والسفلية",
      "translations": []
    }
  ]
}