{
  "chapter": "البروج",
  "text": "ان الذين فتنوا۟ المؤمنين والمؤمنت ثم لم يتوبوا۟ فلهم عذاب جهنم ولهم عذاب الحريق",
  "translations": [
    {
      "translation": "Those who persecute men and women of the muminun, and then do not make tawba, will have the punishment of Hell, will have the punishment of the Burning.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely for those who persecute believers, men and women, and do not repent afterwards, is the punishment of Hell, and the punishment of burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who tormented the believing men and the believing women and then did not repent, theirs shall be the chastisement of Hell, and theirs shall be the chastisement of burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who persecute the believing men and women without repenting will suffer the torment of hell and that of the burning fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who troubled the Muslim men and Muslim women, and then did not repent – for them is the punishment of hell, and for them is the punishment of fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who put into trial the believing men and believing women, and then do not turn in repentance, then they will have the torment of Hell, and they will have the punishment of the burning Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely (as for) those who persecute the believing men and the believing women, then do not repent, they shall have the chastisement of hell, and they shall have the chastisement of burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who persecute the believers, men and women, and then have not repented, there awaits them the chastisement of Gehenna, and there awaits them the chastisement of the burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! they who persecute believing men and believing women and repent not, theirs verily will be the doom of hell, and theirs the doom of burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who persecute the believing men and believing women, and then do not repent, will surely suffer the punishment of Hell, and the torment of burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who affected the believing men and the believing women, and then repented not, theirs shall be the torment of Hell, and theirs shall be the torment of burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who persecute the faithful, men and women, and do not repent thereafter, there is the punishment of hell for them and the punishment of burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who persecute (or draw into temptation) the Believers, men and women, and do not turn in repentance, will have the Penalty of Hell: They will have the Penalty of the Burning Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who put into trial the believing men and believing women (by torturing them and burning them), and then do not turn in repentance, (to Allah), will have the torment of Hell, and they will have the punishment of the burning Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who persecuted the believing men and women and never repented, there is for them the punishment of Gehenna (Hell), and for them the punishment of the burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who tempt the believers, men and women, then do not repent; for them is the punishment of Hell; for them is the punishment of Burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who have tortured the believing men and believing women and then have not repented will have the punishment of Hell, and they will have the punishment of the Burning Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[85:10] Indeed those who persecute believing men and believing women, by having them burnt, then do not repent, there will be for them the chastisement of Hell, [in return] for their disbelief, and there will [also] be for them the chastisement of burning, that is to say, the chastisement for their having had the believers burnt, in the Hereafter; but it is also said [that there is this chastisement for them] in this world, as when the fire rose up and burnt them, as [mentioned] above.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! they who persecute) those who burn and torture with fire (believing men) men who are true in their faith (and believing women) who are true in their faith (and repent not) from their idolatry and disbelief, (theirs verily will be the doom of hell) in the Hereafter, (and theirs the doom of burning) in the Fire; and it is also said: in the life of the world, for Allah had burned them with the Fire. These were people from Najran, and it is said from Mosul, who tortured and consequently killed a group of believers with fire in attempt to make them renounce their religion. The name of the king of these people is Yusuf, and it is said his name is Dhu'l-Nuwas.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّ ٱلَّذِينَ فَتَنُواْ ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَاتِ } معناه أَحرقُوهم\n\n",
      "translations": [
        {
          "translation": " The meaning of the saying of the Most High: {Indeed, those who torment the believing men and believing women} is that he burned them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إنّ } المحجوبين { الذين فتنوا المؤمنين والمؤمنات } من قلوب أهل الشهود ونفوسهم بالإنكار والاحتقار { ثم لم يتوبوا } أي: بقوا في الحجاب ولم يستبصروا فيرجعوا { فلهم عذاب جهنم } أي: من تأثير نار الطبيعة السفلية { ولهم عذاب } حريق القهر من نار الصفات فوق نار الآثار وذلك لشوقهم عند خراب البدن إلى أنوار الصفات في عالم القدس وحرمانهم وطردهم بقهر الحق فعذبوا بالنارين جميعاً",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { إِنَّ } المسرفين المفسدين { ٱلَّذِينَ فَتَنُواْ } وأحرقوا { ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَاتِ } ظلمّاً وعدواناً\n كراهة هدايتهم وإيمانهم { ثُمَّ } بعدما فعلوا من الإفراط والإسراف { لَمْ يَتُوبُواْ } إلى الله\n ولم يرجعوا نحموه سبحانه عن ظلمهم\n ولم يستغفروا نادمين { فَلَهُمْ عَذَابُ جَهَنَّمَ } الطرد والحرمان عن حضور الحنَّان المنَّان { وَلَهُمْ } ولحق بهم\n بسبب كفرهم بالله\n وإنكارهم توحيده { عَذَابُ ٱلْحَرِيقِ } [البروج: 10] بدل ما فعلوا بالمؤمنين من حرقهم في الأخاديد\n\n\nثمَّ عقب سبحانه وعيدهم بوعد المؤمنين فقال: { إِنَّ ٱلَّذِينَ آمَنُواْ } بوحدة الحق { وَ } أكدوا إيمانهم بأن { عَمِلُواْ ٱلصَّالِحَاتِ } المقرونة بالإخلاص في النيات { لَهُمْ } عند ربهم جزاء إيمانهم وأعمالهم تفضلاً عليهم { جَنَّاتٌ } منتزهات العلم والعين والحق { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } جداول المعارف والحقائق المنتشئة من بحر الحقيقة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنَّ الذين فتنوا المؤمنين والمؤمنات } أي: محقوهم في دينهم ليرجعوا عنه\n والمراد بهم: إمّا أصحاب الأخدود خاصة\n وبالمفتونين: المطروحين في الأخدود\n وإمّا الذين بَلوْهم في ذلك بالإذاية والتعذيب على الإطلاق\n وهم داخلون في جملتهم دخولاً أولياً\n قال ابن عطية: الأشبه أنَّ المراد بهؤلاء قريش\n حيث طانوا يُعَذَّبون مَن أسلم\n ويقويه بعض التقوية: قوله تعالى: { ثم لم يتوبوا } لأنه رُوي: أنّ أصحاب الأخدود ماتوا على كفرهم\n وأمّا قريش فكان منهم مَن تاب بعد نزول الآية\n هـ\n مختصراً\n { فلهم عذابُ جهنَّمَ } في الآخرة لكفرهم\n { ولهم عذابُ الحريق } في الدنيا لِما تقدّم أن النار انقلبت عليهم فأحرقتهم\n أو: عذاب الحريق: نار أخرى عظيمة تحرقهم في الآخرة\n لسبب فتنتهم للمؤمنين\n والجملة: خبر \" إن \" ودخلت الفاء لتضمين المبتدأ معنى الشرط\n ولا ضَرَرَ في نسخة بـ \" إنَّ \" وإن خالف في ذلك الأخفش\n\nالإشارة: والسماء ذات البروج\n أي: سماء الحقائق\n صاحبة المنازل التي تنزل فيها السالك في ترقِّبه إليها\n مَن أرض الشرائع\n كمقام التوبة\n ثم الصبر\n ثم الورع\n والزهد\n ثم التكُّل\n ثم الرضا والتسليم\n ثم المراقبة\n ثم المشاهدة\n واليوم الموعود يوم الفتح الأكبر\n وهو وقت الخروج من شهود الكون إلى شهود المكوِّن\n وشاهد هو الذي يشهد ذات الحق عياناً\n ومشهود\n هو عظمة الذات العلية وأسرارها وأنوارها\n وقال الورتجبي: الشاهد هو والمشهود هو\n يرى نفسه بنفسه\n أي: لا يراه أحد بالحقيقة سواه\n وأيضاً: الشاهد هو\n إذا تجلّى بتجلِّي الجمال والحس\n والمشهود قلوب العارفين شاهَدَها بنعت الكشف\n وأيضاً: اشاهد هو قلوب المحبين\n والمشهود لقاؤه\n وهو شاهدهم وهو مشهودهم\n هو شاهد العارف والعارف شاهده\n هـ\n قُتل أصحابُ الأخدود\n وهم الصادُّون عن طريق الحق أينما كانوا وكيف كانوا\n المعذِّبون لأهل التوجه\n وما نقموا منهم إلاّ طلب كمال الإيمان\n وتحقيق الإيقان\n إنّ الذي فتنوا أهل التوجه ثم لم يتوبوا فلهم عذاب البُعد ولهم عذاب الاحتراق بالحرص والتعب والخوف والجزع\n ثم ثنى باضدادهم\n فقال: { إِنَّ ٱلَّذِينَ آمَنُواْ وَعَمِلُواْ ٱلصَّالِحَاتِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:68",
      "similarity": 0.7451272890119353
    },
    {
      "verse": "29:24",
      "similarity": 0.6504705429496391
    },
    {
      "verse": "8:50",
      "similarity": 0.5895916163081273
    },
    {
      "verse": "3:181",
      "similarity": 0.5333918704931876
    },
    {
      "verse": "22:22",
      "similarity": 0.5240214455915481
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/85:10.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/85:10.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/85:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}