{
  "chapter": "البروج",
  "text": "ان الذين ءامنوا۟ وعملوا۟ الصلحت لهم جنت تجرى من تحتها الانهر ذلك الفوز الكبير",
  "translations": [
    {
      "translation": "But those who have iman and do right actions will have Gardens with rivers flowing under them. That is the Great Victory.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely for those who believe and do the right are gardens with rivers running by. That is the greatest success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believed and acted righteously, theirs shall be Gardens beneath which rivers flow. That is the great triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the righteously striving believers, they will live in Paradise wherein streams flow. This is the greatest triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who believed and did good deeds – for them are Gardens beneath which rivers flow; this is the great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who believe and do righteous good deeds, for them will be Gardens under which rivers flow. That is the supreme success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely (as for) those who believe and do good, they shall have gardens beneath which rivers flow, that is the great achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and do righteous deeds, for them await gardens underneath which rivers flow; that is the great triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who believe and do good works, theirs will be Gardens underneath which rivers flow. That is the Great Success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and do good deeds shall be rewarded with gardens watered by flowing rivers. That is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who believed and worked righteons works, theirs shall be Gardens whereunder the rivers flow; that is the supreme achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who have faith and do righteous deeds—for them will be gardens with streams running in them. That is the supreme success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who believe and do righteous deeds, will be Gardens; beneath which rivers flow: That is the great Salvation, (the fulfilment of all desires),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who believe and do righteous good deeds, for them will be Gardens under which rivers flow (Paradise). That is the great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(But) for those who believe and do good works, for them there are Gardens underneath which rivers flow that is the Great Victory!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and do righteous deeds will have Gardens beneath which rivers flow. That is the great triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who have believed and done righteous deeds will have gardens beneath which rivers flow. That is the great attainment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[85:11] Indeed those who believe and perform righteous deeds, for them there will be gardens underneath which rivers flow: that is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned the believers who did not renounce their religion despite being tortured, saying: (Lo! those who believe) in Allah (and do good works) privately between themselves and their Lord, (theirs will be Gardens beneath which) beneath its trees and habitations (rivers flow) rivers of wine, water, honey and milk flow. (That is the Great Success) they earned the Garden and were saved from the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ عقب سبحانه وعيدهم بوعد المؤمنين فقال: { إِنَّ ٱلَّذِينَ آمَنُواْ } بوحدة الحق { وَ } أكدوا إيمانهم بأن { عَمِلُواْ ٱلصَّالِحَاتِ } المقرونة بالإخلاص في النيات { لَهُمْ } عند ربهم جزاء إيمانهم وأعمالهم تفضلاً عليهم { جَنَّاتٌ } منتزهات العلم والعين والحق { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } جداول المعارف والحقائق المنتشئة من بحر الحقيقة، وبالجملة: { ذَلِكَ } القوم العظيم الشأن، البعيد رفعةً ومكانةً عن أفهام الأنام هو { ٱلْفَوْزُ ٱلْكَبِيرُ } [البروج: 11] والفضل العظيم الذي لا فوز أعظم منه وأرفقع\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِنّ الذين آمنوا } وصبروا على الإيمان { وعَمِلوا الصالحات } من المفتونين وغيرهم { لهم } بسبب ذلك الإيمان والعمل الصالح { جناتٌ تجري من تحتها الأنهارُ } ، إن أُريد بالجنات الأشجار فجريان الأنهار من تحتها ظاهر، وإن أُريد بها الأرض المشتملة عليها فالتحتية باعتبار جريها الظاهرة، فإنَّ أشجارها ساترة لساحتها، كما يعرب عنه اسم الجنة\n { ذلك هو الفوزُ الكبير } الذي تصغر عنده الدنيا وما فيها من فنون الرغائب بحذافيرها، والفوز: النجاة من الشر والظفر بالخير\n والإشارة إمّا إلى الجنة الموصوفة بما ذكر والتذكير لتأويلها بما ذكر، وإمّا إلى ما يفيده قوله: { لهم جنات\n\n\n } الخ، من حيازتهم لها، فإنَّ حصولها لهم مستلزم لحيازتهم لها قطعاً، وما فيه من البُعد للإيذان بعلو درجته، وبُعد منزلته في الفضل\n ومحله: الرفع، وخبره: ما بعده",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:89",
      "similarity": 0.7513441710626988
    },
    {
      "verse": "48:5",
      "similarity": 0.7402866814244887
    },
    {
      "verse": "10:9",
      "similarity": 0.6828283728305965
    },
    {
      "verse": "22:14",
      "similarity": 0.6331832400495828
    },
    {
      "verse": "4:13",
      "similarity": 0.6225864947378361
    }
  ]
}