{
  "chapter": "البروج",
  "text": "ان الذين ءامنوا۟ وعملوا۟ الصلحت لهم جنت تجرى من تحتها الانهر ذلك الفوز الكبير",
  "translations": [
    {
      "translation": "But those who have iman and do right actions will have Gardens with rivers flowing under them. That is the Great Victory.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely for those who believe and do the right are gardens with rivers running by. That is the greatest success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believed and acted righteously, theirs shall be Gardens beneath which rivers flow. That is the great triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the righteously striving believers, they will live in Paradise wherein streams flow. This is the greatest triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who believed and did good deeds – for them are Gardens beneath which rivers flow; this is the great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who believe and do righteous good deeds, for them will be Gardens under which rivers flow. That is the supreme success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely (as for) those who believe and do good, they shall have gardens beneath which rivers flow, that is the great achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and do righteous deeds, for them await gardens underneath which rivers flow; that is the great triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who believe and do good works, theirs will be Gardens underneath which rivers flow. That is the Great Success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and do good deeds shall be rewarded with gardens watered by flowing rivers. That is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who believed and worked righteons works, theirs shall be Gardens whereunder the rivers flow; that is the supreme achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who have faith and do righteous deeds—for them will be gardens with streams running in them. That is the supreme success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who believe and do righteous deeds, will be Gardens; beneath which rivers flow: That is the great Salvation, (the fulfilment of all desires),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who believe and do righteous good deeds, for them will be Gardens under which rivers flow (Paradise). That is the great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(But) for those who believe and do good works, for them there are Gardens underneath which rivers flow that is the Great Victory!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and do righteous deeds will have Gardens beneath which rivers flow. That is the great triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who have believed and done righteous deeds will have gardens beneath which rivers flow. That is the great attainment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[85:11] Indeed those who believe and perform righteous deeds, for them there will be gardens underneath which rivers flow: that is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned the believers who did not renounce their religion despite being tortured, saying: (Lo! those who believe) in Allah (and do good works) privately between themselves and their Lord, (theirs will be Gardens beneath which) beneath its trees and habitations (rivers flow) rivers of wine, water, honey and milk flow. (That is the Great Success) they earned the Garden and were saved from the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّ الذين آمنوا } الإيمان العيني الحقيّ { وعملوا الصالحات } في مقام الاستقامة من الأفعال الإلهية المقتضية لتكميل الخلق وضبط النظام { لهم جنّات } من الجنان الثلاث { تجري من تحتها } أنهار علوم توحيد الأفعال والصفات والذات وأحكام تجلياتها { ذلك الفوز الكبير } التامّ الذي لا فوز أكبر منه\n { إنّ بطش ربّك } بالقهر الحقيقي والإفناء { لشديد } لا يبقي بقية ولا أثراً { إنه هو يبدىء } البطش { ويعيد } أي: يكرره\n يبدىء أولاً بإفناء الأفعال ثم يعيد بإفناء الصفات ثم بالذات { وهو الغفور } يستر ذنوب وجودات المحبين وبقاياهم بنوره { الودود } للمحبوبين بإيصالهم إلى جنابه وتنعيمهم وإكرامهم بكمالاته من غير رياضة { ذو العرش } أي: المستوي على عرش قلوب أحبائه من العرفاء { المجيد } ذو العظمة المتجلي بصفات الكمال من الجمال والجلال { فعّال لما يريد } على مظاهرهم لاستقامتهم فيختارون اختياره في أفعالهم أو يحجب من يريد بجلاله كالمنكرين ويتجلى لمن يريد بجماله كالعارفين\n { هل أتاك حديث } المحجوبين إما بالأنائية كفرعون ومن يدين بدينه أو بالآثار والأغيار كثمود ومن يتصل بهم { بل الذين كفروا } حجبوا مطلقاً في أي مقام كان وبأي شيء كان { في تكذيب } لأهل الحق لوقوفهم مع حالهم { والله من ورائهم } فوق حالهم وحجابهم { محيط } يسع كل شيء وهم حصروه في شاهدهم وما شهدوا إحاطته فلذلك أنكروا { بل هو } أي: هذا العلم { قرآن } جامع لكل العلوم { مجيد } لعظمته وإحاطته\n { في لوح } هو القلب المحمدي { محفوظ } عن التبديل والتغيير وإلقاء الشياطين بالتخييل والتزوير هذا إذا حلّ اليوم الموعود على القيامة الكبرى\n فأما إذا أوّل بالصغرى فمعناها: الروح ذات الأبدان فإن الأبدان للأرواح كالأبراج أو الحواس فإنها تخرج منها كالحمام من البروج وشاهد لعلمه وما عمل\n وجواب القسم ليهلكنّ البدنيون\n { قتل أصحاب الأخدود } \n أي: أهلك القوى النفسانية الملازمة لأخدود البدن إذ هم عليها عاكفون وهم على ما يفعلون بمؤمني القوى الروحانية من الاستيلاء عليهم وحجبهم عن مقاصدهم الشريفة وكمالاتهم النفيسة واستعبادهم في أهوائهم وشهواتهم شهود بألسنة أحوالهم وما أنكر هذه القوى المحجوبة عن الكمالات المعنوية من الروحانيين إلا الإيمان بالله المجرّد عن الأين والجهة الغالب على المحجوبين بالقهر الحميد المنعم على المهتدين بالهداية المحتجب بظواهر ملك السماوات والأرض الشهيد الظاهر على كل شيء\n إن هؤلاء الفاتنين بالاستيلاء والاستخدام لمؤمني العقول ومؤمنات النفوس ثم لم يرجعوا بالرياضة واكتساب الملكات الفاضلة والانقياد لهم فلهم عذاب جهنم الآثار والطبيعة وعذاب حريق الشوق إلى المألوفات مع الحرمان عنها\n إن الذين آمنوا الإيمان العلمي من الروحانيين وعملوا الصالحات من الفضائل والأخلاق الحميدة لهم جنّات من جنان الأفعال والصفات وهي جنات النفوس والقلوب\n ذلك الفوز أي: النجاة من النار والوصول إلى المقصود الكبير بالنسبة إلى الحالة الأولى",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وبالجملة: { ذَلِكَ } القوم العظيم الشأن\n البعيد رفعةً ومكانةً عن أفهام الأنام هو { ٱلْفَوْزُ ٱلْكَبِيرُ } [البروج: 11] والفضل العظيم الذي لا فوز أعظم منه وأرفقع\n\n\nثمَّ أشار سبحانه إلى تهديد أصحاب الضلال\n المنحرفين عن جادة الاعتدال",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِنّ الذين آمنوا } وصبروا على الإيمان { وعَمِلوا الصالحات } من المفتونين وغيرهم { لهم } بسبب ذلك الإيمان والعمل الصالح { جناتٌ تجري من تحتها الأنهارُ } \n إن أُريد بالجنات الأشجار فجريان الأنهار من تحتها ظاهر\n وإن أُريد بها الأرض المشتملة عليها فالتحتية باعتبار جريها الظاهرة\n فإنَّ أشجارها ساترة لساحتها\n كما يعرب عنه اسم الجنة\n { ذلك هو الفوزُ الكبير } الذي تصغر عنده الدنيا وما فيها من فنون الرغائب بحذافيرها\n والفوز: النجاة من الشر والظفر بالخير\n والإشارة إمّا إلى الجنة الموصوفة بما ذكر والتذكير لتأويلها بما ذكر\n وإمّا إلى ما يفيده قوله: { لهم جنات\n\n\n } الخ\n من حيازتهم لها\n فإنَّ حصولها لهم مستلزم لحيازتهم لها قطعاً\n وما فيه من البُعد للإيذان بعلو درجته\n وبُعد منزلته في الفضل\n ومحله: الرفع\n وخبره: ما بعده",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:89",
      "similarity": 0.7513441710626988
    },
    {
      "verse": "48:5",
      "similarity": 0.7402866814244887
    },
    {
      "verse": "10:9",
      "similarity": 0.6828283728305965
    },
    {
      "verse": "22:14",
      "similarity": 0.6331832400495828
    },
    {
      "verse": "4:13",
      "similarity": 0.6225864947378361
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/085011.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/085011.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/85:11.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}