{
  "chapter": "البروج",
  "text": "قتل اصحب الاخدود",
  "translations": [
    {
      "translation": "cursed be the Companions of the Pit -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That accursed are the men of the trench\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the people of the pit were destroyed\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "may the people be condemned those who tortured (the believers) in ditches\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Accursed be the People of the Ditch!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cursed were the People of the Ditch.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cursed be the makers of the pit,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "slain were the Men of the Pit,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Self-)destroyed were the owners of the ditch\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "destroyed were the people of the trench,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perish the fellows of the ditch,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "perish the People of the Ditch!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe to the makers of the pit (of fire),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cursed were the people of the ditch (the story of the Boy and the King).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The companions of the pit were killed\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Destroyed were the People of the Trench.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cursed were the companions of the trench\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[85:4] perish, accursed be, the men of the ditch!, the pit in the ground,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Self-)destroyed were the owners of the ditch\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قُتِلَ أَصْحَابُ ٱلأُخْدُودِ } معناه لُعِنَ أصحابُ الإِخْدُودِ، والإخدودُ: الحُفرة والجَمعُ أخاديدٌ\n وكانوا باليَمنِ فَحَفَروا للمؤمنينَ هذه الحُفرةِ ثم أوقدوا فيها ناراً وقذفُوهم فيهَا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah {the people of the ditch were killed}, means the people of the ditch were cursed, and the ditch is the grave and the gathering of the dead.\n\n\nAnd they were in Yemen, so they dug this trench for the believers, then they lit a fire in it and threw them into it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nكما { قُتِلَ } ولُعن { أَصْحَابُ ٱلأُخْدُودِ } [البروج: 4] الخد: الشق في الأرض وغيرها\n رُوي أنه كان لملك ساحر فكبر\n فضم إليه غلاماً\n ليعلمه\n وكان في طريق الغلام را هب يستمع منه كلاماً\n فرأى في طريقه يوماً حية حبست الناس\n فأخذ الغلام حجراً فقال: اللهم إن كان الراهب أحب إليك من الساحر فاقتلها\n فقتلها\n وكان بعد ذلك يبرئ الأكمه والأبرص\n ويشفي المريض\n فعمي جليس للملك\n فابرأه\n فأسلم\n فسأله الملك: من أبرأك؟ فقال: ربي\n\n\nفغضب الملك عليه\n فعذبه فدل على الغلام\n فعذبه فدل على الراهب\n فقده بالمنشار\n وذهب بالغلام إلى جبل\n ليُطرح من أعلاه\n فرجف بالقوم\n فطاحوا ونجا الغلام\n فذهب به إلى سفينة\n ليغرق\n فكفأت السفينة بمن معه ونجا\n\n\nوقال الغلام للملك: لست بقاتلي حتى تأخذ سهماً من كنانتي\n وتقول: بسم الله رب الغلام\n ثمَّ ترميني به\n فرماه فقال: بسم الله رب الغلام\n فأصاب صدغه\n فوضع عليه يده فمات\n فآمن الناس\n\n\nوقيل للملك: نزل بك ما كنت تحذر\n فأمر بحفر أخاديد\n فأوقدت فيها النيران\n فمن لم يرجع منهم طرحه فيها حتى جات امرأة مع صبي رضيع\n فتقاعست فقال الرضع بإلهام الله إياه\n مع أنه في غير أوان تكلمه\n مثل عيسى النبي - صلوت الله عليه -: يا أماه اصبري\n فإنك على الحق",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n } الخ، كأنه قيل: أقسم بهذه الأشياء أنّ كفار قريش ملعونون كما لُعن { أصحابُ الأخدود } أو: هو قتل بعينه على حذف اللام، لطول الكلام، أي: لقد قُتل أصحاب الأخدود، والمراد: تثبيت المؤمنين على ما هم عليه من الإيمان، وتصبيرهم على أذى الكفرة، وتذكيرهم بما جرى على مَن تقدمهم من التعذيب، وصبرهم على ذلك، حتى يأنسوا ويصبروا على ما كانوا يلقون من قومهم، ويعلموا أنَّ هؤلاء الكفرة بمنزلة أولئك، ملعونون مثلهم\n\n\nوالأخدود: الخد في الأرض، أي: الشق\n رُوي في الصحيح عن النبي صلى الله عليه وسلم أنه قال:\n\n \" كان لبعض الملوك ساحر، فلمّا كبر، قال للملك: قد كبرتُ فابعث إليّ غلاماً أعلّمه السحر، فضمّ إليه غلاماً ليعلّمه، وكان في طريق الغلام راهبٌ، فسمع منه وأعجبه، وكان يحتبس عنده، فيضربه الساحرُ، فقال له الراهبُ: إذا خشيت الساحرَ، فقل له: حبسني أهلي، وإذا خشيتَ أهلك، فقل: حبسني الساحرُ، فرأى في طريقه ذات يوم دابة قد حبست الناس، وقيل: كانت أسداً، وقيل: ثُعباناً، فأخذ حجراً، وقال: اللهم إن كان الراهب أحبّ إليك من الساحر فاقتلها، فقتلها، وكان الغلام تعلَّم من الساحر اسم الله الأعظم، فكان الغلام يُبرىء الأكمه والأبرص، ويشفي من الأدواء، فعمي جليس الملكُ فأبراه، وأبصره الملكُ، فقال: مَن ردَّ عليك بصرك؟ فقال: ربي، فغضب، فعذّبه، فدلّ على الغلام، فعذّبه، فدلّ على الراهب، فلم يرجع عن دينه، فقدّ بالمنشار، وأبى الغلامُ، فذهب به إلى جبل ليطرح من ذروته فدعا، فرجف بالقوم، فطاحوا، ونجا، فذهب به إلى قُرْقُورة ـ وهي السفينة ـ فلجَجوا به ليغرقوه، فدعا، فانكفأتْ بهم السفينةُ، فغرقوا، ونجا، فقال للملك: لستَ بقاتلي حتى تجمع الناسَ في صعيد، وتصلبني على جذع، وتأخذ سهماً من كنانتي، وتقول: بسم الله ربّ الغلام، ثم ترميني به، فرماه فوقع في صدغه، فوضع يده عليه ومات\n فقال الناس: آمنا بربّ الغلام، فقيل للملك: نزل بك ما كنت تحذر، فخدّ أخدوداً، فملأها ناراً، فمَن لم يرجع عن دينه طرحه فيها، حتى جاءت امرأة معها صبيٌّ، فتقاعست، فقال الصبيّ: يا أماه! اصبري، فإنك على الحق، فاقتحمت بصبيها\n وقيل لها: قعي ولا تنافقي، ما هي إلاّ غميضة \" \n\nوالحديث في صحيح مسلم\n واسم الغلام: عبد الله بن الثامر، واسم الراهب: فيميون، واسم الملك: ذو نواس\n وقد ذكر القصة الكلاعي بتمامها\n وقيل: تعددت قضية الأخدود، فكانت واحدة بنجران باليمن، والأخرى بالشام، والأخرى بفارس، فنزل القرآن في الذي بنجران\n انظر التثعلبي\n قال سعيد بن المسيب: كنا عند عمر، إذ ورد عليه أنهم وجدوا ذلك الغلام حين حفروا خربة، وأُصْبعه على صُدْغِه كما قتل، فكلما مدت يده رجعت مكانها، فكتب عمر: أن واروه حيث وجدتموه\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "31:18",
      "similarity": 0.36997903388873893
    },
    {
      "verse": "56:38",
      "similarity": 0.04194685377907743
    },
    {
      "verse": "56:27",
      "similarity": 0.04191553352965938
    },
    {
      "verse": "56:8",
      "similarity": 0.041897039187337635
    },
    {
      "verse": "90:18",
      "similarity": 0.04189460468726714
    }
  ]
}