{
  "chapter": "الطارق",
  "text": "والسماء والطارق",
  "translations": [
    {
      "translation": "By Heaven and the Night-Comer!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I CALL TO witness the heavens and the night Star --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the heaven, and the night-visitor,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the heavens and al-tariq.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By oath of the heaven, and by oath of the nightly arriver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the heaven, and At-Tariq;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I swear by the heaven and the comer by night;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By heaven and the night-star!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the heaven and the Morning Star\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the heavens and that which comes in the night --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the heaven and the night-comer\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the heaven, and by the nightly visitor\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the Sky and the Night-Visitant (therein);-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the heaven, and At-Tariq (the night-comer, i.e. the bright star);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the sky, and by the nightly comer!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the sky and at-Tariq.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the sky and the night comer -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[86:1] By the heaven and the night-visitor! (al-tāriq actually denotes any thing that comes by night, including stars, because they come out at night).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said concerning the interpretation of Allah's saying (By the heaven and the Morning Star): '(By the heaven and the Morning Star) He says: Allah swears 746 by the heaven and the morning star\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ والسماء والطارق } أي: والروح الإنساني والعقل الذي يظهر في ظلمة النفس وهو النجم الذي يثقب ظلمتها وينفذ فيها فيبصر بنوره ويهتدي به كما قال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلسَّمَآءِ } أي: وحق سماء الأسماء اللاهوتية، المصونة عن مطلق التغيير والزوال، المتعالية عن مدارك الوهم ومشاعر الخيال { وَ } بحق { ٱلطَّارِقِ } [الطارق: 1] الذي يتخطف منها على آحاد الرجال بعدما هاجروا عن بقعة الناسوت متشمرين بالعزيمة الخالصة نحو فضاء اللاهوت بمقتضى الجذب الجبلي، والميل الفطري المعنوي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { والسماءِ والطارقِ } ، عظّم تعالى قَدْر السماءِ في أعين الخلق لكونها معدن رزقهم، ومسكن ملائكته، وفيها خلق الجنّة، فأقسم بها وبالطارق، والمراد: جنس النجوم، أو جنس الشهُب التي يُرجم بها، لعِظم منفعتها، ثم عظَّمه ونوّه به، فقال: { وما أدراك ما الطارقُ } بعد أن فخّمه بالإقسام به، تنبيهاً على رفعة قدره بحيث لا يناله إدراك الخلق، فلا بد من تلقَّيه من الخلاّق العليم، أي: أيّ شيء أعلمك بالطارق، ثم فسّره بقوله: { النجمُ الثاقبُ } المضيء، فكأنّه يثقب الظلام بضوئه فينفذ فيه، ووصف بالطارق لأنه يبدو بالليل، كما يُقال للآتي ليلاً: طارق، أو: لأنه يطرق الجنِّيَّ، أي: يُصكّه\n وقيل: المراد به كوكب معهود، قيل:هو الثريا، وقيل زُحل، وقيل الجدي\n ثم ذكر المقسَم عليه، فقال: { إِن كُلُّ نفسٍ لمَّا عليها حافظٌ } ، \" إن \" نافية، و \" لمّا \" بمعنى \" إلاّ \" في قراءة مَن شدّدها، وهي لغة هذيل يقولون: \" نشدتك الله لمّا قمت \" أي: إلاّ قمت، أي: ما كل نفس إلاّ عليها حافظ مهيمن رقيب، وهو الله عزّ وجل، كما في قوله تعالى:\n\n[الأحزاب:52] أو: مَن يحفظ عملها، ويحصي عليها ما تكسب من خير أو شر كما في قوله تعالى:\n\n[الانفطار:10] أو: مَن يحفظها من الآفات، ويذب عنها كما في قوله تعالى:\n\n[الرعد:11]، وفي الحديث عنه صلى الله عليه وسلم:\n\n \" وكِّل بالمؤمن ستون ومائة ملك، يذبون عنه ما لم يُقدّر عليه، كما يذب عن قصعة العسل الذبابَ، ولو وكل المرء إلى نفسه طرفة عين لاختطفته الشياطين \" \n\nثم قرأ صلى الله عليه وسلم: { إن كل نَفْس\n\n } الخ\n و \" ما \": صلة في قراءة من خفف، أي: إنه، أي: الأمر والشأن كل نفس لعليها حافظ\n { فلينظر الإنسانُ مِمَّ خُلق } ، لمّا ذكر أنَّ على كل نفسٍ حافظاً، أمره بالنظر في أوّل نشأته، وبالتفكُّر فيها حق التفكُّر، حتى يتضح له أنَّ مَن قَدَر على إنشائه من موادٍ لم تشم رائحة الحياة قط، فهو قادر على إعادته، فيعمل ليوم الإعادة والجزاء ما ينفعه يومئذٍ ويُجزى به، ولا يملي على حافظه ما يُرديه، فالفاء فصيحة تُنبىء عن هذه الجُمل، أي: إذا علم أنَّ على كل إنسان حفظة يحفظونه من الآفات، أو يكتبون أعماله، خيره وشرها، دقيقها وجليلها، وأنه لم يُخلَق عبثاً، ولم يُترك سُدى، فلينظر في أول نشأته حتى يتحقق أنَّ له صانعاً، فيعبده ولا يشرك به شيئاً، ثم فسَّر أصل نشأته فقال: { خُلق من ماء دافقٍ } ، فهو استئناف بياني، كأنه قيل: مِمَّ خُلق؟ فقال: خُلق من ماء دافق، والدفق: صبٌّ فيه دفعٌ وسرعة، والدفق في الحقيقة لصاحبه، والاستناد إلى الماء مجاز، ولم يقل: من ماءين لامتزاجهما في الرحم واتحادهما\n\n\n{ يَخرج من بين الصُلب والترائب } أي: صُلب الرجل وترائب المرأة، وهي عِظام صدرها، حيث تكون القلادة، وقيل: العظم والعصب من الرَجل، واللحم والدم من المرأة، وقال بعض الحكماء: إنَّ النظفة تتولد من فضل الهضم الرابع، وتنفصل عن جميع الأعضاء، حتى تستعد لأنّ يتولّد منها مثل تلك الأعضاء ومقرها عروق مُلتف بعضها على بعض عند البيضتيْن، فالدماغ أعظم معونة في توليدها، ولذلك كان الإفراط في الجماع يُورث الضعف فيه، وله خليفة هو النخاع، وهو في الصلب، وفيه شُعب كثيرة نازلة إلى الترائب، وهما أقرب إلى أوعية المَني، فلذا خُصّا بالذكر، فالمعنى على هذا: يخرج من بين صلب الرجل وترائبه وصلب المرأة وترائبها، وهو الأحسن، وبه صدر ابن جزي\n { إِنه } أي: الخالق، لدلالة \" خُلِق \" عليه، أي: إنَّ الذي خلق الإنسانَ ابتداء من نُطفة، { على رَجْعِه } على إعادته بعد موته { لقادرٌ } بيّن القدرة\n وجِيء بـ \" إنّ \" واللام وتنكير الخبر ليدل على رد بليغ على مَن يدّعي أنه لا حشر ولا بعث، حتى كأنه لا تتعلق القدرة بشيء إلاَّ بإعادة الأرواح إلى الأجساد، { يومَ تُبلى السرائرُ } أي: تكشف ويُتصفَّح ما فيها من العقائد والنيات وغيرها، وما أخفي من الأعمال، ويتبين ما طاب منها وما خبث\n والسرائر: القلوب، هو ظرف لـ \" رَجْعِه \" ، أي: إنه لقادر على رده بالبعث في هذا اليوم الذي تُفضح فيه السرائر، { فما له مِن قوةٍ } في نفسه يمتنع بها { ولا ناصرٍ } ينتصر به ويدفع عنه غير الله تعالى\n ولمّا كان رفع المكان في الدنيا إمّا بقوة الأنسان، وإمّا بنصر غيره له، أخبر الله بنفيهما يوم القيامة\n الإشارة: أقسم تعالى بقلب العارف، لأنه سماءٌ لشمس العرفان وقمرِ الإيمان ونجوم العلم، وبما يطرقه من الواردات الإلهية والنفحات القدسية ثم نوّه بذلك الطارق، فقال: { وما أدراك ما الطارق النجم الثاقب } أي: هو نجم العلم الثاقب لظلمة الجهل، إمّا جهل الشرائع أو جهل الحقائق\n إن كُلُّ نفس لمّا عليها حافظ، وهو الله، فإنه رقيب على الظواهر والبواطن، ففيه حث على تدقيق المراقبة ظاهراً وباطناً\n فلينظر الإنسانُ مِمَّ خُلق في عالم الحكمة من جهة بشريته خُلق من ماء دافق، يخرج من محل البول ويقع في محل البول، فإذا نظر إلى أصل بشريته تواضع وانكسر، وفي ذلك عِزُّه وشرفُه، مَن تواضع رفعه الله\n وفيه روح سماوية قدسية، إذا اعتنى بها وزكّاها، نال عز الدارين وشرف المنزلين \" مَن عرف نفسه عرف ربه \" فالإنسان من جهة بشريته أرضي، ومن جهة روحانيته سماوي، والحُكم للغالب منهما\n إنه على رجعه: أي: رده إلى أصله، حين برز من عالم الغيب، بظهور روحه، لقادر، فيصير روحانيًّا سماويًّا، بعد أن كان بشريًّا أرضيًّا، وذلك يوم تُبلى السرائر بإظهار ما فيها من المساوىء، ليقع الدواء عليها، فتذهب، فمَن لم يَفضح نفسه لم يظفر بها، فما لها من قوةٍ على جهادها وإظهار مساوئها بين الأقران إلاّ بالله، ولا ناصر ينصره على الظفر بها إلاَّ مِن الله، ولا حول ولا قوة إلا بالله\n ثم أقسم على حقيَّة كتابه المحفوظ، فقال: { وَٱلسَّمَآءِ ذَاتِ ٱلرَّجْعِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:168",
      "similarity": 0.8825727947147074
    },
    {
      "verse": "86:2",
      "similarity": 0.8237612755013983
    },
    {
      "verse": "20:104",
      "similarity": 0.7575307560688637
    },
    {
      "verse": "46:30",
      "similarity": 0.7440381557972973
    },
    {
      "verse": "20:63",
      "similarity": 0.727814374854889
    }
  ]
}