{
  "chapter": "الأعلى",
  "text": "سبح اسم ربك الاعلى",
  "translations": [
    {
      "translation": "GLORIFY THE NAME of your Lord, most high,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glorify the name of your Lord, the Most High,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), glorify the Name of your lord, the Most High,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim the Purity of your Lord, the Supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glorify the Name of your Lord, the Most High.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glorify the name of your Lord, the Most High,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Magnify the Name of thy Lord the Most High\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise the name of thy Lord the Most High,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glorify the name of your Lord, the Most High,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hallow thou the name of thine Lord, the Most High,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Celebrate the Name of your Lord, the Most Exalted,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glorify the name of thy Guardian-Lord Most High,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glorify the Name of your Lord, the Most High,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalt the Name of your Lord, the Highest,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise the Name of your Lord, the Most High.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalt the name of your Lord, the Most High,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[87:1] Glorify the Name of your Lord, that is, exalt your Lord above what does not befit Him (ism [in isma rabbika, ‘the Name of your Lord’] is extra), the Most High (an adjective qualifying rabbika, ‘your Lord’),\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said concerning the interpretation of Allah's saying (Praise the name of thy Lord the Most High): '(Praise the name of your Lord the Most High) He says: pray, Muhammad, by the command of your Lord the Most High, Who is Higher than all things; it is also said that this means: remember, Muhammad, the divine Oneness of your Lord; and it is said this means: say, Muhammad, in your prostration \"praise be to my Lord the Most High\",\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ سَبِّحِ } يا من غرق في تيار بحث زخَّار الوجود، وتلاشى في لمعات شمس الشهود { ٱسْمَ رَبِّكَ ٱلأَعْلَىٰ } [الأعلى: 1] وإن لم يبق لك التوسل بمطلق الأسماء، بعدما فنيت في المسمى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { سَبّح اسمَ ربك } أي: نزّه اسمه تعالى عن الإلحاد فيه، بالتأويلات الزائغة، وعن إطلاقه على غيره بوجهٍ يوجب الاشتراك في معناه، فلا يُسمى به صنم ولا وثن ولا شيء مما سواه تعالى، قال تعالى:\n\n[مريم:65] فلا يُقال لغيره تعالى: رب وإله، وإذا كان أَمَر بتنزيه اللفظ فتنزيه الذات أحرى، أو: نزّه اسمه عن ذكره لا على وجه الإجلال والإعظام، أو: نزّه ذاته المقدَّسة عما لا يليق بها، فيكون \" اسم \" صلة\n و \" الأعلى \" صفة لرب، وهو الأظهر\n وعُلوه تعالى: قهريته واقتداره، أو: تعاليه عن سمة الحدوث وعن مدارك العقول، فلا يُحيط به وصف واصف أو علم عارف، لا علو مكان\n أو صفة للاسم، وعلوه بعلو مسماه، وقيل: قل: سبحان ربي الأعلى\n لمّا نزل:\n\n[الواقعة:74] قال صلى الله عليه وسلم:\n\n \" اجعلوه في ركوعكم \" \n\nفلما نزل: { سبح اسم ربك الأعلى } قال:\n\n \" اجعلوه في سجودكم \" \n\nوكانوا يقولون في الركوع: لك ركعت، وفي السجود: لك سجدت، فجعلوا هذا مكانه\n { الذي خلق فسَوَّى } أي: خلق كل شيء فسَوَّى خلقه، ولم يأتِ به متفاوتاً غير متلائم، ولكن على إحكام وإتقان، دلالةً على أنه صادر عن عالم حكيم، أو: سَوَّاه على ما يتأتى به كماله ويتيسّر به معاشه، { والذي قَدَّر فهدى } أي: قّدَّر الأشياء في أزله، فهدى كل واحد إلى ما سبق له من شقاوة وسعادة، ورزقٍ وأجل، أو: ما قَدَّر لكل حيوان ما يُصلحه، فهداه إليه، وعرَّفه وجه الانتفاع به، فترى الولد بمجرد خروجه من بطن أمه يلتمس غذاه، وكذا سائر الحيوانات، فسبحان المدبِّر الحكيم: { الذي أخرج المرعى } أي: أنبت ما ترعاه الدواب غضًّا طريًّا، { فجعله } بعد ذلك { غُثاءً } يابساً هشيماً { أحوى } أسود، فـ \" أحوى \" صفة لغُثاء، وقيل: حال من المرعى، أي: أخرجه أحوى من شدة الخضرة، فمضت مدة، فجعله غثاءً يابساً\n وهذه الجمل الثلاث صفة للرب\n ولمّا تغايرت الصفات وتباينت أتى لكل صفة بموصول\n وعطف على كل صلة ما يترتب عليها\n { سنُقرئك فلا تنسى } أي: سنعلمك القرآن فلا تنساه، وهو بيان لهدايته تعالى الخاصة برسوله صلى الله عليه وسلم، إثر بيان هدايته العامة لكافة مخلوقاته، وهي هدايته صلى الله عليه وسلم لتلقي الوحي، وحفظ القرآن الذي هو أهدى للعالمين، مع ضمانه له\n والسين إمّا للتأكيد، وإمّا لأنَّ المراد إقراء ما أوحي إليه حنيئذٍ وما سيوحى إليه، فهو وعد كريم باستمرار الوحي في ضمن الوعد بالإقراء، أي: سنقرئك ما نوحي إليك الآن وفيما بعد على لسان جبريل عليه السلام، أو: سنجعلك قارئاً فلا تنسى أصلاً، من قوة الحفظ والإتقان مع أنك أُمِّي لا تدري ما الكتاب وما القراءة، ليكون ذلك آية أخرى لك مع ما في تضاعيف ما تقرأ من الآيات البينات من حيث الإعجاز، ومن حيث الإخبار بالمغيبات\n\n\nوقوله تعالى: { إلاَّ ماشاء اللهُ }: استثناء مفرغ من أعم المفاعيل، أي: فلا تنسى شيئاً من الأشياء إلاَّ ما شاء الله أن تنساه بأن ننسخ تلاوته، وهذا إشارة من الله لنبيه أن يحفظ عليه الوحي، فلا يتفلت منه شيءٌ، إلاَّ ما شاء الله نسخه، فيذهب به عن حفظه، ويرفع حُكمه وتلاوته\n قال الكواشي: إلاَّ ما شاء اللهُ أن ننسيكه على سبيل النسخ، أو تنساه ثم تذكره بعد\n رُوي أنه صلى الله عليه وسلم أسقط آية في الصلاة، فظنّ أُبي أنها نُسخت، فسأله، فقال:\n\n \" نسيتها \" \n\n، قال الشيخ السنوسي: والمحققون على منع النسيان لشيءٍ من الأقوال البلاغية قبل التبليغ، لإجماع السلف، وأما بعد التبليغ، فجائز لأنه من الأعراض البشرية\n هـ\n وفي الحديث:\n\n \" إنما أنا بشَرٌ، أنسى كما تَنْسَوْن، فإذا نسيتُ فذكِّروني \" \n\nالحديث\n فالسهو في حق الأنبياء جائز، لأنه من قهرية الربوبية، لتتميز به العبودية من الربوبية، فليس بنقصٍ في حقهم، بل كما، ليحصل التشريع والاقتداء\n وقيل: \" لا \" ناهية، وإثبات الألف للفاصلة، كقوله:\n\n[الأحزاب:67] أي: لا تغفل عن قراءته وتكراره فتنساه، إلاَّ ما شاء الله أن ينسيك برفع تلاوته، وهو ضعيف\n { إِنه يعلم الجهرَ وما يخفى } أي: يعلم ما ظهر وما بطن، التي من جملتها ما أوحى إليك، فينسى ما شاء اللهُ إنساءه، ويبقى محفوظاً ما شاء إبقاءه، أو: يعلم جهرك بالقراءة مع قراءة جبريل مخافة التفلُّت، وما في نفسك مما يدعوك إلى الجهر، أو: ما تقرأ في نفسك مخافة النسيان، وما تجهر به، أو: يعلم ما أعلنتم وما أسررتم من أقوالكم وأفعالكم، وما ظهر وما بطن من أحوالكم\n قال الورتجبي: السر والعلانية عنده تعالى سواء، إذا هو يبصرهما ببصره القديم، ويعلمهما بالعلم القديم، وليس في القِدم نقص، بحيث يتفاوت عنده الظاهر والباطن إذ هناك الظاهر هو الباطن، والباطن هو الظاهر لأنَّ الظاهر ظهر من ظاهريته، والباطن من باطنيته\n هـ\n { ونُيسّرك لليُسرى } ، معطوف على \" سنقرئك \" وما بينهما اعتراض، أي: ونوفّقك للطريقة التي هي أيسر وأسهل، وهي الشريعة السمحة التي هي أسهل الشرائع، أو: نوفّقك توفيقاً مستمراً للطريقة اليسرى في كل باب من أبواب الدين، علماً وتعليماً، هداية واهتداءً، فيندرج فيه تلقي الوحي والإطاحة بما فيه من الأحكام التشريعية السمحة، والنواميس الإلهية، مما يتعلق بتكميل نفس صلى الله عليه وسلم وتكميل غيره، كما يفصح عنه قوله: { فذَكِّر\n\n } الخ\n وتخصيص التيسير به عليه السلام، مع أنه يسري إلى غيره، للإيذان بقوة تمكنه صلى الله عليه وسلم من اليسرى والتصرُّف فيها، بحيث صار ذلك ملكة راسخة له، كأنه عليه السلام جُبل عليها\n\n\nقاله أبو السعود\n الإشارة: نزِّه ربك أن ترى معه غيره، وقدِّسه عن الحلول والاتحاد، قال القشيري: أي: سبِّح ربك بمعرفة أسمائه واسبَح بسرّك في بحر عطائه، واستخرج من بواهر علوه وسناه ما ترفع به عند مدحه من ثنائه\n هـ\n قال الورتجبي: أي: نزِّه اسمه عن أن يكون له سميًّا، من العرش إلى الثرى، حتى يكون بقدس اسمه مقدساً عن رؤية الأغيار، ويصل بقدس اسمه إلى رؤية قدس الصفات، ثم إلى رؤية قدس الذات\n هـ\n الأعلى فوق كل شيء، والقريب دون كل شيء، فهو عليٌّ في قربه، قريب في علوه، ليس فوقه شيء، وليس دونه شيء، الذي خلق أظهر الأشياءَ فسوَّى صورتها، وأتقن خلقها\n والذي قدّر المراتب، فهدى إلى أسباب الوصول إليها، والذي أخرج المرعى، أي: ما ترعى في بهجته وحسن طلعته الأرواح من مظاهر الذات، وأنوار الصفات، فجعله غثاءً أحوى، فتلوّن من طلعة الجمال إلى قهرية الجلال\n قال القشيري: أخرج المرعى: أي: المراتع الروحانية لأرباب الأرواح والأسرار والقلوب، لِيَرْعَوا فيها أعشاب المواهب الإلهية والعطايا اللاهوتية، وأخرج المراتع الجسمانية لأصحاب النفوس الأمَّارة والهوى المتبع، ليرتعوا فيها من كلأ اللذات الحيوانية الشهوانية\n هـ\n سنقرك: سنلهمك من العلوم والأسرار ما تعجز عنه العقول، فلا تنسى، إلاّ ما شاء اللهُ أن تنساه، إنه يعلم الجهر، أي: ما يصلح أن تجهر به من تلك العلوم، وما يخفى وما يجب إخفاءه عن غير أهله\n ونُيسرك للطريقة اليُسرى، التي تُوصل إلى الحضرة الكبرى\n قال القشيري: أي: طريق السلوك إلى الله وهي الجذبة الرحمانية التي توازي عمل الثقلين\n هـ\n فحينئذ تصلح للدعاء إلى الله والتذكير به، كما قال تعالى: { فَذَكِّرْ إِن نَّفَعَتِ ٱلذِّكْرَىٰ }\n\n",
      "translations": []
    }
  ]
}