{
  "chapter": "الأعلى",
  "text": "صحف ابرهيم وموسى",
  "translations": [
    {
      "translation": "the texts of Ibrahim and Musa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Books of Abraham and Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Scrolls of Abraham and Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Scriptures of Abraham and Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the Books of Ibrahim and Moosa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Scriptures of Ibrahim and Musa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The scriptures of Ibrahim and Musa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the scrolls of Abraham and Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Books of Abraham and Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the scriptures of Abraham and Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Writs of Ibrahim and Musa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the scriptures of Abraham and Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Books of Abraham and Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Scriptures of Ibrahim (Abraham) and Musa (Moses).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Scrolls of Abraham and Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Scriptures of Abraham and Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The scriptures of Abraham and Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[87:19] the scrolls of Abraham and Moses, the ten scrolls of Abraham and the Torah of Moses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The Book of Abraham and Moses) the Scripture of Moses is the Torah and only Allah knows about the Scripture of Abraham'. And of the surah in which the Overwhelming is mentioned, which is all Meccan, and consists of 26 verse, 92 words and 381 letters: Surah 88: The Overwhelming (al-Gashiyah) And of the surah in which the Overwhelming is mentioned, which is all Meccan, and consists of 26 verse, 92 words and 381 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ هَـٰذَا } الذي وعظك الحق به يا أكمل الرسل، ووصاك بالفلاح { لَفِي ٱلصُّحُفِ ٱلأُولَىٰ } [الأعلى: 18] أي: مثبت، مسطور على وجهه، وتلك الصحف { صُحُفِ } جدك يا أكمل الرسل { إِبْرَاهِيمَ } الفائق في الخلة والفلاح على عموم أرباب الصلاح والنجاح { وَمُوسَىٰ } [الأعلى: 19] الكليم الفائز من عند الله بالفوز العظيم، وهو مرتبة التكليم مع الله العزيز العليم\n\n\n\n\nجعلنا الله من خدَّامهم وتراب أقدامهم\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها الطالب للفلاح الأخروي الحقيقي والنجاح المعنوي أن تزكي أولاً نفسك عن مطلق الرذائل العائقة عن التوجه الحقيقي نحو الحق، وتصفي سرك عن الميل إلى مزخرفات الدنيا الدنية وأمانيها الغير الهنية، فلك أن ترغب نفسك عن مقتضيات الإمكان، ولا تغريها إلى لذاتها وشهواتها، فعليك أن تلازم الخلوة والخمول، وتجتنب عن أصحاب الثروة والفضول حتى يعينك الحق إلى التلقي بالقبول بما يوجبك الفلاح والفوز بالنجاح\n\n\n\n\nافتح لنا أبواب رحمتك إنك أنت الفتاح\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله تعالى: { صحف إِبراهيمَ وموسى } بدل من \" الصُحف الأُولى \"\n وفي حديث أبي ذر:\n\n \" قلت: يا رسول الله: كم كتاباً أنزل اللهُ؟ قال: \" مائة كتاب وأربعة كتب، أنزل على شيث خمسين صحيفة، وعلى إدريس ثلاثين صحيفة، وعلى إبراهيم عشر صحائف، وعلى موسى قبل التوراة عشر صحائف، وأنزل التوراة والإنجيل والزبور والفرقان \" قال: قلت: يا رسول الله: ما كانت صُحف إبراهيم عليه السلام؟ قال: \" كانت أمثالاً كلها، أيها الملك المسل‍ّط المغرور،إني لم أبعثك لتجمع الدنيا بعضها على بعض ولكن بعثتك لِتَرُدّ على دعوة المظلوم، فإني لا أردها ولو من كافر\n وكان فيها: وعلى العاقل أن تكون له ساعات، ساعة يناجي فيها ربه، وساعة يُحاسب فيها نفسه، وساعة يُفكر في صنع الله عزّ وجل إليه، وساعة يخلو فيها لحاجته من المطعم والمشرب\n وعلى العاقل ألاَّ يكون ظاعناً إلا لثلاث: تزور لمعاد، أو مرمة لمعاش، أو لذة في غير محرم\n وعلى العاقل أن يكون بصيراً بزمانه، مقبلاً على شأنه، حافظاً للسانه، ومَن حسب كلامه من عمله قَلّ كلامه إلاّ فيما يعنيه \" قلت: يا رسول الله فما كانت صُحف موسى عليه السلام؟ قال: \" كانت عِبَراً كلها عجبت لمَن أيقن بالموت كيف يفرح، عجبت لمَن أيقن بالقدر ثم هو ينصب ـ أي يتعب، عجبت لمَن رأى الدنيا وتقلُّبها بأهلها ثم اطمأن إليها، وعجبت لمَن أيقن بالحساب غداً ثم لا يعمل \" قلت: يا رسولَ الله وهل في الدنيا شيء مما كان في يدي إبراهيم وموسى، مما أنزل الله عليك، قال: \" نعم، اقرأ يا أبا ذر: { قد أفلح مَن تزكى\n\n } الآية إلى السورة \" ثم قال: قلت: يا رسول الله، أوصني\n قال: \" أوصيك بتقوى الله عزّ وجل، فإنه رأس أمرك \" قلت: زدني، قال: \" عليك بتلاوة القرآن وذكرِ الله عزّ وجل، فإنه ذكر لك في السماء ونور لك في الأرض \" قلت: يا رسول الله زدني، قال: \" إياك وكثرة الضحك، فإنه يُميت القلب، ويذهب بنور الوجه \" ، قلت: يا رسول الله زدني قال: \" عليك بالجهاد، فإنه رهبانية أمتي \" ، قلت: يا رسول الله زدني، قال: \" عليك بالصمت إلاَّ مِن خير، فإنه مطردة للشيطان، وعون لك على أمر دنياك \" \n\n \n\nهـ\n وعن كعب الأحبار أنه قال: قرأتُ في العشر صحف التي أنزل ا للهُ على موسى عليه السلام سبعة اسطار متصلة، أول سطر منها: مَن أصبح حزيناً على الدنيا أصبح ساخطاً على الله، الثاني: مَن كانت الدنيا أكبر همه نزع اللهُ خوف الآخرة من قلبه، الثالث: مَن شكى مصيبة نزلت به كأنما شكى الله عزّ وجل، الرابع: مَن تواضع لِمَلِك مِن ملوك الدنيا ذهب ثلث دينه، الخامس: مَن لا يبالي من أي الأبواب أتاه رزقه لم يُبال اللهُ من أي أبواب جهنم يدخله ـ يعني من حلال أو حرام، السادس: مَن أتى خطيئَة وهو يضحك دخل النار وهو يبكي، والسابع: مَن جعل حاجته إلى آدمي جعل اللهُ الفقر بين عينيه\n هـ\n الإشارة: فَذكِّرْ أيها العارف الدالّ على الله إن نفعت الذكرى إن رجوتَ أو توهمتَ نفع تذكيرك، فإن تحققتَ عدم النفع فلا تتعب نفسك في التذكير، فربما يكون بطالة، كتذكير العدو الحاسد لك، أو المعاند، أو المنهمك في حب الرياسة، فتذكير هؤلاء ضرب في حديد بارد\n وينبغي للمذَكِّر أن يكون ذا سياسة وملاطفة، قال تعالى:\n\n[النحل:125]الخ، والحكمة: هي أن تٌقر كلَّ واحد في حكمته، وتدسه منها إلى ربه، فأهل الرئاسة تقرهم فيها وتدلهم على الشفقة والرحمة بعباد الله، وأهل الدنيا تُقرهم فيها وتدلهم على بَذلها، وأهل العلم تُقرهم في علمهم وتحضهم على الإخلاص وبذل المجهود في نشره، وأهل الفقر تقرهم فيه وتُرغبهم في الصبر\n\n\n وهكذا، فإن رأيتَ أحداً تشوّف إلى مقام أعلى مما هو فيه فدُلّه عليه، وأهل التذكير لهم عند الله جاه كبير، فأحَبُّ الخلق إلى الله أنفعهم لعياله، كما في الحديث\n وفي حديث آخر:\n\n \" إنَّ أود الأوداء إليَّ مَن يحببني إلى عبادي، ويحبِّب عبادي إليّ، ويمشي في الأرض بالنصيحة \" \n\nأو كما قال عليه السلام: { سَيذَّكَّر مَن يخشى } أي: ينتفع بتذكيري مَن يخشى الله، وسبقت له العناية، ويتجنّبها الأشقى: أي: ويعرض عنها مَن سبق له الشقاء\n\n\nقال القشيري: الشقي: مَن يعرف شقاوته، والأشقى: مَن لا يعرف شقاوته، الذي يصلى النار الكبرى، وهي الخذلان والطرد والهجران، والنار الصغرى: تتبع الحظوظ والشهوات\n هـ\n ثم لا يموت فيها ولا يحيى، أي: لا تموت نفسه عن هذا، ولا تحيا روحه بشهود هؤلاء\n قد أفلح مَن تَزَكَّى، أي: فاز بالوصول مَن تطهَّر مِن هوى نفسه، بأن طَهَّر نفسه من المخالفات، وقلبه من الغفلات والدعوات، وروحه من المساكنات إلى الغير، وسره عن الأنانية، بل تُؤثرون الحياة الدنيا عن التوجُّه إلى الحضرة القدسية، والدار الآخرة التي يدوم فيها الشهود خير وأبقى، وهذا الأمر، وهو التزهيد في الدنيا، والتشويق إلى الله، في صُحف الرسل والأنبياء، قال القشيري: لأنَّ التوحيد والوعد والوعيد لا يختلف في الشرائع\n هـ\n وقال الورتجبي: إنَّ هذا أي: الخروج عما سوى الله بنعت التجريد، في صحف إبراهيم، كما قال:\n\n[الأنعام:78] والإقبال على الله، بقوله:\n\n[الأنعام:79] الخ\n وفي صحف موسى: سرعة الشوق إلى جماله والندم على الوقوف في المقامات: بقوله:\n\n[الأعراف:143]\n هـ\n أي: وبقوله:\n\n[طه:84]\n وبالله التوفيق\n وصلّى الله على سيدنا محمد وآله\n\n",
      "translations": []
    }
  ]
}