{
  "chapter": "الأعلى",
  "text": "الا ما شاء الله انه يعلم الجهر وما يخفى",
  "translations": [
    {
      "translation": "except what Allah wills. He knows what is voiced out loud and what is hidden.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unless God may please. He knows the visible and knows what is hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except what Allah should wish. He knows all that is manifest and all that is hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "unless God wills it to be otherwise. He knows all that is made public and all that remains hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except what Allah wills; indeed He knows all the evident and all the concealed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except what Allah may will He knows what is apparent and what is hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except what Allah pleases, surely He knows the manifest, and what is hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "save what God wills; surely He knows what is spoken aloud and what is hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save that which Allah willeth. Lo! He knoweth the disclosed and that which still is hidden;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except whatever God wills; He knows both what is manifest and what is hidden --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save that which Allah may will. Verily He knoweth the public and that which is hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except what Allah may wish. Indeed, He knows the open and what is hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except as Allah wills: For He knoweth what is manifest and what is hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except what Allah, may will, He knows what is apparent and what is hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except what Allah wills, surely, He knows all that is (spoken) aloud and what is hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except what God wills. He knows what is declared, and what is hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except what Allah should will. Indeed, He knows what is declared and what is hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[87:7] except what God may will, that you forget, by abrogating its recitation and its ruling — the Prophet (s) used to recite aloud while Gabriel recited, fearing to forget, and so it is as though it was said to him, ‘Do not hasten in it; you will not forget and so do not weary yourself by reciting it aloud’; assuredly He, exalted be He, knows what is overt, of words and deeds, and what is hidden, of both of these.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Save that which Allah willeth) and Allah willed that you do not forget; and the Prophet (pbuh) never forgot a bit of the Qur'an after this. (Lo! He knoweth the disclosed) He knows the works that are done and the words that are said in the open (and that which still is hidden) of secrets which you have thought about in yourself;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ سنقرئك } نجعلك قارئاً لما في كتاب استعدادك الذي هو العقل القرآني من القرآن الجامع للحقائق فتذكره ولا تنساه أبداً { إلا ما شاء الله } أن ينسيك ويذهلك عنها فيدخر للمقام المحمود إذا بعثت فيه { إنه يعلم الجهر } أي: ما ظهر فيك من الكمال { وما يخفى } بعد بالقوة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ مَا شَآءَ ٱللَّهُ } العليم الحكيم نسيانه منك بأن نسخ تلاوته أو حكمه أو كلاهما على مقتضى حكمته المتقنة المستحكمة ومصلحته\n وبعدما سمعت يا أكمل الرسل ما سمعت فدم عليها\n ولا تغفل سراً وجهراً\n وحالاً ومقالاً عنها { إِنَّهُ } سبحانه { يَعْلَمُ } منك { ٱلْجَهْرَ وَمَا يَخْفَىٰ } [الأعلى: 7] أي: ظاهرك وباطنك\n يعني: ما امتثلت بظاهرك من مقتضيات الوحي الإلهام\n وبباطنك من الإخلاص في النيات والحالات والخلوص في العزائم والمقامات\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:7",
      "similarity": 0.871242952202852
    },
    {
      "verse": "71:8",
      "similarity": 0.7373172595008021
    },
    {
      "verse": "4:148",
      "similarity": 0.6792158192777081
    },
    {
      "verse": "6:3",
      "similarity": 0.6280005591452156
    },
    {
      "verse": "21:110",
      "similarity": 0.6131114767476998
    }
  ]
}