{
  "chapter": "الأعلى",
  "text": "فذكر ان نفعت الذكرى",
  "translations": [
    {
      "translation": "So remind them if reminder is profitable:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So render good counsel if good counsel will avail.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, keep on preaching as long as it is of benefit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore advise, if advising is beneficial.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore remind in case the reminder profits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore do remind, surely reminding does profit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore remind, if the Reminder profits,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefor remind (men), for of use is the reminder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remind, if the reminder can be of benefit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore admonish thou; admonition hath surely profited,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So admonish, for admonition is indeed beneficial:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore give admonition in case the admonition profits (the hearer).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore remind (men) in case the reminder profits (them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore remind, if the Reminder benefits,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So remind, if reminding helps.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So remind, if the reminder should benefit;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[87:9] So remind, admonish by the Qur’ān, in case the reminder should be of benefit, to the one whom you might remind, the one mentioned in [the following verse] ‘he [who fears] will be reminded’, in other words, even if it might not be of benefit, for it is of benefit to some but of no benefit to others.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therefore remind (men)) admonish by means of the Qur'an and through Allah, (for of use is the reminder) He says: admonition by means of the Qur'an and through Allah does not benefit except he who fears Allah, i.e. the believer.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما يسرنا لك وسلهنا عليك طريق الهداية والإرشاد { فَذَكِّرْ } يعني: عظ بالقرآن وبين الأحكام الموردة فيه للناس { إِن نَّفَعَتِ ٱلذِّكْرَىٰ } [الأعلى: 9] أي: سواء نفعت عظتك وتذكيرك إياهم أو لم تنفع؛ إذ ما عليك إلاَّ البلاغ، وعلينا الحساب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { فَذَكِّرْ } الناسَ حسبما سَيّرناك له بما يُوحى إليك من الحق الهادي إلى الحق، واهدهم إلى ما فيه سعادتهم الأبدية كما كنت تفعل، أي: دُم على تذكيرك\n وتقييد التذكير لِمَا أنَّ رسول الله صلى الله عليه وسلم طالما كان يُذَكرِّهم ويستفرغ جهده في وعظهم، حرصاً على إيمانهم، فما كان يزيد ذلك لبعضهم إلاَّ نفوراً، فأمر عليه السلام أن يخص الذكر بمظان النفع في الجملة، بأن يكون مَن يُذَكِّره ممن يُرجَى منه التذكُّر، ولا يتعب نفسه في تذكير مَن لا ينفعه ولا يزيده إلاّ عتوًّا ونفوراً، ممن طَبع اللهُ على قلبه، فهو كقوله:\n\n[قَ:45] وقوله تعالى:\n\n[النجم:29] وقيل المعنى: ذَكّر إن نفعت وإن لم تنفع، فحذف المقابل، كقوله:\n\n[النحل:81]، واستبعده ابن جُزي لأنَّ المقصود من الشرط استبعاد إسلامهم، كقوله: عظ زيد إن سمع منك، تريد: إن سماعه بعيد، ونسب هذا ابن عطية لبعض الحُذَّاق، قلت: الأَوْلى حمل الآية على ظاهرها، وأنه لا ينبغي الوعظ إلاّ لمَن تنفعه وتؤثر فيه، وأمّا مَن تحقّق عناده فلا يزيده إلاّ عناداً، والقرائن تكفي في ذلك",
      "translations": []
    }
  ]
}