{
  "chapter": "الغاشية",
  "text": "لسعيها راضية",
  "translations": [
    {
      "translation": "well-pleased with their efforts",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Well-pleased with their endeavour,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "well-pleased with their striving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and pleased with the result of their deeds in the past.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rejoicing over their efforts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glad with their endeavor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Well-pleased because of their striving,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "with their striving well-pleased,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glad for their effort past,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "well pleased with the result of their striving,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With their endeavour well pleased.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "pleased with their endeavour,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pleased with their striving,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glad with their endeavour (for their good deeds which they did in this world, along with the true Faith of Islamic Monotheism).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "well pleased with their striving,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satisfied with their endeavor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With their effort [they are] satisfied\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[88:9] pleased by their efforts, in the [life of the] world [expended] in obedience, [pleased] in the Hereafter upon seeing the reward thereof;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Glad for their effort past) He says: they are pleased with the reward of their works,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لِّسَعْيِهَا } الذي تحملته من أنواع المتاعب والمشاق في نشأة الدنيا { رَاضِيَةٌ } [الغاشية: 9] سيما بعدما رأت ما ترتب على سعيها من الجزاء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n[المطففين:24]، { لسعيها راضية } أي: لأجل سعيها في الدنيا هي راضية في الآخرة بما أعطاها عليه من الثواب الجسيم، أو: رضيت بعملها وطاعتها لما رأت ما أداهم إليه من الكرامة والثواب، { في جنةٍ عالية } علو المكان أو المقدار، { لا تسمع فيها لاغية } أي: لغو، أو كلمة ذات لغو، أو نفسٌ لاغية، فإنَّ كلام أهل الجنة كله أذكار وحِكم، أو: لا تسمع يا مخاطَب، فيمن بناه للفاعل\n { فيها عين جاريةٌ } أي: عيون كثيرة تجري مياهها، كقوله:\n\n[التكوير:14] أي: كل نفس، { فيها سُررٌ مرفوعة } رفيعة السمْك أو المقدار، ليرى المؤمن بجلوسه عليه جميع ما خوّله رَبُّه من المُلك والنعيم، { وأكواب موضوعة } بين أيديهم ليتلذذوا بالرؤية إليها، أو موضوعة على حافات العيون مُعَدّة للشرب، { ونمارقُ } وسائد ومرافق { مصفوفة } بعضها إلى جنب بعض، بعضها مسندة، وبعضها مطروحة، أينما أراد أن يجلس جلس على وسادة، وأستند إلى أخرى، { وزرابيّ } أي: بُسُط فاخرة، جمع \" زِرْبيَّة \" ، { مبثوثةٌ } مبسوطة، أو مُفرّقة في المجالس\n ولمّا أنزل الله هذه الآيات وقرأها النبي صلى الله عليه وسلم فسّرها بأنَّ ارتفاع السرير يكون مائة فرسخ، والأكواب الموضوعة لا تدخل تحت حساب، لكثرتها، وطول النمارق كذا، وعرض الزاربيِّ كذا، أنكر المشركون ذلك، وقالوا: كيف يصعد على هذا السرير؟ وكيف تكثر الأكواب هذه الكثرة، وتطول النمارق هذا الطول، وتُبسط الزاربي هذا الانبساط، ولم نشهد ذلك في الدنيا؟! ذكَّرهم الله بقوله: { أفلا ينظرون إِلى الإِبل كيف خُلقت } طويلة عالية، ثم تبرك حتى تُركب ويحمل عليها، ثم تقوم، وكذا السرير يطأطىء للمؤمن كما تطأطىء الإبل حتى يركب عليها، أو: أفلا ينظرون إلى الإبل التي هي نُصب أعينهم، يستعملونها كل حين، كيف خُلقت خلقاً بديعاً معدولاً عن سَنَن سائر الحيوانات، في عظم جثتها وشدّة قوتها، وعجيب هيئاتها اللائقة بتأتي ما يصدر منها من الأفاعيل الشاقة، كالنوْء بالأوقار الثقيلة، وحمل الأثقال الفادحة إلى الأقطار النازحة، وفي صبرها على الجوع والعطش، حتى إنَّ ضمأها ليبلغ العشْر فصاعداً، واكتفائها باليسير، ورعيها كل ما تيسّر من شوك وشجر، وانقيادها إلى كل صغير وكبير، حتى إن فأرة أخذت بزمام ناقة فجرته إلى غارها، فتبعتها الناقة إلى فم الغار\n وفي الإبل خصائص أُخر تدل على كمال قدرته تعالى، كالاسترواح مع الحَدَّاء إذا عيت، إلى ما فيها من المنافع من اللحوم والألبان والأوبار والأشعار، وغير ذلك، والظاهر ما قاله الإمام، وتبعه الطيبي، من أنه احتجاج بشواهد قدرته تعالى على فاتحة السورة من مجيء الغاشية، وأنَّ المخبر بها قادر عليها، فيتوافق العقل والنقل\n\n\nهـ\n قاله المحشي\n { وإِلى السماء كيف رُفعت } رفعاً بعيداً بلا عُمُد ولا مُسَّاك، أو بحيث لا ينالها فَهم ولا إدراك، { وإِلى الجبال } التي ينزلون في أقطارها، وينتفعون بمياهها وأشجارها في رعي تلك الإبل وغيرها { كيف نُصبت } نصباً رصيناً، فهي راسخة لا تميل ولا تميد، { وإِلى الإرض كيف سُطحت } سطحاً بتوطئة وتمهيد وتسوية حسبما يقتضيه صلاح أمور ما عليها من الخلائق\n قال الجلال: وفي الآية دليل على أنَّ الأرض سطح لا كرة، كما قال أهل الهيئة، وإن لم ينقض ركناً من أركان الشرع\n هـ\n وفي ابن عرفة، في قوله تعالى:\n\n[الزمر:5] أنَّ الآية تدل على أنَّ السماء كروية قال: لأنَّ من لوازم تكويرهما تكوير محلهما لاستحالة تعلقهما دون مكان\n هـ\n وفي الأبي: الذي عليه الأكثر من الحكماء وغيرهم أنَّ السموات والأرض كرتان\n هـ\n الإشارة: وجوه يومئذ ناعمة بلذة الشهود والعيان، لأجل سعيها بالمجاهدة، راضية، حيث وصَّلتها إلى صريح المشاهدة، في جنة عالية، جنان المعارف، لا تسمع فيها لاغية لأنَّ أهلها مقدّسون من اللغو والرفث، كلامهم ذكر وصمتهم فكر، فيها عين جارية من قلوبهم بالعلوم والحِكم، فيها سُرر المقامات مرفوعة، يرتفعون منها إلى المعرفة، وأكواب موضوعة كِيسَان شراب الخمرة، وهي محافل الذكر والمذاكرة، ونمارق مصفوفة، وسائد الرّوح والريحان حيث سقطت عنهم الكلف، ورموا حِملهم على الحي القيوم، وزرابي مبثوثة بُسط الأنس في محل القدس، أفلا يستعملون الكفرة والنظرة، حتى تقيم أرواحهم في الحضرة، فإنَّ الفكرة سِراج القلب، فإذا ذهبت فلا إضاءة له، وهي سير القلب إلى حضرة الرب، فينظرون إلى الإبل كيف خُلقت فإنه تجلي غريب، وإلى السماء كيف رُفعت به، وإلى الأرض كيف سُطحت من هيبته، وقال: القشيري: الإبل: النفوس الأمّارة، لقوله عليه السلام:\n\n \" الناس كإبل مائة لا تكاد تجد فيها راحلة \" \n\nهـ وإلى الأرواح كيف رُفعت لأنها محل أفكار العارفين، وإلى جبال العقل كيف نُصبت لتمييز الحس من المعنى، والشريعة من الحقيقة، وإلى الأرض البشرية كيف سُطحت، حيث استولت عليها الروحانية، وتصرفت فيها\n ثم حضَّ على التذكير ثانياً، فقال: { فَذَكِّرْ إِنَّمَآ أَنتَ مُذَكِّرٌ }\n\n",
      "translations": []
    }
  ]
}