{
  "chapter": "الفجر",
  "text": "كلا بل لا تكرمون اليتيم",
  "translations": [
    {
      "translation": "No indeed! You do not honour orphans",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No. In fact you are not generous to the orphans,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But no; you do not treat the orphan honourably,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Since wealth does not necessarily guarantee everlasting happiness) then why do you not show kindness to the orphans,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not at all – but rather you do not honour the orphan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But no! But you treat not the orphans with kindness and generosity!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! but you do not honor the orphan,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No indeed; but you honour not the orphan,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but ye (for your part) honour not the orphan\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No indeed, but you show no kindness to the orphan,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By no means! But ye honour not the orphan,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No indeed! No, you do not honour the orphan,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, nay! but ye honour not the orphans!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! But you treat not the orphans with kindness and generosity (i.e. you neither treat them well, nor give them their exact right of inheritance)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No! But you show no good to the orphan,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not at all. But you do not honor the orphan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No! But you do not honor the orphan\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[89:17] No indeed! — a disavowal [of this notion], in other words, honour is not about wealth, nor is there any humiliation in poverty, rather it has to do with obedience and disobedience [respectively]; but the disbelievers of Mecca unmindful of this. Rather they do not honour the orphan, they do not treat him with   kindness, despite their wealth, or [it means that] they do not give him what is his due from an inheritance,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay) this is a reply to them: No, but the honour I bestow is due to My acknowledgment of some My servants and the success I give to them, while My despising is because I turn away from some servants and completely forsake them, (but ye (for your part) honour not the orphan) you do not acknowledge the right of the orphan when he is under your care.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { كَلاَّ } ردعاً له من هذا الاعتقاد بأن الكرامة باليسر والتوسعة والإهانة بالفقد والفقر { بَل } الكرامة بالإنفاق والإطعام على فقراء الله؛ طلباً لمرضاة الله، وأنتم أيها الأغنياء { لاَّ تُكْرِمُونَ ٱلْيَتِيمَ } [الفجر: 17] ولا تتفقدونه بالنفقة والكسوة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n[القصص:78] وإنما أعطاه الله ابتلاءً من غير استحقاق منه، فردّ تعالى عليه زعمه بقوله: { كلاَّ } أي: ليس الإكرام والإهانة في كثرة المال وقلّته، بل الإكرام في التوفيق للطاعة، والإهانة في الخذلان فـ \" كلا \" ردع للإنسان عن مقالته، وتكذيب له في الحالتين، قال ابن عباس: المعنى: لم أبتله بالغنى لكرامته عليّ، ولم أبتله بالفقر لهوانه عليّ، بل ذلك بمحض القضاء والقدر\n وقوله تعالى: { بل لا تُكرِمون اليتيمَ } انتقال من بيان سوء أقواله إلى بيان سوء أفعاله، والالفتات إلى الخطاب للإيذان بمشافهته بالعتاب، تشديداً للتقريع، وتأكيداً للتشنيع، والجمع باعتبار معنى الإنسان، إذ المراد به الجنس، أي: بل لكم أحوال أشد شرًّا مما ذكر، وأدل على تهالككم على المال، حيث يُكرمكم الله تعالى بكثرة المال فلا تؤدون ما يلزمكم فيه من إكرام اليتيم بالمبّرة به",
      "translations": []
    }
  ]
}