{
  "chapter": "الفجر",
  "text": "وجا۟ىء يومئذۭ بجهنم يومئذ يتذكر الانسن وانى له الذكرى",
  "translations": [
    {
      "translation": "and that Day Hell is produced, that Day man will remember; but how will the remembrance help him?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Hell is brought near, that day will man remember, but of what avail will then remembering be?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when Hell is brought near that Day. On that Day will man understand, but of what avail will that understanding be?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day, hell will be brought closer and the human being will come to his senses, but this will be of no avail to him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when hell is brought that day – on that day will man reflect, but where is the time now to think?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Hell will be brought near that Day. On that Day will man remember, but how will that remembrance avail him\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hell is made to appear on that day. On that day shall man be mindful, and what shall being mindful (then) avail him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and Gehenna is brought out, upon that day man will remember; and how shall the Reminder be for him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hell is brought near that day; on that day man will remember, but how will the remembrance (then avail him)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and Hell is made to appear on that Day, then man will be mindful, but what will being mindful then avail him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Hell on that Day shall be brought nigh. On that Day man shall remember, but how will remembrance avail him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the day when hell is brought [near], man will take admonition on that day, but what will that admonition avail him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Hell, that Day, is brought (face to face),- on that Day will man remember, but how will that remembrance profit him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Hell will be brought near that Day. On that Day will man remember, but how will that remembrance (then) avail him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and Gehenna (Hell) is brought near on that Day the human will remember, and how shall the Reminder be for him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on that Day, Hell is brought forward. On that Day, man will remember, but how will remembrance avail him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And brought [within view], that Day, is Hell - that Day, man will remember, but what good to him will be the remembrance?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[89:23] and Hell on that day is brought [near], pulled by seventy thousand sets of reins, each set of reins [pulled] by the hands of seventy thousand angels, as it groans and seethes in fury; on that day (yawma’idhin is a substitution for idhā, ‘when’, the response to which is [the following]) man, that is to say, the disbeliever, will remember, his prodigal conduct in it, but how will remembering avail him [now]? (the interrogative is meant as a denial, in other words, his remembering that will not be of any use to him).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "754 (And hell is brought near) with 70,000 registers, with each register 70,000 angels leading it to the place of mustering, and then they reveal them (that day) the Day of Judgement; (on that day man) the disbelieving man; i.e. Ubayy Ibn Khalaf and Umayyah Ibn Khalaf (will remember) will be admonished, (but how will the remembrance (then avail him)) when the time for being admonished has passed?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَنَّىٰ لَهُ ٱلذِّكْرَىٰ } معناه من أينَ لَهُ الذّكرى\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Exalted is He}, what does it mean? {And how could he have remembrance?}",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَجِيۤءَ يَوْمَئِذٍ بِجَهَنَّمَ } أي: أُحضرت تهويلاً على أصحابها وتفضيعاً { يَوْمَئِذٍ } أي: يوم القيامة التي ظهرت فيها هذه الآثار { يَتَذَكَّرُ ٱلإِنسَانُ } معاصيه وقول من يزجره عنها وينذره، فيندم عليها ويتأسف { وَأَنَّىٰ لَهُ ٱلذِّكْرَىٰ } [الفجر: 23] أي: من أين ينفعه التذكر والذكرى حينئذٍ؛ إذ نشأة الاختبار والتلاقي قد انقضت؟!\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يومئذ يتذكّرُ الإِنسانُ } أي: يتّعظ، وهو بدل من إذا دُكت والعامل فيه: يتذكّر أي: إذا دُكت الأرض ووقع الفصل بين العباد يتذكر الإنسان ما فرّط فيه بمشاهدة جزائه، { وأنَّى له الذِّكْرَى } أي: ومن أين له الذكرى؟ لفوات وقتها في الدنيا، { يقول يا ليتني قدمتُ لحياتي } هذه، وهي حياة الآخرة، أي: يا ليتني قدّمتُ الأعمالَ الصالحة في الدنيا الفانية لحياتي الباقية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:13",
      "similarity": 0.7493589859867902
    },
    {
      "verse": "23:89",
      "similarity": 0.555280523121091
    },
    {
      "verse": "40:62",
      "similarity": 0.47346706680785217
    },
    {
      "verse": "43:87",
      "similarity": 0.45872578633914507
    },
    {
      "verse": "35:3",
      "similarity": 0.430921275928768
    }
  ]
}