{
  "chapter": "الفجر",
  "text": "ارجعى الى ربك راضية مرضية",
  "translations": [
    {
      "translation": "return to your Lord, well-pleasing and well-pleased!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return to your Lord, well-pleased and well-pleasing Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return to your Lord well-pleased (with your blissful destination), well-pleasing (to your Lord).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "return to your Lord well pleased with him and He will be pleased with you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return towards your Lord – you being pleased with Him, and He pleased with you!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Come back to your Lord, -- well-pleased and well-pleasing!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return to your Lord, well-pleased (with him), well-pleasing (Him),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "return unto thy Lord, well-pleased, well-pleasing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return unto thy Lord, content in His good pleasure!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "return to your Lord, well-pleased, well-pleasing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return Unto thine Lord well pleased and well-pleasing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return to your Lord, pleased and pleasing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Come back thou to thy Lord,- well pleased (thyself), and well-pleasing unto Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Come back to your Lord, Well-pleased (yourself) and well-pleasing unto Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "return to your Lord wellpleased, wellpleasing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return to your Lord, pleased and accepted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return to your Lord, well-pleased and pleasing [to Him],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[89:28] Return — this is said to it upon death — to your Lord, that is to say, return to His command and to His will, pleased, with the reward, pleasing, in God’s sight with your deeds; in other words [return O soul] combining both descriptions (both of which are circumstantial qualifiers). And it will be said to it at the Resurrection:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Return unto thy Lord) return to that which Allah has prepared for you in the Garden; and it is also said this means: return to your master: the body, (content) with Allah's reward (in His good pleasure) because of its belief in Allah's divine Oneness!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ويقال لها هذا عند البعث، أو عند تمام الحساب، أو عند الموت: { ارجعي إِلى ربك } إلى وعده، أو: إلى إكرامه، { راضيةً } بما أُوتيت من النعيم { مرضيةً } عند الله عزّ وجل، { فادخلي في عبادي } أي: في زمرة عبادي الصالحين المخلصين، وانتظمي في سلكهم، { وادخلي جنتي } معهم\n وقال أبو عبيدة: أي: مع عبادي وبين عبادي\n أي: خواصّي، كما قال:\n\n[النمل:19]\n وقيل: المراد بالنفس: الروح، أي: وادخلي في أجساد عبادي، لقراءة ابن مسعود: \" في جسد عبادي \" ولمّا مات ابن عباس بالطائف جاء طائر لم يُرَ على خلقته فدخل في نعشه، فلما دُفن تُليت هذه الآية على شفا قبره، ولم يُدْرَ مَن تلاها، وقيل: نزلت في حمزة بن عبد المطلب وقيل: في خُبيْب بن عدي، الذي صلبه أهلُ مكة والمختار: أنها عامة في المؤمنين إذ العبرة بعموم اللفظ لا بخصوص السبب\n\n\nالإشارة: إذا دُكت أرض الحس، باستيلاء المعنى عليها، أو أرض البشرية، باستيلاء الروحانية عليها، دكاً بعد دكٍّ، بالتدريج والتدريب، حتى يحصل التمكين من أسرار المعاني، وجاء ربك، أي: ظهر وتجلّى للعيان، والملَك صفاً صفاً، أي: وجاءت الملائكة صفوفاً، وجيء يومئذٍ بجهنم، أي: بنار البُعد لأهل الفرق، يومئذ يتذكّر الإنسانُ ما فاته من المجاهدة وصُحبة أهل الجمع، وأنَّى له الذكرى مع إقامته في الفَرْق طول عمره، يقول: يا ليتني قدمتُ لحياتي رُوحي بالمشاهدة بعد المجاهدة، فيومئذٍ يتولى الحق تصرُّفه في عباده بقدرته، فيُعَذِّب أهل الحجاب بسلاسل العلائق والشواغل، ويُقيدهم بقيود البين، ثم يُنادي روح المقربين أهل الأرواح القدسية: يا أيتها النفس المطمئنة، التي اطمأنت بشهود الحق، ودام فناؤها وبقاؤها بالله، ارجعي إلى ربك إلى شهود ربك بعد أن كنت عنه محجوبة، راضية عن الله في الجلال والجمال، مرضية عنده في حضرة الكمال، وعلامة الطمأنينة: أنَّ صاحبها لا ينهزم عند الشدائد وتفاقم الأهوال، لأنَّ مَن كانت يده مع الملك صحيحة لا يبالي بمَن واجهه بالتخويف أو التهديد\n وقال الورتجبي: النفس المطمئنة هي التي صدرت مِن نور خطاب الأول الذي أوجدها من العدم بنور القِدم، واطمأنت بالحق وبخطابه ووصاله، فدعاها الله إلى معدنها الأول، وهي التي ما نالت من الأول إلى الآخر غير مشاهدة الله، راضية من الله بالله، مرضية عند الله بالاصطفائية الأزلية\n هـ\n والنفوس ثلاثة: أمّارة، ولوّامة، ومطمئنة، وزاد بعضهم: اللاّمة\n والله تعالى أعلم، صلّى الله على سيدنا محمد وآله\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "96:8",
      "similarity": 0.6019246128917085
    },
    {
      "verse": "21:64",
      "similarity": 0.46492528799628996
    },
    {
      "verse": "9:21",
      "similarity": 0.459753170938652
    },
    {
      "verse": "92:21",
      "similarity": 0.45938933419901135
    },
    {
      "verse": "3:109",
      "similarity": 0.43716997269087604
    }
  ]
}