{
  "chapter": "الفجر",
  "text": "ارجعى الى ربك راضية مرضية",
  "translations": [
    {
      "translation": "return to your Lord, well-pleasing and well-pleased!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return to your Lord, well-pleased and well-pleasing Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return to your Lord well-pleased (with your blissful destination), well-pleasing (to your Lord).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "return to your Lord well pleased with him and He will be pleased with you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return towards your Lord – you being pleased with Him, and He pleased with you!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Come back to your Lord, -- well-pleased and well-pleasing!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return to your Lord, well-pleased (with him), well-pleasing (Him),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "return unto thy Lord, well-pleased, well-pleasing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return unto thy Lord, content in His good pleasure!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "return to your Lord, well-pleased, well-pleasing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return Unto thine Lord well pleased and well-pleasing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return to your Lord, pleased and pleasing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Come back thou to thy Lord,- well pleased (thyself), and well-pleasing unto Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Come back to your Lord, Well-pleased (yourself) and well-pleasing unto Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "return to your Lord wellpleased, wellpleasing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return to your Lord, pleased and accepted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Return to your Lord, well-pleased and pleasing [to Him],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[89:28] Return — this is said to it upon death — to your Lord, that is to say, return to His command and to His will, pleased, with the reward, pleasing, in God’s sight with your deeds; in other words [return O soul] combining both descriptions (both of which are circumstantial qualifiers). And it will be said to it at the Resurrection:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nارْجِعِي إِلَى رَبِّكِ رَاضِيَةً مَرْضِيَّةً (28) فإن كان من كلام الله تعالى كان قوله : { إلى ربك } إظهاراً في مقام الإِضمار بقرينة تفريع { فادخلي في عبادي } عليه . ونكتةُ هذا الإِظهار ما في وصف { رب } من الولاء والاختصاص . وما في إضافته إلى ضمير النفس المخاطَبة من التشريف لها . وإن كان من قول الملائكة فلفظ { ربك } جرى على مقتضى الظاهر وعطفُ { فادخلي في عبادي } عطف تلقين يصدر من كلام الله تعالى تحقيقاً لقول الملائكة { ارجعي إلى ربك } .والرجوع إلى الله مستعار للكون في نعيم الجنة التي هي دار الكرامة عند الله بمنزلة دار المضيف قال تعالى : { في مقعد صدق عند مليك مقتدر } \\[ القمر : 55 \\] بحيث شُبهت الجنة بمنزل للنفس المخاطبة لأنها استحقته بوعد الله على أعمالها الصالحة فكأنها كانت مغتربة عنه في الدنيا فقيل لها : ارجعي إليه ، وهذا الرجوع خاصٌّ غير مطلق الحلول في الآخرة .ويجوز أن تكون الآية استئنافاً ابتدائياً جرى على مناسبة ذكر عذاب الإِنسان المشرك فتكون خطاباً من الله تعالى لنفوس المؤمنين المطمئنة .والأمر في { ارجعي إلى ربك } مراد منه تقييده بالحالين بعده وهما { راضية مرضية } وهو من استعمال الأمر في الوعد والرجوع مجاز أيضاً ، والإِضمار في قوله : { في عبادي } وقوله : { جنتي } التفات من الغيبة إلى التكلم .وقال بعض أهل التأويل : نزلت في معيَّن . فعن الضحاك : أنها نزلت في عثمان بن عفان لما تصدق ببئرِ رومة . وعن بريدة : أنها نزلت في حمزة حين قُتل . وقيل : نزلت في خُبَيب بن عديّ لما صلبه أهل مكة . وهذه الأقوال تقتضي أن هذه الآية مدنية ، والاتفاقُ على أن السورة مكية إلا ما رواه الدَّاني عن بعض العلماء أنها مدنية ، وهي على هذا منفصلة عما قبلها كتبت هنا بتوقيف خاص أو نزلت عقب ما قبلها للمناسبة .وعن ابن عباس وزيدِ بن حارثة وأبيّ بن كعب وابننِ مسعود : أن هذا يقال عند البعث لترجع الأرواح في الأجساد ، وعلى هذا فهي متصلة بقوله :{ إذا دكت الأرض } \\[ الفجر : 21 \\] الخ كالوجه الذي قبل هذا ، والرجوع على هذا حقيقة والرب مراد به صاحب النفس وهو الجسد .وعن زيد بن حارثة وأبي صالح : يقال هذا للنفس عند الموت . وقد روى الطبري عن سعيد بن جبير قال : قرأ رجل عند رسول الله صلى الله عليه وسلم { يأيتها النفس المطمئنة ارجعي إلى ربك راضية مرضية } فقال أبو بكر : ما أحسنَ هذا؟ فقال النبي صلى الله عليه وسلم « أمَا إنَّ الملَك سيقولها لك عند الموت » . وعن زيد بن حارثة أن هذا يقال لنفس المؤمن عند الموت تبشر بالجنة .والنفس : تطلق على الذات كلها كما في قوله تعالى : { أن تقول نفس يا حسرتى على ما فرطت في جنب اللَّه } \\[ الزمر : 56 \\] وقوله : { ولا تقتلوا النفس التي حرم اللَّه إلا بالحق } \\[ الأنعام : 151 \\] وتطلق على الروح التي بها حياة الجسد كما في قوله : { إن النفس لأمارة بالسوء } \\[ يوسف : 53 \\] .وعلى الإطلاقين توزع المعاني المتقدمة كما لا يخفى .و { المطمئنة } : اسم فاعل من اطمأن إذا كان هادئاً غير مضْطَرِب ولا منزعج ، فيجوز أن يكون من سكون النفس بالتصديق لما جاء به القرآن دون تردد ولا اضطراب باللٍ فيكون ثناء على هذه النفس ويجوز أن يكون من هدوء النفس بدون خوف ولا فتنة في الآخرة .وفعله من الرباعي المزيد وهو بوزن أفْعَلَلَّ . والأصح أنه مهموز اللام الأولى وأن الميم عين الكلمة كما يُنطَق به وهذا قول أبي عَمرو . وقال سيبويه : أصل الفعل : طَأْمَنَ فوقع فيه قلب مكاني فقدمت الميم على الهمزة فيكون أصل مطمئنة عنده مُطْأَمِنَّة ومصدره اطئمنان وقد تقدم عند قوله تعالى : { ولكن ليطمئن قلبي } في سورة البقرة ( 260 ) وقوله : { فإذا اطمأننتم فأقيموا الصلاة } في سورة النساء ( 103 ) .ووصف النفس } ب { المطمئنة } ليس وصفاً للتعريف ولا للتخصيص ، أي لتمييز المخاطَبين بالوصف الذي يميزهم عمن عداهم فيعرفون أنهم المخاطبون المأذونون بدخول الجنة لأنهم لا يَعْرفون أنهم مطمئنون إلا بعد الإِذن لهم بدخول الجنة ، فالوصف مراد به الثناء والإِيماء إلى وجه بناء الخبر . وتبشير من وُجه الخطاب إليهم بأنهم مطمئنون آمنون . ويجوز أن يكون للتعريف أو التخصيص بأن يجعل الله إلهاماً في قلوبهم يعرفون به أنهم مطمئنون .والاطمئنان : مجاز في طيب النفس وعدم ترددها في مصيرها بالاعتقاد الصحيح فيهم حين أيقنوا في الدنيا بأن ما جاءت به الرسل حق فذلك اطمئنان في الدنيا ومن أثره اطمئنانهم يوم القيامة حين يرون مخائل الرضى والسعادة نحوهم ويرون ضد ذلك نحو أهل الشقاء .وقد فُسر الاطمئنان : بيقين وجود الله ووحدانيته ، وفسر باليقين بوعد الله ، وبالإخلاص في العمل ، ولا جرم أن ذلك كله من مقومات الاطمئنان المقصود فمجموعه مراد وأجزاؤه مقصودة ، وفسر بتبشيرهم بالجنة ، أي قبل ندائهم ثم نُودُوا بأن يدخلوا الجنة .والرجوع يحتمل الحقيقة والمجاز كما علمت من الوجوه المتقدمة في معنى الآية .والراضية : التي رضت بما أُعطيته من كرامة وهو كناية عن إعطائها كل ما تطمح إليه .والمرضية : اسم مفعول وأصله : مَرضياً عنها ، فوقع فيه الحذف والإِيصال فصار نائب فاعل بدون حرف الجر ، والمقصود من هذا الوصف زيادة الثناء مع الكناية عن الزيادة في إفاضة الإِنعام لأن المرضي عنه يزيده الراضي عنه من الهبات والعطايا فوق ما رضي به هو .\n\n",
      "translations": [
        {
          "translation": "(Return unto thy Lord) return to that which Allah has prepared for you in the Garden; and it is also said this means: return to your master: the body, (content) with Allah's reward (in His good pleasure) because of its belief in Allah's divine Oneness!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { راضيةً } بما أُوتيت من النعيم { مرضيةً } عند الله عزّ وجل\n { فادخلي في عبادي } أي: في زمرة عبادي الصالحين المخلصين\n وانتظمي في سلكهم\n { وادخلي جنتي } معهم\n وقال أبو عبيدة: أي: مع عبادي وبين عبادي\n أي: خواصّي\n كما قال:\n[النمل:19]\n وقيل: المراد بالنفس: الروح\n أي: وادخلي في أجساد عبادي\n لقراءة ابن مسعود: \" في جسد عبادي \" ولمّا مات ابن عباس بالطائف جاء طائر لم يُرَ على خلقته فدخل في نعشه\n فلما دُفن تُليت هذه الآية على شفا قبره\n ولم يُدْرَ مَن تلاها\n وقيل: نزلت في حمزة بن عبد المطلب وقيل: في خُبيْب بن عدي\n الذي صلبه أهلُ مكة والمختار: أنها عامة في المؤمنين إذ العبرة بعموم اللفظ لا بخصوص السبب\n\nالإشارة: إذا دُكت أرض الحس\n باستيلاء المعنى عليها\n أو أرض البشرية\n باستيلاء الروحانية عليها\n دكاً بعد دكٍّ\n بالتدريج والتدريب\n حتى يحصل التمكين من أسرار المعاني\n وجاء ربك\n أي: ظهر وتجلّى للعيان\n والملَك صفاً صفاً\n أي: وجاءت الملائكة صفوفاً\n وجيء يومئذٍ بجهنم\n أي: بنار البُعد لأهل الفرق\n يومئذ يتذكّر الإنسانُ ما فاته من المجاهدة وصُحبة أهل الجمع\n وأنَّى له الذكرى مع إقامته في الفَرْق طول عمره\n يقول: يا ليتني قدمتُ لحياتي رُوحي بالمشاهدة بعد المجاهدة\n فيومئذٍ يتولى الحق تصرُّفه في عباده بقدرته\n فيُعَذِّب أهل الحجاب بسلاسل العلائق والشواغل\n ويُقيدهم بقيود البين\n ثم يُنادي روح المقربين أهل الأرواح القدسية: يا أيتها النفس المطمئنة\n التي اطمأنت بشهود الحق\n ودام فناؤها وبقاؤها بالله\n ارجعي إلى ربك إلى شهود ربك بعد أن كنت عنه محجوبة\n راضية عن الله في الجلال والجمال\n مرضية عنده في حضرة الكمال\n وعلامة الطمأنينة: أنَّ صاحبها لا ينهزم عند الشدائد وتفاقم الأهوال\n لأنَّ مَن كانت يده مع الملك صحيحة لا يبالي بمَن واجهه بالتخويف أو التهديد\n وقال الورتجبي: النفس المطمئنة هي التي صدرت مِن نور خطاب الأول الذي أوجدها من العدم بنور القِدم\n واطمأنت بالحق وبخطابه ووصاله\n فدعاها الله إلى معدنها الأول\n وهي التي ما نالت من الأول إلى الآخر غير مشاهدة الله\n راضية من الله بالله\n مرضية عند الله بالاصطفائية الأزلية\n هـ\n والنفوس ثلاثة: أمّارة\n ولوّامة\n ومطمئنة\n وزاد بعضهم: اللاّمة\n والله تعالى أعلم\n صلّى الله على سيدنا محمد وآله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "96:8",
      "similarity": 0.6019246128917085
    },
    {
      "verse": "21:64",
      "similarity": 0.46492528799628996
    },
    {
      "verse": "9:21",
      "similarity": 0.459753170938652
    },
    {
      "verse": "92:21",
      "similarity": 0.45938933419901135
    },
    {
      "verse": "3:109",
      "similarity": 0.43716997269087604
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/089028.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/089028.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/89:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}