{
  "chapter": "الأنفال",
  "text": "يسـلونك عن الانفال قل الانفال لله والرسول فاتقوا۟ الله واصلحوا۟ ذات بينكم واطيعوا۟ الله ورسوله ان كنتم مؤمنين",
  "translations": [
    {
      "translation": "They will ask you about booty. Say: 'Booty belongs to Allah and the Messenger. So have taqwa of Allah and put things right between you. Obey Allah and His Messenger if you are muminun.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "THEY ASK YOU of (benefits accruing as) spoils of war. Tell them: \"The benefits belong to God and His Messenger.\" So fulfil your duty to God and keep peace among yourselves. Obey God and the Prophet, If you really believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you concerning the spoils of war? Tell them: 'The spoils of war belong to Allah and the Messenger. So fear Allah, and set things right between you, and obey Allah and His Messenger if you are true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (the believers) ask you (Muhammad) about the booty captured (from the enemies) during a war. Tell them, \"It belongs to God and the Messengers. If you have faith, have fear of God. Settle the disputes among yourselves and obey God and His Messengers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you O dear Prophet (Mohammed – peace and blessings be upon him) concerning the war booty; say, “Allah and the Noble Messenger are the owners of the war booty; so fear Allah and maintain friendship among yourselves; and obey Allah and His Noble Messenger, if you have faith.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about Al-Anfal (the spoils of war). Say: \"Al-Anfal are for Allah and the Messenger.\" So have Taqwa of Allah and settle all matters of difference among you, and obey Allah and His Messenger, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the windfalls. Say: The windfalls are for Allah and the Apostle. So be careful of (your duty to) Allah and set aright matters of your difference, and obey Allah and His Apostle if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will question thee concerning the spoils. Say: 'The spoils belong to God and the Messenger; so fear you God, and set things right between you, and obey you God and His Messenger, if you are believers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee (O Muhammad) of the spoils of war. Say: The spoils of war belong to Allah and the messenger, so keep your duty to Allah, and adjust the matter of your difference, and obey Allah and His messenger, if ye are (true) believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the spoils of war. Say, \"They belong to God and His Messenger. So fear God, and set things right among yourselves, and obey God and His Messenger, if you are true believers:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee concerning the spoils of war. Say thou: the spoils of war are Allah's and the apostle's. So fear Allah, and set right the matter among you, and obey Allah and His apostle if ye are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you concerning the anfaal. Say, ‘The anfaal belong to Allah and the Apostle.’ So be wary of Allah and settle your differences, and obey Allah and His Apostle, should you be faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee concerning (things taken as) spoils of war. Say: \"(such) spoils are at the disposal of Allah and the Messenger: So fear Allah, and keep straight the relations between yourselves: Obey Allah and His Messenger, if ye do believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you (O Muhammad SAW) about the spoils of war. Say: \"The spoils are for Allah and the Messenger.\" So fear Allah and adjust all matters of difference among you, and obey Allah and His Messenger (Muhammad SAW), if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the spoils (of war). Say: 'The spoils belong to Allah and the Messenger. Therefore, have fear of Allah and set things right between you. Obey Allah and His Messenger, if you are believers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the bounties. Say, “The bounties are for God and the Messenger.” So be mindful of God, and settle your differences, and obey God and His Messenger, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you, [O Muhammad], about the bounties [of war]. Say, \"The [decision concerning] bounties is for Allah and the Messenger.\" So fear Allah and amend that which is between you and obey Allah and His Messenger, if you should be believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:1] ‘They question you, O Muhammad (s), concerning the spoils of war — the booty — to whom do they belong? Say, to them: ‘The spoils of war belong to God, Who places them where He will, and the Messenger, who divides them according to God’s command. The Prophet (s) divided these [spoils] between them equally, as reported by al-Hākim in his al-Mustadrak. So fear God and set things right between you, that is, [set right] the reality of that [state of affairs] which is between you, through mutual affection and the refraining from quarrelling; and obey God and His Messenger, if you are, truly, believers’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas who said concerning the saying of Allah, Exalted is He, ((They ask thee (O Muhammad) of the spoils of war): 'He says: your Companions ask you about the spoils 182 of war on the Day of Badr and also about the officers for weapons and horses. (Say) Muhammad: (The spoils of war belong to Allah and the messenger) the spoils of war at Badr belong to Allah and His Messenger, and none of it is yours; it is also said: they all belong to Allah and the command of the Messenger regarding what is allowed, (so keep your duty to Allah) fear Allah concerning taking the spoils of war, (and adjust the matter of your difference) solve the differences among you: let the rich give to the poor and the strong to the weak and the young to the elderly, (and obey Allah and His messenger) in the matter of reconciliation, (if ye are (true) believers) in Allah and His Messenger.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر قالَ: أخبرنا علي بن أحمد، عن عطاء بن السائب، عن أبي خالد الواسطي، عن زيد بن علي عليهما السَّلامُ في قولِه تعالى: { يَسْأَلُونَكَ عَنِ ٱلأَنْفَالِ } فالأَنفالُ: الغَنائِمُ واحدُها نَفَلٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us that Ali ibn Ahmad told us, from Ata' ibn al-Sa'ib, from Abu Khalid al-Wasiti, from Zayd ibn Ali, may peace be upon them, that he said regarding the words of the Almighty {They ask you about the spoils}, that the spoils are the rewards, and one of them is a share.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يسألونك عن الأنفال } احتجبوا بأفعالهم فاعترضوا على فعل الله ورسوله\n أي: فعل الله في مظهر الرسول\n فأمروا بتقوى الأفعال\n أي: الاجتناب عنها برؤية فعل الله\n وإصلاح ذات البين بمحو صفات النفوس التي هي مصادر أفعالهم الموجبة للتنازع والتخالف حتى يرجعوا إلى الإلفة والمحبة القلبية بظهور أنواع الصفات { وأطيعوا الله ورسوله } بفناء صفاتها ليتيسر لكم قبول الأمر بالإرادة القلبية\n { إن كنتم مؤمنين } الإيمان الحقيقي { إنما المؤمنون } بالإيمان الحقيقي { الذين إذا ذُكِرَ الله } ذكر الصفات الذي للقلب لا ذكر الأفعال الذي للنفس { وجِلَتْ قلوبهم } تأثرت بتصوّر العظمة والبهاء والقهر والكبرياء وإشراق أنوار تجليات تلك الصفات عليها { وإذا تُلِيَت عليهم آياته } أي: جليت عليهم صفاته في المظاهر الكلامية { زادتهم إيماناً } حقيقياً بالترقي عن مقام العلم إلى العين { وعلى ربّهم يتوكلون } أي: يصححون مقام التوكل بفناء الأفعال ويتممونه في مقام فناء الصفات\n فإن تصحيح كل مقام إنما يتم بالترقي عنه والنظر إليه من مقام فوقه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَسْأَلُونَكَ } أي: أصحابك لك أيها الرسول\n المبعوث على الخق العظيم { عَنِ ٱلأَنْفَالِ } أي: قسمة الغنائم\n عبَّر سبحانه عنها بالنفل\n وهو في اللغة: عطية زائدة اشترطها الإمام لمن اقتحم على محل الخطر زيادة على سهمه\n لأنها زائدة على سهام الغزاة المجاهدين\n المقاتلين في سبيل الله\n لإعلاء كلمة الحق طلباً لمرضاته\n وما يترتب عليه من أموال الدنيا بمنزلة النفل والعطية الزائدة على سهامهم التي هي المثوبة العظمى والمرتبة العليا عند الله\n\n\n{ قُلِ } لهم يا أكمل الرسل: { ٱلأَنفَالُ } كلها { لِلَّهِ } ومن مال الله\n وقسمتها مفوض إليه سبحانه { وَ } إلى { ٱلرَّسُولِ } المستخلف منه\n النائب عنه بإذنه { فَٱتَّقُواْ ٱللَّهَ } أيها المؤمنون عن مخالفة أمره وأمر رسوله { وَأَصْلِحُواْ ذَاتَ بِيْنِكُمْ } أي: الحالة والعداوة التي وقعت بينكم بوسوسة الشيطان وإغوائه { وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُ } أي: انقادوا أمرهما ولا تتجاوزوا عن حكمهما { إِن كُنتُم مُّؤْمِنِينَ } [الأنفال: 1] موقنين بتوحيد الله وتصديق رسوله صلى الله عليه وسلم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { يسألونك عن } قسمة { الأنفالِ } وهي الغنائم\n سميت الغنيمة نفلاً لأنها عطية من الله تعالى\n وزيادة فضل\n كما يسمى ما يشترط الإمام للشجاع المقتحم خطراً\n نفلاً لأنه عطية له زيادة على سهمه\n وكما سمى يعقوب عليه السلام نافلة لأنه عطية زائدة على ولد إبراهيم عليه السلام\n حيث كان حفيده\n ثم أجابهم الحق تعالى فقال: { قل الأنفال لله والرسول } أي: أَمرها إلى الله ورسوله\n يقسمها رسول الله صلى الله عليه وسلم حيث يأمره الله تعالى\n وفي الوضع الذي يعينه له\n وسبب نزولها: اختلاف المسلمين في غنائم بدر كيف تقسم\n هل في المهاجرين لفقرهم\n أو في الأنصار لنصرهم\n أو فيهما معاً\n قال ابن جزي: وذلك أنهم كانوا يوم بدر ثلاث فرق: فرقة مع النبي صلى الله عليه وسلم في العريش تحرسه وتؤنسه\n وفرقة اتبعوا المشركين فقتلوهم وأسروهم\n وفرقة أحاطوا بأسلاب العدو وعسكرهم لما انهزموا\n فلما انجلت الحرب واجتمع الناس\n ورأت كل فرقة أنها بالغنيمة من غيرها\n اختلفوا فيما بينهم\n فنزلت الآية\nهـ\n  وقيل: شرط رسول الله صلى الله عليه وسلم لمن كان له غناء أن ينفله\n فتسارع شبابهم حتى قتلوا سبعين وأسروا سبعين\n ثم طلبوا نفلهم\n وكان المال قليلاً\n فقال الشيخ والوجوه الذين كانوا عند الرايات: كنا رداءاً لكم\n وفئة تنحازون إلينا\n فلا تختصوا بشيء دوننا\n فنزلت\n فقسمها رسول الله صلى الله عليه وسلم بينهم على السواء\n ولهذا قيل: لا يلزم الإمام الوفاء بما وعد\n وهذا قول الشافعي رضي الله عنه\n وعن سعد بن أبي وقاص رضي الله عنه قال: لمّا كَانَ يَوْمُ بَدْرٍ قُتل أَخي عُمَيْرٌ\n وقتلتُ سَعِيدَ بْنَ العَاصِ\n وأخذتُ سَيْفَهُ وأتيتُ به رسول الله صلى الله عليه وسلم\n واستوهبته منه\n فقال:\n \" لَيْسَ هَذَا لِي\n ولكن ضَعهُ في القَبض \"\n \nفَطَرحْتُهُ\n وفي قلبي مَا لا يَعْلَمُهُ إِلا الله من قَتَلِ أَخِي وأَخْذِ سَلَبي\n فَمَا جَاوَزْتُها إلا قليلاً حتى نزلت سُورَةُ الأَنْفَال\n فقال لي رسول الله صلى الله عليه وسلم\n \" سَأَلَتنِي السَّيف ولَيْس لِي\n وإِنّهُ قد صَارَ لِي فاذْهَبْ فَخُذْهُ \"\n \n{ فاتقوا الله } في المشاجرة والاختلاف\n { وأَصلحوا ذات بينكم } أي أصلحوا الحال التي بينكم بالمواساة والمواددة وسلامة الصدور\n ولمساعدة فيما رزقكم الله\n وتسليم أمره إلى الله تعالى ورسوله\n { وأطيعوا الله ورسوله } فيما يأمركم به { إن كنتم مؤمنين } فإن الإيمان يقتضي الاستماع والاتباع\n أو إن كنتم كاملي الإيمان فإن كمال الإيمان يقتضي التمسك بهذه الخصال الثلاث: امتثال الأوامر\n واجتناب النواهي\n وإصلاح ذات البين بالعدل والإحسان\n ثم ذكر شروط كمال الإيمان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:72",
      "similarity": 0.7587542644040667
    },
    {
      "verse": "17:79",
      "similarity": 0.3722540286286309
    },
    {
      "verse": "5:7",
      "similarity": 0.0899285492549136
    },
    {
      "verse": "4:59",
      "similarity": 0.0863469105545704
    },
    {
      "verse": "18:83",
      "similarity": 0.08231343442673617
    }
  ]
}