{
  "chapter": "الأنفال",
  "text": "وما جعله الله الا بشرى ولتطمئن به قلوبكم وما النصر الا من عند الله ان الله عزيز حكيم",
  "translations": [
    {
      "translation": "Allah only did this to give you good news and that so your hearts would be at rest. Victory comes from no one but Allah. Allah is Almighty, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He gave you the good news only to reassure your hearts, for victory comes from God alone, and certainly God is all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah meant this as glad tidings and that your hearts may be set at rest. For every help comes from Allah alone. Surely Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has sent this glad news to comfort your hearts. Victory is in the hands of God alone. God is Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah did this just for your happiness and for your hearts to gain contentment; and help does not come except from Allah; indeed Allah is Almighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah made it only as glad tidings, and that your hearts be at rest therewith. And there is no victory except from Allah. Verily, Allah is Almighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah only gave it as a good news and that your hearts might be at ease thereby; and victory is only from Allah; surely Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God wrought this not, save as good tidings and that your hearts thereby might be at rest; help comes only from God; surely God is All-mighty, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah appointed it only as good tidings, and that your hearts thereby might be at rest. Victory cometh only by the help of Allah. Lo! Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God only did this to give you good news, and so that your hearts might be set at rest, for help comes from God alone. Surely, God is Mighty and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah made not this save as a glad tidings, and that your hearts might thereby be set at rest; and succour cometh not but from Allah. Verily Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah did not appoint it but as a good news, and to reassure your hearts. Victory comes only from Allah. Indeed Allah is all-mighty, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah made it but a message of hope, and an assurance to your hearts: (in any case) there is no help except from Allah: and Allah is Exalted in Power, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah made it only as glad tidings, and that your hearts be at rest therewith. And there is no victory except from Allah. Verily, Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah only made it to be glad tidings and so that your hearts may be satisfied; victory comes only from Allah; He is Almighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God only made it a message of hope, and to set your hearts at rest. Victory comes only from God. God is Mighty and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah made it not but good tidings and so that your hearts would be assured thereby. And victory is not but from Allah. Indeed, Allah is Exalted in Might and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:10] And God appointed it, that is, the reinforcement, only as good tidings, and that your hearts might thereby be reassured. Victory comes only from God: surely God is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على { أني مُمدكم بألففٍ من الملائكة مردَفين } \\[ الأنفال : 9 \\] فالضمير المنصوب في قوله : { جَعله } عائِد إلى القول الذي تضمنه { فاستجاب لكم أني ممدكم } \\[ الأنفال : 9 \\] أي ما جعل جوابكم بهذا الكلام إلاّ ليبشركم ، وإلاّ فقد كان يكفيكم أن يضمن لكم النصر دون أن يبين أنه بإمداد من الملائكة .وفائِدة التبشير بإمداد الملائكة أن يوم بدر كان في أول يوم لقي فيه المسلمون عدواً قوياً وجيشاً عديداً ، فبشرهم الله بكيفية النصر الذي ضمنه لهم بأنه بجيش من الملائكة ، لأن النفوس أمْيل إلى المحسوسات ، فالنصر معنى من المعاني يدق إدراكه وسكون النفس لتصوره بخلاف الصور المحسوسة من تصوير مَدد الملائكة ورؤية أشكال بعضهم .وتقدم القول في نظير هذه الآية في سورة آل عمران إلاّ لتعرض لما بين الآيتين من اختلاف في ترتيب النظم وذلك في ثلاثة أمور :أحدها : أنه قال في آل عمران ( 126 ) : { إِلا بشرى لكم } وحُذف ( لكم ) هنا دفعاً لتكرير لفظه لسبق كلمة { لكم } قريباً في قوله : { فاستجاب لكم } \\[ الأنفال : 9 \\] فعلم السامع أن البشرى لهم ، فأغنت { لكم } الأولى ، بلفظها ومعناها ، عن ذكر { لكم } مرة ثانية ، ولأن آية آل عمران سيقت مساق الامتنان والتذكير بنعمة النصر في حين القلة والضعف ، فكان تقييد { بشرى } بأنها لأجلهم زيادة في المنة أي : جعل الله ذلك بشرى لأجلكم كقوله تعالى : { ألم نشرح لكَ صدرك } \\[ الشرح : 1 \\] وأما آية الآنفال فهي مسوقة مساق العتاب على كراهية الخروج إلى بدر في أول الأمر ، وعلى اختيار أن تكون الطائفة التي تلاقيهم غير ذات الشوكة ، فجرد { بشرى } عن أن يعلق به { لكم } إذ كانت البشرى للنبيء صلى الله عليه وسلم ومن لم يترددوا من المسلمين ، وقد تقدم ذلك في آل عمران .ثانيها : تقديم المجرور هنا في قوله : { به قلوبكم } وهو يفيد الاختصاص ، فيكون المعنى : ولتطمئن به قلوبكم لا بغيره ، وفي هذا الاختصاص تعريض بما اعتراهم من الوجل من الطائفة ذات الشوكة وقناعتهم بغُنم العُروض التي كانت مع العِير ، فعُرض لهم بأنهم لم يتفهموا مراد الرسول صلى الله عليه وسلم حين استشارهم ، وأخبرهم بأن العير سلكتْ طريق الساحل فكان ذلك كافياً في أن يعلموا أن الطائفة الموعود بها تمحضت أنها طائفة النفير ، وكان الشأن أن يظنوا بوعد الله أكمل الأحوال ، فلما أراد الله تسكين روعهم ، وعَدهم بنصرة الملائكة علماً بأنه لا يُطْمئِنُ قُلوبهم إلاّ ذلك ، وجعل الفخرُ : التقديمَ هنا لمجرد الاهتمام بذلك الوعد ، وذلك من وجوه التقديم لكنه وجّه تأخيره في آل عمران بما هو غير مقبول .ثالثها : أنه قال في سورة آل عمران ( 126 ) { العزيز الحكيم } فصاغ الصفتين العَلِيتَيْن في صيغة النعت ، وجعلهما في هذه الآية في صيغة الخبر المؤكد ، إذ قال : إن الله عزيز حكيم } فنزّل المخاطبين منزلة مَن يتردد في أنه تعالى موصوف بهاتين الصفتين : وهما العزة ، المقتضية أنه إذا وعَد بالنصر لم يُعجزه شيء ، والحكمةُ ، فما يصدر من جانبه غوصُ الإفهام في تبيّن مقتضاءه ، فكيف لا يهتدون إلى أن الله لما وعدهم الظَفَر بإحدى الطائفتين وقد فاتتهم العير أن ذلك آيل إلى الوعد بالظفَر بالنفير .وجملة : { إن الله عزيز حكيم } مستأنفة استينافاً ابتدائياً جعلت كالإخبار بما ليس بمعلوم لهم .\n\n",
      "translations": [
        {
          "translation": "(Allah appointed it) i.e. His succour (only as good tidings) of your victory, (and that your hearts thereby might be at rest) because of this help. (Victory) by means of the angels (cometh only by the help of Allah. Lo! Allah is Mighty) towards His enemies in His retribution, (Wise) He decreed that they be defeated and killed and that you triumph and gain the spoils of war.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وما } جعل { الله } الإمداد { إلا } بشارة لكم بالنصر وطمأنينة لقلوبكم بالاتصال بها عند التجرّد عن ملابس النفس وأحوالها\n لا أن النصر منها فإنّ النصر ليس { إلاّ من عند الله } لكن حكمته تقتضي تعليق الأشياء بأسبابها { إنّ الله } قوي على النصر غالب { حكيم } يفعله على مقتضى الحكمة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا جَعَلَهُ ٱللَّهُ } أي: إمدادكم أيها المؤمنون بملائكة السماء { إِلاَّ بُشْرَىٰ } لك بفضلكم وكرامتكم عليهم { وَلِتَطْمَئِنَّ بِهِ قُلُوبُكُمْ } في جميع ما وعدكم الله به { وَ } اعلموا أيها المتحققون بمقام التوحيد { مَا ٱلنَّصْرُ } والغلبة والظفر { إِلاَّ مِنْ عِندِ ٱللَّهِ } القادر المقتدر على كل ما أراد واختار { إِنَّ ٱللَّهَ } المتعزز برداء العظمة والجلال { عَزِيزٌ } غالب على جميع مقدوراته ومراداته { حَكِيمٌ } الأنفال: 10] متقن في جميع أحكامه ومأموراته يفعل ما يشاء\n ويحكم ما يريد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ذكر حكمة الإمداد بقوله: { وما جعله الله } أي: الإمداد { إلا بُشرى } أي: بشارة بالنصر\n { ولتطمئن به قلوبكم } فيزول ما بها من الوجل لقلتكم\n { وما النصر إلا من عند الله } لا يتوقف على سبب\n { إن الله عزيز } لا يغلب { حكيم } في تدبير الأسباب وترتيبها رداء للقدرة الأزلية\n فإمداد الملائكة\n وكثرة العدد\n والتأهب\n وسائط\n لا تأثير لها\n فلا تحسبوا النصر منها\n ولا تيأسوا منه بفقدها\n فحكم الأزل جلّ أن يضاف إلى العلل\n الإشارة: إظهار الفاقة الابتهال لا يقدح في صحة التوكل على الكبيرالمتعال\n بل هو شرف للإنسان\n وتقريب من الكريم المنان\n بل من شأن العارف الكامل الرجوع إلى الله في كل شيء\n والتعلق به في كل حال\n ولو وعده بالنصر أو الإجابة\n لا يقطع عنه السؤال\n عبوديةً وتملقاً بين يدي الحبيب\n وقد اختلف الصوفية: أي الحالين أشرف: هل الدعاء والتضرع؟ أو السكوت والرضى تحت مجاري الأقدار؟ وقال بعضهم: يجب أن يكون العبد صاحب دعاء بلسانه\n صاحب رضى بقلبه\n ليجمع بين الأمرين\n قال القشيري: والأَوْلى أن يُقال: إن الأوقات مختلفة\n ففي بعض الأحوال الدعاء أفضلُ\n وفي بعض الأحوال السكوت أفضل\n وإنما يُعرف ذلك في الوقت لأن علم الوقت يحصل في الوقت\n فإذا وجد في قلبه إشارة إلى الدعاء فالدعاء منه أولى\n وإذا وجد إشارة إلى السكوت فالسكوت أتم\n هـ\n وقد تقدم في آل عمران إشارة الإمداد\n وبالله التوفيق\n ثم ذكر تأمِينَهم\n فقال: { إِذْ يُغَشِّيكُمُ ٱلنُّعَاسَ أَمَنَةً مِّنْهُ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:126",
      "similarity": 0.9980538599608239
    },
    {
      "verse": "89:27",
      "similarity": 0.7367774712698287
    },
    {
      "verse": "13:28",
      "similarity": 0.7036765823172145
    },
    {
      "verse": "5:113",
      "similarity": 0.6857137151627263
    },
    {
      "verse": "17:95",
      "similarity": 0.5773390980526943
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008010.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008010.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}