{
  "chapter": "الأنفال",
  "text": "وما جعله الله الا بشرى ولتطمئن به قلوبكم وما النصر الا من عند الله ان الله عزيز حكيم",
  "translations": [
    {
      "translation": "Allah only did this to give you good news and that so your hearts would be at rest. Victory comes from no one but Allah. Allah is Almighty, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He gave you the good news only to reassure your hearts, for victory comes from God alone, and certainly God is all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah meant this as glad tidings and that your hearts may be set at rest. For every help comes from Allah alone. Surely Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has sent this glad news to comfort your hearts. Victory is in the hands of God alone. God is Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah did this just for your happiness and for your hearts to gain contentment; and help does not come except from Allah; indeed Allah is Almighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah made it only as glad tidings, and that your hearts be at rest therewith. And there is no victory except from Allah. Verily, Allah is Almighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah only gave it as a good news and that your hearts might be at ease thereby; and victory is only from Allah; surely Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God wrought this not, save as good tidings and that your hearts thereby might be at rest; help comes only from God; surely God is All-mighty, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah appointed it only as good tidings, and that your hearts thereby might be at rest. Victory cometh only by the help of Allah. Lo! Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God only did this to give you good news, and so that your hearts might be set at rest, for help comes from God alone. Surely, God is Mighty and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah made not this save as a glad tidings, and that your hearts might thereby be set at rest; and succour cometh not but from Allah. Verily Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah did not appoint it but as a good news, and to reassure your hearts. Victory comes only from Allah. Indeed Allah is all-mighty, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah made it but a message of hope, and an assurance to your hearts: (in any case) there is no help except from Allah: and Allah is Exalted in Power, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah made it only as glad tidings, and that your hearts be at rest therewith. And there is no victory except from Allah. Verily, Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah only made it to be glad tidings and so that your hearts may be satisfied; victory comes only from Allah; He is Almighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God only made it a message of hope, and to set your hearts at rest. Victory comes only from God. God is Mighty and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah made it not but good tidings and so that your hearts would be assured thereby. And victory is not but from Allah. Indeed, Allah is Exalted in Might and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:10] And God appointed it, that is, the reinforcement, only as good tidings, and that your hearts might thereby be reassured. Victory comes only from God: surely God is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah appointed it) i.e. His succour (only as good tidings) of your victory, (and that your hearts thereby might be at rest) because of this help. (Victory) by means of the angels (cometh only by the help of Allah. Lo! Allah is Mighty) towards His enemies in His retribution, (Wise) He decreed that they be defeated and killed and that you triumph and gain the spoils of war.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا جَعَلَهُ ٱللَّهُ } أي: إمدادكم أيها المؤمنون بملائكة السماء { إِلاَّ بُشْرَىٰ } لك بفضلكم وكرامتكم عليهم { وَلِتَطْمَئِنَّ بِهِ قُلُوبُكُمْ } في جميع ما وعدكم الله به { وَ } اعلموا أيها المتحققون بمقام التوحيد { مَا ٱلنَّصْرُ } والغلبة والظفر { إِلاَّ مِنْ عِندِ ٱللَّهِ } القادر المقتدر على كل ما أراد واختار { إِنَّ ٱللَّهَ } المتعزز برداء العظمة والجلال { عَزِيزٌ } غالب على جميع مقدوراته ومراداته { حَكِيمٌ } الأنفال: 10] متقن في جميع أحكامه ومأموراته يفعل ما يشاء، ويحكم ما يريد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:126",
      "similarity": 0.9980538599608239
    },
    {
      "verse": "89:27",
      "similarity": 0.7367774712698287
    },
    {
      "verse": "13:28",
      "similarity": 0.7036765823172145
    },
    {
      "verse": "5:113",
      "similarity": 0.6857137151627263
    },
    {
      "verse": "17:95",
      "similarity": 0.5773390980526943
    }
  ]
}