{
  "chapter": "الأنفال",
  "text": "اذ يوحى ربك الى الملئكة انى معكم فثبتوا۟ الذين ءامنوا۟ سالقى فى قلوب الذين كفروا۟ الرعب فاضربوا۟ فوق الاعناق واضربوا۟ منهم كل بنان",
  "translations": [
    {
      "translation": "And when your Lord revealed to the angels, 'I am with you so make those who have iman firm. I will cast terror into the hearts of those who are kafir, so strike their necks and strike all their finger joints!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Lord said to the angels: \"I am with you; go and strengthen the faithful. I shall fill the hearts of infidels with terror. So smite them on their necks and every joint, (and incapacitate them),\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when your Lord inspired the angels: 'I am certainly with you. So make firm the feet of those who believe. I will cast terror into the hearts of those who disbelieve. So strike at their necks and strike at every pore and tip.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord inspired the angels saying, \"I am with you. Encourage the believers. I shall cast terror into the hearts of the unbelievers and you will strike their heads and limbs;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when O dear Prophet, your Lord was inspiring the angels that, “I am with you – so make the believers stand firm; I will soon instil fear into the hearts of the disbelievers, so strike above the disbelievers’ necks and hit their each and every bone joint.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when your Lord revealed to the angels, \"Verily, I am with you, so keep firm those who have believed. I will cast terror into the hearts of those who have disbelieved, so strike them over the necks, and smite over all their fingers and toes.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your Lord revealed to the angels: I am with you, therefore make firm those who believe. I will cast terror into the hearts of those who disbelieve. Therefore strike off their heads and strike off every fingertip of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When thy Lord was revealing to the angels, 'I am with you; so confirm the believers. I shall cast into the unbelievers' hearts terror; so smite above the necks, and smite every finger of them!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When thy Lord inspired the angels, (saying): I am with you. So make those who believe stand firm. I will throw fear into the hearts of those who disbelieve. Then smite the necks and smite of them each finger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your Lord commanded the angels, saying, \"I am with you, so make those who believe stand firm. I will instill fear in the hearts of those who deny the truth: so strike their necks and strike all their finger joints!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time thy Lord inspired the angels: verily I am with you, so keep firm those who have believed; will cast horror into the hearts of those who have disbelieved, so smite them above the neck and smite of them every fingertip.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then your Lord signaled to the angels: ‘I am indeed with you; so steady the faithful. I will cast terror into the hearts of the faithless. So strike their necks, and strike their every limb joint!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember thy Lord inspired the angels (with the message): \"I am with you: give firmness to the Believers: I will instil terror into the hearts of the Unbelievers: smite ye above their necks and smite all their finger-tips off them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when your Lord inspired the angels, \"Verily, I am with you, so keep firm those who have believed. I will cast terror into the hearts of those who have disbelieved, so strike them over the necks, and smite over all their fingers and toes.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah revealed to the angels, saying: 'I shall be with you. Give courage to the believers. I shall cast terror into the hearts of the unbelievers. Strike them above the necks, smite their finger tips'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord inspired the angels: “I am with you, so support those who believe. I will cast terror into the hearts of those who disbelieve. So strike above the necks, and strike off every fingertip of theirs.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Remember] when your Lord inspired to the angels, \"I am with you, so strengthen those who have believed. I will cast terror into the hearts of those who disbelieved, so strike [them] upon the necks and strike from them every fingertip.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:12] When your Lord inspired the angels, with whom He reinforced the Muslims, [saying]: ‘I am with you, with assistance and victorious help, so make the believers stand firm, by helping [them] and giving [them] good tidings. I shall cast terror, fear, into the hearts of the disbelievers; so smite above the necks, that is, the heads, and smite of them every finger!’, that is, [smite] the extremities of their hands and feet: thus, when one of them went to strike an disbeliever’s head, it would roll off before his sword reached it. The Prophet (s) threw a handful of pebbles against them and every single idolater was struck in his eye, and thus they were defeated.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ إذ } ظرف متعلق بقوله : { فاستجاب لكم أني ممدكم بألففٍ من الملائكة مردفين } \\[ الأنفال : 9 \\].وجعل الخطاب هنا للنبيء صلى الله عليه وسلم تلطفاً به ، إذ كانت هذه الآية في تفصيل عمل الملائكة يوم بدر ، وما خاطبهم الله به فكان توجيه الخطاب بذلك إلى النبي صلى الله عليه وسلم أولى لأنه أحق من يعلم مثل هذا العلم ويحصل العلم للمسلمين تبعاً له ، وأن الذي يهم المسلمين من ذلك هو نصر الملائكة إياهم وقد حصل الإعلام بذلك من آية { إذ تستغيثون ربكم } \\[ الأنفال : 9 \\] ولأن النبي صلى الله عليه وسلم كان أول من استغاث الله ، ولذلك عرف الله هنا باسم الرب وإضافته إلى ضمير النبي صلى الله عليه وسلم ليوافق أسلوب { إذ تستغيثون ربكم } \\[ الأنفال : 9 \\] ولما فيه من التنويه بقدر نبيه صلى الله عليه وسلم إشارة إلى أنه فعل ذلك لطفاً به ورفعاً لشأنه .والوحي إلى الملائكة المرسلين : إما بطريق إلقاء هذا الأمر في نفوسهم بتكوين خاص ، وإما بإبلاغهم ذلك بواسطة .و { أنّي معكم } قيل هو في تأويل مصدر وذلك المصدر مفعول يوحي ، أي يوحي إليهم ثبوتَ معيّتِه لهم ، فيكون المصدر ، منصوباً على المفعول به ليوحي ، بهذا التأويل وقيل على تقدير باء الجر .وأنت على ذُكْر مما قدمناه قريباً في قوله تعالى : { أني ممدكم بألففٍ من الملائكة } \\[ الأنفال : 9 \\] من تحقيق أن تكون ( أن ) المفتوحة الهمزةِ المشددة النوننِ مفيدة معنى ( أنْ ) التفسيرية ، إذا وقعت معمولة لما فيه معنى القول دون حروفه .والمعية حقيقتها هنا مستحيلة فتحمل على اللائِقة بالله تعالى أعني المعية المجازية ، فقد يَكون معناها توجه عنايته إليهم وتيسير العمل لهم ، وقد تكرر إطلاق ( مع ) بمثل هذا في القرآن كقوله : { وهْو مَعكم أينما كنتم } \\[ الحديد : 4 \\].وإيحاء الله إلى الملائكة بهذا مقصود منه تشريفهم وتشريف العمل الذي سيكلفون به ، لأن المعية تؤذن إجمالاً بوجود شيء يستدعي المصاحبة ، فكان قوله لهم : { أني معكم } مقدمة للتكليف بعمل شريف ولذلك يذكْر ما تتعلق به المعية لأنه سيعلم من بقية الكلام ، أي أني معكم في عملكم الذي أكفلكم به .ومن هنا ظهر موقع فَاء الترتيب في قوله : { فثبتوا الذين آمنوا } من حيث ما دل عليه { أني معكم } من التهيئة لتلقي التكليف بعمل عظيم وإنما كان هذا العمل بهذه المثابة لأنه إبدال للحقائق الثابتة باقتلاعها ووضع أضدادها لأنه يجعل الجبن شجاعة ، والخوف إقداماً والهلع ثباتاً ، في جانب المؤمنين ، ويجعل العزة رعباً في قلوب المشركين ، ويقطع أعناقهم وأيديهم بدون سَبب من أسباب القطع المعتادة فكانت الأعمال التي عُهد للملائكة عملُها خوارقَ عادات .والتثبيت هنا مجاز في إزالة الاضطراب النفساني مما ينشأ عن الخوف ومن عدم استقرار الرأي واطمئنانه .وعُرف المثبتُون بالموصول لما تومىء إليه صلة { آمنوا } من كون إيمانهم هو الباعث على هذه العناية ، فتكون الملائكة بعناية المؤمنين لأجل وصف الإيمان .وتثبيت المؤمنين إيقاع ظن في نفوسهم بأنهم منصورون ويسمى ذلك إلهاماً وتثبيتاً ، لأنه إرشاد إلى ما يطابق الواقع ، وإزالة للاضطراب الشيطاني ، وإنما يكون خيراً إذا كان جارياً على ما يحبه الله تعالى بحيث لا يكون خاطراً كاذباً ، وإلاّ صار غروراً ، فتشجيع الخائف حيث يريد الله منه الشجاعة خاطر ملكي وتشجيعه حيث ينبغي أن يتوقى ويخاف خاطر شيطاني ووسوسة ، لأنه تضليل عن الواقع وتخذيل .ولم يسند إلقاء الرعب في قلوب الذين كفروا إلى الملائكة بل أسنده الله إلى نفسه وحده بقوله : { سألقي في قلوب الذين كفروا الرعْب } لأن أولئك الملائكة المخاطبين كانوا ملائكة نصر وتأييد فلا يليق بقواهم إلقاء الرعب ، لأن الرعب خاطر شيطاني ذميم ، فجعله الله في قلوب الذين كفروا بواسطة أخرى غير الملائكة .وأسند إلقاء الرعْب في قلوب الذين كفروا إلى الله على طريقةٌ الإجمال دون بيان لكيفية إلقائه ، وكل ما يقع في العالم هو من تقدير الله على حسب إرادته ، وأشار ذلك إلى أنه رعب شديد قدره الله على كيفية خارقة للعادة ، فإن خوارق العادات قد تصدر من القُوى الشيطانية بإذن الله وهو ما يسمى في اصطلاح المتكلمين بالإهانة وبالاستدراج ، ولا حاجة إلى قصد تحقير الشيطان بإلقاء الرعب في قلوب المشركين كما قصد تشريف الملائكة ، لأن إلقاء الرعب في قلوب المشركين يعود بالفائدة على المسلمين ، فهو مبارك أيضاً ، وإنما كان إلقاء الرعْب في قلوب المشركين خارقَ عادة ، لأن أسباب ضده قائمة ، وهي وفرة عددهم وعُددهم وإقدامُهم على الخروج إلى المسلمين ، وحرصهم على حماية أموالهم التي جاءت بها العير .فجملة : { سألقي في قلوب الذين كفروا } مستأنفة استئنافاً ابتدائياً إخباراً لهم بما يقتضي التخفيف عليهم في العمل الذي كلفهم الله به بأن الله كفاهم تخذيل الكافرين بعمل آخر غير الذي كَلف الملائكة بعمله ، فليست جملة { سألقي } مفسرة لمعنى { أني معكم }.ولم يقل سنلقي لئلا يتوهم أن للملائكة المخاطبين سبباً في إلقاء الرعب في قلوب الذين كفروا كما علمتَ آنفاً .وتفريع { فاضربوا فوق الأعناق } على جملة : { سألقي في قلوب الذين كفروا الرعب } المفرعة هنا أيضاً على جملة : { فثبتوا الذين آمنوا } في المعنى ، يؤذن بما اقتضته جملة { سألقي في قلوب الذين كفروا الرعب } من تخفيف عمل الملائكة عليهم بعض التخفيف الذي دل عليه إجمالاً قوله : { أني معكم } كما تقدم { فوق الأعناق } على الظرفية لاضْربوا .و { الأعناق } أعناق المشركين وهو بيّن من السياق ، واللام فيه والمراد بعض الجنس بالقرينة للجنس أو عوض عن المضاف إليه بقرينة قوله بعد : { واضْربوا منهم كل بنان }.والبنان اسم جمع بَنَانَة وهي الأصبع وقيل طرف الأصبع ، وإضافة ( كل ) إليه لاستغراق أصحابها .وإنما خصت الأعناق والبنان لأن ضرب الأعناق إتلاف لأجساد المشركين وضرب البنان ، يبطل صلاحية المضروب للقتال ، لأن تناول السلاح إنما يكون بالأصابع ، ومن ثَم كثر في كلامهم الاستغناء بذكر ما تتناوله اليد أو ما تتناوله الأصابع ، عن ذكر السيف ، قال النابغة: ... وأن تلادي أن نظرت وشِكّتيومُهري وما ضَمَّتْ إليّ الأنامل ... يعني سيفه ، وقال أبو الغول الطهوي :فدت نفسي وما ملكتْ يميني ... فوارسَ صُدِّقت فيهم ظنونييريد السيف ومثل ذلك كثير في كلامهم فضرب البنان يحصل به تعطيل عمل اليد فإذا ضُربت اليد كلها فذلك أجدر .وضرب الملائكة يجوز أن يكون مباشرة بتكوين قطع الأعناق والأصابع بواسطة فعل الملائكة على كيفية خارقة للعادة وقد ورد في بعض الآثار عن بعض الصحابة ما يشهد لهذا المعنى ، فإسناد الضرب حقيقة . ويجوز أن يكون بتسديد ضربات المسلمين وتوجيه المشركين إلى جهاتها ، فإسناد الضرب إلى الملائكة مجاز عقلي لأنهم سببه ، وقد قيل : الأمر بالضرب للمسلمين ، وهو بعيد ، لأن السورة نزلت بعد انكشاف الملحمة .\n\n",
      "translations": [
        {
          "translation": "(When your Lord inspired the angels) it is also said that this means: when your Lord commanded the angels, ((saying:) I am with you) I will help you. (So make those who believe stand firm) in war; it is also said that this means: give those who believe the good news of victory. (I will throw) cast (fear into the hearts of those who disbelieve) the fear of Muhammad (pbuh) and his Companions. (Then smite the necks) their heads (and smite of them each finger) each shaped finger.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱضْرِبُواْ فَوْقَ ٱلأَعْنَاقِ } معناه فاضْرِبُوا الأَعْنَاقَ\n\n\n\n\nوقوله تعالى: { وَٱضْرِبُواْ مِنْهُمْ كُلَّ بَنَانٍ } فالبَنَانُ: أَطرافُ الأَصَابعِ واحدُها بَنَانَةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Strike above the necks,\" means strike at the necks.\n\n\nAnd His saying, {And strike them at every joint}, so the joint is the extremities of the fingers, and one of them is a joint.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر يا أكمل الرسل\n وذكر من تبعك فضل الله عليك وعلى أصحابك وقت { إِذْ يُوحِي رَبُّكَ إِلَى ٱلْمَلاۤئِكَةِ } المأمورين\n لعونك وإمدادك حين ازداد رعب أصحابك من اقتحام القتال\n قائلاً له: { أَنِّي } بكمال حولي وقوتي { مَعَكُمْ } حاضر عندكم\n شهيد عليكم { فَثَبِّتُواْ ٱلَّذِينَ آمَنُواْ } في مكانهم تجاه العدو حتى يستدبروا\n إذ { سَأُلْقِي } من كما لنصري وعوني للمؤمنين { فِي قُلُوبِ ٱلَّذِينَ كَفَرُواْ } أي: قلوب العدو { ٱلرُّعْبَ } من المؤمنين فاستكثروهم واستدبروا منهم\n ومتى استدبر العدو { فَٱضْرِبُواْ } أيها المؤمنون { فَوْقَ ٱلأَعْنَاقِ } أي: أعاليها { وَ } إن وضعوا جننهم وأيديهم على أعناقهم\n حفظاً لها { ٱضْرِبُواْ مِنْهُمْ كُلَّ بَنَانٍ } [الأنفال: 12] أي: جميع أصابعهم\n لئلا يبقى لهم استعداد للقتال أصلاً\n حتى لا يكروا عليكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال للملائكة أو للمؤمنين: { فاضربوا فوق الأعناق } أي: أعاليها التي هي المذابح والرؤوس\n { واضربوا منهم كل بَنَان } أي: أصابعهم\n أي: جزوا رقابهم واقطعوا أطرافهم\n الإشارة: كان شيخ شيخنا يُشير على الفقراء\n إذا كثرت عليهم الخواطر والهواجس\n بالنوم\n ويقول من تشوش خاطره فليرقد حتى يشبع من النعاس\n فإنه يجد قلبه لأن النعاس أمنة من الله يذهب به رجز الشيطان وثقله\n ويربط على القلوب في الحضرة لأنه زوال\n وإذا زال العبد ظهر الحق وزهق الباطل\n وقوله تعالى: { ويُنزل عليكم من السماء ماء }: هو ماء الغيب الذي يطهر القوب من شهود السَّوى\n ويذهب به رجز الشيطان\n وهي ظلمة الأكوان\n التي تنعقد في القلب من حب الهوى الذي هو من تزيين الشيطان\n ويثبت به الأقدام\n حتى تثبت عند مصادمة أنوار الحضرة\n التي هي تجلي الذات\n فلا يثبت لها إلا الشجعان والأبطال وأكابر الرجال\n والله تعالى أعلم\n ثم ذكر علة أمرهم بقتل الكفار\n فقال: { ذٰلِكَ بِأَنَّهُمْ شَآقُّواْ ٱللَّهَ وَرَسُولَهُ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "75:4",
      "similarity": 0.6483800511907659
    },
    {
      "verse": "3:151",
      "similarity": 0.33126708966194296
    },
    {
      "verse": "59:2",
      "similarity": 0.19009064539096174
    },
    {
      "verse": "17:13",
      "similarity": 0.17388083086696196
    },
    {
      "verse": "13:5",
      "similarity": 0.1669140387557969
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008012.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008012.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}