{
  "chapter": "الأنفال",
  "text": "اذ يوحى ربك الى الملئكة انى معكم فثبتوا۟ الذين ءامنوا۟ سالقى فى قلوب الذين كفروا۟ الرعب فاضربوا۟ فوق الاعناق واضربوا۟ منهم كل بنان",
  "translations": [
    {
      "translation": "And when your Lord revealed to the angels, 'I am with you so make those who have iman firm. I will cast terror into the hearts of those who are kafir, so strike their necks and strike all their finger joints!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Lord said to the angels: \"I am with you; go and strengthen the faithful. I shall fill the hearts of infidels with terror. So smite them on their necks and every joint, (and incapacitate them),\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when your Lord inspired the angels: 'I am certainly with you. So make firm the feet of those who believe. I will cast terror into the hearts of those who disbelieve. So strike at their necks and strike at every pore and tip.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord inspired the angels saying, \"I am with you. Encourage the believers. I shall cast terror into the hearts of the unbelievers and you will strike their heads and limbs;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when O dear Prophet, your Lord was inspiring the angels that, “I am with you – so make the believers stand firm; I will soon instil fear into the hearts of the disbelievers, so strike above the disbelievers’ necks and hit their each and every bone joint.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when your Lord revealed to the angels, \"Verily, I am with you, so keep firm those who have believed. I will cast terror into the hearts of those who have disbelieved, so strike them over the necks, and smite over all their fingers and toes.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your Lord revealed to the angels: I am with you, therefore make firm those who believe. I will cast terror into the hearts of those who disbelieve. Therefore strike off their heads and strike off every fingertip of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When thy Lord was revealing to the angels, 'I am with you; so confirm the believers. I shall cast into the unbelievers' hearts terror; so smite above the necks, and smite every finger of them!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When thy Lord inspired the angels, (saying): I am with you. So make those who believe stand firm. I will throw fear into the hearts of those who disbelieve. Then smite the necks and smite of them each finger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your Lord commanded the angels, saying, \"I am with you, so make those who believe stand firm. I will instill fear in the hearts of those who deny the truth: so strike their necks and strike all their finger joints!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time thy Lord inspired the angels: verily I am with you, so keep firm those who have believed; will cast horror into the hearts of those who have disbelieved, so smite them above the neck and smite of them every fingertip.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then your Lord signaled to the angels: ‘I am indeed with you; so steady the faithful. I will cast terror into the hearts of the faithless. So strike their necks, and strike their every limb joint!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember thy Lord inspired the angels (with the message): \"I am with you: give firmness to the Believers: I will instil terror into the hearts of the Unbelievers: smite ye above their necks and smite all their finger-tips off them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when your Lord inspired the angels, \"Verily, I am with you, so keep firm those who have believed. I will cast terror into the hearts of those who have disbelieved, so strike them over the necks, and smite over all their fingers and toes.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah revealed to the angels, saying: 'I shall be with you. Give courage to the believers. I shall cast terror into the hearts of the unbelievers. Strike them above the necks, smite their finger tips'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord inspired the angels: “I am with you, so support those who believe. I will cast terror into the hearts of those who disbelieve. So strike above the necks, and strike off every fingertip of theirs.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Remember] when your Lord inspired to the angels, \"I am with you, so strengthen those who have believed. I will cast terror into the hearts of those who disbelieved, so strike [them] upon the necks and strike from them every fingertip.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:12] When your Lord inspired the angels, with whom He reinforced the Muslims, [saying]: ‘I am with you, with assistance and victorious help, so make the believers stand firm, by helping [them] and giving [them] good tidings. I shall cast terror, fear, into the hearts of the disbelievers; so smite above the necks, that is, the heads, and smite of them every finger!’, that is, [smite] the extremities of their hands and feet: thus, when one of them went to strike an disbeliever’s head, it would roll off before his sword reached it. The Prophet (s) threw a handful of pebbles against them and every single idolater was struck in his eye, and thus they were defeated.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When your Lord inspired the angels) it is also said that this means: when your Lord commanded the angels, ((saying:) I am with you) I will help you. (So make those who believe stand firm) in war; it is also said that this means: give those who believe the good news of victory. (I will throw) cast (fear into the hearts of those who disbelieve) the fear of Muhammad (pbuh) and his Companions. (Then smite the necks) their heads (and smite of them each finger) each shaped finger.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱضْرِبُواْ فَوْقَ ٱلأَعْنَاقِ } معناه فاضْرِبُوا الأَعْنَاقَ\n\n\n\n\nوقوله تعالى: { وَٱضْرِبُواْ مِنْهُمْ كُلَّ بَنَانٍ } فالبَنَانُ: أَطرافُ الأَصَابعِ واحدُها بَنَانَةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Strike above the necks,\" means strike at the necks.\n\n\nAnd His saying, {And strike them at every joint}, so the joint is the extremities of the fingers, and one of them is a joint.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر يا أكمل الرسل\n وذكر من تبعك فضل الله عليك وعلى أصحابك وقت { إِذْ يُوحِي رَبُّكَ إِلَى ٱلْمَلاۤئِكَةِ } المأمورين\n لعونك وإمدادك حين ازداد رعب أصحابك من اقتحام القتال\n قائلاً له: { أَنِّي } بكمال حولي وقوتي { مَعَكُمْ } حاضر عندكم\n شهيد عليكم { فَثَبِّتُواْ ٱلَّذِينَ آمَنُواْ } في مكانهم تجاه العدو حتى يستدبروا\n إذ { سَأُلْقِي } من كما لنصري وعوني للمؤمنين { فِي قُلُوبِ ٱلَّذِينَ كَفَرُواْ } أي: قلوب العدو { ٱلرُّعْبَ } من المؤمنين فاستكثروهم واستدبروا منهم\n ومتى استدبر العدو { فَٱضْرِبُواْ } أيها المؤمنون { فَوْقَ ٱلأَعْنَاقِ } أي: أعاليها { وَ } إن وضعوا جننهم وأيديهم على أعناقهم\n حفظاً لها { ٱضْرِبُواْ مِنْهُمْ كُلَّ بَنَانٍ } [الأنفال: 12] أي: جميع أصابعهم\n لئلا يبقى لهم استعداد للقتال أصلاً\n حتى لا يكروا عليكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال للملائكة أو للمؤمنين: { فاضربوا فوق الأعناق } أي: أعاليها التي هي المذابح والرؤوس\n { واضربوا منهم كل بَنَان } أي: أصابعهم\n أي: جزوا رقابهم واقطعوا أطرافهم\n الإشارة: كان شيخ شيخنا يُشير على الفقراء\n إذا كثرت عليهم الخواطر والهواجس\n بالنوم\n ويقول من تشوش خاطره فليرقد حتى يشبع من النعاس\n فإنه يجد قلبه لأن النعاس أمنة من الله يذهب به رجز الشيطان وثقله\n ويربط على القلوب في الحضرة لأنه زوال\n وإذا زال العبد ظهر الحق وزهق الباطل\n وقوله تعالى: { ويُنزل عليكم من السماء ماء }: هو ماء الغيب الذي يطهر القوب من شهود السَّوى\n ويذهب به رجز الشيطان\n وهي ظلمة الأكوان\n التي تنعقد في القلب من حب الهوى الذي هو من تزيين الشيطان\n ويثبت به الأقدام\n حتى تثبت عند مصادمة أنوار الحضرة\n التي هي تجلي الذات\n فلا يثبت لها إلا الشجعان والأبطال وأكابر الرجال\n والله تعالى أعلم\n ثم ذكر علة أمرهم بقتل الكفار\n فقال: { ذٰلِكَ بِأَنَّهُمْ شَآقُّواْ ٱللَّهَ وَرَسُولَهُ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "75:4",
      "similarity": 0.6483800511907659
    },
    {
      "verse": "3:151",
      "similarity": 0.33126708966194296
    },
    {
      "verse": "59:2",
      "similarity": 0.19009064539096174
    },
    {
      "verse": "17:13",
      "similarity": 0.17388083086696196
    },
    {
      "verse": "13:5",
      "similarity": 0.1669140387557969
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/8:12.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/8:12.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}