{
  "chapter": "الأنفال",
  "text": "فلم تقتلوهم ولكن الله قتلهم وما رميت اذ رميت ولكن الله رمى وليبلى المؤمنين منه بلاء حسنا ان الله سميع عليم",
  "translations": [
    {
      "translation": "You did not kill them; it was Allah who killed them; and you did not throw, when you threw; it was Allah who threw: so He might test the muminun with this excellent trial from Him. Allah is All-Hearing, All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was not you who killed them, but God did so. You did not throw what you threw, (sand into the eyes of the enemy at Badr), but God, to bring out the best in the faithful by doing them a favour of His own. God is all-hearing and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the fact is that it was not you, but it was Allah Who killed them; and it was not you when you threw [sand at them], but it was Allah Who threw it, (and the believers were employed for the task) that He might cause the believers to successfully pass through this test. Allah is All-Hearing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was not you (believers) but God who slew the pagans. It was not you (Muhammad) but God who threw dust at them. He did this as a favorable test for the believers. God is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So you did not slay them, but in fact Allah slew them; and O dear Prophet (Mohammed – peace and blessings be upon him) you did not throw (the sand) when you did throw, but in fact Allah threw; and in order to bestow an excellent reward upon the Muslims; indeed Allah is the All Hearing, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You killed them not, but Allah killed them. And you threw not when you did throw, but Allah threw, that He might test the believers by a fair trial from Him. Verily, Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So you did not slay them, but it was Allah Who slew them, and you did not smite when you smote (the enemy), but it was Allah Who smote, and that He might confer upon the believers a good gift from Himself; surely Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You did not slay them, but God slew them; and when thou threwest, it was not thyself that threw, but God threw, and that He might confer on the believers a fair benefit; surely God is All-hearing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye (Muslims) slew them not, but Allah slew them. And thou (Muhammad) threwest not when thou didst throw, but Allah threw, that He might test the believers by a fair test from Him. Lo! Allah is Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You did not kill them; it was God who killed them; and when you [Prophet] threw [sand] at them it was not you, but God who threw it so that He might confer on the believers a great favour from Himself. Surely, God is all hearing, all-knowing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore ye slew them not, but Allah slew them, and thou thrtwest not, When thou threWest, but Allah threw, in order that he might prove the believers with a goodly proving from Him. Verily Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You did not kill them; rather, it was Allah who killed them; and you did not throw when you threw, rather, it was Allah who threw, that He might test the faithful with a good test from Himself. Indeed Allah is all-hearing, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not ye who slew them; it was Allah: when thou threwest (a handful of dust), it was not thy act, but Allah's: in order that He might test the Believers by a gracious trial from Himself: for Allah is He Who heareth and knoweth (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You killed them not, but Allah killed them. And you (Muhammad SAW) threw not when you did throw but Allah threw, that He might test the believers by a fair trial from Him. Verily, Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was not you who killed them, but Allah slew them, neither was it you who threw at them. Allah threw at them in order that He confers on the believers a fair benefit. Indeed, Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was not you who killed them, but it was God who killed them. And it was not you who launched when you launched, but it was God who launched. That He may bestow upon the believers an excellent reward. God is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you did not kill them, but it was Allah who killed them. And you threw not, [O Muhammad], when you threw, but it was Allah who threw that He might test the believers with a good test. Indeed, Allah is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:17] You did not slay them, at Badr by your own might, but God slew them, by giving you assistance, and you threw not, O Muhammad (s), [against] the eyes of the [unbelieving] folk, when you threw, the pebbles, for   a handful of pebbles thrown by a human being cannot strike the eyes of [every person in] a large troop, but God threw, by making that [throw] reach them. He did this in order to vanquish the disbelievers, and that He might try the believers with a fair test, a [fair] gift, namely, booty; surely God is Hearing, of their sayings, Knowing, of their conditions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Ye (Muslims) slew them not) on the Day of Badr, (but Allah slew them) through Gabriel and the angels. (And thou (Muhammad) threwest not when thou didst throw) you did make the dust reach the faces of the 184 idolaters, (but Allah threw) did make it so reach, (that He might test the believers) through the throwing of dust (by a fair test from Him) by giving them victory and spoils of war. (Lo! Allah is Hearer) of your supplications, (Knower) of your help.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَـٰكِنَّ ٱللَّهَ رَمَىٰ } معناهُ أنَّ الله هو الذِي أَيَّدَكَ ونَصَرَكَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - {And you did not throw when you threw but it was Allah who threw} - means that it was Allah who aided and helped you.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بل إن قتلتموهم صورةً { فَلَمْ تَقْتُلُوهُمْ } حقيقةً { وَلَـٰكِنَّ ٱللَّهَ قَتَلَهُمْ } لأن جميع الأمور الكائنة في الآفاق صادرة من الله أولاً وبالذات\n ومن آثار أوصافه وأسمائه { وَ } بالجملة: { مَا رَمَيْتَ إِذْ رَمَيْتَ } أيها النبي المأمور برمي الحصا حين هجوم الأعداء على أصحابك { وَلَـٰكِنَّ ٱللَّهَ رَمَىٰ } أي: أوجد سبحانه الرمي بيدك التي هي\n[الفتح: 10]\n لذلك ترتب على رميك انهزامهم الذي يستبعدونه أنتم وهؤلاء أيضاً\n\n\n{ وَ } إنما رماهم سبحانه بما رمى { لِيُبْلِيَ } ويجرب { ٱلْمُؤْمِنِينَ مِنْهُ بَلاۤءً حَسَناً } أي: بنعمة الغنيمة والظفر\n هل يرجعون ويواظبون على شكر نعمه أم لا؟ { إِنَّ ٱللَّهَ } المصلح لأحوال عباده { سَمِيعٌ } يسمع مناجاتهم الصادرة منهم على وجه الخلوص { عَلِيمٌ } [الأنفال: 17] بحاجاتهم التي يحتاجون إليها في معاشهم ومعادهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: فَلَمْ تقتلوا الكفار بحولكم وقوتكم وذلتكم\n وقلّة عُدتكم وعدَدكم\n وكثرة عدوكم وعُدتهم\n { ولكن اللَّه قتلهمْ } بواسطة مباشرتكم\n حيث أيدكم وسلطكم عليهم\n وإمداد الملائكة لكم\n وإلقاء الرعب في قلوب عدوكم\n قال البيضاوي: رُوي أنه لما أَطلَّتْ قريش من العقنقل ـ اسم جبل ـ قال رسول الله صلى الله عليه وسلم:\n \" هذِهِ قُرَيْشٌ جَاءَتْ بخُيَلائِهَا وفَخْرِهَا\n يُكَذِّبُونَ رَسُولَكَ\n اللَّهُمَّ إِنَّي أَسْأَلُكَ مَا وَعَدْتَنِي \" \n\n فأَتَاهُ جِبْرِيلُ\n وَقَال له: خُذْ قَبْضَةً مِنْ تُرَابٍ فارْمِهِمْ بِهَا\n فلمَّا التَقَى الجَمعَأن تناول كفّاً من الحَصْبَاءِ فَرَمَى بها في وُجُوهِهِم\n وقال: \" شَاهَتْ الوُجُوهُ \" فَلَمْ يَبق مُشْرِكٌ إلا شُغِلَ بَعَيْنَيْهِ\n فانْهَزَمُوا\n وردفهم المؤمنون يقتلونهم ويأسرونهم\n ثم لما انصرفوا أقبلوا على التفاخر\n فيقول الرجل: قتلتُ وأسرتُ\n فنزلت الآية\n وإلغاء جواب شرط محذوف\n تقديره: إن افتخرتم بقتلهم فلَمْ تقتلوهم\n ولكن الله قتلهم\n { وما رميتَ } يا محمد رمياً توصلها إلى أعينهم\n ولم تقدر عليه { إذْ رميتَ } أي: حين ألقيت صورة الرمي\n { ولكنَّ الله رَمَى } \n أتى بما هو غاية الرمي\n فأوصلها إلى أعينهم جميعاً\n حتى انهزموا وتمكنتم من قطع دابرهم\n هـ\n فالرمي\n حقيقة\n إنما وقع من الله تعالى\n وإن ظهر حساً من النبي صلى الله عليه وسلم\n وإنما فعل ذلك ليقطع طرفاً من الكفار\n ويحد شوكتهم\n { وليُبلي المؤمنين منه بلاءً حسناً } أي: ليختبر المؤمنين منه اختباراً حسناً\n ليظهر شكرهم على هذه النعمة\n أو لينعم عليهم نعمة عظيمة بالنصر والغنيمة ومشاهدة الآيات\n { إن الله سميع } لاستغاثتهم ودعائهم\n { عليم } بنياتهم وأحوالهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:6",
      "similarity": 0.6507839329172377
    },
    {
      "verse": "77:32",
      "similarity": 0.5936243953487453
    },
    {
      "verse": "24:23",
      "similarity": 0.5584026871150436
    },
    {
      "verse": "4:112",
      "similarity": 0.44961245155937807
    },
    {
      "verse": "105:4",
      "similarity": 0.43333141526530755
    }
  ]
}