{
  "chapter": "الأنفال",
  "text": "انما المؤمنون الذين اذا ذكر الله وجلت قلوبهم واذا تليت عليهم ءايته زادتهم ايمنا وعلى ربهم يتوكلون",
  "translations": [
    {
      "translation": "The muminun are those whose hearts tremble when Allah is mentioned, whose iman is increased when His Signs are recited to them, and who put their trust in their Lord;",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only they are true believers whose hearts fill up with awe when the name of God is mentioned; and their faith is further strengthened when His messages are read out to them; and those who place their trust in their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The true believers are those who, when Allah's name is mentioned, their hearts quake, and when His verses are recited to them their faith grows, and who put their trust in their Lord;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God is mentioned, the true believers begin to feel fear of Him in their hearts and when His revelations are recited to them their faith strengthens. In God alone do they trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only they are the believers whose hearts fear when Allah is remembered, and their faith advances when His verses are recited to them, and who trust only in their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are only those who, when Allah is mentioned, feel a fear in their hearts and when His Ayat are recited unto them, they increase their faith; and they put their trust in their Lord;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those only are believers whose hearts become full of fear when Allah is mentioned, and when His communications are recited to them they increase them in faith, and in their Lord do they trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those only are believers who, when God is mentioned, their hearts quake, and when His signs are recited to them, it increases them in faith, and in their Lord they put their trust,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They only are the (true) believers whose hearts feel fear when Allah is mentioned, and when His revelations are recited unto them they increase their faith, and who trust in their Lord;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "true believers are those whose hearts tremble with awe at the mention of God, and whose faith grows stronger as they listen to His revelations. They are those who put their trust in their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are only those whose hearts thrill with fear when Allah is mentioned, and when His revelations are rehearsed unto them, they increase their faith and who trust in their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithful are only those whose hearts tremble [with awe] when Allah is mentioned, and when His signs are recited to them, they increase their faith, and who put their trust in their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For, Believers are those who, when Allah is mentioned, feel a tremor in their hearts, and when they hear His signs rehearsed, find their faith strengthened, and put (all) their trust in their Lord;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are only those who, when Allah is mentioned, feel a fear in their hearts and when His Verses (this Quran) are recited unto them, they (i.e. the Verses) increase their Faith; and they put their trust in their Lord (Alone);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the believers are those whose hearts quake at the mention of Allah, and when His verses are recited to them it increased them in faith. They are those who put their trust in their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are those whose hearts tremble when God is mentioned, and when His revelations are recited to them, they strengthen them in faith, and upon their Lord they rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are only those who, when Allah is mentioned, their hearts become fearful, and when His verses are recited to them, it increases them in faith; and upon their Lord they rely -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:2]   The believers, those whose faith is complete, are only those who, when God is mentioned, that is, when His threat of punishment [is mentioned], their hearts tremble, fear, and when His verses are recited to them, they increase their faith, their acceptance of the truth, and who rely upon their Lord, [who] put their trust in Him [alone], and not in any other.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ إِنَّمَا المؤمنون الذين إِذَا ذُكِرَ الله وَجِلَتْ قُلُوبُهُمْ }.موقع هذه الجملة وما عطف عليها موقع التعليل لوجوب تقوى الله وإصلاح ذات بينهم وطاعتهم الله ورسوله ، لأن ما تضمنته هذه الجمل التي بعد { إنما } من شأنه أن يحمل المتصفين به على الامتثال لما تضمنته جُمل الأمر الثلاث السابقة ، وقد اقتضى ظاهر القصر المستفاد من { إنما } أن من لم يَجلْ قلبُه إذا ذُكر الله ، ولم تزده تلاوة آيات الله إيماناً مع إيمانه ، ولم يتوكل على الله ، ولم يقم الصلاة ، ولم ينفق ، لم يكن موصوفاً بصفة الإيمان ، فهذا ظاهرٌ مؤول بما دلت عليه أدلة كثيرة من الكتاب والسنة من أن الإيمان لاَ ينقضه الإخلال ببعض الواجبات كما سيأتي عند قوله تعالى : { أولئك هم المؤمنون حقاً } \\[ الأنفال : 4 \\] فتعين أن القصر ادعائي بتنزيل الإيمان الذي عَدم الواجبات العظيمةَ منزلة العدم ، وهو قصر مجازي لابتنائه على التشبيه ، فهو استعارة مكنية : شبه الجانب المنفي في صيغة القصر بمن ليس بمؤمن ، وطوي ذكر المشبه به ورُمز إليه بذكر لازمه وهو حَصْر الإيمان فيمن اتصف بالصفات التي لم يتصف بها المشبه به ، ويئول هذا إلى معنى : إنما المؤمنون الكاملُو الإيماننِ ، فالتعريف في { إنما المؤمنون } تعريف الجنس المفيد قصراً ادعائياً على أصحاب هذه الصفات مبالغة ، وحرف ( أل ) فيه هو ما يسمى بالدالة على معنى الكمال .وقد تكون جملة : { إنما المؤمنون } مستأنفة استينافاً بيانياً لجواب سؤال سائِل يثيره الشرطُ وجزاؤه المقدرُ في قوله : { إن كنتم مؤمنين } \\[ الأنفال : 1 \\] بأن يتساءلوا عن هذا الاشتراط بعد ما تحقق أنهم مؤمنون من قبل ، وهل يمتري في أنهم مؤمنون ، فيجابوا بأن المؤمنين هم الذين صفتهم كيت وكيت ، فيعلموا أن الإيمان المجعول شرطاً هو الإيمان الكامل فتنبعث نفوسهم إلى الاتسام به والتباعد عن موانع زيادته .وإذ قد كان الاحتمالان غير متنافيين صح تحميل الآية إياهما توفيراً لمعاني الكلام المعجز فإن علة الشيء مما يُسأل عنه ، وإن بيان العلة مما يصح كونه استينافاً بيانياً .وعلى كلا الاحتمالين وقعت الجملة مفصولة عن التي قبلها لاستغنائها عن الربط وإن اختلف موجب الاستغناء باختلاف الاحتمالين ، والاعتباراتُ البلاغية يصح تعدد أسبابها في الموقع الواحد لأنها اعتبارات معنوية وليست كيفيات لفظية فتحقَّقْه حق تحقُّقه .والمعنى ليس المؤمنون الكامل إيمانهم إلا أصحاب هذه الصلة التي يعرف المتصف بها تحققها فيه أو عدمه من عرض نفسه على حقيقتها ، فإنه لما كان الكلام وارداً مورد الأمر بالتخلق بما يقتضيه الإيمان أحيلوا في معرفة أمارات هذا التخلق على صفات يأنسونها من أنفسهم إذا علموها .والذكر حقيقته التلفظ باللسان ، وإذا علق بما يدل على ذات فالمقصود من الذات أسماؤها ، فالمراد من قوله : { إذا ذكر الله } إذا نطق ناطق باسم من أسماء الله أو بشأن من شؤونه ، مثل أمره ونهيه ، لأن ذلك لا بد معه من جريان اسمه أو ضميره أو موصوله أو إشارته أو نحو ذلك من دلائل ذاته .والوجل خوف مع فزع فيكون لاستعظام الموجول منه .وقد جاء فعل وَجل في الفصيح بكسر العين في الماضي على طريقة الأفعال الدالة على الانفعال الباطني مثل فَرِح ، وصَدِي ، وهوِيَ ، ورَوِي .وأسند الوجل إلى القلوب لأن القلب يكثر إطلاقه في كلام العرب على إحساس الإنسان وقرارة إدراكه ، وليس المراد به هذا العضو الصنوبري الذي يرسل الدم إلى الشرايين .وقد أجملت الآية ذكر الله إجمالاً بديعاً ليناسب معنى الوجل ، فذكرُ الله يكون : بذكر اسمه ، وبذكر عقابه ، وعظمته ، وبذكر ثوابه ورحمته ، وكل ذلك يحصل معه الوجل في قلوب كُمّل المؤمنين ، لأنه يحصلَ معه استحضار جلال الله وشدة بأسه وسعة ثوابه ، فينبعث عن ذلك الاستحضار توقعُ حلول بأسه ، وتوقع انقطاع بعض ثوابه أو رحمته ، وهو وجل يبعث المؤمن إلى الاستكثار من الخير وتوقي ما لا يرضي الله تعالى وملاحظة الوقوف عند حدود الله في أمره ونهيه ، ولذلك روي عن عمر بن الخطاب أنه قال : «أفضَلُ من ذِكر الله باللسان ذكرُ الله عند أمره ونهيه» .وإذ قد كان المقصود من هذا الكلام حث المؤمنين على الرضى بما قسم النبي صلى الله عليه وسلم من غنايم بدر ، وأن يتركوا التشاجر بينهم في ذلك ، ناسب الاقتصار على وجل قلوب المؤمنين عند ذكر الله ، والوجلُ حالين يحصلان للمؤمن عند ذكر الله والحال الآخر هو الأمل والطمع في الثواب فطوى ذكره هنا اعتماداً على استلزام الوجل إياه ، لأن من الوجل أن يَجل ، من فوات الثواب أو نقصانه .التلاوة : القراءة واستظهار ما يحفظه التالي من كلام له أو لغيره يحكيه لسامعه ، وقد تقدم عند قوله تعالى : { واتبعوا ما تتلوا الشياطين على ملك سليمان } في \\[ البقرة : 102 \\].وآيات الله القرآن ، سميت آيات ، لأن وحيها إلى النبي الأمّي وعجزَ قومه ، خاصتهم وعامتهم عن الإتيان بمثلها فيه دلالة على صدق من جاء بها فلذلك سميت آيات . ويسمى القرآن كله آية أيضاً باعتبار دلالة جملته على صدق محمد ، وقد تقدم ذلك في المقدمة الثامنة من مقدمات هذا التفسير .وإسناد فعل زيادة الإيمان إلى آيات الله لأنها سبب تلك الزيادة للإيمان باعتبار حال من أحوالها ، وهو تلاوتها لاعتبار مجرد وجودها في صدر غير المتلوة عليه . وهذا الإسناد من المجاز العقلي إذ جُعلت الآيات بمنزلة فاعل الزيادة في الإيمان .فإنه لما لم يعرف الفاعل الحقيقي لزيادة الإيمان ، إذْ تلك الزيادة كيفية نفسية عارضة ، لليقين ، لا يُعرف فاعل انقداحها في العقل ، وغاية ما يعرف أن يقال : ازداد إيمان فلان ، أو ازداد فلان إيماناً ، بطريق ما يدل على المطاوعة ، ولا التفات في الاستعمال إلى أن الله هو خالق الأحوال ، كلها إذ ليس ذلك معنى الفاعل الحقيقي في العُرف ، ولو لوحظ ذلك لم ينقسم الكلام إلى حقيقة ومجاز عقليين وإنما الفاعل الحقيقي هو من يأتي بالفعل ويصنعه كالكاتب للكتابة والضارب بالسيف للقتل .والإيمانُ : تصديق النفس بثبوت نسبة شيء لشيء ، أو بانتفاء نسبة شيء عن شيء ، تصديقاً جازماً لا يحتمل نقيض تلك النسبة ، وقد اشتهر اسم الإيمان شرعاً في اليقين بالنسبة المقتضية وجود الله ووجودَ صفاته التي دلت عليها الأدلة العقلية أو الشرعية ، والمقتضية مجيء رسول الله مخبراً عن الله الذي أرسله وثبوتَ صفات الرسول عليه الصلاة والسلام التي لا يتم معنى رسالته عن الله بدونها : مثل الصدق فيما يبلغ عن الله ، والعصمة عن اقتراف معصية الله تعالى .ومعنى زيادة الإيمان : قوة اليقين في نفس المُوقن على حسب شدة الاستغناء عن استحضار الأدلة في نفسه ، وعن إعادة النظر فيها ، ودفععِ الشك العارض للنفس ، فإنه كلما كانت الأدلة أكثر وأقوى وأجلى مقدمات كان اليقين أقوى ، فتلك القوة هي المعبر عنها بالزيادة ، وتفاوتها تدرج في الزيادة ، ويجوز أن تسمى قلة التدرج في الأدلة نقصاً لكنه نقص عن الزيادة ، وذلك مع مراعاة وجود أصل حقيقة الإيمان ، لأنها لو نقصت عن اليقين لبطلت ماهية الأيمان ، وقد أشار البخاري إلى هذا بقوله : باب زيادةِ الإيمان ونقصانه فإذا ترك شيئاً من الكمال فهو ناقص فلو أن نقص الأدلة بلغ بصاحبه إلى انخرَام اليقين لم يكن العلم الحاصل له إيماناً ، حتى يوصف بالنقص ، فهذا هو المراد من وصف الإيمان بالزيادة ، في القرآن وكلام الرسول ، وهو بين . ولم يرد عن الشريعة ذكر نقص الإيمان ، وذلك هو الذي يريده جمهور علماء الأمه إذا قالوا الإيمان يزيد كما قال مالك بن أنس الإيمانُ يزيد ولا ينقص ، وهو عبارة كاملة ، وقد يطلق الإيمان على الأعمال التي تجب على المؤمن وهو إطلاق باعتبار كون تلك الأعمال من شرائِع الإيمان ، كما أطلق على الصلاة اسم الإيمان في قوله تعالى : { وما كان الله ليضيع إيمانكم } \\[ البقرة : 143 \\] ولكن الاسم المضبوط لهذا المعنى هو اسم ( الإسلام ) كما يفصح عنه حديث سؤال جبريل عن الإيمان والإسلام والإحسان ، فالإيمان قد يطلق على الإسلام وهو بهذا الاعتبار يوصف بالنقص والزيادة باعتبار الإكثار من الأعمال والإقلال ، ولكنه ليس المراد في هذه الآية ولا في نظائِرها من آيات الكتاب وأقواللِ النبيّء صلى الله عليه وسلم وقد يريده بعض علماء الأمة فيقول : الإيمان يزيد وينقص ، ولعل الذي الجأهم إلى وصفه بالنقص هو ما اقتضاه الوصف بالزيادة . وهذا مذهبٌ أشار إليه البخاري في قوله \" باب من قال إن الإيمان هو العمل \" وقال الشيخ ابن أبي زيد «وأن الإيمان قولُ باللسان واخلاصٌ بالقلب وعملٌ بالجوارح يزيد بزيادة الأعمال وينقص بنقص الأعمال فيكون فيها النقص وبها الزيادة» ، وهو جار على طريقة السلف من إقرار ظواهر القرآن والسنة ، في الأمور الاعتقادية ولكن وصف الإيمان بالنقص لا داعي إليه لعدم وجود مقتضيه لعدم وصفه بالنقص في القرآن والسنة ولهذا قال مالك الإيمان يزيد ولا ينقص .وكيفية تأثير تلاوة الآيات في زيادة الإيمان : أن دقائِق الإعجاز التي تحتوي عليها آيات القرآن تزيد كل آية تنزل منها أو تتكرر على الأسماع سامعها يقيناً بأنها من عند الله ، فتزيده استدلالاً على ما في نفسه ، وذلك يُقوي الإيمان حتى يصل إلى مرتبة تقرب من الضرورة على نحو ما يحصل في تواتر الخبر من اليقين بصدق المخبرين ، ويحصل مع تلك الزيادة زيادة في الإقبال عليها بشراشر القلوب ثم في العمل بما تتضمنه من أمر أو نهي ، حتى يحصل كمال التقوى ، فلا جرم كان لكل آية تتلى على المؤمنين زيادة في عوارض الإيمان من قوة اليقين وتكثير الأعمال فهذا وصف راسخ للآيات ويجوز أن تفسر زيادة الإيمان عند تلاوة الآيات بأنها زيادة إدراك للمعاني المؤمن بها ، كما فسرت زيادة الإيمان بالنسبة إلى الأعمال ، التي تجب على المؤمن إذ تلك الإدراكات تعلقات بعضها حسي وبعضها عقلي .وحظ المقام المتعلق بآحكام الأنفال من هذه الزيادة هو أن سماع آيات حكم الأنفال يزيد إيمان المؤمنين قوة ، بنبذ الشقاق والتشاجر الطارىء ببينهم في أنفس الأموال عندهم ، وهو المال المكتسب من سيوفهم ، فإنه أحب أموالهم إليهم . وفي الحديث « وجعل رزقي تحت ظل رمحي » وبذلك تتضح المناسبة بين ذكر حكم الأنفال ، وتعقيبه بالأمر بالتقوى وإصلاح ذات البين والطاعة ، ثم تعليل ذلك بأن شأن المؤمنين ازدياد إيمانهم عند تلاوة آيات الله .صلة ثالثة ل { المؤمنون } أوحال منه ، وجعلت فعلاً مضارعاً للدلالة على تكرر ذلك منهم ، ووصفهم بالتوكل على الله وهو الاعتماد على الله في الأحوال والمساعي ليقدر للمتوكل تيسيراً مرة ويعوضه عن الكسب المنهي عنه بآحسن منه من الحلال المأذون فيه . وتقدم تفسير التوكل عند قوله : { فإذا عزمت ، فتوكل على الله } في سورة \\[ آل عمران : 159 \\].ومناسبة هذا الوصف للغرض : أنهم أمروا بالتخلي عن الأنفال ، والرضى بقسمة الرسول صلى الله عليه وسلم فيها ، فمن كان قد حرم من نفل قتيله يتوكلُ على الله في تعويضه بأحسن منه .وتقديم المجرور في قوله : { وعلى ربهم يتوكلون } إما للرعاية على الفاصلة فهو من مقتضيات الفصاحة مع ما فيه من الاهتمام باسم الله ، وإما للتعريض بالمشركين ، لأنهم يتوكلون على إعانة الأصنام ، قال تعالى : { واتخذوا من دون الله آلهةً ليكونوا لهم عزاً } \\[ مريم : 81 \\] فيكون الكلام مدحاً للمؤمنين ، وتعريضاً بذم المشركين ، ثم فيه تحذير من أن تبقى في نفوس المؤمنين آثار من التعلق بما نهوا عن التعلق به ، لتوهمهم أنهم إذا فوّتوه فقد أضاعوا خيراً من الدنيا .\n\n",
      "translations": [
        {
          "translation": "(They only are the (true) believers whose hearts feel fear when Allah is mentioned) when they are enjoined with a command from Allah, such as in the matter of reconciliation and other things, (and when the revelations of Allah) concerning reconciliation (are recited unto them they increase their faith) increase their certitude in Allah's saying; it is also said that this means: they increase their truthfulness; it is also said that this means: it increases their refinement, (and who trust in their Lord) and not in the spoils of war;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَجِلَتْ قُلُوبُهُمْ } معناهُ خَافتْ قُلُوبُهم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - {And their hearts became fearful} - means that their hearts became afraid.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّمَا ٱلْمُؤْمِنُونَ } الكاملون في الإيمان\n المتحققون بمرتبة اليقين والعرفان\n المصدقون بالرسل المبين لهم طريق التوحيد\n هم { ٱلَّذِينَ إِذَا ذُكِرَ ٱللَّهُ } الواحد الأحد\n المتفرد بالألوهية\n المتوحد بالربوبية { وَجِلَتْ } أي: خافت وترهبت\n واضطربت { قُلُوبُهُمْ } من سطوة سلطنة عظمته وجلاله { وَإِذَا تُلِيَتْ عَلَيْهِمْ ءَايَٰتُهُ } الدالة على بسطته وكبريائه\n النازلة على رسله وأنبيائه { زَادَتْهُمْ } تلك الآيات { إِيمَٰناً } وتصديقاً وإذعاناً\n ويقيناً وعياناً وعرفاناً { وَ } هم من كمال يقينهم وعرفانهم { عَلَىٰ رَبِّهِمْ } لا على غيره من الأسباب الناقصة { يَتَوَكَّلُونَ } [الأنفال: 2] أي: يتوصلون ويستعينون في جميع الأمور لتحققهم وتمكنهم ي مقام التوحيد المسقط للالتفات إلى غير الحق مطلقاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { إنما المؤمنون } الكاملون في الإيمان: { الذين إذا ذُكر الله وَجَلتْ قلوبُهم } خافت واقشعرت لذكره استعظاماً له وهيبة من جلاله\n وقيل: هو الرجل يهم بالمعصية فقال له اتق الله\n فينزع عنها خوفاً من عقابه\n { وإِذا تُلِيت عليهم آياته } القرآنية { زادتهم إيماناً } أي: يقيناً وطمأنينة بتظاهر الأدلة التي اشتملت عليها\n أو بالعمل بموجبها\n\nوهو دليل على أن الإيمان يزيد بالطاعة وينقص بالمعصية\n بناء على أن العمل داخل فيه\n والتحقيق: أن العمل خارج عنه\n لكن نوره يتقوى به وينقص بنقصانه أو بالمعصية وسيأتي في الإشارة الكلام عليه\n ومن أوصاف أهل الإيمان: التوكل على الله والاعتماد عليه\n كما قال: { وعلى ربهم يتوكلون } وقد تقدم في \" آل عمران \" الكلام على التوكل",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:60",
      "similarity": 0.8466439896270336
    },
    {
      "verse": "15:52",
      "similarity": 0.8157243531029008
    },
    {
      "verse": "22:35",
      "similarity": 0.7865598080179963
    },
    {
      "verse": "15:53",
      "similarity": 0.7165542481775409
    },
    {
      "verse": "3:173",
      "similarity": 0.20283771180934196
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008002.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008002.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:2.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}