{
  "chapter": "الأنفال",
  "text": "انما المؤمنون الذين اذا ذكر الله وجلت قلوبهم واذا تليت عليهم ءايته زادتهم ايمنا وعلى ربهم يتوكلون",
  "translations": [
    {
      "translation": "The muminun are those whose hearts tremble when Allah is mentioned, whose iman is increased when His Signs are recited to them, and who put their trust in their Lord;",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only they are true believers whose hearts fill up with awe when the name of God is mentioned; and their faith is further strengthened when His messages are read out to them; and those who place their trust in their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The true believers are those who, when Allah's name is mentioned, their hearts quake, and when His verses are recited to them their faith grows, and who put their trust in their Lord;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God is mentioned, the true believers begin to feel fear of Him in their hearts and when His revelations are recited to them their faith strengthens. In God alone do they trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only they are the believers whose hearts fear when Allah is remembered, and their faith advances when His verses are recited to them, and who trust only in their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are only those who, when Allah is mentioned, feel a fear in their hearts and when His Ayat are recited unto them, they increase their faith; and they put their trust in their Lord;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those only are believers whose hearts become full of fear when Allah is mentioned, and when His communications are recited to them they increase them in faith, and in their Lord do they trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those only are believers who, when God is mentioned, their hearts quake, and when His signs are recited to them, it increases them in faith, and in their Lord they put their trust,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They only are the (true) believers whose hearts feel fear when Allah is mentioned, and when His revelations are recited unto them they increase their faith, and who trust in their Lord;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "true believers are those whose hearts tremble with awe at the mention of God, and whose faith grows stronger as they listen to His revelations. They are those who put their trust in their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are only those whose hearts thrill with fear when Allah is mentioned, and when His revelations are rehearsed unto them, they increase their faith and who trust in their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithful are only those whose hearts tremble [with awe] when Allah is mentioned, and when His signs are recited to them, they increase their faith, and who put their trust in their Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For, Believers are those who, when Allah is mentioned, feel a tremor in their hearts, and when they hear His signs rehearsed, find their faith strengthened, and put (all) their trust in their Lord;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are only those who, when Allah is mentioned, feel a fear in their hearts and when His Verses (this Quran) are recited unto them, they (i.e. the Verses) increase their Faith; and they put their trust in their Lord (Alone);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the believers are those whose hearts quake at the mention of Allah, and when His verses are recited to them it increased them in faith. They are those who put their trust in their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are those whose hearts tremble when God is mentioned, and when His revelations are recited to them, they strengthen them in faith, and upon their Lord they rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are only those who, when Allah is mentioned, their hearts become fearful, and when His verses are recited to them, it increases them in faith; and upon their Lord they rely -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:2]   The believers, those whose faith is complete, are only those who, when God is mentioned, that is, when His threat of punishment [is mentioned], their hearts tremble, fear, and when His verses are recited to them, they increase their faith, their acceptance of the truth, and who rely upon their Lord, [who] put their trust in Him [alone], and not in any other.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They only are the (true) believers whose hearts feel fear when Allah is mentioned) when they are enjoined with a command from Allah, such as in the matter of reconciliation and other things, (and when the revelations of Allah) concerning reconciliation (are recited unto them they increase their faith) increase their certitude in Allah's saying; it is also said that this means: they increase their truthfulness; it is also said that this means: it increases their refinement, (and who trust in their Lord) and not in the spoils of war;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَجِلَتْ قُلُوبُهُمْ } معناهُ خَافتْ قُلُوبُهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّمَا ٱلْمُؤْمِنُونَ } الكاملون في الإيمان، المتحققون بمرتبة اليقين والعرفان، المصدقون بالرسل المبين لهم طريق التوحيد، هم { ٱلَّذِينَ إِذَا ذُكِرَ ٱللَّهُ } الواحد الأحد، المتفرد بالألوهية، المتوحد بالربوبية { وَجِلَتْ } أي: خافت وترهبت، واضطربت { قُلُوبُهُمْ } من سطوة سلطنة عظمته وجلاله { وَإِذَا تُلِيَتْ عَلَيْهِمْ ءَايَٰتُهُ } الدالة على بسطته وكبريائه؛ النازلة على رسله وأنبيائه { زَادَتْهُمْ } تلك الآيات { إِيمَٰناً } وتصديقاً وإذعاناً، ويقيناً وعياناً وعرفاناً { وَ } هم من كمال يقينهم وعرفانهم { عَلَىٰ رَبِّهِمْ } لا على غيره من الأسباب الناقصة { يَتَوَكَّلُونَ } [الأنفال: 2] أي: يتوصلون ويستعينون في جميع الأمور لتحققهم وتمكنهم ي مقام التوحيد المسقط للالتفات إلى غير الحق مطلقاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ذكر شروط كمال الإيمان، فقال: { إنما المؤمنون } الكاملون في الإيمان: { الذين إذا ذُكر الله وَجَلتْ قلوبُهم } خافت واقشعرت لذكره استعظاماً له وهيبة من جلاله، وقيل: هو الرجل يهم بالمعصية فقال له اتق الله، فينزع عنها خوفاً من عقابه، { وإِذا تُلِيت عليهم آياته } القرآنية { زادتهم إيماناً } أي: يقيناً وطمأنينة بتظاهر الأدلة التي اشتملت عليها، أو بالعمل بموجبها\n\n\nوهو دليل على أن الإيمان يزيد بالطاعة وينقص بالمعصية، بناء على أن العمل داخل فيه، والتحقيق: أن العمل خارج عنه، لكن نوره يتقوى به وينقص بنقصانه أو بالمعصية وسيأتي في الإشارة الكلام عليه\n ومن أوصاف أهل الإيمان: التوكل على الله والاعتماد عليه، كما قال: { وعلى ربهم يتوكلون } وقد تقدم في \" آل عمران \" الكلام على التوكل، ثم وصفهم بإقامة الدين فقال: { الذين يقيمون الصلاة ومما رزقناهم ينفقون } في الواجب والتطوع",
      "translations": []
    }
  ]
}