{
  "chapter": "الأنفال",
  "text": "ان شر الدواب عند الله الصم البكم الذين لا يعقلون",
  "translations": [
    {
      "translation": "The worst of beasts in Allah's sight are the deaf and dumb who have no intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The worst of creatures in the eyes of God are those who are deaf and dumb and devoid of sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the worst kind of all beasts in the sight of Allah are the people that are deaf and dumb, and do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The most wicked beasts in the sight of God are the deaf and the dumb who have no understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the worst beasts in the sight of Allah are those (people) who are deaf, dumb – who do not have any sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, the worst of living creatures with Allah are the deaf and the dumb (the disbelievers), who understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the vilest of animals, in Allah's sight, are the deaf, the dumb, who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the worst of beasts in God's sight are those that are deaf and dumb and do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! the worst of beasts in Allah's sight are the deaf, the dumb, who have no sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the worst creatures in God's eyes are those who are deaf and dumb, and who possess no understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the vilest of beasts with Allah are the deaf and dumb who understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the worst of beasts in Allah’s sight are the deaf and dumb who do not exercise their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the worst of beasts in the sight of Allah are the deaf and the dumb,- those who understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! The worst of (moving) living creatures with Allah are the deaf and the dumb, those who understand not (i.e. the disbelievers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The worst beasts before Allah are those who are deaf, dumb, and do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The worst of animals to God are the deaf and dumb—those who do not reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the worst of living creatures in the sight of Allah are the deaf and dumb who do not use reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:22] Surely the worst of beasts in God’s sight are those who are deaf, to hearing the truth, and dumb, [unable] to utter it, those who do not understand.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوجملة : { إن شر الدواب عند الله الصُم البكم الذين لا يعقلون } معترضة ، وسَوقها في هذا الموضع تعريض بالذين { قالوا سمعنا وهم لا يسمعون } بأنهم يشبهون دواب صماء بكماء .والتعريض قد يكون كناية وليس من أصنافها فإن بينه وبين الكناية عموماً وخصوصاً وجهياً ، لأن التعريض كلام أريد به لازم مدلوله ، وأما الكناية فهي لفظ مفرد يراد به لازم معناه إما الحقيقي كقوله تعالى : { وأمرت لأن أكون أول المسلمين } \\[ الزمر : 12 \\] ، وإما المجازي نحو قولهم للجواد : جبان الكلب إذا لم يكن له كلب ، فأما التعريض فليس إرادة لازم معنى لفظ مفرد ولا لازم معنى تركيب ، وإنما هو إرادة لنطق المتكلم بكلامه ، قال في «الكشاف» عند قوله تعالى : { ولا جناح عليكم فيما عرّضتم به من خطبة النساء } في سورة \\[ البقرة : 235 \\] التعريض أن تذكر شيئاً يدل به على شيء لم تذكره يريد أن تذكر كلاماً دالاً كما يقول المحتاج لغيره جئت لأسلم عليك .قلت : ومن أمثلة التعريض قول القائل حين يسمع رجلاً يسب مسلماً أو يضربه : المسلم من سلم المسلمون من لسانه ويده ، فكذلك قوله تعالى : { إن شر الدوابّ عند الله الصم البكم } لم يرد به لازم معنى ألفاظ ولا لازم معنى الكلام ، ولكن أريد به لازم النطق به في ذلك المكان بدون مقتض للإخبار من حقيقة ولا مجاز ولا تمثيل .والفرق بين التعريض وبين ضرب المثل : أن ضرب المثل ذكر كلام يدل على تشبيه هيئة مضربه بهيئة مورده ، والتعريض ليس فيه تشبيه هيئة بهيئة . فالتعريض كلام مستعمل في حقيقته أو مجازه ، ويحصل به قصد التعريض من قرينة سوقه فالتعريض من مستتبعات التراكيب .وهذه الآية تعريض بتشبيههم بالدواب ، فإن الدواب ضعيفة الإدراك ، فإذا كانت صماء كانت مثلاً في انتفاء الإدراك ، وإذا كانت مع ذلك بكماً انعدم منها ما انعدم منها ما يعرف به صاحبها ما بها ، فانضم عدم الإفهام إلى عدم الفهم ، فقوله : { الصم البكم } خبرَاننِ عن الدواب بمعناهما الحقيقي ، وقوله : { الذين لا يعقلون } خبر ثالث ، وهذا عدول عن التشبيه إلى التوصيف لأن { الذين } مما يناسب المشبّهين إذ هو اسم موصول بصيغة جمع العقلاء وهذا تخلص إلى أحوال المشبهين كما تخلص طرفة في قوله: ... خذول تُراعي رَبْرباً بخميلةتَنَاول أطراف البرير وترتدي ... وتبسم عن ألْمى كأنّ منوّراًتوسط حرُ الرمل دعص له نَدِي ... و { شر } اسم تفضيل ، وأصله «أشر» فحذفت همزته تخفياً كما حذفت همزة خير كقوله تعالى : { قل هل أنبئكم بشرٍ من ذلك مثوبةً عند الله } \\[ المائدة : 60 \\] الآية .والمراد بالدواب معناه الحقيقي ، وظاهر أن الدابة الصمّاء البكماء أخسّ الدواب .{ عند الله } قيد أريد به زيادة تحقيق كونهم ، أشر الدواب بأن ذلك مقرر في علم الله ، وليس مجرد اصطلاح ادعائي ، أي هذه هي الحقيقة في تفاضل الأنواع لا في تسامح العرف والاصطلاح ، فالعُرف يُعد الإنسان أكمل من البهائم ، والحقيقة تفصل حالات الإنسان فالإنسان المنتفع بمواهبه فيما يُبلغه إلى الكمال هو بحق أفضل من العُجم ، والإنسان الذي دَلّى بنفسه إلى حَضيض تعطيل انتفاعه بمواهبه السامية يصير أحط من العجماوات .والمشبهون بالصم البكم هم الذين قالوا { سمعنا وهم لا يسمعون } ، شبهوا بالصم في عدم الانتفاع بما سمعوا لأنه مما يكفي سماعه في قبوله والعمل به وشبهوا بالبكم في انقطاع الحجة والعجز عن رد ما جاءهم به القرآن فهمُ ما قبلوا ولا أظهروا عذراً عن عدم قبوله .ولما وصفهم بانتهاء قبول المعقولات والعجز عن النطق بالحجة أتبعه بانتفاء العقل عنهم أي عقل النظر والتأمل بله عقل التقبل ، وقد وصف بهذه الأوصاف في القرآن كل من المشركين والمنافقين في مواضع كثيرة .ولعل ما روي عن ابن عباس من قوله إن الآية نزلت في نفر من بني عبد الدار كما تقدم آنفاً إنما عنى بهم نزول قوله تعالى : { إن شر الدواب عند الله الصم البكم الذين لا يعقلون } لأنهم الذين قالوا مقالة تقرب مما جاء في الآية .\n\n",
      "translations": [
        {
          "translation": "It was also revealed about these: (Lo! the worst of beasts) created beings and creatures (in Allah's sight are the deaf) to the Truth, (the dumb) about the Truth, (who have no sense) who do not understand Allah's command and His divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ شَرَّ ٱلدَّوَابِّ عِندَ ٱللَّهِ ٱلصُّمُّ } عن استماع كلمة الحق عن ألسنة الرسل والإطاعة بها { ٱلْبُكْمُ } عن التكلم بها بعدما فهموه\n ولاحت عندهم حقيقتها\n وبالجملة: هؤلاء هم { ٱلَّذِينَ لاَ يَعْقِلُونَ } [الأنفال: 22] أي: ليسوا من زمرة العقلاء وإن ظهروا على صورتهم وشكلهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { إن شر الدوابّ عند الله } وهو كل من يدب على وجه الأرض\n { الصمُّ } عن سماع الحق\n { البُكمُ } عن النطق به\n { الذين لا يعقلون } الحق ولا يعرفونه\n عدهم من البهائم ثم جعلهم شرها لإبطالهم ما مُيزوا به وفُضلوا لأجله\n وهو استعمال العقل فيما ينفعهم من التفكر والاعتبار\n قال ابن قتيبة: نزلت هذه الآية في بني عبد الدار\n فإنهم جدوا في القتال مع المشركين\n يعني يوم بدر\n وحكمها عام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:18",
      "similarity": 0.7488937156074248
    },
    {
      "verse": "6:39",
      "similarity": 0.7463087143044144
    },
    {
      "verse": "16:76",
      "similarity": 0.4396169959061202
    },
    {
      "verse": "8:55",
      "similarity": 0.42510700374494437
    },
    {
      "verse": "10:42",
      "similarity": 0.39910485936884244
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008022.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008022.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:22.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}