{
  "chapter": "الأنفال",
  "text": "ولو علم الله فيهم خيرا لاسمعهم ولو اسمعهم لتولوا۟ وهم معرضون",
  "translations": [
    {
      "translation": "If Allah knew of any good in them, He would have made them able to hear. But even if He had made them able to hear, they would still have turned away.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God had seen any good in them He would surely have made them hear. Now even if He makes them hear they will turn away (in obduracy).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had Allah known in them any good He would surely, have made them hear; but (being as they, are) even if He made them hear, they would have surely turned away in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had they possessed any virtue, God would certainly have made them hear. Even if God were to make them hear, they would still turn away from (the words of God).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had Allah found any goodness in them, He would have made them hear; and had He made them hear they would, in the end, have turned away and gone back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah known of any good in them, He would indeed have made them listen; and even if He had made them listen, they would but have turned away with aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah had known any good in them He would have made them hear, and if He makes them hear they would turn back while they withdraw.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God had known of any good in them He would have made them hear; and if He had made them hear, they would have turned away, swerving aside.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah known of any good in them He would have made them hear, but had He made them hear they would have turned away, averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God had found any good in them, He would certainly have made them hear; but being as they are, even if He makes them hear, they will turn away in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had Allah known in them any good He would surely have made them hearken; and even if He made them hear, they would surely turn away as backsliders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah known any good in them, He would have surely made them hear, and were He to make them hear, surely they would turn away, being disregardful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah had found in them any good. He would indeed have made them listen: (As it is), if He had made them listen, they would but have turned back and declined (Faith).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah known of any good in them, He would indeed have made them listen, and even if He had made them listen, they would but have turned away, averse (to the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, had Allah known any good in them, He would have let them hear. But even if He had made them hear, they would have turned away, swerving aside.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God recognized any good in them, He would have made them hear; and had He made them hear, they would have turned away defiantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah known any good in them, He would have made them hear. And if He had made them hear, they would [still] have turned away, while they were refusing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:23] For had God known of any good in them, any righteousness, were they to listen to the truth, He would have made them hear, in such a way as to understand; and had He made them hear — hypothetically speaking — already knowing that there is no good in them, they would have turned away, from it, averse, to accepting it, out of obstinacy and in denial.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Had Allah Known of any good) felicity (in them) i.e. in the Banu 'Abd al-Dar (He would have made them hear) He would have honoured them with faith, (but had He made them hear) had He honoured them with faith (they would have turned away) from faith due to Allah's foreknowledge about them, (averse) they are disbelieving in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n { وَلَوْ عَلِمَ ٱللَّهُ فِيهِمْ } أي: من استعداد هؤلاء السفهاء المنحطين عن مرتبة العقلاء { خَيْراً لأَسْمَعَهُمْ } كلمة الحق سمعَ طاعة { وَلَوْ أَسْمَعَهُمْ } مع أنهم ليسوا مستعدين له { لَتَوَلَّواْ } وانصرفوا؛ من خبث طينتهم عنها { وَّهُمْ } في أصل فطرتهم { مُّعْرِضُونَ } [الأنفال: 23] مجبولون على الأعراض، ولا يرجى منهم الإطاعة أصلاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولو علِمَ الله فيهم خيراً } سعادة كتبت لهم، أو انتفاعاً بالآيات، { لأسمعهُم } سماع تَفَهُّم، { ولو أسمعهم } ، مع كونه قد علم الأخير فيهم، { لتولَّوا } عنه، ولم ينتفعوا به، وارتدوا بعد التصديق والقبول، { وهم مُّعرضون } عنه لعنادهم، وقيل: إنهم طلبوا من النبي صلى الله عليه وسلم أن يُحيي لهم قُصي بن كلاب، ويشهد له بالرسالة، حتى يسمعوا منه ذلك، فأنزل الله: { ولو عَلِمَ اللَّهُ فيهم خيراً لأسمعهم } كلامه بعد إحيائه، { ولو أسمعهم لتولوا وهم مُّعرضُون } ، لسبق الشقاوة في حقهم\n الإشارة: اعلم أن الأمر الذي شرف به الآدمي وفضل غيره هو معرفة خالقه، واستعمال العقل فيما يقربه إليه، وسماع الوعظ الذي يزجره عن غيه، فإذا فقد هذا كان كالبهائم أو أضل، ولله در ابن البنا، حيث يقول في مباحثه:\n",
      "translations": []
    }
  ]
}