{
  "chapter": "الأنفال",
  "text": "يايها الذين ءامنوا۟ استجيبوا۟ لله وللرسول اذا دعاكم لما يحييكم واعلموا۟ ان الله يحول بين المرء وقلبه وانه اليه تحشرون",
  "translations": [
    {
      "translation": "You who have iman! respond to Allah and to the Messenger when He calls you to what will bring you to life! Know that Allah intervenes between a man and his heart and that you will be gathered to Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, respond to the call of God and His Prophet when he calls you to what will give you life (and preservation). Remember that God intervenes between man and his heart, and that you will be gathered before Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Respond to Allah, and respond to the Messenger when he calls you to that which gives you life. Know well that Allah stands between a man and his heart, and it is to Him that all of you shall be mustered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, listen to God and the Messengers when they call you to that which gives you life. Know that God is between a man and his heart and that before Him you will all be brought together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Present yourselves upon the command of Allah and His Noble Messenger, when the Noble Messenger calls you towards the matter that will bestow you life; and know that the command of Allah becomes a barrier between a man and his heart’s intentions, and that you will all be raised towards Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Answer Allah and (His) Messenger when he (the Messenger) calls you to that which will give you life, and know that Allah comes between a person and his heart. And verily to Him you shall (all) be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! answer (the call of) Allah and His Apostle when he calls you to that which gives you life; and know that Allah intervenes between man and his heart, and that to Him you shall be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, respond to God and the Messenger when He calls you unto that which will give you life; and know that God stands between a man and his heart, and that to Him you shall be mustered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Obey Allah, and the messenger when He calleth you to that which quickeneth you, and know that Allah cometh in between the man and his own heart, and that He it is unto Whom ye will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, obey God and the Messenger when he calls you to that which gives you life. Know that God stands between man and his heart, and you shall all be gathered in His presence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! answer Allah and the apostle when he calleth you to that which quickeneth you, and know that verily Allah interposeth between a man and his heart, and that verily unto Him ye all shall be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Answer Allah and the Apostle when he summons you to that which will give you life. Know that Allah intervenes between a man and his heart and that toward Him you will be mustered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! give your response to Allah and His Messenger, when He calleth you to that which will give you life; and know that Allah cometh in between a man and his heart, and that it is He to Whom ye shall (all) be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Answer Allah (by obeying Him) and (His) Messenger when he (SAW) calls you to that which will give you life, and know that Allah comes in between a person and his heart (i.e. He prevents an evil person to decide anything). And verily to Him you shall (all) be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, respond to Allah and the Messenger when he calls you to that which revives you. Know that Allah is between the person and his heart, and that toHim you shall all be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Respond to God and to the Messenger when He calls you to what will revive you. And know that God stands between a man and his heart, and that to Him you will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, respond to Allah and to the Messenger when he calls you to that which gives you life. And know that Allah intervenes between a man and his heart and that to Him you will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:24] O you who believe, respond to God and the Messenger, with obedience, when He calls you to that which will give you life, in the matter of religion, for it will be the source of everlasting life [for you]; and know that God comes in between a man and his heart, so that he cannot believe or disbelieve except by His will; and that it is to Him that you shall be gathered, and He will requite you for your deeds.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe) i.e. the Companions of Muhammad (pbuh); (Obey Allah, and the messenger when He calleth you to that which quickeneth you) to that which honours you, makes you triumphant and reforms you, such as when you are called to fighting, etc., (and know) believers (that Allah cometh in between) protects (the man and his own heart) He protects the believer and his heart, such that He preserves the heart of the believer by making it firm on faith so that it does not reject faith; and he preserves the heart of the disbeliever by making it firm on disbelief so that it does not accept faith, (and that He it is unto Whom) unto Allah in the Hereafter (ye will be gathered) and thus rewarded you for your works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذَا دَعَاكُم لِمَا يُحْيِيكُمْ } معناه لِمَا يُهدِيكُمْ ويُصلِحُكُمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"When He calls you to that which gives you life\" - meaning that which guides you and makes you righteous.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يا أيها الذين آمنوا } بالغيب { اسْتَجِيبوا } بالتزكية والتصفية { إذا دعاكم لما } يحيي قلوبكم من العلم الحقيقي أو آمنوا الإيمان التحقيقي\n استجيبوا بالسلوك إلى الله وفيه إذا دعاكم إليه لإحيائكم به\n هذا إذا كانت استجابة الله والرسول استجابة واحدة\n أما إذا كانت متغايرة فمعناه: استجيبوا لله بالباطن والأعمال القلبية\n وللرسول بالظاهر والأعمال النفسية\n أو استجيبوا لله بالفناء في الجمع\n وللرسول بمراعاة حقوق التفصيل إذا دعاكم إلى الاستقامة لما يحييكم من البقاء بالله فيها\n كل ذلك قبل زوال الاستعداد فإن الله يحول بين المرء وقلبه بزوال الاستعداد وحصول الحجاب بارتكاب الرين\n فانتهزوا الفرصة ولا تؤخروا الاستجابة { وأنه إليه تُحْشرون } فيجازيكم من صفاته وذاته على حسب محوكم وفنائكم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه منادياً للمؤمنين تذكيراً له وتعليماً: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم: إجابة الله وإجابة رسوله { ٱسْتَجِيبُواْ لِلَّهِ } بامتثال مأموراته وأحكامه واجتناب نواهيه { وَلِلرَّسُولِ } سنته وآدابه وأخلاقه { إِذَا دَعَاكُم } وحده\n باعتبار أن دعوة الرسول هي بعينها دعوة الحق { لِمَا يُحْيِيكُمْ } من العلوم الدينية والمعارف الحقيقية المثمرة للمكاشفات والمشاهدات التي اضمحلت دنها نفوس السّوى والأغيار مطلقاً\n المورثة للحياة الأزلية والبقاء السرمدي التي لا يذوقون فيها الموت إلا الموتة الأولى التي هي الانخلاع عن لوازم البشرية\n ومقتضيات القوى البهيمية\n ولا بدَّ أن تكون إجابتكم وقولكم على وجه الخلوص والتسليم\n\n\n{ وَاعْلَمُواْ أَنَّ ٱللَّهَ } المطلع لضمائر عباده { يَحُولُ } ويحجب { بَيْنَ ٱلْمَرْءِ } المشخص بالهوية الشخصية\n المتعين بالتعين العدلي { وَقَلْبِهِ } الذي يسع فيه الحق المنزه عن الإطلاق والتقييد\n المبرئ عن الإحاطة والتحديد بالحجب الكثيرة فمادامت الحجب والأستار مسدولة بين المرء وقلبه لم يشم رائحة المحبة والولاء المؤدي إلى الفناء\n المثمر للبقاء\n\n\nوانفتاح أبواب المحبة والولاء إنما يحصل بالإخلاص والتسليم والتفويض والتوكل والتبتل\n والتوحيد المقسط للإضافات مطلقاً { وَ } بالجلمة: { أَنَّهُ } أي: الشأن { إِلَيْهِ } سبحانه لا إلى غيره بد رفع الأظلال الهالكة والتعينات الباطلة { تُحْشَرُونَ } [الأنفال: 24] ترجعون رجوع الظل إلى ذي الظل\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { يا أيها الذين آمنوا استجيبوا لله } أي: أجيبوا فيما دعاكم إليه، { وللرسول } فيما دلكم عليه من الطاعة والإحسان، { إذا دعاكم لما يُحييكم } من العلوم الدينية فإنها حياة القلب، كما أن الجهل موته، أو { إذا دعاكم لما يُحييكم } الحياة الأبدية، في النعيم الدائم، من العقائد والأعمال، أو من الجهاد، فإنه سبب بقائكم إذ تركتموه لغلبكم العدو وقتلكم، أو الشهادة، لقوله تعالى:\n[آل عمران: 169]، ووحد الضمير في قوله: { إذا دعاكم } باعتبار ما ذكر، أو لأن دعوة الله تُسمع من الرسول. وفي البخاري: أن الرسول صلى الله عليه وسلم دعا أبيّ بْنَ كَعْبٍ، وهو في الصَّلاة، فلم يجب، فلما فرغ أجاب، فقال له صلى الله عليه وسلم:\n \" ما مَنَعَكَ أن تجيبني \" \nفقال: كُنْتُ أُصلّي، فقال:\n \" أَلمْ تَسْمَعَ قوله: { استَجِيتُوا لِلَّهِ وَلِلرَّسُول } \" \nفاختلف فيه العلماء، فقيل لأن إجابته صلى الله عليه وسلم لا تقطع الصلاة، فيُجيب، ويبقى على صلاته، وقيل: إن دعاءه كان لأمر لا يقبل التأخير، وللمصلي أن يقطع الصلاة لمثله، كإنقاذ أعمى وشبهه. ثم قال تعالى: { واعلموا أنَّ الله يَحُولُ بين المرء وقلبه } فينقله من الإيمان إلى الكفر، ومن الكفر إلى الإيمان، ومن اليقين إلى الشك ومن الشك إلى اليقين، ومن الصفاء إلى الكدر، ومن الكدر إلى الصفاء. وقيل البيضاوي: هو تمثيل لغاية قربه من العبد كقوله تعالى:\n[ق: 16]، وتنبيه على أنه مطلع على مكنونات القلوب، مما عسى أن يغفل عنها صاحبها، أو حث على المبادرة إلى إخلاص القلوب وتصفيتها، قبل أن يحول الله بينه وبين قلبه بالموت أو غيره، أو تصوير وتخييل لتملكه على العبد قلبه فيفسخ عزائمه، ويغير مقاصده، ويحول بينه وبين الكفر، إن أراد سعادته، وبينه وبين الإيمان، إن قضى شقاوته. هـ. { و } اعلموا أيضاً { أنه إليه تُحشرون } فيجازيكم بأعمالكم وعقائدكم. الإشارة: قد جعل الله، من فضله ورحمته، في كل زمان وعصر، دعاة يدعون الناس إلى ما تحيا به قلوبهم، حتى تصلح لدخول حضرة محبوبهم، فهم خلفاء عن الله ورسوله، فمن استجاب لهم وصحبهم حيي قلبه، وتطهر سره ولبه، ومن تنكب عنهم ماتت روحه في أودية الخواطر والأوهام.\nوقوله تعالى: { واعلموا أن الله يَحُولُ بين المرء وقلبه } حيلولة الحق تعالى بين المرء وهو تغطيته وحجبه عن شهود أسرار ذاته وأنوار صفاته، بالوقوف مع الحس، وشهود الفرق بلا جمع، ويعبر عنه أهل الفن بفَقْد القلب، فإذا قال أحدهم: فقدتُ قلبي، فمعناه: أنه رجع لشهود حسه ووجود نفسه، ووجدان القلب هو احتضاره بشهود معاني أسرار الذات وأنوار الصفات، فيغيب عن نفسه وحسه، وعن سائر الأكوان الحسية، وفقدان القلب يكون بسبب سوء الأدب، وقد يكون بلا سبب اختباراً من الحق تعالى، هل يفزع إليه في فقدان أو يبقى مع حاله.\nوقد تكلم الغزالي على القلب فقال، في أول شرح عجائب القلب من الإحياء: إن المطيع بالحقيقة لله هو القلب، وهو العالم بالله، وهو الساعي إلى الله، والمتقرب إليه، المكاشف بما عند الله ولديه، وإنما الجوارح أتباع، والقلب هو المقبول عند الله، إذا سَلِمَ من غير الله، وهو المحجوب عن الله إذا صار مستغرقاً في غير الله وهو المطالب والمخاطب، وهو المعاتب والمعاقب، وهو الذي يسعد بالقرب من الله، فيفلح إذا زكاه، ويخيب ويشقى إذا دنسه ودساه. ثم قال: وهو الذي إذا عرفه الإنسان فقد عرف نفسه، وإذا عرف نفسه فقد عرف ربه، وإذا جهله فقد جهل نفسه، وإذا جهل نفسه، جهل ربه، ومن جهل قلبه فهو لغيره أجهل، وأكثر الناس جاهلون بقلوبهم وأنفسهم وقد حيل بينهم وبين أنفسهم، فإن الله يحول بين المرء وقلبه، وحيلولته بأن يمنعه عن مشاهدته ومراقبته، ومعرفة صفاته، وكيفية تقلبه بين أصبعين من أصابع الرحمن، إلى أعلى عليين، ويرتقي إلى عالم الملائكة المقربين، ومن لم يعرف قلبه ليراقبه ويراعيه، ويترصد ما يلوح من خزائن الملكوت عليه وفيه، فهو ممن قال الله تعالى فيهم:\n[الحشر: 19] الآية.هـ. وقد أنشد من وجد قلبه، وعرف ربه، وغنى بما وجد، فقال:\nومن أسباب تشتت القلب وفقده دخولُ الفتنة عليه، الذي أشار أليه بقوله: { وَٱتَّقُواْ فِتْنَةً لاَّ تُصِيبَنَّ ٱلَّذِينَ ظَلَمُواْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:25",
      "similarity": 0.3936112502132867
    },
    {
      "verse": "26:34",
      "similarity": 0.3635544783016135
    },
    {
      "verse": "18:108",
      "similarity": 0.36166547839787194
    },
    {
      "verse": "27:8",
      "similarity": 0.3116546084600306
    },
    {
      "verse": "10:89",
      "similarity": 0.30641686746851526
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008024.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008024.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}