{
  "chapter": "الأنفال",
  "text": "يايها الذين ءامنوا۟ استجيبوا۟ لله وللرسول اذا دعاكم لما يحييكم واعلموا۟ ان الله يحول بين المرء وقلبه وانه اليه تحشرون",
  "translations": [
    {
      "translation": "You who have iman! respond to Allah and to the Messenger when He calls you to what will bring you to life! Know that Allah intervenes between a man and his heart and that you will be gathered to Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, respond to the call of God and His Prophet when he calls you to what will give you life (and preservation). Remember that God intervenes between man and his heart, and that you will be gathered before Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Respond to Allah, and respond to the Messenger when he calls you to that which gives you life. Know well that Allah stands between a man and his heart, and it is to Him that all of you shall be mustered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, listen to God and the Messengers when they call you to that which gives you life. Know that God is between a man and his heart and that before Him you will all be brought together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Present yourselves upon the command of Allah and His Noble Messenger, when the Noble Messenger calls you towards the matter that will bestow you life; and know that the command of Allah becomes a barrier between a man and his heart’s intentions, and that you will all be raised towards Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Answer Allah and (His) Messenger when he (the Messenger) calls you to that which will give you life, and know that Allah comes between a person and his heart. And verily to Him you shall (all) be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! answer (the call of) Allah and His Apostle when he calls you to that which gives you life; and know that Allah intervenes between man and his heart, and that to Him you shall be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, respond to God and the Messenger when He calls you unto that which will give you life; and know that God stands between a man and his heart, and that to Him you shall be mustered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Obey Allah, and the messenger when He calleth you to that which quickeneth you, and know that Allah cometh in between the man and his own heart, and that He it is unto Whom ye will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, obey God and the Messenger when he calls you to that which gives you life. Know that God stands between man and his heart, and you shall all be gathered in His presence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! answer Allah and the apostle when he calleth you to that which quickeneth you, and know that verily Allah interposeth between a man and his heart, and that verily unto Him ye all shall be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Answer Allah and the Apostle when he summons you to that which will give you life. Know that Allah intervenes between a man and his heart and that toward Him you will be mustered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! give your response to Allah and His Messenger, when He calleth you to that which will give you life; and know that Allah cometh in between a man and his heart, and that it is He to Whom ye shall (all) be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Answer Allah (by obeying Him) and (His) Messenger when he (SAW) calls you to that which will give you life, and know that Allah comes in between a person and his heart (i.e. He prevents an evil person to decide anything). And verily to Him you shall (all) be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, respond to Allah and the Messenger when he calls you to that which revives you. Know that Allah is between the person and his heart, and that toHim you shall all be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Respond to God and to the Messenger when He calls you to what will revive you. And know that God stands between a man and his heart, and that to Him you will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, respond to Allah and to the Messenger when he calls you to that which gives you life. And know that Allah intervenes between a man and his heart and that to Him you will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:24] O you who believe, respond to God and the Messenger, with obedience, when He calls you to that which will give you life, in the matter of religion, for it will be the source of everlasting life [for you]; and know that God comes in between a man and his heart, so that he cannot believe or disbelieve except by His will; and that it is to Him that you shall be gathered, and He will requite you for your deeds.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإعادة لمضمون قوله : { يأيها الذين ءامنوا أطيعوا الله ورسوله } \\[ الأنفال : 20 \\] الذي هو بمنزلة النتيجة من الدليل أو مقصد الخطبة من مقدمتها كما تقدم هنالك .فافتتاح السورة كان بالأمر بالطاعة والتقوى ، ثم بيان أن حق المؤمنين الكُمّل أن يخافوا الله ويطيعوه ويمتثلوا أمره وإن كانوا كارهين ، وضرب لهم مثلاً بكَراهتهم الخروج إلى بدر ، ثم بكراهتهم لقاء النفير وأوقفهم على ما اجتنوه من بركات الامتثال وكيف أيدهم الله بنصره ونصب لهم عليه أمارة الوعد بإمداد الملائكة؛ لتطمئن قلوبهم بالنصر وما لطف بهم من الأحوال ، وجعل ذلك كله إقناعاً لهم بوجوب الثبات في وجه المشركين عند الزحف ثم عاد إلى الأمر بالطاعة وحذرهم من أحوال الذين يقولون سمعنا وهم لا يسمعون ، وأعقب ذلك بالأمر بالاستجابة للرسول إذا دعاهم إلى شيء ، فإن في دعوته إياهم إحياء لنفوسهم وأعلمهم أن الله يكسب قلوبهم بتلك الاستجابة قوى قدسية .واختير في تعريفهم ، عند النداء ، وصفُ الإيمان ليوميء إلى التعليل كما تقدم في الآيات من قبل ، أي أن الإيمان هو الذي يقتضي أن يثقوا بعناية الله بهم فيمتثلوا أمره إذا دعاهم .والاستجابة : الإجابة ، فالسين والتاء فيها للتأكيد ، وقد غلب استعمال الاستجابة في إجابة طلب معيّن أو في الأعم ، فأما الإجابة فهي إجابة لنداء وغلب أن يُعدى باللام إذا اقترن بالسين والتاء ، وتقدم ذلك عند قوله تعالى : { فاستجاب لهم ربهم } في \\[ آل عمران : 195 \\].( وإعادة حرف بعد واو العطف في قوله : { وللرسول } للإشارة إلى استقلال المجرور بالتعلق بفعل الاستجابة ، تنبيهاً على أن استجابة الرسول صلى الله عليه وسلم أعم من استجابة الله لأن الاستجابة لله لا تكون إلاّ بمعنى المجاز وهو الطاعة بخلاف الاستجابة للرسول عليه الصلاة والسلام فإنها بالمعنى الأعم الشامل للحقيقة وهو استجابة ندائِه ، وللمجاز وهو الطاعة فأريد أمرهم بالاستجابة للرسول بالمعنيين كلما صدرت منه دعوة تقتضي أحدهما .ألا ترى أنه لم يُعَد ذكر اللام في الموقع الذي كانت فيه الاستجابة لله والرسول صلى الله عليه وسلم بمعنى واحد ، وهو الطاعة ، وذلك قوله تعالى : { الذين استجابوا لله والرسول من بعد ما أصابهم القرح } \\[ آل عمران : 172 \\] فإنها الطاعة للأمر باللحاق بجيش قريش في حمراء الأسد بعد الانصراف من أُحد ، فهي استجابة لدعوة معينة .وإفراد ضمير { دعاكم } لأن الدعاء من فعل الرسول مباشرة ، كما أفرد الضمير في قوله : { ولا تَولوا عنه } \\[ الأنفال : 20 \\] وقد تقدم آنفاً .وليس قوله : { إذا دعاكم لما يحييكم } قيْداً للأمر باستجابة ، ولكنه تنبيه على أن دعاءه إياهم لا يكون إلاّ إلى ما فيه خير لهم وإحياء لأنفسهم .واللام في { لما يحييكم } لام التعليل أي دعاكم لأجل ما هو سبب حياتكم الروحية .والإحياء تكوين الحياة في الجسد ، والحياة قوة بها يكون الإدراك والتحرك بالاختيار ويُستعار الإحياء تبعاً لاستعارة الحياة للصفة أو القوة التي بها كمال موصوفها فيما يراد منه مثل حياة الأرض بالإنبات وحياة العقل بالعلم وسداد الرأي ، وضدها الموت في المعاني الحقيقية والمجازية ، قال تعالى : { أمواتٌ غير أحياء } \\[ النحل : 21 \\] { أوَ من كان ميتاً فأحييناه } وقد تقدم في سورة \\[ الأنعام : 122 \\].والإحياء والإماتة تكوين الحياة والموت . وتستعار الحياة والإحياء لبقاء الحياة واستبقائها بدفع العوادي عنها { ولكم في القصاص حياة } \\[ البقرة : 179 \\] { ومن أحياها فكأنما أحيا الناس جميعاً } \\[ المائدة : 32 \\].والإحياء هذا مستعار لما يشبه إحياء الميت ، وهو إعطاء الإنسان ما به كمال الإنسان ، فيعم كل ما به ذلك الكمالُ من إنارة العقول بالاعتقاد الصحيح والخُلق الكريم ، والدلالة على الأعمال الصالحة وإصلاح الفرد والمجتمع ، وما يتقوم به ذلك من الخلال الشريفة العظيمة ، فالشجاعة حياة للنفس ، والاستقلال حياة ، والحرية حياة ، واستقامة أحوال العيش حياة .ولما كان دعاءُ الرسول صلى الله عليه وسلم لا يخلوا عن إفادة شيء من معاني هذه الحياة أمَر الله الأمة بالاستجابة له ، فالآية تقتضي الأمر بالامتثال لما يدعو إليه الرسول سواء دعَا حقيقة بطلب القدوم ، أم طلَب عمَلاً من الأعمال ، فلذلك لم يكن قيدُ { لما يحييكم } مقصوداً لتقييد الدعوة ببعض الأحوال بل هو قيد كاشف ، فإن الرسول صلى الله عليه وسلم لا يدعوهم إلاّ وفي حضورهم لديْه حياةٌ لهم ، ويكشف عن هذا المعنى في قيد { لما يحييكم } ما رواه أهل الصحيح عن أبي سعيد بننِ المُعَلى ، قال : كنتُ أصلي في المسجد فدعاني رسول الله صلى الله عليه وسلم فلم أجبه ثم أتيتُه فقلت يا رسول الله إني كنتُ أصلي فقال : ألم يقل الله تعالى : { يا أيها الذين آمنوا استجيبوا لله وللرسول إذا دعاكم } ثم قال : ألا أعلمك صورة الحديث في فضل فاتحة الكتاب ، فوقْفُه على قوله : { إذا دعاكم } يدل على أن { لِما يحييكم } قيدٌ كاشف وفي «جامع الترمذي» عن أبي هريرة أن رسول الله صلى الله عليه وسلم خرج على أبيّ بن كعب فقال : يا أبيّ وهو يصلي فالتفت أبَيّ ولم يجبه وصلى أبيّ فخفف ثم انصرف إلى رسول الله فقال : السلامُ عليك يا رسول الله فقال رسول الله صلى الله عليه وسلم وعليك السلام ما منَعك يا أبيّ أن تجيبني إذْ دعوتك فقال : يا رسول الله إني كنت في الصلاة فقال : أفلم تجد فيما أوحي إلي أن استجيبوا لله وللرسول إذا دعاكم لما يحييكم قال : بَلَى ولا أعود إن شاء الله» الحديثَ بمثل حديث أبي سعيد بن المعلى قال ابن عطية : وهو مروي أيضاً من طريق مالك بن أنس ( يريد حديث أبيّ بن كعب وهو عند مالك حضر منه عند الترمذي ) قال ابن عطية وروي أنه وقع نحوُه مع حذيفة بن اليمان في غزوة الخندق ، فتكون عدة قضايا متماثلة ولا شك أن القصد منها التنبيهُ على هذه الخصوصية لدعاء الرسول صلى الله عليه وسلممقتضى ارتباط نظم الكلام يوجب أن يكون مضمونُ هذه الجملة مرتبطاً بمضمون الجملة التي قبلها فيكون عطفها عليها عطف التكملة على ما تُكمّلُه ، والجملتان مجعولتان آية واحدة في المصحف .وافتتحت الجملة باعلموا؛ للاهتمام بما تتضمنه وحث المخاطبين على التأمل فيما بعدَه ، وذلك من أساليب الكلام البليغ أن يفتتح بعض الجمل المشتملة على خبر أوْ طلببِ فهم باعْلم أو تَعَلمْ لَفتاً لذهن المخاطب .وفيه تعريض غالباً بغفلة المخاطب عن أمر مهم فمن المعروف أن المخبر أو الطالب ما يريد إلاّ علمَ المخاطب فالتصريح بالفعل الدال على طلب العلم مقصود للاهتمام ، قال تعالى : { اعلموا أن الله شديد العقاب وأن الله غفورٌ رحيمٌ } \\[ المائدة : 196 \\] وقال { اعلموا أنما الحياة الدنيا لعبٌ ولهوٌ } \\[ الحديد : 20 \\] الآية وقال في الآية ، بعد هذه { واعلموا أن الله شديد العقاب } \\[ الأنفال : 25 \\] وفي الحديث أن النبي صلى الله عليه وسلم قال لأبي مسعود الأنصاري وقد رآه يضرب عبداً له « أعلم أبَا مسعود اعْلَم أبا مسعود : أن الله أقدر عليك منك على هذا الغلام » وقد يفتتحون بتَعَلّم أو تَعَلَمَنَّ قال زهير :قلتُ تعلَّمْ أن للصيد غرة ... وإلاّ تُضَيِّعْها فإِنك قاتلُهوقال زياد بن سَيّار: ... تَعلّمْ شفاء النفس قَهرُ عدوهافبالغْ بلطف في التحيُّل والمكر ... وقال بشر بن أبي خازم: ... وإلاّ فاعلموا أنّا وأنتُمبُغاةٌ ما بَقينا في شقاق ... و { أن } بعد هذا الفعل مفتوحة الهمزة حيثما وقعت ، والمصدر المؤول يسُدّ مسدّ مفعولي عَلم مع إفادة ( أن ) التأكيد .والحَوْل ، ويقال الحُؤُل : منع شيء اتصالاً بين شيئين أو أشياء قال تعالى : { وحالَ بينهما المَوج } \\[ هود : 43 \\].وإسناد الحول إلى الله مجاز عقلي لأن الله منزه عن المكان ، والمعنى يحولُ شأنٌ من شؤون صفاتِه ، وهو تعلق صفة العلم بالإطلاع على ما يضمره المرء أو تعلق صفة القدرة بتنفيذ ما عزم عليه المرءُ أو بصرفه عن فعله ، وليس المرادُ بالقلب هنا البضعة الصنوبرية المستقرة في باطن الصدر ، وهي الآلة التي تدفع الدم إلى عروق الجسم ، بل المراد عقل المرء وعزْمه ، وهو إطلاق شائع في العربية .فلما كان مضمون هذه الجملة تكملة لمضمون الجملة التي قبلها يجوز أن يكون المعنى : واعلموا أن علم الله يخلُص بين المرء وعقله خُلوص الحائِللِ بين شيئين فإنه يكون شديد الاتصال بكليهما .والمراد ب { المرء } عمله وتصرفاته الجسمانية .فالمعنى : أن الله يعلم عزم المرء ونِيّته قبل أن تنفعل بعزمه جوارحُه ، فشبه علم الله بذلك بالحائِل بين شيئين في كونه أشد اتصالاً بالمحول عنه من أقرب الأشياء إليه على نحو قوله تعالى : { ونحن أقرب إليه من حبل الوريد .وجيء بصيغة المضارع يحول } للدلالة على أن ذلك يتجدد ويستمر ، وهذا في معنى قوله تعالى : { ونحن أقرب إليه من حبل الوريد } \\[ ق : 16 \\] قاله قتادة .والمقصود من هذا تحذير المؤمنين من كل خاطر يخطر في النفوس : من التراخي في الاستجابة إلى دعوة الرسول صلى الله عليه وسلم والتنصل منها ، أو التستر في مخالفته ، وهو معنى قوله : { واعلموا أن الله يعلم ما في أنفسكم فاحذروه } \\[ البقرة : 235 \\].وبهذا يظهر وقع قوله : { وأنه إليه تحشرون } عقبه فكان ما قبله تحذيراً وكان هو تهديداً وفي «الكشاف» ، و«ابن عطية» : قيل إن المراد الحث على المبادرة بالامتثال وعدم إرجاء ذلك إلى وقت آخر خشية أن تعترض المرءَ موانع من تنفيذ عزمه على الطاعة أي فيكون الكلام على حذف مضاف تقديره : إن أجَل الله يحول بين المرء وقلبه ، أي بين عمله وعزمه قال تعالى : { وأنْفقوا ممّا رزقناكم من قبل أن يأتي أحدَكم الموتُ } \\[ المنافقون : 10 \\] الآية .وهنالك أقوال أخرى للمفسرين يحتملها اللفظ ولا يساعد عليها ارتباط الكلام والذي حملنا على تفسير الآية بهذا دون ما عداه أن ليس في جملة : { أن الله يحول بين المرء وقلبه } إلاّ تعلق شأن من شؤون الله بالمرء وقلبه أي جثمانه وعقله دون شيء آخر خارج عنهما ، مثل دعوة الإيمان ودعوة الكفر ، وأن كلمة { بين } تقتضي شيئين فما يكون تحول إلاّ إلى أحدهما لا إلى أمر آخر خارج عنهما كالطبائِع ، فإن ذلك تحويل وليس حُؤلاً .وجملة : { وأنه إليه تحشرون } عطف على { أن الله يحول بين المرء وقلبه } والضمير الواقع اسم ( أن ) ضمير اسم الجلالة ، وليس ضمير الشأن لعدم مناسبته ، ولإجراء أسلوب الكلام على أسلوب قوله : { أن الله يحول } الخ .وتقديم متعلق { تُحشرون } عليه لإفادة الاختصاص أي : إليه إلى غيره تحشرون ، وهذا الاختصاص للكناية عن انعدام ملجإٍ أو مَخْبَإٍ تلتجئون إليه من الحشر إلى الله فكني عن انتفاء المكان بانتفاء محشورٍ إليْه غير الله بأبدع أسلوب ، وليس الاختصاص لرد اعتقادٍ ، لأن المخاطبين بذلك هم المؤمنون ، فلا مقتضى لقصر الحشر على الكون إلى الله بالنسبة إليهم .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe) i.e. the Companions of Muhammad (pbuh); (Obey Allah, and the messenger when He calleth you to that which quickeneth you) to that which honours you, makes you triumphant and reforms you, such as when you are called to fighting, etc., (and know) believers (that Allah cometh in between) protects (the man and his own heart) He protects the believer and his heart, such that He preserves the heart of the believer by making it firm on faith so that it does not reject faith; and he preserves the heart of the disbeliever by making it firm on disbelief so that it does not accept faith, (and that He it is unto Whom) unto Allah in the Hereafter (ye will be gathered) and thus rewarded you for your works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذَا دَعَاكُم لِمَا يُحْيِيكُمْ } معناه لِمَا يُهدِيكُمْ ويُصلِحُكُمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"When He calls you to that which gives you life\" - meaning that which guides you and makes you righteous.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يا أيها الذين آمنوا } بالغيب { اسْتَجِيبوا } بالتزكية والتصفية { إذا دعاكم لما } يحيي قلوبكم من العلم الحقيقي أو آمنوا الإيمان التحقيقي\n استجيبوا بالسلوك إلى الله وفيه إذا دعاكم إليه لإحيائكم به\n هذا إذا كانت استجابة الله والرسول استجابة واحدة\n أما إذا كانت متغايرة فمعناه: استجيبوا لله بالباطن والأعمال القلبية\n وللرسول بالظاهر والأعمال النفسية\n أو استجيبوا لله بالفناء في الجمع\n وللرسول بمراعاة حقوق التفصيل إذا دعاكم إلى الاستقامة لما يحييكم من البقاء بالله فيها\n كل ذلك قبل زوال الاستعداد فإن الله يحول بين المرء وقلبه بزوال الاستعداد وحصول الحجاب بارتكاب الرين\n فانتهزوا الفرصة ولا تؤخروا الاستجابة { وأنه إليه تُحْشرون } فيجازيكم من صفاته وذاته على حسب محوكم وفنائكم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه منادياً للمؤمنين تذكيراً له وتعليماً: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم: إجابة الله وإجابة رسوله { ٱسْتَجِيبُواْ لِلَّهِ } بامتثال مأموراته وأحكامه واجتناب نواهيه { وَلِلرَّسُولِ } سنته وآدابه وأخلاقه { إِذَا دَعَاكُم } وحده\n باعتبار أن دعوة الرسول هي بعينها دعوة الحق { لِمَا يُحْيِيكُمْ } من العلوم الدينية والمعارف الحقيقية المثمرة للمكاشفات والمشاهدات التي اضمحلت دنها نفوس السّوى والأغيار مطلقاً\n المورثة للحياة الأزلية والبقاء السرمدي التي لا يذوقون فيها الموت إلا الموتة الأولى التي هي الانخلاع عن لوازم البشرية\n ومقتضيات القوى البهيمية\n ولا بدَّ أن تكون إجابتكم وقولكم على وجه الخلوص والتسليم\n\n\n{ وَاعْلَمُواْ أَنَّ ٱللَّهَ } المطلع لضمائر عباده { يَحُولُ } ويحجب { بَيْنَ ٱلْمَرْءِ } المشخص بالهوية الشخصية\n المتعين بالتعين العدلي { وَقَلْبِهِ } الذي يسع فيه الحق المنزه عن الإطلاق والتقييد\n المبرئ عن الإحاطة والتحديد بالحجب الكثيرة فمادامت الحجب والأستار مسدولة بين المرء وقلبه لم يشم رائحة المحبة والولاء المؤدي إلى الفناء\n المثمر للبقاء\n\n\nوانفتاح أبواب المحبة والولاء إنما يحصل بالإخلاص والتسليم والتفويض والتوكل والتبتل\n والتوحيد المقسط للإضافات مطلقاً { وَ } بالجلمة: { أَنَّهُ } أي: الشأن { إِلَيْهِ } سبحانه لا إلى غيره بد رفع الأظلال الهالكة والتعينات الباطلة { تُحْشَرُونَ } [الأنفال: 24] ترجعون رجوع الظل إلى ذي الظل\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { يا أيها الذين آمنوا استجيبوا لله } أي: أجيبوا فيما دعاكم إليه، { وللرسول } فيما دلكم عليه من الطاعة والإحسان، { إذا دعاكم لما يُحييكم } من العلوم الدينية فإنها حياة القلب، كما أن الجهل موته، أو { إذا دعاكم لما يُحييكم } الحياة الأبدية، في النعيم الدائم، من العقائد والأعمال، أو من الجهاد، فإنه سبب بقائكم إذ تركتموه لغلبكم العدو وقتلكم، أو الشهادة، لقوله تعالى:\n[آل عمران: 169]، ووحد الضمير في قوله: { إذا دعاكم } باعتبار ما ذكر، أو لأن دعوة الله تُسمع من الرسول. وفي البخاري: أن الرسول صلى الله عليه وسلم دعا أبيّ بْنَ كَعْبٍ، وهو في الصَّلاة، فلم يجب، فلما فرغ أجاب، فقال له صلى الله عليه وسلم:\n \" ما مَنَعَكَ أن تجيبني \" \nفقال: كُنْتُ أُصلّي، فقال:\n \" أَلمْ تَسْمَعَ قوله: { استَجِيتُوا لِلَّهِ وَلِلرَّسُول } \" \nفاختلف فيه العلماء، فقيل لأن إجابته صلى الله عليه وسلم لا تقطع الصلاة، فيُجيب، ويبقى على صلاته، وقيل: إن دعاءه كان لأمر لا يقبل التأخير، وللمصلي أن يقطع الصلاة لمثله، كإنقاذ أعمى وشبهه. ثم قال تعالى: { واعلموا أنَّ الله يَحُولُ بين المرء وقلبه } فينقله من الإيمان إلى الكفر، ومن الكفر إلى الإيمان، ومن اليقين إلى الشك ومن الشك إلى اليقين، ومن الصفاء إلى الكدر، ومن الكدر إلى الصفاء. وقيل البيضاوي: هو تمثيل لغاية قربه من العبد كقوله تعالى:\n[ق: 16]، وتنبيه على أنه مطلع على مكنونات القلوب، مما عسى أن يغفل عنها صاحبها، أو حث على المبادرة إلى إخلاص القلوب وتصفيتها، قبل أن يحول الله بينه وبين قلبه بالموت أو غيره، أو تصوير وتخييل لتملكه على العبد قلبه فيفسخ عزائمه، ويغير مقاصده، ويحول بينه وبين الكفر، إن أراد سعادته، وبينه وبين الإيمان، إن قضى شقاوته. هـ. { و } اعلموا أيضاً { أنه إليه تُحشرون } فيجازيكم بأعمالكم وعقائدكم. الإشارة: قد جعل الله، من فضله ورحمته، في كل زمان وعصر، دعاة يدعون الناس إلى ما تحيا به قلوبهم، حتى تصلح لدخول حضرة محبوبهم، فهم خلفاء عن الله ورسوله، فمن استجاب لهم وصحبهم حيي قلبه، وتطهر سره ولبه، ومن تنكب عنهم ماتت روحه في أودية الخواطر والأوهام.\nوقوله تعالى: { واعلموا أن الله يَحُولُ بين المرء وقلبه } حيلولة الحق تعالى بين المرء وهو تغطيته وحجبه عن شهود أسرار ذاته وأنوار صفاته، بالوقوف مع الحس، وشهود الفرق بلا جمع، ويعبر عنه أهل الفن بفَقْد القلب، فإذا قال أحدهم: فقدتُ قلبي، فمعناه: أنه رجع لشهود حسه ووجود نفسه، ووجدان القلب هو احتضاره بشهود معاني أسرار الذات وأنوار الصفات، فيغيب عن نفسه وحسه، وعن سائر الأكوان الحسية، وفقدان القلب يكون بسبب سوء الأدب، وقد يكون بلا سبب اختباراً من الحق تعالى، هل يفزع إليه في فقدان أو يبقى مع حاله.\nوقد تكلم الغزالي على القلب فقال، في أول شرح عجائب القلب من الإحياء: إن المطيع بالحقيقة لله هو القلب، وهو العالم بالله، وهو الساعي إلى الله، والمتقرب إليه، المكاشف بما عند الله ولديه، وإنما الجوارح أتباع، والقلب هو المقبول عند الله، إذا سَلِمَ من غير الله، وهو المحجوب عن الله إذا صار مستغرقاً في غير الله وهو المطالب والمخاطب، وهو المعاتب والمعاقب، وهو الذي يسعد بالقرب من الله، فيفلح إذا زكاه، ويخيب ويشقى إذا دنسه ودساه. ثم قال: وهو الذي إذا عرفه الإنسان فقد عرف نفسه، وإذا عرف نفسه فقد عرف ربه، وإذا جهله فقد جهل نفسه، وإذا جهل نفسه، جهل ربه، ومن جهل قلبه فهو لغيره أجهل، وأكثر الناس جاهلون بقلوبهم وأنفسهم وقد حيل بينهم وبين أنفسهم، فإن الله يحول بين المرء وقلبه، وحيلولته بأن يمنعه عن مشاهدته ومراقبته، ومعرفة صفاته، وكيفية تقلبه بين أصبعين من أصابع الرحمن، إلى أعلى عليين، ويرتقي إلى عالم الملائكة المقربين، ومن لم يعرف قلبه ليراقبه ويراعيه، ويترصد ما يلوح من خزائن الملكوت عليه وفيه، فهو ممن قال الله تعالى فيهم:\n[الحشر: 19] الآية.هـ. وقد أنشد من وجد قلبه، وعرف ربه، وغنى بما وجد، فقال:\nومن أسباب تشتت القلب وفقده دخولُ الفتنة عليه، الذي أشار أليه بقوله: { وَٱتَّقُواْ فِتْنَةً لاَّ تُصِيبَنَّ ٱلَّذِينَ ظَلَمُواْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:25",
      "similarity": 0.3936112502132867
    },
    {
      "verse": "26:34",
      "similarity": 0.3635544783016135
    },
    {
      "verse": "18:108",
      "similarity": 0.36166547839787194
    },
    {
      "verse": "27:8",
      "similarity": 0.3116546084600306
    },
    {
      "verse": "10:89",
      "similarity": 0.30641686746851526
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008024.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008024.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}