{
  "chapter": "الأنفال",
  "text": "واتقوا۟ فتنة لا تصيبن الذين ظلموا۟ منكم خاصة واعلموا۟ ان الله شديد العقاب",
  "translations": [
    {
      "translation": "Be fearful of trials which will not afflict solely those among you who do wrong. Know that Allah is severe in retribution.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beware of sedition, which does not affect the oppressors alone among you, and know that the punishment of God is severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And guard against the mischief that will not only bring punishment to the wrong-doers among you. Know well that Allah is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Guard yourselves against discord among yourselves so that it will not mislead anyone of you, especially the unjust, and know that God's retribution is most severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear the turmoil which will certainly not fall only upon a few selected unjust people among you; and know that Allah’s punishment is severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear the Fitnah (affliction and trial) which affects not in particular (only) those of you who do wrong, and know that Allah is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear an affliction which may not smite those of you in particular who are unjust; and know that Allah is severe in requiting (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear a trial which shall surely not smite in particular the evildoers among you; and know that God is terrible in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And guard yourselves against a chastisement which cannot fall exclusively on those of you who are wrong-doers, and know that Allah is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And beware of an affliction that will not smite exclusively those among you who have done wrong. Know that God is severe in exacting retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear the trial that shall not afflict those alone who among you do Wrong; and know that verily Allah severe in chastising.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And beware of a punishment, which shall not visit the wrongdoers among you exclusively, and know that Allah is severe in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear tumult or oppression, which affecteth not in particular (only) those of you who do wrong: and know that Allah is strict in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear the Fitnah (affliction and trial, etc.) which affects not in particular (only) those of you who do wrong (but it may afflict all the good and the bad people), and know that Allah is Severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be cautious against a sedition that will not smite the harmdoers alone. Know that the punishment of Allah is Stern.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And beware of discord which does not afflict the wrongdoers among you exclusively; and know that God is severe in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear a trial which will not strike those who have wronged among you exclusively, and know that Allah is severe in penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:25] And be afraid of a trial which, if it were to fall upon you, would certainly not fall exclusively upon the evildoers among you, but would encompass them and others, and the way to guard against it is to repudiate that evil which necessarily results in [precipitating] it; and know that God is severe in retribution, against those who oppose Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعُقب تحريضُ جميعهم على الاستجابة ، المستلزمُ تحذيرهم من ضدها بتحذير المستجيبين من إعراض المعرضين ، ليعلموا أنهم قد يلحقهم أذى من جراء فعل غيرهم إذا هم لمُ يُقَوّموا عِوَج قومهم ، كَيلا يحسبوا أن امتثالهم كاف إذا عصى دهماؤهم ، فحذّرهم فتنة تلحقهم فتعم الظالم وغيره .فإن المسلمين إن لم يكونوا كلمة واحدة في الاستجابة لله وللرسول عليه الصلاة والسلام دب بينهم الاختلاف واضطربت أحوالهم واختل نظام جماعتهم باختلاف الآراء وذلك الحال هو المعبر عنه بالفتنة .وحاصل معنى الفتنة يرجع إلى اضطراب الآراء ، واختلال السير ، وحلول الخوف والحذر في نفوس الناس ، قال تعالى : { وفتنّاك فتوناً } \\[ طه : 40 \\] وقد تقدم ذكر الفتنة في قوله : { والفتنة أشد من القتل } في سورة \\[ البقرة : 91 \\].فعلى عقلاء الأقوام وأصحاب الأحلام منهم إذا رأوا دبيب الفساد في عامتهم أن يبادروا للسعي إلى بيان ما حل بالناس من الضلال في نفوسهم ، وأن يكشفوا لهم ماهيته وشبهته وعواقبه ، وأن يمنعوهم منه بما أوتوه من الموعظة والسلطان ، ويزجروا المفسدين عن ذلك الفساد حتى يرتدعوا ، فإن هم تركوا ذلك ، وتوانوا فيه لم يلبث الفساد أن يسري في النفوس وينتقل بالعدوى من واحد إلى غيره ، حتى يعم أو يكاد ، فيعسر اقتلاعه من النفوس ، وذلك الاختلالُ يفسد على الصالحين صلاحَهم وينكد عيشهم على الرغم من صلاحهم واستقامتهم ، فظهر أن الفتنة إذا حلّت بقوم لا تصيب الظالم خاصة بل تعمه والصالح ، فمن أجل ذلك وجب اتقاؤها على الكل ، لأن إضرار حلولها تصيب جميعهم .وبهذا تعلم أن الفتنة قد تكون عقاباً من الله تعالى في الدنيا ، فهي تأخذ حكم العقوبات الدنيوية التي تصيب الأمم ، فإن من سُنتها أن لا تخص المجرمين إذا كان الغالب على الناس هو الفساد ، لأنها عقوبات تحصل بحوادث كونية يستتب في نظام العالم الذي سنه الله تعالى في خلق هذا العالم أن يوزع على الأشخاص كما ورد في حديث النهي عن المنكر في الصحيح : أن النبي قال : مثل القائِم على حدود الله والواقع فيها كمثل قوم استهموا على سفينة فأصاب بعضهم أعلاها وبعضهم أسفلها فكان الذين في أسفلها إذا استقوا من الماء مرّوا على مَن فوقهم فقالوا : لو أنّا خرقنا في نصيبنا خرقاً ولم نؤذ مَن فوقنا فإنْ يتركوهم وما أرادوا هلكوا جميعاً وإن أخذوا على أيديهم نجَوا ونجَوا جميعاً وفي صحيح مسلم } عن زينب بنت جحش أنها قالت : «يا رسول الله أنهلك وفينا الصالحون قال : نعم إذا كثر الخبث ثم يحشْرون على نياتهم» .وحرف { لا } في قوله : { لا تصيبن } نهي بقرينة اتصال مدخولها بنون التوكيد المختصة بالإثبات في الخبر وبالطلب ، فالجملة الطلبية : إما نعت ل { فتنة } بتقدير قول محذوف ، ومثله وارد في كلام العرب كقول العجاج: ... حتى إذا جَن الظلام واختلطجاءوا بِمَذْق هَلْ رأيتَ الذئب قط ... أي مقول فيه . وباب حذف القول باب متسع ، وقد اقتضاه مقام المبالغة في التحذير هنا والاتقاء من الفتنة فأكد الأمر باتقائها بنهيها هي عن إصابتها إياهم ، لأن هذا النهي من أبلغ صيغ النهي بأن يُوجه النهي إلى غير المراد نهيه تنبيهاً له على تحذيره من الأمر المنهي عنه في اللفظ ، والمقصودُ تحذير المخاطب بطريق الكناية لأن نهي ذلك المذكور في صيغة النهي يستلزم تحذير المخاطب فكأنّ المتكلم يجمع بين نهيين ، ومنه قول العرب : لا أعرِفَنّك تفعل كذا ، فإنه في الظاهر المتكلممِ نفسَه عن فعل المخاطب ، ومنه قوله تعالى : { لا يفتننكم الشيطان } \\[ الأعراف : 27 \\] ويسمى هذا بالنهي المحول ، فلا ضمير في النعت بالجملة الطلبية .ويجوز أن تكون جملة : { لا تصيبن } نهياً مستأنفاً تأكيداً للأمر باتقائها مع زيادة التحذير بشمولها مَن لم يكن من الظالمين .ولا يصح جعل جملة : { لا تصيبن } جواباً للأمر في قوله : { واتقوا فتنة } لأنه يمنع منه قوله : { الذين ظلموا منكم خاصة } وإنما كان يجوز لو قال : «لا تصيبنكم» كما يظهر بالتأمل ، وقد أبطل في «مغني اللبيب» جعل ( لا ) نافية هنا ، ورَد على الزمخشري تجويزه ذلك .و { خاصة } اسم فاعل مؤنث لجريانه على { فتنة } فهو منتصب على الحال من ضمير { تصيبن } وهي حال مفيدة لأنها المقصود من التحذير .وافتتاح جملة : { واعلموا أن الله شديد العقاب } بفعل الأمر بالعلم للإهتمام لقصد شدة التحذير ، كما تقدم آنفاً في قوله : { واعلموا أن الله يحول بين المرء وقلْبه } \\[ الأنفال : 24 \\] والمعنى أنه شديد العقاب لمن يخالف أمره ، وذلك يشمل من يخالف الأمر بالاستجابة .\n\n",
      "translations": [
        {
          "translation": "185 (And guard yourselves against a sedition) any sedition that happens (which cannot fall exclusively on those of you who are wrong-doers) but rather befalls on both the wrong-doers and the wronged, (and know that Allah is severe in punishment) when He punishes.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { واتّقوا فتنة } شركاً وحجاباً { لا تصيبنّ } تلك الفتنة { الذين ظلموا منكم } بإزالة الاستعداد أو نقصه لاستعماله في غير موضعه وصرفه فيما دون الحق { خاصة } لانفرادهم بالظلم\n ومعنى لا تصيبن النهي\n أي: إن تصب تصبهم خاصة\n كقوله تعالى:\n[الأنعام\n الآية: 164]\n ويجوز أن يكون المعنى: لا تصيبنهم خاصة\n بل تشملهم وغيرهم بشؤم صحبتهم وتعدي رذيلتهم إلى من يخالطهم كقوله تعالى:\n[الروم\n الآية: 41]\n { واعلموا أنّ الله شديد العقاب } بتسليط الهيآت الظلمانية التي اكتسبتها القلوب عليها وحجبها عنه وتعذيبها بها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱتَّقُواْ } أيها المؤمنون { فِتْنَةً } أي: معصية مسقطة للعدالة\n مزيحة للمروءة مورثة للمصيبة الشاملة إثرها لعباد الله مثل الطاعون المترتب على الزنا واللواط\n والقحط المترتب على التخسير والتطفيف والاحتكار وغيرها من طرق الربا\n مع أن أثرها { لاَّ تُصِيبَنَّ ٱلَّذِينَ ظَلَمُواْ } أي: أتوا بها { مِنكُمْ خَآصَّةً } بل يعم الظالمين وغيرهم بشؤمهم\n لأن غيرهم يداهنون معهم كأنهم راضون بفعلهم { وَٱعْلَمُوۤاْ أَنَّ ٱللَّهَ } المتعزز برداء العظمة { شَدِيدُ ٱلْعِقَابِ } [الأنفال: 25] ضعب الانتقام\n سريع الحساب لعى من خرج من مقتضى أمره ونهيه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: دخلت النون في لا تصيبن لأنه في معنى النهي، على حد قوله:\n[النمل: 18] انظر البيضاوي. يقول الحق جل جلاله: { واتقوا فتنة } ، إن نزلت { لا تصيبن الذين ظلموا منكم خاصة } ، بل تعم الظالم وغيره، ثم يبعث الناس على نيتهم، وذلك كإقرار المنكَر بين أظهركم، والمداهنة في الأمر بالمعروف، واقتراف الكبائر، وظهور البدع، والتكاسل في الجهاد، وعن الفرائض، وغير ذلك من أنواع الذنوب، وفي الحديث:\n \" لَتأْمُرُنَّ بالمَعْرُوفِ ولَتَنْهُونَّ عن المُنْكَرِ،أو لَيَعُمَّنَّكُمْ اللَّهُ بِعَذَابِهِ \" \nأو كما قال صلى الله عليه وسلم. قالت عائشة رضي الله عنها: أنهلك وفينا الصالحون؟ قال:\n \" نعم، إذا كثُر الخبث \". \nقال القشيري. في معنى الآية: احذروا أن ترتكبوا زلَّةً توجب لكم عقوبة لا تخص مرتكبها، بل يعمُّ شؤمُها مَنْ تعاطاها ومن لم يتعاطاها. وغير المجرم لا يُؤخْذَ بجُرْم من أذنب، ولكن قد ينفرد واحدٌ بجُرم فيحمل أقوامٌ من المختصين بفاعل هذا الجُرْم، كأن يتعصبوا له إذا أُخِذَ بحكم ذلك الجرّم، فبعد ألا يكونوا ظالمين يصيرون ظالمين بمعاونتهم وتعصبهم لهذا الظالم فتكون فتنة لا تختص بمن كان ظالماً في الحا ل، بل تصيب أيضاً ظالماً في المستقبل بسبب تعصبه لهذا الظالم، ورضاه به. هـ. وسيأتي تمامه في الإشارة. وحكى الطبري أنها نزلت في علي بن أبي طالب وعمار بن ياسر وطلحة والزبير، وأن الفتنة ما جرى لهم يوم الجمل.هـ. قال تعالى { واعلموا أن الله شديد العقاب } لمن ارتكب معاصيه وتسبب في فتنة غيره. الإشارة: في القشيري، لما تكلم على تفسير الظاهر، قال: وأما من جهة الإشارة فإن العبدّ إذا باشر زّلّةٍ بنفسه عادت إلى القلب منها الفتنة، وهي العقوبة المعجلة، ونصيب النفس من الفتنة العقوبة، والقلبُ إذا حصلت منه فتنة، وهو همه بما لا يجوز، تَعدَّتْ فتنته إلى السر وهي الحُجْبَةُ. وكذلك المُقَدًّمُ في شأنه، إذا فعل ما لا يجوز، انقطعت البركات التي كانت تتعدى منه إلى مُتَّبعِيهِ وتلامذتِهِ، فكان انقطاع تلك البركات عنهم نصيبهم من الفتنة، وهم لم يعملوا ذنباً، ويقال: إن الأكابر إذا سكتوا عن التنكير على الأصاغر أصابتهم فتنة بتَرْكِهِم الإنكار عليهم فيما فعلوا من الإجرام. ثم قال: ويقال: إنًّ الزاهد إذا انحط إلى رخصة الشرع في اخذ الزيادة من الدنيا بما فوق الكفاية ـ وإن كانت من وجه حلال ـ تعدت فتنتهُ إلى من يتخرج على يديه من المبتدئين، فيحمله على ما رأى منه على الرغبة في الدنيا، وتَرْكِ التقلل، فيؤديه إلى الانهماك في أودية الغفلة في الأشغال الدنيوية، والعابد إذا جَنَحَ إلى سوء ترك الأوراد تعدَّى ذلك إلى ما كان ينشط في المجاهدة به، ويتوطَّن الكسل، ثم يحمله الفراغ وترك المجاهدة على متابعة الشهوات فيصير كما قيل:\nفهذا يكون نصيبهم من الفتنة، والعارف إذا رجع إلى ما فيه حَظَّ له، نَظَرَ إليه المريدُ فتتداخله فتنة فَتْرَةٌ فيما هو به من الصدق المنازلة، فيكون ذلك نصيبه من فتنة العارف. وبالجملة: إذا غفل المَلِكُ، وتَشَاغَلَ عن سياسة رعيته، تَعَطَّلَ الجندُ والرعية، وعَظُمَ فيهم الخَلَلُ والبَليَّة، وفي معناه أنشدوا:\nانتهى كلامه رضي الله عنه. ثم ذكّرهُمْ، فقال: { وَٱذْكُرُوۤاْ إِذْ أَنتُمْ قَلِيلٌ مُّسْتَضْعَفُونَ فِي ٱلأَرْضِ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:74",
      "similarity": 0.8241754258843076
    },
    {
      "verse": "2:105",
      "similarity": 0.7457943250068538
    },
    {
      "verse": "59:9",
      "similarity": 0.3600307143307262
    },
    {
      "verse": "5:98",
      "similarity": 0.15010781491178035
    },
    {
      "verse": "5:49",
      "similarity": 0.1448552556913868
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008025.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008025.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:25.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}