{
  "chapter": "الأنفال",
  "text": "واذكروا۟ اذ انتم قليل مستضعفون فى الارض تخافون ان يتخطفكم الناس فـاوىكم وايدكم بنصره ورزقكم من الطيبت لعلكم تشكرون",
  "translations": [
    {
      "translation": "When you were few and oppressed in the land, afraid that the people would snatch you away, He gave you refuge and supported you with His help and provided you with good things so that hopefully you would be thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember, when you were few and powerless in the land, afraid of despoliation at the hands of men. But then God sheltered and helped you to strength, and provided for you good things that you may perhaps be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when you were few in numbers and deemed weak in the land, fearful lest people do away with you. Then He provided you refuge, strengthened you with His help, and provided you sustenance with good things that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall the time when you (the believers) were only a few suppressed people in the land, afraid of being terrorized by the people. God gave you shelter, supported you with His help, and bestowed on you pure provisions so that perhaps you would give Him thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when you were only a few and meek in the land, and feared that men may snatch you away – He therefore gave you refuge and strengthened you with His help, and gave you good things as sustenance, so that you may be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when you were few and were reckoned weak in the land, and were afraid that men might kidnap you, but He provided a safe place for you, strengthened you with His help, and provided you with good things (for livelihood) so that you might be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when you were few, deemed weak in the land, fearing lest people might carry you off by force, but He sheltered you and strengthened you with His aid and gave you of the good things that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when you were few and abased in the land, and were fearful that the people would snatch you away; but He gave you refuge, and confirmed you with His help, and provided you with the good things, that haply you might be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember, when ye were few and reckoned feeble in the land, and were in fear lest men should extirpate you, how He gave you refuge, and strengthened you with His help, and made provision of good things for you, that haply ye might be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when you were few in number and were accounted weak in the land, ever fearing the onslaught of your enemies, but He provided you with shelter, and supported you with His help and provided you with good things, so that you might be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember what time ye were few and downtrodden in the land fearing that the people would snatch you away; then He gave you refuge and strengthened you with His succour, and provided you with good things that haply ye might return thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when you were few, abased in the land, and feared lest the people should despoil you, and He gave you refuge, and strengthened you with His help, and provided you with all the good things so that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call to mind when ye were a small (band), despised through the land, and afraid that men might despoil and kidnap you; But He provided a safe asylum for you, strengthened you with His aid, and gave you Good things for sustenance: that ye might be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when you were few and were reckoned weak in the land, and were afraid that men might kidnap you, but He provided a safe place for you, strengthened you with His Help, and provided you with good things so that you might be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember how He gave you shelter when you were few in number and considered weak in the land, ever fearing that the people would snatch you away; but He gave you refuge and supported you with His victory and provided you with goodness, so that you might give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when you were few, oppressed in the land, fearing that people may capture you; but He sheltered you, and supported you with His victory, and provided you with good things—so that you may be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when you were few and oppressed in the land, fearing that people might abduct you, but He sheltered you, supported you with His victory, and provided you with good things - that you might be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:26] And remember when you were few and oppressed in the land, the land of Mecca, and were fearful lest men should snatch you away, [lest] the disbelievers should seize you swiftly; how He gave you refuge, in Medina, and reinforced you, strengthened you, with His help, on the day of Badr, with the angels, and provided you with the good things, the spoils, that you might be thankful, for His graces.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And remember) group of Emigrants, (when ye were few) in number (and reckoned feeble) oppressed (in the land) the land of Mecca, (and were in fear lest men should extirpate you) you feared that the people of Mecca would expel or imprison you, (how He gave you refuge) in Medina, (and strengthened you with His help) i.e. He assisted and gave you strength when He made you victorious on the Day of Badr, (and made provision of good things) the spoils of war (for you, that haply ye might be thankful) in order that you give thanks for His bounty: victory and the spoils of war on the Day of Badr.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ واذكروا إذ أنتم قليل } القدر\n لجهلكم وانقطاعكم عن نور العلم { مُسْتَضعفون في } أرض النفس { تخافون أن يتخطفَكُم الناس } أي: ناس القوى الحسيّة لضعف نفوسكم { فآواكم } إلى مدينة العلم { وأيدكم بنصره } في مقام توحيد الأفعال { ورزقكم من } طيبات علوم تجليات الصفات { لعلكم تشكرون } نعمة العلوم والتجليات بالسلوك فيه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱذْكُرُوۤاْ } أيها المؤمنون نعمنا إياكم\n وداموا بشكرها وقت { إِذْ أَنتُمْ قَلِيلٌ مُّسْتَضْعَفُونَ } يستضعفكم مَنْ { فِي ٱلأَرْضِ } يعني: أرض مكة - شرفها الله - ومن غاية ضعفكم وقلتكم { تَخَافُونَ أَن يَتَخَطَّفَكُمُ } ويلتقطكم { ٱلنَّاسُ } عن وجه الأرض إلى حيث يستأصلكم بالمرة\n من غاية ضعفكم وقلتكم { فَآوَاكُمْ } الله بحوله وقوته\n وأعادكم إليها بعدما أخرجكم العدو منها ظلماً وزوراً { وَأَيَّدَكُم بِنَصْرِهِ } بأن تغلبوا وتظفروا على عدوكم\n وتخرجوهم منها مهانين مغلوبين مستضعفين { وَ } بعدما أيدكم وأظفركم سبحانه { رَزَقَكُمْ مِّنَ ٱلطَّيِّبَاتِ } التي غنمتم منها { لَعَلَّكُمْ تَشْكُرُونَ } [الأنفال: 26] رجاء أن تواظبوا شكر هذه النعم الجسام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { واذكروا إذ أنتم قليل } أي اذكروا هذه النعمة، حيث كنتم بمكة وأنتم قليل عَددكم مع كثرة عدوكم، { مستضعفون في الأرض } أي: أرض مكة، يستضعفكم قريش ويعذبونكم ويضيقون عليكم، { تخافون أن يتخطفكم الناسُ } أي: قريش، أو من عداهم، { فآواكم } إلى المدينة، وجعلها لكم مأوىً تتحصنون بها من أعدائكم، { وأَيَّدكم } أي: قواكم { بنصره } على الكفار، أو بمظاهرة الأنصار، أو بإمداد الملائكة يوم بدر، { ورزَقكم من الطيبات } من الغنائم، { لعلكم تشكرون } هذه النعم. والخطاب للمهاجرين، وقيل: للعرب كافة فإنهم كانوا أذلاء في أيدي فارس والروم، يخافون أن يتخطفهم الناس من كثرة الفتن، فكان القوي يأكل الضعيف منهم، فآواهم الله إلى الإسلام، فحصل بينهم الأمن والأمان، وأيدهم بنصره، حيث نصرهم على جميع الأديان، وأعزهم بمحمد صلى الله عليه وسلم، ورزقهم من الطيبات، حيث فتح عليهم البلاد، وملكوا ملك فارس والروم، فملكوا ديارهم وأموالهم، ونكحوا نساءهم وبناتِهم، لعلهم يشكرون. الإشارة: التذكير بهذه النعمة يتوجه إلى خصوص هذه الأمة، وهم الفقراء المتوجهون إلى الله، فهم قليل في كل زمان، مستضعفون في كل أوان، حتى إذا تمكنوا وتهذبوا، وطهروا من البقايا منَّ عليهم بالنصر والعز والتأييد، كما وعدهم بقوله:\n[القصص:5] الآية، والغالب عليهم شكر هذه النعم، لَمَا خصهم به من كمال المعرفة. والله تعالى أعلم. ثم نهاهنم عن الخيانة، فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ لاَ تَخُونُواْ ٱللَّهَ وَٱلرَّسُولَ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:67",
      "similarity": 0.5034001275202614
    },
    {
      "verse": "28:57",
      "similarity": 0.39876496163921626
    },
    {
      "verse": "51:47",
      "similarity": 0.33793711054068803
    },
    {
      "verse": "2:20",
      "similarity": 0.32500288746543593
    },
    {
      "verse": "38:17",
      "similarity": 0.29380653980705224
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/8:26.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/8:26.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:26.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}