{
  "chapter": "الأنفال",
  "text": "يايها الذين ءامنوا۟ لا تخونوا۟ الله والرسول وتخونوا۟ امنتكم وانتم تعلمون",
  "translations": [
    {
      "translation": "You who have iman! do not betray Allah and His Messenger, and do not knowingly betray your trusts.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, do not be faithless to God and His Apostle, nor violate your trusts knowingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Do not be unfaithful to Allah and the Messenger, nor be knowingly unfaithful to your trusts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not be dishonest to God and the Messengers or knowingly abuse your trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not betray Allah and His Noble Messenger, nor purposely defraud your trusts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Betray not Allah and His Messenger, nor betray knowingly your Amanat (things entrusted to you).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! be not unfaithful to Allah and the Apostle, nor be unfaithful to your trusts while you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, betray not God and the Messenger, and betray not your trusts and that wittingly;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Betray not Allah and His messenger, nor knowingly betray your trusts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not betray God and His Messenger, and do not knowingly violate your trusts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! defraud not Allah and the apostle, nor defraud your trusts while ye know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not betray Allah and the Apostle, and do not betray your trusts knowingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye that believe! betray not the trust of Allah and the Messenger, nor misappropriate knowingly things entrusted to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Betray not Allah and His Messenger, nor betray knowingly your Amanat (things entrusted to you, and all the duties which Allah has ordained for you).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not betray Allah and the Messenger, nor knowingly betray your trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not betray God and the Messenger, nor betray your trusts, while you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not betray Allah and the Messenger or betray your trusts while you know [the consequence].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:27] The following was revealed regarding Abū Lubāba Marwān b. ‘Abd al-Mundhir: the Prophet (s) had dispatched him to the Banū Qurayza so that they would submit to his [the Prophet’s] authority. But they [Banū Qurayza] consulted with him [as to whether they should cede], and he pointed out to them that a slaughter would ensue — for members of his family and his property were among them: O you who believe, do not betray God and the Messenger, and, do not, betray your trusts, that which has been entrusted to you, in the way of religion or otherwise, while you are aware.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف خطاب للمؤمنين يحذرهم من العصيان الخفي . بعد أن أمرهم بالطاعة والاستجابة لله ولرسوله صلى الله عليه وسلم حذرهم من أن يظهروا الطاعة والاستجابة في ظاهر أمرهم ويبطنوا المعصية والخلاف في باطنه ، ومناسبته لما قبله ظاهرة وإن لم تسبق من المسلمين خيانة وإنما هو تحذير .وذكر الواحدي في «أسباب النزول» وروى جمهور المفسرين وأهل السير ، عن الزهري والكلبي ، وعبد الله بن أبي قتادة ، أنها نزلت في أبي لبابة بن عبد المنذر الأنصاري لما حَاصر المسلمون بني قريظة ، فسألت بنو قريظة الصلح فقال رسول الله صلى الله عليه وسلم \" تَنزلون على حكم سعد بن مُعاذ \" فأبوا وقالوا : «أرسل إلينا أبا لُبابة» فبعث رسول الله صلى الله عليه وسلم إليهم أبا لُبابة وكان ولده وعيالُه وماله عندهم ، فلما جاءهم قالوا له ما ترى أننزل على حكم سعد ، فأشار أبو لُبابة بيده على حَلْقِه : أنّه الذبْح ، ثم فطن أنه قد خان الله ورسوله فنزلت فيه هذه الآية ، وهذا الخبر لم يثبت في الصحيح ، ولكنه اشتهر بين أهل السير والمفسرين ، فإذا صح ، وهو الأقرب كانت الآية مما نزل بعد زمن طويل من وقت نزول الآيات التي قبلها ، المتعلقة باختلاف المسلمين في أمر الأنفال فإن بين الحادثتين نحواً من ثلاث سنين ويقرب هذا ما أشرنا إليه آنفاً من انتفاء وقوع خيانة لله ورسوله بين المسلمين .والخَوْن والخيانة : إبطال ونقضُ ما وقع عليه تعاقد من دون إعلان بذلك النقض ، قال تعالى : { وإمّا تخافَن من قوممٍ خيانةً فانبِذْ إليهم على سواءٍ } \\[ الأنفال : 58 \\] والخيانة ضد الوفاء قال الزمخشري : «وأصل معنى الخَون النقصُ ، كما أن أصل الوفاء التمام ، ثم استعمل الخَون في ضد الوفاء لأنك إذا خنت الرجل في شيء فقد أدخلت عليه النقصان فيه» أي واستعمل الوفاء في الإتمام بالعهد ، لأن من أنجز بما عاهد عليه فقد أتم عهده فلذلك يقال : أوفى بما عاهد عليه .فالإيمان والطاعة لله ورسوله عهد بين المؤمن وبين الله ورَسوله ، فكما حُذروا من المعصية العلنية حذروا من المعصية الخفية .وتشمل الخيانة كل معصية خفية ، فهي داخلة في { لا تخونوا } ، لأن الفعل في سياق النهي يعم ، فكل معصية خفية فهي مراد من هذا النهي ، فتشمل الغلول الذي حاموا حوله في قضية الأنفال ، لأنهم لما سأل بعضهم النفل وكانوا قد خرجوا يتتبعون آثار القتلى ليتنفلوا منهم ، تعين تحذيرهم من الغلول ، فذلك مناسبة وقع هذه الآية من هذه الآيات سواء صح ما حكي في سبب النزول أم كانت متصلة النزول بقريناتها .وفعل «الخيانة» أصله أن يتعدى إلى مفعول واحد وهو المخون ، وقد يعدى تعدية ثانية إلى ما وقع نقضه ، يقال : خان فلاناً أمانتَه أو عهدَه ، وأصله أنه نصب على نزع الخافض ، أي خانه في عهده أو في أمانته ، فاقتصر في هذه الآية على المخوف ابتداء ، واقتصر على المخون فيه في قوله : { وتخونوا أماناتكم } أي في أماناتكم أي وتخونوا الناس في أماناتكم .والنهي عن خيانة الأمانة هنا : إن كانت الآية نازلة في قضية أبي لبابة : إن ما صدر منه من إشارة إلى ما في تحكيم سعد بن معاذ مِن الضر عليهم يعتبر خيانة لمن بعثه مستفسراً ، لأن حقه أن لا يشير عليهم بشيء ، إذ هو مبعوث وليس بمستشار .وإن كانت الآية نزلت مع قريناتها فنهي المسلمين عن خيانة الأمانة استطراد لاستكمال النهي عن أنواع الخيانة ، وقد عدل عن ذكر المفعول الأصلي ، إلى ذكر المفعول المتْسَع فيه ، لِقصد تِبشيع الخيانة بأنها نقض للأمانة ، فإن الأمانة وصف محمود مشهور بالحسن بين الناس ، فما يكون نقضاً له يكون قبيحاً فظيعاً ، ولأجل هذا لم يقل : وتخونوا الناسَ في أماناتهم فهذا حذف من الإيجاز .والأمانة اسم لما يحفظه المرء عند غيره مشتقة من الأمن؛ لأنه يأمنه من أن يضيعها ، والأمين الذي يحفظ حقوق من يواليه ، وإنما أضيفت الأمانات إلى المخاطبين مبالغة في تفظيع الخيانة ، بأنها نقض لأمانة منسوبة إلى ناقضها ، بمنزلة قوله : { ولا تقتلوا أنفسكم } \\[ النساء : 29 \\] دون : ولا تقتلوا النفس .وللأمانة شأن عظيم في استقامة أحوال المسلمين ، ما ثبتوا عليها وتخلقوا بها ، وهي دليل نزاهة النفس واعتدال أعمالها ، وقد حذر النبي صلى الله عليه وسلم من إضاعتها والتهاون بها ، وأشار إلى أن في إضاعتها انحلال أمر المسلمين ، ففي «صحيح البخاري» عن حذيفة بن اليَمَان قال حدثنا رسول الله صلى الله عليه وسلم حديثين : رأيت أحدهما وأنا انتظر الآخر ، حدثنا أن الأمانة نزلتْ على جَذْر قلوب الرجال ثم عَلمِوا من القرآن ثم علَموا من السنة ، وحدثنا عن رفعها فقال : ينام الرجل النومة فَتُقبض من قلبه فيظل أثرها مثل الوكْت ، ثم ينام النّومة فتقبض فيبقى أثرها مثل أثر المَجْل كجَمْر دَحُرَجْتَه على رِجْلِك فَنفِط فتراه مُنْتَبِراً وليس فيه شيء ، ويصبح الناس يتبايعون ولا يكاد أحد يؤدي الأمانة فيقال إن في بني فلان رجلاً أميناً ، ويقال للرجل ما أعْقَلَه وما أظْرَفَه ومَا أجْلَدَه ، وما في قلبه مثقال حَبّهِ خَرْدَل من إيمان» .( الوكت سواد يكون في البُسْر إذا قارب أن يصير رُطَباً ، والمَجْل غِلَظ الجلد من أثر العمل والخدمة ، ونَفِط تَقَرَّح ومُنْتَبِراً منتفخاً ) ، وقد جعلها النبي صلى الله عليه وسلم من الإيمان إذ قال في آخر الأخبار عنها وما في قلبه مثقال حبة خردل من إيمان ، وحسبك من رفع شأن الأمانة : أن كان صاحبها حقيقاً بولاية أمر المسلمين لأن ولاية أمر المسلمين ، أمانة لهم ونصح ، ولذلك قال عمر بن الخطاب حين أوصى بأن يكون الأمر شورى بين ستة «ولو كان أبو عبيدة بن الجراح حياً لعهدت إليه لقول رسول الله صلى الله عليه وسلم له إنه أمين هذه الأمة» .وقوله : { وتخونوا } عطف على قوله : { لا تخونوا } فهو في حَيز النهي ، والتقدير : ولا تخونوا أماناتكم ، وإنما أعيد فعل { تخونوا } ولم يُكتف بحرف العَطف ، الصالح للنيابة عن العامل في المعطوف ، للتنبيه على نوع آخر من الخيانة فإن خيانتهم الله ورسوله نقضُ الوفاءِ لهما بالطاعة والامتثال ، وخيانة الأمانة نقض الوفاء بأداء ما ائتمنوا عليه .وجملة { وأنتم تعلمون } في موضع الحال من ضمير { تَخونوا } الأول والثاني ، وهي حال كاشفة والمقصود منها تشديد النهي ، أو تشنيع المنهي عنه لأن النهي عن القبيح في حال معرفة المنهي أنه قبيح يكون أشد ، ولأن القبيح في حال علم فاعله بقبحه يكون أشنَعَ ، فالحال هنا بمنزلة الصفة الكاشفة في قوله تعالى : { ومَن يَدْعُ مع الله إلهاً آخر لا بُرهان له به فإنما حِسابُه عند ربه } \\[ المؤمنون : 117 \\] وقوله { فلا تجعلوا لله أنداداً وأنتم تعلمون } \\[ البقرة : 22 \\] وليس المراد تقييد النهي عن الخيانة بحالة العلم بها ، لأن ذلك قليل الجدوى ، فإن كل تكليف مشروط بالعلم وكون الخيانة قبيحة أمر معلوم .ولك أن تجعل فعل { تَعْلمون } منزلاً منزلة اللازم ، فلا يُقدّر له مفعول ، فيكون معناه «وأنتم ذَوُو عِلم» أي معرفة حقائق الأشياء ، أي وأنتم عُلماء لا تجهلون الفرق بين المَحاسن والقبائح ، فيكون كقوله : { فلا تجعلوا لله أنداداً وأنتم تعلمون } في سورة البقرة ( 22 ).ولك أن تقدر له هنا مفعولاً دل عليه قوله : { وتخونوا أماناتكم } أي وأنتم تعلمون خيانة الأمانة أي تعلمون قبحها فإن المسلمين قد تقرر عندهم في آداب دينهم تقبيح الخيانة ، بل هو أمر معلوم للناس حتى في الجاهلية .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe!) the address here is to Marwan and Abu Lubabah Ibn 'Abd al-Mundhir (Betray not Allah) in relation to Religion (and His messenger) by advising the Banu Qurayzah not to accept the judgement of Sa'd Ibn Mu'adh, (nor knowingly betray your trusts) nor betray the obligations of Allah which are your trusts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { لا تخُونُوا الله } بنقض ميثاق التوحيد الفطري السابق { و } تخونوا { الرسول } بنقض العزيمة ونبذ العقد اللاحق { وتخونوا أماناتكم } من المعارف والحقائق التي استودع الله فيكم بحسب الاستعداد الأول في الأزل بإخفائها بصفات النفس { وأنتم تعلمون } أنكم حاملوها\n أو تعلمون أنّ الخيانة من أسوأ الرذائل وأقبحها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على وجه العظة والتذكير تعليماً للمؤمنين\n منادياً لهم\n ليقبلوا بما أمروا ونهوا: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم: أن { لاَ تَخُونُواْ ٱللَّهَ } في امتثال أوامره واجتناب نواهيه { وَٱلرَّسُولَ } في سنته وأخلاقه وآدابه التي وضعها فيما بينكم\n لإصلاح حالكم { وَ } بالجملة: { تَخُونُوۤاْ أَمَانَاتِكُمْ } التي ائتمنتم فيها اعتماداً وثقةً { وَ } الحال أنه { أَنْتُمْ تَعْلَمُونَ } [الأنفال: 27] قبح الخيانة من أنفسكم بلا احتياج إلى إنذار منذر\n وإخبار مخبر\n والخيانة في الأمانات إنما تنشأ من جلب المنفعة والحرص المفرط\n وتكثير الميل إلى المال الصالح للعيال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { يا أيها الذين آمنوا لا تخونوا الله } بتضييع أوامره\n وارتكاب نواهيه\n { والرسول } بمخالفة أمره وترك سنته\n أو بالغلول في الغنائم\n أو بأن تُبطنوا خلاف ما تظهرون\n قيل: نزلت في أبي لبابة في قصة بَني قُرَيْظَةَ\n روي أنه صلى الله عليه وسلم حاصرهم إِحْدَى وعشرين ليلةً\n فَسَأَلوا الصُّلْحَ كما صَالَحَ إِخْوانَهُمْ بَني النَّضِير\n عَلَى أَنْ يَصيروا إلى إخوانهم بأذْرِعَاتٍ وأريحا من الشَّام\n فأبَى إلا أن يَنْزِلوا عَلَى حُكْمِ سَعْدِ بْنِ مُعَاذٍ\n فَأبَوْا وقَالوا: أرْسِلَ لنا أبا لُبَابَةَ\n وكان مُنَاصِحاُ لهُمْ لأنَّ عيَالهُ ومَالَهُ في أَيْدِيِهِمْ\n فَبَعَثَه إليْهِمْ\n فقالوا: ما تَرَى؟ هَلْ نَنْزِلُ على حُكْم سَعْدٍ؟ فأَشارَ إلى حَلْقِهِ\n أنه الذَّبْحُ\n فقال أبو لُبَابَة: فما زَالت قَدَمَاي حَتَّى عَلِمْتُ أَنِّي قَدْ خُنْتُ الله ورسُولَهُ\n فنزل وشدَّ نَفْسَهُ إلى ساريةٍ في المسجد\n وقال: والله لا أَذُوقُ طعاماُ ولا شَرَاباً حتى أمُوتَ\n أوْ يَتُوبَ اللَّهُ عَلَيَّ\n فَمَكَثَ سَبْعَةَ أيام حتى خَرَّ مَغْشِيّاً عَلَيهِ\n ثم تَابَ اللَّهُ عليه فَقِيلَ لَهُ تِيب عَلَيْكَ فحُلّ نفسك\n فقال: لاً والله لا أحلها حتى يكون رسول الله صلى الله عليه وسلم هو الذي يحلني\n فجاء رسول الله صلى الله عليه وسلم فحلَّه\n فقال صلى الله عليه وسلم هو الذي يحلني\n فجاء رسولُ الله صلى الله عليه وسلم فحلَّه\n فقال: إِنَّ من تَمام تَوْبَتِي أن أَهْجُرَ دَارَ قَوْمِي الّتِي أصَبْتُ فيها الذَّنْب\n وأن أنخَلِعَ من مَالِي\n فقال صلى الله عليه وسلم:\n \" يَجْزِيكَ الثُّلثُ أنْ تَتَصَّدَّقَ بِه \"\n \nثم قال تعالى: { وتخونوا أماناتكم } فيما بينكم\n أو فيما أسر الرسول إليكم من السر فتفشوه\n { وأنتم تعلمون } أن الخيانة ليست من شأن الكرام\n بل هي من شأن اللئام\n كما قال الشاعر:\nأو: وأنتم علماء تميزون الحسن من القبيح",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:52",
      "similarity": 0.7214350887517369
    },
    {
      "verse": "40:19",
      "similarity": 0.6869763652842973
    },
    {
      "verse": "4:107",
      "similarity": 0.6683481575337141
    },
    {
      "verse": "8:71",
      "similarity": 0.6598420354347287
    },
    {
      "verse": "4:105",
      "similarity": 0.6470917146705508
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008027.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008027.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:27.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}