{
  "chapter": "الأنفال",
  "text": "يايها الذين ءامنوا۟ لا تخونوا۟ الله والرسول وتخونوا۟ امنتكم وانتم تعلمون",
  "translations": [
    {
      "translation": "You who have iman! do not betray Allah and His Messenger, and do not knowingly betray your trusts.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, do not be faithless to God and His Apostle, nor violate your trusts knowingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Do not be unfaithful to Allah and the Messenger, nor be knowingly unfaithful to your trusts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not be dishonest to God and the Messengers or knowingly abuse your trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not betray Allah and His Noble Messenger, nor purposely defraud your trusts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Betray not Allah and His Messenger, nor betray knowingly your Amanat (things entrusted to you).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! be not unfaithful to Allah and the Apostle, nor be unfaithful to your trusts while you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, betray not God and the Messenger, and betray not your trusts and that wittingly;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Betray not Allah and His messenger, nor knowingly betray your trusts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not betray God and His Messenger, and do not knowingly violate your trusts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! defraud not Allah and the apostle, nor defraud your trusts while ye know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not betray Allah and the Apostle, and do not betray your trusts knowingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye that believe! betray not the trust of Allah and the Messenger, nor misappropriate knowingly things entrusted to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Betray not Allah and His Messenger, nor betray knowingly your Amanat (things entrusted to you, and all the duties which Allah has ordained for you).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not betray Allah and the Messenger, nor knowingly betray your trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not betray God and the Messenger, nor betray your trusts, while you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not betray Allah and the Messenger or betray your trusts while you know [the consequence].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:27] The following was revealed regarding Abū Lubāba Marwān b. ‘Abd al-Mundhir: the Prophet (s) had dispatched him to the Banū Qurayza so that they would submit to his [the Prophet’s] authority. But they [Banū Qurayza] consulted with him [as to whether they should cede], and he pointed out to them that a slaughter would ensue — for members of his family and his property were among them: O you who believe, do not betray God and the Messenger, and, do not, betray your trusts, that which has been entrusted to you, in the way of religion or otherwise, while you are aware.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe!) the address here is to Marwan and Abu Lubabah Ibn 'Abd al-Mundhir (Betray not Allah) in relation to Religion (and His messenger) by advising the Banu Qurayzah not to accept the judgement of Sa'd Ibn Mu'adh, (nor knowingly betray your trusts) nor betray the obligations of Allah which are your trusts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { لا تخُونُوا الله } بنقض ميثاق التوحيد الفطري السابق { و } تخونوا { الرسول } بنقض العزيمة ونبذ العقد اللاحق { وتخونوا أماناتكم } من المعارف والحقائق التي استودع الله فيكم بحسب الاستعداد الأول في الأزل بإخفائها بصفات النفس { وأنتم تعلمون } أنكم حاملوها\n أو تعلمون أنّ الخيانة من أسوأ الرذائل وأقبحها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على وجه العظة والتذكير تعليماً للمؤمنين\n منادياً لهم\n ليقبلوا بما أمروا ونهوا: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم: أن { لاَ تَخُونُواْ ٱللَّهَ } في امتثال أوامره واجتناب نواهيه { وَٱلرَّسُولَ } في سنته وأخلاقه وآدابه التي وضعها فيما بينكم\n لإصلاح حالكم { وَ } بالجملة: { تَخُونُوۤاْ أَمَانَاتِكُمْ } التي ائتمنتم فيها اعتماداً وثقةً { وَ } الحال أنه { أَنْتُمْ تَعْلَمُونَ } [الأنفال: 27] قبح الخيانة من أنفسكم بلا احتياج إلى إنذار منذر\n وإخبار مخبر\n والخيانة في الأمانات إنما تنشأ من جلب المنفعة والحرص المفرط\n وتكثير الميل إلى المال الصالح للعيال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { يا أيها الذين آمنوا لا تخونوا الله } بتضييع أوامره\n وارتكاب نواهيه\n { والرسول } بمخالفة أمره وترك سنته\n أو بالغلول في الغنائم\n أو بأن تُبطنوا خلاف ما تظهرون\n قيل: نزلت في أبي لبابة في قصة بَني قُرَيْظَةَ\n روي أنه صلى الله عليه وسلم حاصرهم إِحْدَى وعشرين ليلةً\n فَسَأَلوا الصُّلْحَ كما صَالَحَ إِخْوانَهُمْ بَني النَّضِير\n عَلَى أَنْ يَصيروا إلى إخوانهم بأذْرِعَاتٍ وأريحا من الشَّام\n فأبَى إلا أن يَنْزِلوا عَلَى حُكْمِ سَعْدِ بْنِ مُعَاذٍ\n فَأبَوْا وقَالوا: أرْسِلَ لنا أبا لُبَابَةَ\n وكان مُنَاصِحاُ لهُمْ لأنَّ عيَالهُ ومَالَهُ في أَيْدِيِهِمْ\n فَبَعَثَه إليْهِمْ\n فقالوا: ما تَرَى؟ هَلْ نَنْزِلُ على حُكْم سَعْدٍ؟ فأَشارَ إلى حَلْقِهِ\n أنه الذَّبْحُ\n فقال أبو لُبَابَة: فما زَالت قَدَمَاي حَتَّى عَلِمْتُ أَنِّي قَدْ خُنْتُ الله ورسُولَهُ\n فنزل وشدَّ نَفْسَهُ إلى ساريةٍ في المسجد\n وقال: والله لا أَذُوقُ طعاماُ ولا شَرَاباً حتى أمُوتَ\n أوْ يَتُوبَ اللَّهُ عَلَيَّ\n فَمَكَثَ سَبْعَةَ أيام حتى خَرَّ مَغْشِيّاً عَلَيهِ\n ثم تَابَ اللَّهُ عليه فَقِيلَ لَهُ تِيب عَلَيْكَ فحُلّ نفسك\n فقال: لاً والله لا أحلها حتى يكون رسول الله صلى الله عليه وسلم هو الذي يحلني\n فجاء رسول الله صلى الله عليه وسلم فحلَّه\n فقال صلى الله عليه وسلم هو الذي يحلني\n فجاء رسولُ الله صلى الله عليه وسلم فحلَّه\n فقال: إِنَّ من تَمام تَوْبَتِي أن أَهْجُرَ دَارَ قَوْمِي الّتِي أصَبْتُ فيها الذَّنْب\n وأن أنخَلِعَ من مَالِي\n فقال صلى الله عليه وسلم:\n \" يَجْزِيكَ الثُّلثُ أنْ تَتَصَّدَّقَ بِه \"\n \nثم قال تعالى: { وتخونوا أماناتكم } فيما بينكم\n أو فيما أسر الرسول إليكم من السر فتفشوه\n { وأنتم تعلمون } أن الخيانة ليست من شأن الكرام\n بل هي من شأن اللئام\n كما قال الشاعر:\nأو: وأنتم علماء تميزون الحسن من القبيح",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:52",
      "similarity": 0.7214350887517369
    },
    {
      "verse": "40:19",
      "similarity": 0.6869763652842973
    },
    {
      "verse": "4:107",
      "similarity": 0.6683481575337141
    },
    {
      "verse": "8:71",
      "similarity": 0.6598420354347287
    },
    {
      "verse": "4:105",
      "similarity": 0.6470917146705508
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008027.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008027.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:27.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}