{
  "chapter": "الأنفال",
  "text": "واعلموا۟ انما امولكم واولدكم فتنة وان الله عنده اجر عظيم",
  "translations": [
    {
      "translation": "Know that your wealth and children are a trial and that there is an immense reward with Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that your worldly possessions and your children are just a temptation, and that God has greater rewards with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know well that your belongings and your children are but a trial, and that with Allah there is a mighty reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that your possessions and children are a temptation for you and that God has the greatest reward (for the righteous ones).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that your wealth and your children are a test, and that with Allah is an immense reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that your possessions and your children are but a trial and that surely, with Allah is a mighty reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that your property and your children are a temptation, and that Allah is He with Whom there is a mighty reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and know that your wealth and your children are a trial, and that with God is a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that your possessions and your children are a test, and that with Allah is immense reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that your wealth and children are a trial and that there is an immense reward with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that your riches and your children are but a temptation, and that verily Allah: with Him is a mighty hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that your possessions and children are only a test, and that Allah—with Him is a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know ye that your possessions and your progeny are but a trial; and that it is Allah with Whom lies your highest reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that your possessions and your children are but a trial and that surely with Allah is a mighty reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that your children and your wealth are but a temptation, and that the reward with Allah is great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that your possessions and your children are a test, and that God possesses an immense reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that your properties and your children are but a trial and that Allah has with Him a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:28] And know that your wealth and your children are a trial, for you, impeding you from the concerns of the Hereafter; and that with God is a tremendous wage, so do not forfeit it by giving [undue] attention to wealth and children, acting treacherously for the sake of [preserving] them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And know) this address is directed at Abu Lubabah (that your possessions and your children) in the Banu Qurayzah (are a test) an affliction, (and that with Allah is immense reward) an abundant reward in Paradise through jihad.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { واعْلَموا أنما أمْوَالكم وأولادكم فِتْنَة } أي: حجاب لكم لاشتغالكم بها عن الله، أو شرك لمحبتكم إياها كحبّ الله { وأنّ الله عنده أجرٌ عظيمٌ } فاطلبوه بالتجرّد عنها ومراعاة حق الله فيها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱعْلَمُوۤاْ أَنَّمَآ أَمْوَالُكُمْ وَأَوْلاَدُكُمْ فِتْنَةٌ } اختيار وابتلاء لكم من ربكم يجربكم هل تضطربون في أمر المال والعيال، وتوقعون لأجلها في المهالك وإباحة المحرمات، وارتكاب الخيانات المسقطة للمروءات مطلقاً؟ أم تفوضون الأمور كلها إلى الله وترضون بما قضى عليكم، وقدر لكم في سابق علمه ولوح قضائه؟ { وَ } اعلموا { أَنَّ ٱللَّهَ } المطلع لجميع حالاتكم { عِندَهُ } وفي كنف حفظه وجواره { أَجْرٌ عَظِيمٌ } [الأنفال: 28] للمفوضين الذين رضوا بقسمة الله في جميع حالاتهم، ووفوا بما ائتمنوا من الأمانات مجتنبين عن الخيانة فيها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { واعلموا أنما أموالكم وأولادُكُم فتنةٌ } لأنه سبب الوقوع في الإثم والعقاب، أو محنة من الله ليبلوكم فيهم، فلا يحملنكم حبهم على الخيانة، كما فعل أبو لبابة\n { وأنَّ الله عنده أجرٌ عظيم } لمن آثر رضا الله ومحبته عليهم، وراعى حُدود الله فيهم، فعلّقوا هممكم بما يؤديكم إلى أجره العظيم، ورضاه العميم، حتى تفوزوا بالخير الجسيم\n الإشارة: خيانة الله ورسوله تكون بإظهار الموافقة وإبطان المخالفة، بحيث يكون ظاهره حسن وباطنه قبيح، وهذا من أقبح الخيانة، وينخرط فيه إبطان الاعتراض على المشايخ وإظهار الوفاق، فمن فعل ذلك فسيف الشريعة فوق رأسه، إذا كان سالكاً غير مجذوب، لأن من أفشى سر الملك استحق القتل، وكان خائناً، ومن كان خائناً لا يُؤمن على السر، فهو حقيق أن ينزع منه، إن لم يقتل أو يتب، ولله در القائل:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "64:15",
      "similarity": 0.9772481144950842
    },
    {
      "verse": "34:35",
      "similarity": 0.48814130784086013
    },
    {
      "verse": "19:77",
      "similarity": 0.44191109139415463
    },
    {
      "verse": "37:162",
      "similarity": 0.4016384824179332
    },
    {
      "verse": "68:6",
      "similarity": 0.3866160285511852
    }
  ]
}