{
  "chapter": "الأنفال",
  "text": "يايها الذين ءامنوا۟ ان تتقوا۟ الله يجعل لكم فرقانا ويكفر عنكم سيـاتكم ويغفر لكم والله ذو الفضل العظيم",
  "translations": [
    {
      "translation": "You who have iman! if you have taqwa of Allah, He will give you discrimination and erase your bad actions from you and forgive you. Allah's favour is indeed immense.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, if you follow the path shown by God, He will give you a standard (of right and wrong), and overlook your sins, and forgive you. God is abounding in benevolence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! If you fear Allah He will grant you a criterion and will cleanse you of your sins and forgive you. Allah is Lord of abounding bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you fear God, He will give you guidance, will expiate your bad deeds and forgive you. God's favors are the greatest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! If you fear Allah, He will bestow upon you (the criterion) that with which you will separate the truth from falsehood, and He will unburden your misdeeds and forgive you; and Allah is the Extremely Munificent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If you obey and fear Allah, He will grant you Furqan, and will expiate for you your sins, and forgive you; and Allah is the Owner of the great bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If you are careful of (your duty to) Allah, He will grant you a distinction and do away with your evils and forgive you; and Allah is the Lord of mighty grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, if you fear God, He will assign you a salvation, and acquit you of your evil deeds, and forgive you; and God is of bounty abounding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! If ye keep your duty to Allah, He will give you discrimination (between right and wrong) and will rid you of your evil thoughts and deeds, and will forgive you. Allah is of Infinite Bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you fear God, He will grant you the ability to discriminate between right and wrong, and will forgive you your sins: for God is limitless in His great bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! if ye fear Allah He will make for you a distinction and will expiate for you your misdeeds, and forgive you; and Allah is Owner of Mighty Grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! If you are wary of Allah, He shall appoint a criterion for you, and absolve you of your misdeeds, and forgive you, for Allah is dispenser of a great grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! if ye fear Allah, He will grant you a criterion (to judge between right and wrong), remove from you (all) evil (that may afflict) you, and forgive you: for Allah is the Lord of grace unbounded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If you obey and fear Allah, He will grant you Furqan a criterion [(to judge between right and wrong), or (Makhraj, i.e. making a way for you to get out from every difficulty)], and will expiate for you your sins, and forgive you, and Allah is the Owner of the Great Bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you fear Allah, He will give you a criteria and cleanse you of your sins and forgive you. Allah is the Owner of great bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If you remain conscious of God, He will give you a criterion, and will remit from you your sins, and will forgive you. God is possessor of infinite grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, if you fear Allah, He will grant you a criterion and will remove from you your misdeeds and forgive you. And Allah is the possessor of great bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:29] The following was revealed regarding his [Abū Lubāba’s] repentance: O you who believe, if you fear God, by turning [in repentance] to Him and in other ways, He will grant you a [means of] separation, between yourselves and what you fear, so that you will be delivered, and absolve you of your evil deeds, and forgive you, your sins; and God is of tremendous bounty.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe! If you keep your duty to Allah) regarding that which He has commanded you and warned you against, (He will give you discrimination) victory and salvation (and will rid you of your evil thoughts and deeds) but not the enormities which you have committed, (and will forgive you) all the other transgressions. (Allah is of Infinite Bounty) He favours His servants with forgiveness and Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَّكُمْ فُرْقَاناً } معناهُ حُججٌ ويقالُ نصرٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"For you there is distinction,\" [means that] there are proofs and it is said that [this] is victory.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إن تتقوا الله } بالاجتناب عن نقض العهد وفسخ العزيمة وإخفاء الأمانة ومحبة الأموال والأولاد حتى تفنوا فيه { يجعل لكم فرقاناً } نوراً يفرق به بين الحق والباطل من طور العقل الفرقاني { ويكفر عنكم سيئاتكم } أي: سيئات نفوسكم { ويغفر لكم ذنوبكم } أي: ذنوب ذواتكم { والله ذو الفضل العظيم } بإعطاء الوجود الموهوب الحقاني والعقل الفرقاني\n { وما كان الله ليعذبهم وأنت فيهم } لأن العذاب صورة الغضب وأثره فلا يكون إلا من غضب النبي أو من غضب الله المسبب من ذنوب الأمة، والنبي عليه السلام كان صورة الرحمة لقوله تعالى:\n\n[الأنبياء: 107] ولهذا إذ كسروا رباعيته قال صلى الله عليه وسلم:\n\n \" اللهم اهد قومي فإنهم لا يعلمون \" \n\n، ولم يغضب كما غضب نوح عليه السلام، وقال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يِٰأَيُّهَا ٱلَّذِينَ ءَامَنُوۤاْ إِن تَتَّقُواْ ٱللَّهَ } وتحذروا عن محارمة ومحضوراته مطلقاً\n وتؤدوا الأمانات التي ائتمنتم بها من الأموال والشهادات بلا خيانة فيها\n وتفوضوا أموركم كلها إليه مجتنبين { يَجْعَل لَّكُمْ } وينزل على قلوبكم تفضلاً وامتناناً { فُرْقَاناً } ينور به قلوبكم إلى حيث تميِّزون الحق من الباطل\n والصواب من الخطأ\n والإلهام الإلهي من إغواء الشيطان وتقريره { وَيُكَفِّرْ } به ويمحو به { عَنكُمْ سَيِّئَاتِكُمْ } أي: جرائمكم اللاتي مضت عليكم بالمرة { وَ } بالجملة: { يَغْفِرْ لَكُمْ } ويستر عنكم ذنوبكم مطلقاً\n تفضلاً وامتناناً { وَ } لا تتعجبوا من أفضاله هذا\n ولا تستبعدوا منه سبحانه أمثاله\n إن { ٱللَّهُ } المراقب لأحوال عباده { ذُو ٱلْفَضْلِ ٱلْعَظِيمِ } [الأنفال: 29] واللطف الجسيم على من توكل عليه\n والتجأ نحوه في جميع حالات على وجه الخضوع والخشوع\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "62:4",
      "similarity": 0.4997176659427737
    },
    {
      "verse": "65:5",
      "similarity": 0.4031699991158298
    },
    {
      "verse": "23:109",
      "similarity": 0.39955027079529487
    },
    {
      "verse": "3:174",
      "similarity": 0.3968349318983943
    },
    {
      "verse": "3:100",
      "similarity": 0.389826896898452
    }
  ]
}