{
  "chapter": "الأنفال",
  "text": "يايها الذين ءامنوا۟ ان تتقوا۟ الله يجعل لكم فرقانا ويكفر عنكم سيـاتكم ويغفر لكم والله ذو الفضل العظيم",
  "translations": [
    {
      "translation": "You who have iman! if you have taqwa of Allah, He will give you discrimination and erase your bad actions from you and forgive you. Allah's favour is indeed immense.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, if you follow the path shown by God, He will give you a standard (of right and wrong), and overlook your sins, and forgive you. God is abounding in benevolence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! If you fear Allah He will grant you a criterion and will cleanse you of your sins and forgive you. Allah is Lord of abounding bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you fear God, He will give you guidance, will expiate your bad deeds and forgive you. God's favors are the greatest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! If you fear Allah, He will bestow upon you (the criterion) that with which you will separate the truth from falsehood, and He will unburden your misdeeds and forgive you; and Allah is the Extremely Munificent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If you obey and fear Allah, He will grant you Furqan, and will expiate for you your sins, and forgive you; and Allah is the Owner of the great bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If you are careful of (your duty to) Allah, He will grant you a distinction and do away with your evils and forgive you; and Allah is the Lord of mighty grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, if you fear God, He will assign you a salvation, and acquit you of your evil deeds, and forgive you; and God is of bounty abounding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! If ye keep your duty to Allah, He will give you discrimination (between right and wrong) and will rid you of your evil thoughts and deeds, and will forgive you. Allah is of Infinite Bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you fear God, He will grant you the ability to discriminate between right and wrong, and will forgive you your sins: for God is limitless in His great bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! if ye fear Allah He will make for you a distinction and will expiate for you your misdeeds, and forgive you; and Allah is Owner of Mighty Grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! If you are wary of Allah, He shall appoint a criterion for you, and absolve you of your misdeeds, and forgive you, for Allah is dispenser of a great grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! if ye fear Allah, He will grant you a criterion (to judge between right and wrong), remove from you (all) evil (that may afflict) you, and forgive you: for Allah is the Lord of grace unbounded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If you obey and fear Allah, He will grant you Furqan a criterion [(to judge between right and wrong), or (Makhraj, i.e. making a way for you to get out from every difficulty)], and will expiate for you your sins, and forgive you, and Allah is the Owner of the Great Bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you fear Allah, He will give you a criteria and cleanse you of your sins and forgive you. Allah is the Owner of great bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If you remain conscious of God, He will give you a criterion, and will remit from you your sins, and will forgive you. God is possessor of infinite grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, if you fear Allah, He will grant you a criterion and will remove from you your misdeeds and forgive you. And Allah is the possessor of great bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:29] The following was revealed regarding his [Abū Lubāba’s] repentance: O you who believe, if you fear God, by turning [in repentance] to Him and in other ways, He will grant you a [means of] separation, between yourselves and what you fear, so that you will be delivered, and absolve you of your evil deeds, and forgive you, your sins; and God is of tremendous bounty.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستيناف ابتدائي متصل بالآيات السابقة ابتداء من قوله تعالى : { يأيها الذين آمنوا أطيعوا الله ورسوله ولا تولوا عنه } \\[ الأنفال : 20 \\] الآية وما بعده من الآيات إلى هُنا .وافتتح بالنداء للاهتمام ، كما تقدم آنفاً .وخوطب المؤمنون بوصف الإيمان تذكيراً لهم بعهد الإيمان وما يقتضيه كما تقدم آنفاً في نظائِره ، وعقب التحذير من العصيان والتنبيه على سوء عواقبه ، بالترغيب في التقوى وبيان حسن عاقبتها وبالوعد بدوام النصر واستقامة الأحوال إن هم داموا على التقوى .ففعل الشرط مراد به الدوام ، فإنهم كانوا متقين ، ولكنهم لما حُذروا من المخالفة والخيانة ناسب أن تفرض لهم الطاعة في مقابل ذلك .ولقد بَدَا حُسنُ المناسبة إذ رُتبتتِ على المنهيات تحذيراتٌ من شرور وأضرار من قوله : { إن شر الدواب عند الله الصم البكم } \\[ الأنفال : 22 \\] وقوله { واتقوا فتنة } \\[ الأنفال : 25 \\] الآية ، ورتب على التقوى : الوعد بالنصر ومغفرة الذنوب وسعة الفضل .والفرقان أصله مصدر كالشكران والغُفران والبُتان ، وهو ما يَفرِق أي يميَز بين شيئين متشابهين ، وقد أطلق بالخصوص على أنواع من التفرقة فأطلق على النصر ، لأنه يفرق بين حاليْن كانا محتَمَلَيْن قبلَ ظهور النصر ، ولُقب القرآنُ بالفرقان؛ لأنه فَرّقَ بين الحق والباطل ، قال تعالى : { تبارك الذي نزل الفرقان على عبده } \\[ الفرقان : 1 \\] ولعل اختياره هنا لقصد شموله ما يصلح للمقام من معانيه ، فقد فُسّر بالنصر ، وعن السدي ، والضحاك ، ومجاهد ، الفرقانُ المَخْرَج ، وفي «أحكام ابن العربي» ، عن ابن وهب وابن القاسم وأشهب أنهم سألوا مالكاً عن قوله تعالى : { يجعل لكم فرقاناً } قال مَخَرجاً ثم قرأ : { ومن يَتَققِ الله يَجْعَلْ له مخرجاً ويرزقه من حيث لا يحتسب ومن يتوكل على الله فهو حسبه } \\[ الطلاق : 3 \\] ، وفسر بالتمييز بينهم وبين الكفار في الأحوال التي يُستحب فيها التمايز في أحوال الدنيا ، فيشمل ذلك أحوالَ النفس : من الهداية ، والمعرفة ، والرضى ، وانشراح القلب ، وإزالةِ الحِقد والغل والحسد بينهم ، والمكرِ والخداععِ وذميممِ الخلائق .وقد أشعر قوله : { لكم } أن الفرقان شيء نافع لهم فالظاهر أن المراد منه كل ما فيه مخرج لهم ونجاة من التباس الأحوال وارتباك الأمور وانبهام المقاصد ، فيؤول إلى استقامة أحوال الحياة ، حتى يكونوا مطمئني الباللِ منشرحي الخاطر وذلك يستدعي أن يكونوا : منصورين ، غالبين ، بُصراء بالأمور ، كَمَلة الأخلاق سائرين في طريق الحق والرشد ، وذلك هو ملاك استقامة الأمم ، فاختيار الفرقان هنا ، لأنه اللفظ الذي لا يؤدي غيرُه مُؤداه في هذا الغرض وذلك من تمَام الفصاحة .والتقوى تشمل التوبة ، فتكفير السيئات يصح أن يكون المراد به تكفير السيئات الفارطة التي تعقبها التقوى . ومفعول { يغفر لكم } ، محذوف وهو ما يستحق الغفران وذلك هو الذنب ، ويتعين أن يحمل على نوع من الذنوب . وهو الصغائر التي عبر عنها باللمم ، ويجوز العكس بأن يراد بالسيئات الصغائِر وبالمغفرة مغفرة الكبائر بالتوبة المعقبَة لها ، وقيل التكفير الستر في الدنيا ، والغفران عدم المؤاخذة بها في الآخرة ، والحاصل أن الإجمال مقصود للحث على التقوى وتحقق فائِدتها والتعريض بالتحذير من التفريط فيها ، فلا يحصل التكفير ولا المغفرة بأي احتمال .وقوله : { والله ذو الفضل العظيم } تذييل وتكميل وهو كناية عن حصول منافع أخرى لهم من جراء التقوى .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe! If you keep your duty to Allah) regarding that which He has commanded you and warned you against, (He will give you discrimination) victory and salvation (and will rid you of your evil thoughts and deeds) but not the enormities which you have committed, (and will forgive you) all the other transgressions. (Allah is of Infinite Bounty) He favours His servants with forgiveness and Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَّكُمْ فُرْقَاناً } معناهُ حُججٌ ويقالُ نصرٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"For you there is distinction,\" [means that] there are proofs and it is said that [this] is victory.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يِٰأَيُّهَا ٱلَّذِينَ ءَامَنُوۤاْ إِن تَتَّقُواْ ٱللَّهَ } وتحذروا عن محارمة ومحضوراته مطلقاً\n وتؤدوا الأمانات التي ائتمنتم بها من الأموال والشهادات بلا خيانة فيها\n وتفوضوا أموركم كلها إليه مجتنبين { يَجْعَل لَّكُمْ } وينزل على قلوبكم تفضلاً وامتناناً { فُرْقَاناً } ينور به قلوبكم إلى حيث تميِّزون الحق من الباطل\n والصواب من الخطأ\n والإلهام الإلهي من إغواء الشيطان وتقريره { وَيُكَفِّرْ } به ويمحو به { عَنكُمْ سَيِّئَاتِكُمْ } أي: جرائمكم اللاتي مضت عليكم بالمرة { وَ } بالجملة: { يَغْفِرْ لَكُمْ } ويستر عنكم ذنوبكم مطلقاً\n تفضلاً وامتناناً { وَ } لا تتعجبوا من أفضاله هذا\n ولا تستبعدوا منه سبحانه أمثاله\n إن { ٱللَّهُ } المراقب لأحوال عباده { ذُو ٱلْفَضْلِ ٱلْعَظِيمِ } [الأنفال: 29] واللطف الجسيم على من توكل عليه\n والتجأ نحوه في جميع حالات على وجه الخضوع والخشوع\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { يا أيها الذين آمنوا إن تتقوا الله } ، كما أمركم، { يجعل لكم فرقاناً } نوراً في قلوبكم، تُفرقون به بين الحق والباطل، والحسن والقبيح. قال ابن جزي: وذلك دليل على أن التقوى تُنور القلب، وتشرح الصدر، وتزيد في العلم والمعرفة. هـ. أو: نصراً يُفرق بين المحق والمبطل بإعزاز المؤمنين وإذلال الكافرين، أو مخرجاً من الشبهات، أو نجاة مما تحذرون في الدارين من المكروهات، أو ظهوراً يشهر أمركم ويثبت صِيتَكم، من قولهم: سطع فرقان الصبح، أي نوره، { ويُكفِّر عنكم سيئاتكم } أي: يسترها، فلا يفضحكم يوم القيامة، { ويغفرْ لكم } يتجاوز عن مساوئكم، أو يكفر صغائركم ويغفر كبائركم، أو يكفر ما تقدم ويغفر ما تأخر، { والله ذوالفضل العظيم } ، ففضله أعظم من كل ذنب، وفيه تنبيه على أن ما وعده لهم على التقوى تفضل منه وإحسان، لا أن تقواهم أو جبت ذلك عليه، كالسيد إذا ما وعده عبده أن يعطيه شيئاً في مقابلة عمل امره به، مع أنه واجب عليه لا محيد له عنه. والله تعالى أعلم. الإشارة: الفرقان الذي يلقيه الله في قلوب المتقين من المتوجهين هو نور الواردات الإلهية، التي ترد على القلوب من حضرة الغيوب، وهي ثلاثة أقسام: وارد الانتباه: وهو نور يفرق به بين الغفلة واليقظة، وبين البطالة والنهوض إلى الطاعة، فيترك غفلته وهواه، وينهض إلى مولاه، ووارد الإقبال: وهو نور يفرق به بين الوقوف مع ظلمة الحجاب وبين السير إلى شهود الأحباب، ووارد الوصال: وهو نور يفرق به بين ظلمة الأكوان، ونور الشهود، أو بين ظلمة سحاب الأثر وشهود شمس العرفان. وإلى هذه الواردات الثلاثة أشار في الحكم بقوله: \" إنما أورد عليك الوارد لتكون به عليه وارداً، أورد عليك الوارد ليسلمك من يد الأغيار، ويحررك من رق الآثار، أورد عليك الوارد ليخرجك من سجن وجودك إلى فضاء شهودك \". ثم ذكَّر نبيه صلى الله عليه وسلم بما فعل معه من الحفظ والرعاية من أعدائه اللئام، فقال: { وَإِذْ يَمْكُرُ بِكَ ٱلَّذِينَ كَفَرُواْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "62:4",
      "similarity": 0.4997176659427737
    },
    {
      "verse": "65:5",
      "similarity": 0.4031699991158298
    },
    {
      "verse": "23:109",
      "similarity": 0.39955027079529487
    },
    {
      "verse": "3:174",
      "similarity": 0.3968349318983943
    },
    {
      "verse": "3:100",
      "similarity": 0.389826896898452
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008029.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008029.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:29.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}