{
  "chapter": "الأنفال",
  "text": "واذ يمكر بك الذين كفروا۟ ليثبتوك او يقتلوك او يخرجوك ويمكرون ويمكر الله والله خير المكرين",
  "translations": [
    {
      "translation": "When those who are kafir were plotting against you to imprison you or kill you or expel you: they were plotting and Allah was plotting, but Allah is the Best of Plotters.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember, when the infidels contrived to make you a prisoner or to murder or expel you, they plotted, but God also planned; and God's plan is the best.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall how those who disbelieved schemed against you to take you captive, or kill you, or drive you away. They schemed and Allah did also scheme. Allah is the best of those who scheme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers planned to imprison, murder or expel you (Muhammad) from your city. They make evil plans but God too plans and God's plans are the best.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember O dear Prophet when the disbelievers were scheming against you to either imprison you, or to kill you or to banish you; and they were scheming, and Allah was making His secret plan; and Allah’s secret plan is the best.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when the disbelievers plotted against you to imprison you, or to kill you, or to expel you (from your home, Makkah); they were plotting and Allah too was plotting; and Allah is the best of plotters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who disbelieved devised plans against you that they might confine you or slay you or drive you away; and they devised plans and Allah too had arranged a plan; and Allah is the best of planners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the unbelievers were devising against thee, to confine thee, or slay thee, or to expel thee, and were devising, and God was devising; and God is the best of devisers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who disbelieve plot against thee (O Muhammad) to wound thee fatally, or to kill thee or to drive thee forth; they plot, but Allah (also) plotteth; and Allah is the best of plotters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember how those who bent on denying the truth plotted against you to imprison you or kill you or expel you: they schemed -- but God also schemed. God is the best of schemers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time those who disbelieved were plotting against thee to confine thee or to slay thee or to drive thee forth: they were plotting and Allah was plotting, and Allah is the Best of plotters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the faithless plotted against you to take you captive, or to kill or expel you—they plotted and Allah devised, and Allah is the best of devisers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember how the Unbelievers plotted against thee, to keep thee in bonds, or slay thee, or get thee out (of thy home). They plot and plan, and Allah too plans; but the best of planners is Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when the disbelievers plotted against you (O Muhammad SAW) to imprison you, or to kill you, or to get you out (from your home, i.e. Makkah); they were plotting and Allah too was planning, and Allah is the Best of the planners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the unbelievers plotted against you (Prophet Muhammad). They sought to either take you captive or have you killed, or expelled. They plotted but Allah (in reply) also plotted. Allah is the Best in plotting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the disbelievers plotted against you, to imprison you, or kill you, or expel you. They planned, and God planned, but God is the Best of planners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [remember, O Muhammad], when those who disbelieved plotted against you to restrain you or kill you or evict you [from Makkah]. But they plan, and Allah plans. And Allah is the best of planners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:30] And, remember, O Muhammad (s), when the disbelievers — who had gathered to discuss your affair at the council assembly — were plotting against you, to confine you, to chain you up and imprison you, or slay you — all of them [acting as] assassins of one man — or to expel you, from Mecca, and they were plotting, against you, and God was plotting, against them, by devising a way [out] for you, when He revealed to you what they had devised and commanded you to leave [Mecca]; and God is the best of those who plot, the most knowledgeable among them about it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when those who disbelieve) i.e. Abu Jahl and his host (plot against thee (0 Muhammad)) in Dar al- Nadwah (to wound you fatally) to imprison you as suggested by 'Amr Ibn Hisham, (or to kill thee) all together as suggested by Abu Jahl Ibn Hisham (or to drive thee forth) and expel you as suggested by Abu'l- Buhturi Ibn Hisham; (they plot) they intend to destroy and kill you, Muhammad, (but Allah (also) plotteth) He wants to destroy and kill them on the Day of Badr; (and Allah is the best of plotters) He is the strongest of plotters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لِيُثْبِتُوكَ } معناه لِيُقَيِّدُوكَ\n\n",
      "translations": [
        {
          "translation": " And His saying - the Most High - {Liythbitook} means to make you firm.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل إنجاءنا وخلاصنا إياك وقت { إِذْ يَمْكُرُ } ويخدع { بِكَ } إهلاكك ومقتك { ٱلَّذِينَ كَفَرُواْ } يعني: قريشاً شاوروا لأمرك في دار الندوة { لِيُثْبِتُوكَ } ويحبسوك في دار ليس فيها منفذ ولا كوة يلقون منها طعامكم أحياناً { أَوْ يَقْتُلُوكَ } مزدحمين\n بحيث لم ينسب قتلك إلى معين منهم { أَوْ يُخْرِجُوكَ } من مكة محمولاً على عجل\n ليقتلك القطاع { وَ } بالجملة: { يَمْكُرُونَ } أولئك الكفرة العصاة الطغاة لمقتك { وَيَمْكُرُ ٱللَّهُ } الرقيب عليك\n لإنجائك وخلاصك من أيديهم قغلب مكره سبحانه على مكره\n وأخرجك من بينهم سالماً { وَٱللَّهُ } المطلع لجميع محايلهم { خَيْرُ ٱلْمَاكِرِينَ } [الأنفال: 30] أي: أشدهم وأقواهم تأثيراً وقوةً\n\n\nوذلك أنهم حين سمعوا إيمان الأنصار تشاوروا على أظهرهم في أمره صلى الله عليه وسلم\n وارتفاع شأنه\n وسطوع برهانه فدخل عليهم إبليس في صورة شيخ\n وقال: أنا من نجد\n سمعت اجتماعكم فأحضركم\n لأعلم كيف تدبرون في أمر هذا الشخص الذي لو بقي زماناً على هذا يُخاف عليكم من شرءه؟\n\nفقال أبو البحتري: رأيي أن تحبسوه في بيت\n وتسدوا منافذه غير كوةٍ يلقون إليه طعامه وشرابه حتى يموت\n فقال الشيخ النجدي: بئس هذا الرأي\n يأتيكم من يقاتلكم من قومه يخلصونه من أيديكم\n فقال هشام بن عمرو: رأيي أن يحملوه على جمل فيخرجوه من أرضكم\n ولا يلحقكم ضرر بني هاشم\n فقال الشيخ: يفسد قوماً آخر ويقاتلكم بهم أما رأيتم طلاقة لسانه وحلاوة كلامه\n ووجاهة منظره؟\n\n\nفقال أبو جهل: أنا أرى أن تأخذوا من كل بطن غلاماً وتعطوه سيفاً\n فيضربون دفعة واحدة فيتفرق دمه في القبائل\n فلا يقوى بنو هاشم على حروب قريش كلهم\n فإن طلبوا العقل عقلناه\n فقال الشي: صدق هذا التفى\n واتفقوا على رأيه\n\n\nفأتى جبريل النبي - عليهما السلام - وأخبره الخبر وأمره بالهجرة فبيَّت صلى الله عليه وسلم علياً - كرم الله وجهه - على مضجعه متسجياً ببرده\n وخرج صلى الله عليه وسلم مع أبي بكر رضي الله عنه ومضيا إلى الغار وبات المشركون يحرسون علياً - كرم الله وجهه - يحسبون النبي صلى الله عليه وسلم\n فلمَّا أصبحوا ساروا ليقتلوه قرأوا عليّاً\n فقالوا: أين صاحبكم؟ فقال: ما أدري فاتبعوا أثره\n فلمَّا بلغوا الغار رأوا نسج العنكبوت على بابه\n فقالوا: لو دخله ليم يبق لنسج العنكبوت أثر\n فمكث فيه صلى الله عليه وسلم ثلاثة ثمَّ خرج نحو المدينة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { و } اذكر، يا محمد، نعمة الله عليك بحفظه ورعايته لك { إذ يمكُر بك الذين كفروا } من قريش، حين اجتمعوا في دار الندوة { ليُثْبِتُوكَ } أي: يحبسوك في الوثاق والسجن { أو يقتلوك } بسيوفهم، { أو يخرجوك } من مكة. وذلك أنهم لما سمعوا بإسلام الأنصار ومبايعتهم للنبي صلى الله عليه وسلم، خافوا على أنفسهم، واجتمعوا في دار الندوة متشاورين في أمره، فدخل عليهم إبليس في صورة شيخ، وقال: أنا من نجد، سمعت اجتماعكم فأردت أن أحضركم، ولن تعدموا مني رأياً ونصحاً، فقال أبو البحتري: أرى أن تحبسوه في بيت، وتسدوا منافذه، غير كوة تلقون إليه طعامه وشرابه فيها، حتى يموت، فقال الشيخ: بئس الرأي، يأتيكم من يقاتلكم من قومه، ويخلصه من أيديكم. فقال هشام بن عمرو: أرى أن تحملوه على جمل فتخرجوه من أرضكم، فلا يضركم ما صنع، فقال الشيخ: بئس الرأي، يُفسد قوماً غيركم ويقاتلكم بهم. فقال أبو جهل: أنا أرى أن تأخذوا من كل بطن غلاماً، وتعطوه سيفاً، فتضربوه ضربة واحدة، فيتفرق دمه في القبائل، فلا يقوى بنو هاشم على حرب قريش كلهم، فإن طلبوا العَقَلَ عقلناه. فقال الشيخ: صدق هذا الفتى، فتفرقوا على رأيه، فأتى جبريلُ النبي صلى الله عليه وسلم وأخبره الخبر، وأمره بالهجرة فبيت عليّاً رضي الله عنه على مضجعه، وخرج مع أبي بكر إلى الغار، ثم سافر مهاجراً إلى المدينة. قال تعالى: { ويمكرون ويمكر اللَّهُ } برد مكرهم عليهم، أو مجازاتهم عليه، أو بمعاملة الماكرين معهم، بأن أخرجهم إلى بدر، وقلل المسلمين في أعينهم، حتى تجرأوا على قتالهم، فقُتِلوا وأُسِروا، { والله خيرُ الماكرين } إذ لا يؤبه بمكرهم دون مكره، وإسناد أمثال هذا مما يحسن للمزاوجة، ولا يجوز إطلاقها ابتداء لما فيه من إيهام الذم. قاله البيضاوي. الإشارة: وإذ يمكر بك أيها القلب الذين كفروا، وهم القواطع من العلائق والحظوظ والشهوات، ليحبسوك في سجن الأكوان، مسجوناً بمحيطاتك، محصوراً في هيكل ذاتك، أو يقتلوك بالغفلة والجهل وتوارد الخواطر والأوهام، أو يُخرجوك من حضرة ربك إلى شهود نفسك، أو من صحبة العارفين إلى مخالطة الغافلين، أو من حصن طاعته إلى محل الهلاك من موطن معصيته، أو من دائرة الإسلام إلى الزيغ والإلحاد، عائذاً بالله من المحن، والله خير الماكرين، فيرد كيد الماكرين، وينصر أولياءه المتوجهين والواصلين، وبالله التوفيق. ثم ذكر مساوئ أهل المكر، فقال: { وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا قَالُواْ قَدْ سَمِعْنَا }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:54",
      "similarity": 0.5398991162987262
    },
    {
      "verse": "47:7",
      "similarity": 0.5190594079404266
    },
    {
      "verse": "14:27",
      "similarity": 0.5110036555246685
    },
    {
      "verse": "4:66",
      "similarity": 0.5104563122549903
    },
    {
      "verse": "71:22",
      "similarity": 0.47062071610649653
    }
  ]
}