{
  "chapter": "الأنفال",
  "text": "واذا تتلى عليهم ءايتنا قالوا۟ قد سمعنا لو نشاء لقلنا مثل هذا ان هذا الا اسطير الاولين",
  "translations": [
    {
      "translation": "When Our Signs are recited to them, they say, 'We have already heard all this. If we wanted, we could say the same thing. This is nothing but the myths of previous peoples.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our messages were read out to them, they said: \"We have heard. We could certainly compose (writings) like them if we choose. They are but only tales of long ago.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our verses are recited to them, they say: 'We have heard. We could, if we willed, compose the like of it. They, are nothing but fables of the ancient times.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our revelations are recited to them (the unbelievers), they say, \"We have heard them. Had we wanted, we could also have composed such statements; they are no more than ancient legends.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our verses are recited to them they say, “Yes, we have heard – if we wanted we could also say something like this – these are nothing but stories of former people!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Ayat are recited to them, they say: \"We have heard (the Qur'an); if we wish we can say the like of this. This is nothing but the tales of the ancients.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our communications are recited to them, they say: We have heard indeed; if we pleased we could say the like of it; this is nothing but the stories of the ancients.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And When Our signs were being recited to them, they said, 'We have already heard; if we wished, we could say the like of this; this is naught but the fairy-tales of the ancients.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our revelations are recited unto them they say: We have heard. If we wish we can speak the like of this. Lo! this is naught but fables of the men of old.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever Our revelations are recited to them, they say, \"We have heard them. If we wished, we could produce the like. They are nothing but the fables of the ancients.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our revelations are rehearsed unto them, they say: we have heard; we could if we willed, surely say something the like thereof; naught is this but fables of the ancients.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our signs are recited to them, they say, ‘We have heard already. If we want, we [too] can say like this. These are nothing but myths of the ancients.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our Signs are rehearsed to them, they say: \"We have heard this (before): if we wished, we could say (words) like these: these are nothing but tales of the ancients.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Verses (of the Quran) are recited to them, they say: \"We have heard this (the Quran); if we wish we can say the like of this. This is nothing but the tales of the ancients.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever Our verses are recited to them, they say: 'We have heard them, if we wished, we could speak its like. They are but tales of the ancients'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our revelations are recited to them, they say, “We have heard. Had we wanted, we could have said the like of this; these are nothing but myths of the ancients.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our verses are recited to them, they say, \"We have heard. If we willed, we could say [something] like this. This is not but legends of the former peoples.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:31] And when Our verses, namely, the Qur’ān, were being recited to them, they said, ‘We have already heard! If we wish we can speak the like of this — al-Nadr b. al-Hārith said this, for he used to travel on trading business to al-Hīra, where he would buy books containing the tales of the Persians, and would recount these to the Meccans; this, Qur’ān, is nothing but the fables, the lies, of the ancients’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when Our revelations) detailing commands and prohibitions (are recited unto them) to al-Nadr Ibn al- Harth and his companions (they say: We have heard) what Muhammad (pbuh) has said. (If we wish we can speak the like of this) the like of what Muhammad (pbuh) recites. (Lo! This) which Muhammad (pbuh) says (is naught but fables) tales (of the men of old) and their stories.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من مكرنا أياهم أنَّا ختمنا على قلوبهم وسمعهم بختم القساوة والغفلة بحيث { إِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا } مع أنهم عارضوا زماناً\n ثمَّ عجزوا مع وفوره دواعيهم\n فلمَّا عجزوا عن إتيان مثله { قَالُواْ } مكابرةً وعناداً: { قَدْ سَمِعْنَا لَوْ نَشَآءُ لَقُلْنَا مِثْلَ هَـٰذَا إِنْ هَـٰذَآ إِلاَّ أَسَاطِيرُ ٱلأَوَّلِينَ } [الأنفال: 31] أي: أكاذيبهم التي سطروها في دواوينهم\n لتعزيز السفهاء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: \" إذا \": ظرفية شرطية، خافضة لشرطها، معمولة لجوابها، أي قالوا وقت تلاوة الآيات: لو نشاء... لخ. يقول الحق جل جلاله: { وإذا تُتلى عليهم آياتنا } القرآنية { قالوا قد سمعنا } ما تتلوه علينا { لو نشاء لقلنا مثل هذا إنْ هذا إلا أساطير الأولين } أي: اخبارهم المسطورة أو أكاذيبهم المختلقة. قال البيضاوي وهذا قول النَّضْر بن الحارث، وإسناده إلى الجمع إسناد ما فعله رئيس القوم إليهم، فإنه كان قاصهم، أي: يقص عليهم أخبار فارس والروم، فإذا سمع القرآن يقص أخبار الأنبياء قال: لو شئت لقلتُ مثل هذا، أو قول الذين ائتمروا في شأنه: وهذا غاية مكائدهم، وفرط عنادهم، إذ لو استطاعوا ذلك لسارعوا إليه، فما منعهم أن يشاؤوا وقد تحداهم وقرعهم بالعجز عشر سنين، ثم قارعهم بالسيف، فلم يعارضوا، مع أنفتهم وفرط استنكافهم أن يغلَبوا، خصوصاً في باب البيان؟ هـ. بالمعنى. الإشارة: هذه المقالة بقيت سُنَّةً في أهل الإنكار على أهل الخصوصية، إذا سمعوا منهم علوماً لدنية، أو أسراراً ربانية، أو حِكماً قدسية، قالوا: لو نشاء لقلنا مثل هذا، وهم لا يقدرون على كلمة واحدة من تلك الأسرار، وهذا الغالب على المعاصرين لأهل الخصوصية، دون من تأخر عنهم، فإنهم مغرورون عنده\n[فاطر: 43]. ثم ذكر استعجالهم للعذاب عناداً وعتواً، فقال: { وَإِذْ قَالُواْ ٱللَّهُمَّ إِن كَانَ هَـٰذَا هُوَ ٱلْحَقَّ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "68:15",
      "similarity": 0.8658368589030551
    },
    {
      "verse": "83:13",
      "similarity": 0.8658368589030551
    },
    {
      "verse": "23:83",
      "similarity": 0.7142832963575373
    },
    {
      "verse": "27:68",
      "similarity": 0.7142832963575373
    },
    {
      "verse": "52:2",
      "similarity": 0.6653154378641388
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008031.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008031.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:31.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}