{
  "chapter": "الأنفال",
  "text": "واذ قالوا۟ اللهم ان كان هذا هو الحق من عندك فامطر علينا حجارة من السماء او ائتنا بعذاب اليم",
  "translations": [
    {
      "translation": "And they say, 'Allah, if this is really the truth from You, rain down stones on us out of heaven or send a painful punishment down on us.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They had also said: \"If this be the truth from you, O God, then rain down on us stones from the skies, or inflict a grievous punishment upon us.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And also recall when they said: 'O Allah! If this indeed be the truth from You, then rain down stones upon us from heaven, or bring upon us a painful chastisement.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They also say, \"Lord, if this (Quran) is the Truth from you, shower down stones on us from the sky instead of rain or send us a painful punishment\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they said, “O Allah! If this (the Qur’an) is really the truth from You, then shower upon us a rain of stones from the sky, or bring upon us some painful punishment.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when they said: \"O Allah! If this (the Qur'an) is indeed the truth (revealed) from You, then rain down stones on us from the sky or bring on us a painful torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they said: O Allah! if this is the truth from Thee, then rain upon us stones from heaven or inflict on us a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they said, 'O God, if this be indeed the truth from Thee, then rain down upon us stones out of heaven, or bring us a painful chastisement.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they said: O Allah! If this be indeed the truth from Thee, then rain down stones on us or bring on us some painful doom!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They also said, \"God, if this really is the truth from You, then rain down upon us stones from heaven, or send us some other painful punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time they said: O God! if this indeed be the truth from before Thee, then rain down stones upon us from heaven or bring on us a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they said, ‘O Allah, if this be the truth from You, rain down upon us stones from the sky, or bring us a painful punishment.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember how they said: \"O Allah if this is indeed the Truth from Thee, rain down on us a shower of stones form the sky, or send us a grievous penalty.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when they said: \"O Allah! If this (the Quran) is indeed the truth (revealed) from You, then rain down stones on us from the sky or bring on us a painful torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they say: 'O Allah, if this is indeed the truth from You, rain down upon us stones from heaven or bring us a painful punishment.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “Our God, if this is the truth from You, then rain down on us stones from the sky, or visit us with a painful affliction.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [remember] when they said, \"O Allah, if this should be the truth from You, then rain down upon us stones from the sky or bring us a painful punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:32] And when they said, ‘O God! If this, that Muhammad (s) recites, be indeed the truth, revealed, from You, then rain down stones upon us from the heaven, or bring on us a painful chastisement’, in return for [our] denial of it: this was said by al-Nadr and others, in mockery and in delusion that he had some insight and certainty about it [the Qur’ān] being false.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على { وإذ يمكر بك الذين كفروا } \\[ الأنفال : 30 \\] أو على { قالوا قد سمعنا } \\[ الأنفال : 31 \\] وقائل هذه المقالة هو النضر بن الحارث صاحب المقالة السابقة ، وقالها أيضاً أبو جهل وإسناد القول إلى جميع المشركين للوجه الذي أسند له قولُ النضر { قد سمعنا لو نشاء لقلنا مثل هذا } \\[ الأنفال : 31 \\] فارجع إليه ، وكذلك طريق حكاية كلامهم إنما هو جار على نحو ما قررته هنالك من حكاية المعنى .وكلامهم هذا جار مجرى القَسَم ، وذلك أنهم يقسمون بطريقة الدعاء على أنفسهم إذا كان ما حصل في الوجود على خلاف ما يحكونه أو يعتقدونه ، وهم يحسبون أن دعوة المرء على نفسه مستجابة ، وهذه طريقة شهيرة في كلامهم قال النابغة: ... ما إنْ أتيتُ بشيء أنتَ تكرههإذَنْ فلا رَفَعَتْ سَوطي إِليَّ يدي ... وقال معدان بنُ جَواس الكِندي ، أو حُجَيّة بن المضرب السَّكوني: ... إن كان ما بُلِّغْت عني فلامنيصديقي وشَلَّتْ من يديّ الأنامل ... وكَفّنْتُ وحدي مُنذراً برِدائِهوصادَفَ حَوْطاً من أعاديّ قاتل ... وقال الأشتر النّخَعي: ... بُقَّيْتُ وفْري وانحرفتُ عن العلاولقيتُ أضيافي بوجهِ عبوسِ ... إنْ لم أَشُنّ على ابن حرب غارةلم تخلُ يوماً من نهاب نفوس ... وقد ضَمّن الحريري في «المقامة العاشرة» هذه الطريقة في حكاية يمين وجّهها أبو زيد السروجي على غُلامه المزعوم لدى والي رَحبة مالك بن طوْق حتى اضطرَّ الغلامَ إلى أن يقول : «الاصطلاء بالبلية ، ولا الابتلاءُ بهذه الإِلِيّة» .فمعنى كلامهم : إن هذا القرآن ليس حقاً من عندك فإن كان حقاً فأصبنا بالعذاب ، وهذا يقتضي أنهم قد جزموا بأنه ليس بحق وليسَ الشرط على ظاهره حتى يفيد ترددهم في كونه حقاً ولكنه كناية عن اليمين وقد كانوا لجهلهم وضلالهم يحسبون أن الله يتصدى لمخاطرتهم ، فإذا سألوه أن يمطر عليهم حجارة إن كان القرآن حقاً منه أمطر عليهم الحجارة وأرادوا أن يظهروا لقومهم صحة جزمهم بعدم حقية القرآن فأعلنوا الدعاء على أنفسهم بأن يصيبهم عذاب عاجل إن كان القرآن حقاً من الله ليستدلوا بعدم نزول العذاب على أن القرآن ليس من عند الله ، وذلك في معنى القسم كما علمت .وتعليق الشرط بحرف { إن } لأن الأصل فيها عدم اليقين بوقوع الشرط ، فهم غير جازمين بأن القرآن حق ومنزل من الله بل هم موقنون بأنه غير حق واليقين بأنه غير حق أخص من عدم اليقين بأنه حق .وضمير { هو } ضميرُ فصل فهو يقتضي تقوي الخبر أي : إن كان هذا حقاً ومن عندك بلا شك .وتعريف المسند بلام الجنس يقتضي الحصر فاجتمع في التركيب تقو وحصر وذلك تعبيرهم يحكون به أقوال القرآن المنوهة بصدقه كقوله تعالى : { إن هذا لَهو القصص الحق } \\[ آل عمران : 62 \\] وهم إنما أرادوا إن كان القرآن حقاً ولا داعي لهم إلى نفي قوة حقيته ولا نفي انحصار الحقية فيه ، وإن كان ذلك لازماً لكونه حقاً ، لأنه إذا كان حقاً كان ما هم عليه باطلاً فصح اعتبار انحصار الحقية فيه انحصاراً إضافياً ، إلاّ أنه لا داعي إليه لولا أنهم أرادوا حكاية الكلام الذي يبطلونه .وهذا الدعاء كناية منهم عن كون القرآن ليس كما يوصف به ، للتلازم بين الدعاء على أنفسهم وبين الجزم بانتفاء ما جعلوه سبب الدعاء بحسب عرف كلامهم واعتقادهم .و { من عندك } حال من الحق أي منزلاً من عندك فهم يطْعنون في كونه حقاً وفي كونه منزلاً من عند الله .وقوله : { من السماء } وصف لحجارة أي حجارةَ مخلوقة لعذاب مَن تصيبه لأن الشأن أن مطر السماء لا يكون بحجارة كقوله تعالى : { فصَب عليهم ربك سوط عذابٍ } \\[ الفجر : 13 \\] ( والصب قريب من الأمطار ).وذكروا عذاباً خاصاً وهو مطر الحجارة ثم عمموا فقالوا : { أو ائِتنا بعذاب أليم } ويريدون بذلك كله عذاب الدنيا لأنهم لا يؤمنون بالآخرة . ووصفوا العذاب بالأليم زيادة في تحقيق يقينهم بأن المحلوف عليه بهذا الدعاء ليس منزلاً من عند الله فلذلك عرضوا أنفسهم لخَطر عظيم على تقدير أن يكون القرآن حقاً ومنزلاً من عند الله .وإذ كان هذا القول إنما يلزم قائله خاصة ومن شاركه فيه ونطقَ به مثل النضر وأبي جهل ومَن التزم ذلك وشارك فيه من أهل ناديهم ، كانوا قد عرضوا أنفسهم به إلى تعذيب الله إياهم انتصاراً لنبيه وكتابه ، وكانت الآية نزلت بعد أن حق العذاب على قائلي هذا القول وهو عذاب القتل المُهين بأيدي المسلمين يومَ بدر ، قال تعالى : { يُعذبْهُم الله بأيديكم ويُخْزِهم وينْصُرْكم عليهم } \\[ التوبة : 14 \\] وكان العذاب قد تأخر عنهم زمناً اقتضته حكمة الله ، بين الله لرسوله في هذه الآية سبب تأخر العذاب عنهم حين قالوا ما قالوا ، وأيقظ النفوس إلى حلوله بهم وهم لا يشعرون .\n\n",
      "translations": [
        {
          "translation": "(And when they said) it is al-Nadr Ibn al-Harth who said it: (0 Allah! If this) which Muhammad (pbuh) says (be indeed the Truth from You) that You have no son or partner, (then rain down stones on us) on al-Nadr (or bring on us some painful doom!) On the Day of Badr, al-Nadr Ibn al-Harth was killed in captivity.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل وقت { إِذْ قَالُواْ } من غاية عتوهم وفرط انهماكهم في الغفلة والضلال\n وأصرارهم على تكذيب القرآن والرسول: { ٱللَّهُمَّ إِن كَانَ هَـٰذَا } المفترى { هُوَ ٱلْحَقَّ } الثابت النازل { مِنْ عِندِكَ فَأَمْطِرْ عَلَيْنَا } بسبب تكذيبنا إياه { حِجَارَةً مِّنَ } جانب { ٱلسَّمَآءِ } واستأصلنا بها { أَوِ ٱئْتِنَا بِعَذَابٍ أَلِيمٍ } [الأنفال: 32] مؤلم مفزع\n وما هذا إلا مبالغة في تكذيب القرآن والرسول على سبيل التهكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: \" الحق \": خبر كان. يقول الحق جل جلاله: { و } اذكر { إذ قالوا اللهم إن كان هذا } الذي أتى به محمد { هو الحقَّ من عندك فأمطر علينا حجارةً من السماءِ } كأصحاب لوط، { أو ائتنا بعذاب أليم } ، قيل: القائل هذا هو النَّضْر بن الحارث، وهو أبلغ في الجحود. رُوي أنه لما قال: { إن هذا أساطير الأولين } ، قال له النبي صلى الله عليه وسلم:\n \" ويلك إنه كلام الله \" \nفقال هذه المقالة. والذي في صحيحي البخاري ومسلم: أن القائل هو أبو جهل، وقيل: سائر قريش لمّا كذبوا الني صلى الله عليه وسلم دعوا على أنفسهم، زيادة في تكذيبهم وعتوهم. وقال الزمخشري: ليس بدعاء، وإنما هو جحود، أي: إن كان هو الحق فأمطر علينا، لكنه ليس بحق فلا نستوجب عقاباً. بالمعنى.  الإشارة: قد وقعت هذه المقالة لبعض المنكرين على الأولياء، فعجلت عقوبته، ولعل ذلك الولي لم تتسع دائرة حلمه ومعرفته، وإلا لكان على قدم نبيه صلى الله عليه وسلم حيث قال الله تعالى في شأنه: { وَمَا كَانَ ٱللَّهُ لِيُعَذِّبَهُمْ وَأَنتَ فِيهِمْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:10",
      "similarity": 0.5999603086109534
    },
    {
      "verse": "39:46",
      "similarity": 0.5688661342721653
    },
    {
      "verse": "3:26",
      "similarity": 0.5455869268439282
    },
    {
      "verse": "5:114",
      "similarity": 0.4344376259689628
    },
    {
      "verse": "26:173",
      "similarity": 0.4163798184444755
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008032.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008032.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:32.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}