{
  "chapter": "الأنفال",
  "text": "وما كان الله ليعذبهم وانت فيهم وما كان الله معذبهم وهم يستغفرون",
  "translations": [
    {
      "translation": "Allah would not punish them while you were among them. Allah would not punish them as long as they sought forgiveness.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But God would not choose to punish them while you are in their midst, nor afflict them when they are seeking forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah was not to chastise them while you are in their midst; nor was Allah going to chastise them while they sought His forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God would not punish them while you were among them nor while they were asking for forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not for Allah to punish them while you O dear Prophet (Mohammed – peace and blessings be upon him) are amongst them; and Allah will not punish them as long as they are seeking forgiveness. (Prophet Mohammed – peace and blessings be upon him – is a mercy unto mankind.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah would not punish them while you (Muhammad) are among them, nor will He punish them while they seek (Allah's) forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah was not going to chastise them while you were among them, nor is Allah going to chastise them while yet they ask for forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But God would never chastise them, with thee among them; God would never chastise them as they begged forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah would not punish them while thou wast with them, nor will He punish them while they seek forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But God would not punish them while you [Prophet] were in their midst, nor would He punish them so long as they sought forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah is not one to chastise them whilst thou art in their midst, nor was Allah going to chastise them while they were asking forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah will not punish them while you are in their midst, nor will Allah punish them while they plead for forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah was not going to send them a penalty whilst thou wast amongst them; nor was He going to send it whilst they could ask for pardon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah would not punish them while you (Muhammad SAW) are amongst them, nor will He punish them while they seek (Allah's) Forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah was not to punish them whilst you were living in their midst. Nor would Allah punish them if they repeatedly ask forgiveness of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But God would not punish them while you are amongst them. And God would not punish them as long as they seek forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah would not punish them while you, [O Muhammad], are among them, and Allah would not punish them while they seek forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:33] God then says: But God was not about to chastise them, for what they requested, while you were among   them, for when chastisement is sent down it is all-encompassing, and no community was ever chastised except after its prophet and the believers had departed from it; nor was God about to chastise them while they sought forgiveness, crying, as they performed the circumambulations: ‘Your forgiveness! Your forgiveness!’; it is also said that this [last clause] refers to those oppressed believers among them, similar to where God says Had they been clearly separated, verily We would have chastised the disbelievers among them with a painful chastisement [Q. 48:25].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "186 (But Allah would not punish them) Allah would not destroy Abu Jahl and his host (while thou wast) residing (with them, nor will He punish them) destroy them (while they seek forgiveness) while they desire to believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَهُمْ يَسْتَغْفِرُونَ } معناه يصلُّونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And they seek forgiveness,\" its meaning is that they pray.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا كَانَ ٱللَّهُ لِيُعَذِّبَهُمْ } وإن استحقوا أشد العذاب والنكال والهلاك الكلي\n بسبب تكذيبك وتكذيب كتابك { وَأَنتَ فِيهِمْ } يعني: ما دامت فيهم وفي ديارهم ومكانهم\n فإن عذبهم الله فقد أصابك مما أصابهم { وَ } إن أمكن تخليصك وإنقاذك حين تعذيبهم { مَا كَانَ ٱللَّهُ مُعَذِّبَهُمْ } وما أراد تعذيبهم واستئصالهم { وَهُمْ يَسْتَغْفِرُونَ } [الأنفال: 33] أي: يتوقع منهم\n من أخلافهم الإيمان والاستغفار في الاستقبال بخلاف الأمم الهالكة من قبلأ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وما كان الله ليُعذبهم وأنت } موجود { فيهم } \n ونازل بين أظهرهم\n وقد جعلتلك رحمة للعالمين\n خصوصاً عشيرتك الأقربين\n { وما كان الله مُعَذِّبَهُم وهم يستغفرون } قيل: كانوا يقولون: غفرانك اللهم\n فلما تركوه عُذبوا يوم بدر\n وقيل: وفيهم من يستغفر\n وهو من بقي فيهم من المؤمنين\n فلما هاجروا كلهم عُذبوا\n وقيل: على الفرض والتقدير\n أي: ما كان الله ليعذبهم لو آمنوا واستغفروا\n قال بعض السلف: كان لنا أمانان من العذاب: النبي صلى الله عليه وسلم والاستغفار\n فلما مات النبي صلى الله عليه وسلم ذهب الأمان الواحد وبقي الآخر\n والمقصود من الآية: بيان ما كان الموجب لإمهاله لهم والتوقف على إجابة دعائهم\n وهو وجوده صلى الله عليه وسلم أو من يستغفر فيهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:129",
      "similarity": 0.6317666429353087
    },
    {
      "verse": "4:106",
      "similarity": 0.6117698068277007
    },
    {
      "verse": "71:10",
      "similarity": 0.5855210648354247
    },
    {
      "verse": "48:14",
      "similarity": 0.5278983228991492
    },
    {
      "verse": "26:138",
      "similarity": 0.48487186316124714
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008033.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008033.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:33.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}