{
  "chapter": "الأنفال",
  "text": "وما لهم الا يعذبهم الله وهم يصدون عن المسجد الحرام وما كانوا۟ اولياءه ان اولياؤه الا المتقون ولكن اكثرهم لا يعلمون",
  "translations": [
    {
      "translation": "But why should Allah not punish them now when they bar access to the Masjid al-Haram? They are not its guardians. Only people who have taqwa can be its guardians. But most of them do not know that.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But what is there so special they have that God should not punish them when they obstruct people from the Holy Mosque, though they are not its (appointed) guardians? Its guardians could be only those who are pious and devout. But most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But what prevents Allah from chastising them now when they are hindering people from the Holy Mosque, even though they are not even its true guardians. For its true guardians are none but the God-fearing, though most of them do not know that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should God not punish them when they hinder people from entering the sacred mosque? They are not its true patrons. Only the righteous ones are its patrons, but most of the pagans do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what is with them that Allah should not punish them, whereas in fact they prevent from the Sacred Mosque and they are not worthy (of being the custodians) of it; only the pious are its befitting custodians, but most of them do not have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should not Allah punish them while they hinder (men) from Al-Masjid Al-Haram, and they are not its guardians None can be its guardians except those who have Taqwa, but most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what (excuse) have they that Allah should not chastise them while they hinder (men) from the Sacred Mosque and they are not (fit to be) guardians of it; its guardians are only those who guard (against evil), but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But what have they now, that God should not chastise them, when they are barring from the Holy Mosque, not being its protectors? Its only protectors are the godfearing; but most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What (plea) have they that Allah should not punish them, when they debar (His servants) from the Inviolable Place of Worship, though they are not its fitting guardians. Its fitting guardians are those only who keep their duty to Allah. But most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet why should God not punish them when they debar people from the Sacred Mosque, although they are not its guardians? Its rightful guardians are those who fear God, though most of them do not realize it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what aileth them that Allah should not chastise them when they are hindering people from the Sacred Mosque, whereas they are not even the keepers thereof - its keepers are none but the God-fearing-- but most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What [excuse] have they that Allah should not punish them, when they bar [the faithful] from the Holy Mosque, and they are not its custodians? Its custodians are only the Godwary, but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But what plea have they that Allah should not punish them, when they keep out (men) from the sacred Mosque - and they are not its guardians? No men can be its guardians except the righteous; but most of them do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should not Allah punish them while they stop (men) from Al-Masjid-al-Haram, and they are not its guardians? None can be its guardian except Al-Muttaqun (the pious - see V. 2:2), but most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should Allah not punish them, when they have barred others from the Sacred Mosque, although they were not its guardians? Its only guardians are the cautious, though most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet why should God not punish them, when they are turning others away from the Sacred Mosque, although they are not its custodians? Its rightful custodians are the pious; but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But why should Allah not punish them while they obstruct [people] from al-Masjid al- Haram and they were not [fit to be] its guardians? Its [true] guardians are not but the righteous, but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:34] But what [plea] have they now, that God should not chastise them, with the sword, after your departure and that of the oppressed [believers] — if this [verse] is understood in accordance with the first opinion [that it refers to the idolaters asking forgiveness], then it abrogates the previous one, for God had chastised them at Badr and in other instances — when they bar, prevent the Prophet (s) and the Muslims, from the Sacred Mosque, [from] performing circumambulations there, though they are not its guardians?, as they claim? Its only [rightful] guardians are the God-fearing, but most of them do not know, that they have no [rightful] custodianship over it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على قوله : { وما كان الله ليعذبهم وأنتَ فيهم } \\[ الأنفال : 33 \\] وهو ارتقاء في بيان أنهم أحقاء بتعذيب الله إياهم ، بياناً بالصراحة .و { ما } استفهامية ، والاستفهام إنكاري ، وهي في محل المبتدأ و { لهم } خبره ، واللام للاستحقاق والتقدير ما الذي ثبت لهم لأن ينتفي عنهم عذاب الله فكلمة ( ما ) اسم استفهام إنكاري ، والمعنى : لم يثبت لهم شيء .و { أنْ لا يعذبهم } مجرور بلام جر محذوفة بعد ( إن ) على الشائِع من حذف الجر مع ( أنْ ) والتقدير : أي شيء كان لهم في عدم تعذيبهم أي لم يكن شيء في عدم تعذيبهم أو مِن عدم تعذيبهم أي أنهم لا شيء يمنعهم من العذاب ، والمقصود الكناية عن استحقاقهم العذاب وحلوله بهم ، أوْ توقع حلوله بهم ، تقول العرب : مَالك أنْ لا تُكْرِمَ ، أي : أنت حقيق بأن تكَرم ولا يمنعك من الإكرام شيء ، فاللفظ نفي لمانع الفعل ، والمقصود أن الفعل توفرت أسبابه ثم انتفت موانعه ، فلم يبق ما يحول بينك وبينه .وقد يتركون ( أن ) ويقولون : مالك لا تفعل فتكون الجملة المنفية بعد الاستفهام في موضع الحال وتكون تلك الحال هي مُثير الاستفهام الإنكاري ، وهذا هو المعنى الجاري على الاستعمال .وجوزوا أن تكون { ما } في الآية نافية فيكون { أن لا يعذبهم } اسمها و { لهم } خبرها والتقدير وما عدم التعذيب كائناً لهم .وجملة : { وهم يصدون عن المسجد الحرام } في موضع الحال على التقديرين .والصد الصرف ، ومفعول { يصدون } محذوف دل عليه السياق ، أي يصدون المؤمنين عن المسجد الحرام بقرينة قوله : { إنْ أولياؤه إلاّ المتقون } فكان الصد عن المسجد الحرام جريمة عظيمة يستحق فاعلوه عذاب الدنيا قبيل عذاب الآخرة ، لأنه يؤول إلى الصد عن التوحيد لأن ذلك المسجد بنَاه مُؤسسه ليكون علَماً على توحيد الله ومأوى للموحدين ، فصدهم المسلمين عنه ، لأنهم آمنوا بإله واحد ، صرف له عن كونه علَماً على التوحيد ، إذ صار الموحدون مَعدودين غيرَ أهل لزيادته ، فقد جعلوا مضادين له ، فلزم أن يكون ذلك المسجد مضاداً للتوحيد وأهلِه ، ولذلك عقب بقوله : { وما كانوا أولياءه إن أولياؤه إلاّ المتقون } وهذا كقوله : { ومن يُرد فيه بإلحادٍ بظلممٍ نذقه من عذاببٍ أليمٍ } \\[ الحج : 25 \\] ، والظلم الشرك لقوله : { إن الشرك لظلمٌ عظيمٌ } \\[ لقمان : 13 \\].وهذا الصد الذي ذكرتْه الآية : هو عزمهم على صدّ المسلمين المهاجرين عن أن يحجوا ويعْتمروا ، ولعلهم أعلنوا بذلك بحيث كان المسلمون لا يدخلون مكة . وفي «الكشاف» : «كانوا يقولون نحن وُلاَة البيت والحرم فنصد من نشاء ونُدخل من نشاء» .قلت : ويشهد لذلك قضية سعد بن معاذ مع أبي جهل ففي «صحيح البخاري» عن عبد الله بن مسعود ، أنه حدث عن سعد بن معاذ : «أنه كان صديقاً لأمية بن خلف ، وكان أمية إذا مرَّ بالمدينة نزل على سعد ، وكان سعد إذا مرَّ بمكة نزل على أمية ، فلما هاجر رسول الله صلى الله عليه وسلم إلى المدينة انطلق سعد معتمراً فنزل على أمية بمكة فقال لأمية انظُرْ لي ساعة خلوة لعليَ أطوف بالبيت فخرج قريباً من نصف النهار ، فلقيهما أبو جهل ، فقال : يا أبا صفوان مَن ( كنية أمية بن خلف ) هذا معك فقال : هذا سعد ، فقال له أبو جهل : ألا أراك تطوف باليبت آمناً وقد آوَيْتُم الصباة أما والله لولا أنك مع أبي صفوان ما رجعتَ إلى أهلك سالماً» الحديث .وقد أفادت الآية : أنهم استحقوا العذاب فنبهت على أن ما أصابهم يوم بدر ، من القتل والأسر ، هو من العذاب ، ولكن الله قد رحم هذه الأمة تكرمة لنبيه محمد صلى الله عليه وسلم فلم يؤاخذ عامتهم بظلم الخاصة بل سلط على كل أحد من العذاب ما يُجازي كفره وظُلمه وإذايته النبي صلى الله عليه وسلم والمسلمين ، ولذلك عذب بالقتل والأسر والإهانة نفراً عُرفوا بالغلو في كفرهم وأذاهم ، مثل النضر بن الحارث ، وطعيمة بن عدي ، وعُقبة بن أبي مُعَيط ، وأبي جهل ، وعذب بالخوف والجوع من كانوا دون هؤلاء كفراً واستبقاهم وأمهلهم فكان عاقبة أمرهم أن أسلموا بقرب أو بُعد وهؤلاء مثل أبي سفيان ، وحكيم بن حزام ، وخالد بن الوليد ، فكان جزاؤه إياهم على حسب علمه ، وحقق بذلك رجاء رسول الله صلى الله عليه وسلم إذ قال : \" لعل الله أن يخرج من أصلابهم من يعبده \" وجملة : { وما كانوا أولياءه } في موضع الحال من ضمير { يصُدون } والمقصود من هذه الحال إظهار اعتدائهم في صدهم عن المسجد الحرام ، فإن مَن صدّ عما هو له من الخير كان ظالماً ، ومَن صدّ عما ليس من حقه كان أشدّ ظلماً ، ولذلك قال تعالى : { ومَن أظْلَم ممن منعَ مساجد الله أن يُذكر فيها اسمه } \\[ البقرة : 114 \\] أي لا أظلمَ منه أحد لأنه منع شيئاً عن مستحقه .وجملة : { إن أولياؤه إلاّ المتقون } تعيين لأوليائه الحق ، وتقرير لمضمون { وما كانوا أولياءه } مع زيادة ما أفاده القصر من تعيين أوليائِه ، فهي بمنزلة الدليل على نفي ولاية المشركين ، ولذلك فصلت .وإنما لم يُكتف بجملة القصر مع اقتضائه أن غير المتقين ليسوا أولياء المسجد الحرام ، لقصد التصريح بظلم المشركين في صدهم المسلمين عن المسجد الحرام بأنهم لا ولاية لهم عليه ، فكانت جملة : { وما كانوا أولياءه } أشد تعلقاً بجملة : { وهم يصدون عن المسجد الحرام } من جملة : { إِن أولياؤه إلاّ المتقون } وكانت جملة : { إن أولياءه إلا المتقون } كالدليل ، فانتظم الاستدلال أبدع انتظام ، ولما في إناطة ولاية المسجد الحرام بالمتقين من الإشارة إلى أن المشركين الذين سلبت عنهم ولايته ليسوا من المتقين ، فهو مذمة لهم وتحقيق للنفي بحجة .والاستدراك الذي أفاده { لكن } ناشىء عن المقدمتين اللتين تضمنتهما جملتا { وما كانوا أولياءه ، إن أولياؤه إلاّ المتقون } لأن ذلك يثير فرض سائل يسأل عن الموجب الذي أقحمهم في الصد عننِ المسجد الحرام ، ويحسبون أنهم حقيقون بولايته لما تقدم عن «الكشاف» ، فحذف مفعول { يعلمون } لدلالة الاستدراك عليه لتعلق الاستدراك بقوله : { وما كانوا أولياءه }.وإنما نفَى العلم عن أكثرهم دون أن يقال ولكنهم لا يعلمون فاقتضى أن منهم من يعلم أنهم ليسوا أولياء المسجد الحرام ، وهم من أيقنوا بصدق الرسول صلى الله عليه وسلم واستفاقوا من غفلتهم القديمة ، ولكن حملهم على المشايعة للصادين عن المسجد الحرام ، العنادُ وطلبُ الرئاسة ، وموافقة الدهماء على ضلالهم ، وهؤلاء هم عقلاء أهل مكة ومن تهيأ للإيمان منهم مثل العباسسِ وعَقيل بن أبي طالب وأبي سفيان بن حرب وحَكيم بن حزم وخالد بن الوليد ، ومن استبقاهم الله للإسلام فكانوا من نصرائه من بعد نزول هذه الآية .\n\n",
      "translations": [
        {
          "translation": "(What (plea) have they that Allah should not punish them) that Allah should not destroy them after you left them, (when they debar) Muhammad (pbuh) and his Companions (from the Inviolable Place of Worship) and circumambulate it in the year of al-Hudaybiyyah, (though they are not its fitting guardians) guardians of the Mosque. (Its fitting guardians are those only who keep their duty to Allah) those who ward off disbelief, idolatry and indecencies: i.e. Muhammad (pbuh) and his Companions. (But most of them) all of them (know not) this nor believe in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وما لهم ألا يعذبهم الله } أي: ليس عدم نزول العذاب لعدم استحقاقهم لذلك بحسب أنفسهم\n بل إنهم مستحقون بذواتهم لصدورهم وصدّهم المستعدين عن مقام القلب وعدم بقاء الخيرية فيهم ولكن يمنعه وجودك ووجود المؤمنين المستغفرين معك فيهم\n واعلم أن الوجود الإمكاني يتبع الخير الغالب\n لأن الوجود الواجبي هو الخير المحض\n فما رجح خيره على شره فهو موجود بوجوده بالمناسبة الخيرية\n وإذا غلب الشرّ لم تبق المناسبة فلزم استئصاله وإعدامه فهم ما داموا على الصورة الاجتماعية كان الخير فيهم غالباً فلم يستحقوا الدمار بالعذاب\n وأما إذا تفرّقوا ما بقي شرّهم إلا خالصاً فوجب تدميرهم كما وقع في وقعة بدر\n ومن هذا يظهر تحقيق المعنى الثاني في قوله تعالى:\n[الأنفال\n الآية: 25] لغلبة الشرّ على المجموع حينئذ\n ولهذا قال أمير المؤمنين عليه السلام: \" كان في الأرض أمانان\n فرُفِعَ أحدهما وبقي الآخر\n فأما الذي رُفِعَ فهو رسول الله صلى الله عليه وسلم\n وأما الذي بقي فالاستغفار \" وقرأ هذه الآية\n { يصدّون عن المسجد الحرام } صورة لصدودهم وإعراضهم عن معناه الذي هو القلب بالركون إلى النفس وصفاتها\n وصدّهم المستعدّين عنه بإغرائهم على الأمور النفسانية واللذّات الطبيعية\n { وما كانوا أولياءه } لبعدهم عن الصفة وغلبة ظلمة النفس واستيلاء صفاتها عليهم\n واحتجابهم عنه بالكفر المستفاد من الدين { إن أولياؤه إلاّ المتقون } الذين اتّقوا صفات النفس وأفعالها { ولكن أكثرهم لا يعلمون } أنّ البيت صورة القلب الذي هو بيت الله بالحقيقة فلا يستحق ولايته إلا أهل التقوى من الموحدين دون المشركين",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا لَهُمْ أَلاَّ يُعَذِّبَهُمُ ٱللَّهُ } أي: أيّ شيء يمنع تعذيب الله إياهم مع أنهم مستحقون للعذاب؟ وكيف لا يعذبون هؤلاء المستكبرون المعاندون { وَهُمْ } من شدة عتوهم وعنادهم { يَصُدُّونَ } ويصرفون المؤمنين { عَنِ ٱلْمَسْجِدِ ٱلْحَرَامِ } والطواف نحو البيت مدعين ولايته؟! { وَ } الحال أنهم { مَا كَانُوۤاْ أَوْلِيَآءَهُ } أي: ليس لهم صلاحية الولاية في بيت الله\n لخباثة كفرهم وفسقهم\n وعدم لياقتهم { إِنْ أَوْلِيَآؤُهُ إِلاَّ ٱلْمُتَّقُونَ } الذين يجتنبون كبائر الإثم والفواحش\n ويتطهرون عن المعاصي والآثام مطلقاً { وَلَـٰكِنَّ أَكْثَرَهُمْ لاَ يَعْلَمُونَ } [الأنفال: 34] عدم ولايتهم ولياقتهم لها\n ومع ذلك يدعونها مكابرةً واستكباراً وإن كان بعضهم يعلم ولكن يعاند\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  ثم قال تعالى: { وما لهم ألا يعذبهم الله } أي: وأيُّ شيء يمنع من عذابهم؟ وكيف لا يعذبون { وهم يصُدُّون } الناس { عن المسجد الحرام }؟ أي: يمنعُون المتقين من المسجد الحرام\n ويصدون رسوله عن الوصول إليه\n { وما كانوا أولياءَهُ } المستحقين لولايته مع شركهم وكفرهم\n وهو ردٌّ لما كانوا يقولون: نحن ولاة البيت الحرام فنصد من نشاء ونُدخل من نشاء\n قال تعالى: { إنْ أولياؤُه إلا المتقون } أي: ما المستحقون لولايته إلا المتقون\n الذين يتقون الشرك والمعاصي ولا يعبدون فيه إلا الله\n ويعظمونه\n حق تعظيمه\n { ولكنَّ أكثرهم لا يعلمون } أن لا ولاية لهم عليه\n وإنما الولاية لأهل الإيمان\n وكأنه نبه بالأكثر على أن منهم من يعلم ذلك ويعاند أو أراد به الكل\n كما يراد بالقلة العدم\n قاله البيضاوي\n الإشارة: قد جعل الله رسوله صلى الله عليه وسلم أماناً لأمته ما دام حياً\n فلما مات صلى الله عليه وسلم بقيت سنته أماناً لأمته\n فإذا أُميتت سنته أتاهم ما يوعدون من البلاء والفتن\n وكذلك خواص خلفائه\n وهم العارفون الكبار\n فوجودهم أمان للناس\n فقد قالوا: إن الإقليم الذي يكون فيه القطب لا يصيبه قحط ولا بلاء\n ولا هرج ولا فتن لأنه أمان لذلك الإقليم\n خلافة عن رسول الله صلى الله عليه وسلم\n والله تعالى أعلم\n ثم ذكر تلاعبهم بالذين\n فقال: { وَمَا كَانَ صَلاَتُهُمْ عِندَ ٱلْبَيْتِ إِلاَّ مُكَآءً وَتَصْدِيَةً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:37",
      "similarity": 0.42915736735248566
    },
    {
      "verse": "4:160",
      "similarity": 0.42241083707366367
    },
    {
      "verse": "27:43",
      "similarity": 0.41627493473380894
    },
    {
      "verse": "47:1",
      "similarity": 0.4127309252907431
    },
    {
      "verse": "4:167",
      "similarity": 0.40708928917647835
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008034.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008034.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:34.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}