{
  "chapter": "الأنفال",
  "text": "وما لهم الا يعذبهم الله وهم يصدون عن المسجد الحرام وما كانوا۟ اولياءه ان اولياؤه الا المتقون ولكن اكثرهم لا يعلمون",
  "translations": [
    {
      "translation": "But why should Allah not punish them now when they bar access to the Masjid al-Haram? They are not its guardians. Only people who have taqwa can be its guardians. But most of them do not know that.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But what is there so special they have that God should not punish them when they obstruct people from the Holy Mosque, though they are not its (appointed) guardians? Its guardians could be only those who are pious and devout. But most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But what prevents Allah from chastising them now when they are hindering people from the Holy Mosque, even though they are not even its true guardians. For its true guardians are none but the God-fearing, though most of them do not know that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should God not punish them when they hinder people from entering the sacred mosque? They are not its true patrons. Only the righteous ones are its patrons, but most of the pagans do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what is with them that Allah should not punish them, whereas in fact they prevent from the Sacred Mosque and they are not worthy (of being the custodians) of it; only the pious are its befitting custodians, but most of them do not have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should not Allah punish them while they hinder (men) from Al-Masjid Al-Haram, and they are not its guardians None can be its guardians except those who have Taqwa, but most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what (excuse) have they that Allah should not chastise them while they hinder (men) from the Sacred Mosque and they are not (fit to be) guardians of it; its guardians are only those who guard (against evil), but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But what have they now, that God should not chastise them, when they are barring from the Holy Mosque, not being its protectors? Its only protectors are the godfearing; but most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What (plea) have they that Allah should not punish them, when they debar (His servants) from the Inviolable Place of Worship, though they are not its fitting guardians. Its fitting guardians are those only who keep their duty to Allah. But most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet why should God not punish them when they debar people from the Sacred Mosque, although they are not its guardians? Its rightful guardians are those who fear God, though most of them do not realize it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what aileth them that Allah should not chastise them when they are hindering people from the Sacred Mosque, whereas they are not even the keepers thereof - its keepers are none but the God-fearing-- but most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What [excuse] have they that Allah should not punish them, when they bar [the faithful] from the Holy Mosque, and they are not its custodians? Its custodians are only the Godwary, but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But what plea have they that Allah should not punish them, when they keep out (men) from the sacred Mosque - and they are not its guardians? No men can be its guardians except the righteous; but most of them do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should not Allah punish them while they stop (men) from Al-Masjid-al-Haram, and they are not its guardians? None can be its guardian except Al-Muttaqun (the pious - see V. 2:2), but most of them know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should Allah not punish them, when they have barred others from the Sacred Mosque, although they were not its guardians? Its only guardians are the cautious, though most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet why should God not punish them, when they are turning others away from the Sacred Mosque, although they are not its custodians? Its rightful custodians are the pious; but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But why should Allah not punish them while they obstruct [people] from al-Masjid al- Haram and they were not [fit to be] its guardians? Its [true] guardians are not but the righteous, but most of them do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:34] But what [plea] have they now, that God should not chastise them, with the sword, after your departure and that of the oppressed [believers] — if this [verse] is understood in accordance with the first opinion [that it refers to the idolaters asking forgiveness], then it abrogates the previous one, for God had chastised them at Badr and in other instances — when they bar, prevent the Prophet (s) and the Muslims, from the Sacred Mosque, [from] performing circumambulations there, though they are not its guardians?, as they claim? Its only [rightful] guardians are the God-fearing, but most of them do not know, that they have no [rightful] custodianship over it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(What (plea) have they that Allah should not punish them) that Allah should not destroy them after you left them, (when they debar) Muhammad (pbuh) and his Companions (from the Inviolable Place of Worship) and circumambulate it in the year of al-Hudaybiyyah, (though they are not its fitting guardians) guardians of the Mosque. (Its fitting guardians are those only who keep their duty to Allah) those who ward off disbelief, idolatry and indecencies: i.e. Muhammad (pbuh) and his Companions. (But most of them) all of them (know not) this nor believe in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وما لهم ألا يعذبهم الله } أي: ليس عدم نزول العذاب لعدم استحقاقهم لذلك بحسب أنفسهم، بل إنهم مستحقون بذواتهم لصدورهم وصدّهم المستعدين عن مقام القلب وعدم بقاء الخيرية فيهم ولكن يمنعه وجودك ووجود المؤمنين المستغفرين معك فيهم\n واعلم أن الوجود الإمكاني يتبع الخير الغالب، لأن الوجود الواجبي هو الخير المحض، فما رجح خيره على شره فهو موجود بوجوده بالمناسبة الخيرية، وإذا غلب الشرّ لم تبق المناسبة فلزم استئصاله وإعدامه فهم ما داموا على الصورة الاجتماعية كان الخير فيهم غالباً فلم يستحقوا الدمار بالعذاب\n وأما إذا تفرّقوا ما بقي شرّهم إلا خالصاً فوجب تدميرهم كما وقع في وقعة بدر\n ومن هذا يظهر تحقيق المعنى الثاني في قوله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا لَهُمْ أَلاَّ يُعَذِّبَهُمُ ٱللَّهُ } أي: أيّ شيء يمنع تعذيب الله إياهم مع أنهم مستحقون للعذاب؟ وكيف لا يعذبون هؤلاء المستكبرون المعاندون { وَهُمْ } من شدة عتوهم وعنادهم { يَصُدُّونَ } ويصرفون المؤمنين { عَنِ ٱلْمَسْجِدِ ٱلْحَرَامِ } والطواف نحو البيت مدعين ولايته؟! { وَ } الحال أنهم { مَا كَانُوۤاْ أَوْلِيَآءَهُ } أي: ليس لهم صلاحية الولاية في بيت الله\n لخباثة كفرهم وفسقهم\n وعدم لياقتهم { إِنْ أَوْلِيَآؤُهُ إِلاَّ ٱلْمُتَّقُونَ } الذين يجتنبون كبائر الإثم والفواحش\n ويتطهرون عن المعاصي والآثام مطلقاً { وَلَـٰكِنَّ أَكْثَرَهُمْ لاَ يَعْلَمُونَ } [الأنفال: 34] عدم ولايتهم ولياقتهم لها\n ومع ذلك يدعونها مكابرةً واستكباراً وإن كان بعضهم يعلم ولكن يعاند\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:37",
      "similarity": 0.42915736735248566
    },
    {
      "verse": "4:160",
      "similarity": 0.42241083707366367
    },
    {
      "verse": "27:43",
      "similarity": 0.41627493473380894
    },
    {
      "verse": "47:1",
      "similarity": 0.4127309252907431
    },
    {
      "verse": "4:167",
      "similarity": 0.40708928917647835
    }
  ]
}