{
  "chapter": "الأنفال",
  "text": "وما كان صلاتهم عند البيت الا مكاء وتصدية فذوقوا۟ العذاب بما كنتم تكفرون",
  "translations": [
    {
      "translation": "Their prayer at the House is nothing but whistling and clapping. So taste the punishment because you were kafir!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their worship in the House of God has been no more than whistling and clapping. So they have to taste the punishment for disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Prayer at the House is nothing but whistling and handclapping. Taste, then, this chastisement for your denying the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their (unbelievers) prayer at the mosque is nothing but whistling and clapping of hands. We shall tell them, \"Suffer torment for your disbelief.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their prayer near the Kaa’bah is nothing except whistling and clapping; “So now taste the punishment – the result of your disbelief.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Salah at the House was nothing but Muka' and Tasdiyah. Therefore taste the punishment because you used to disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their prayer before the House is nothing but whistling and clapping of hands; taste then the chastisement, for you disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their prayer at the House is nothing but a whistling and a clapping of hands -- therefore taste you now the chastisement for your unbelief!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their worship at the (holy) House is naught but whistling and hand-clapping. Therefore (it is said unto them): Taste of the doom because ye disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their prayers at the Sacred House are nothing but whistling and clapping of hands. \"So taste the punishment because of your denial.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And naught was their prayer at the House but whistling and hand-clapping. Taste then the torment for ye were to disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their prayer at the House is nothing but whistling and clapping. So taste the punishment because of what you used to defy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their prayer at the House (of Allah) is nothing but whistling and clapping of hands: (Its only answer can be), \"Taste ye the penalty because ye blasphemed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Salat (prayer) at the House (of Allah, i.e. the Ka'bah at Makkah) was nothing but whistling and clapping of hands. Therefore taste the punishment because you used to disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their prayers at the Sacred House are nothing but whistling and clapping. Therefore, taste the punishment for your disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their prayer at the House was nothing but whistling and clapping—so taste the punishment for your blasphemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their prayer at the House was not except whistling and handclapping. So taste the punishment for what you disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:35] And their prayer at the [Sacred] House is nothing but whistling and hand-clapping: in other words they do this in place of the prayer which they were ordered to perform — therefore taste now, at Badr, the chastisement for your unbelief!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And their worship at the (holy) House is naught but whistling) like the whistling of a bird (and hand clapping. Therefore (it is said unto them): Taste of the doom) on the Day of Badr (because you disbelieve) in Muhammad (pbuh) and the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلاَّ مُكَآءً وَتَصْدِيَةً } فالمُكاءُ: الصَّوتُ والصّفيرُ\n والصَّوتُ يَصْفِرُ كَمَا يَصْفِرُ المُكاءُ، وهو طَائِرٌ، والتَصْدِيَةُ التـَصْفِيقُ بالأَكُفِ\n\n\n\n\nوقوله تعالى: { فَذُوقُواْ } معناهُ فَجَرِّبُوا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {Except a cry and a protection} So the cry is the sound and the silence.\n\n\nAnd the sound grows fainter as the echo does, it is like a bird, and the act of silenced applause with the palms.\n\n\nAnd His saying, {Taste}, means, \"So try.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما لم يصلحوا لولاية البيت { مَا كَانَ صَلاَتُهُمْ } ودعاؤهم { عِندَ ٱلْبَيْتِ } المعدّ للتوجه والتقرب نحو الحق على وجه الخضوع والانكسار، والتذلل والافتقار { إِلاَّ مُكَآءً } صفيراً وصداء { وَتَصْدِيَةً } تصفيقاً وتبختراً، مع أنهم يدعون ولايته ورعاية حرمته، وما ذكل إلا من أمارات الاستهانة والاستخفاف المسلتزم للكفر { فَذُوقُواْ ٱلْعَذَابَ } أيها المنهمكون في الضلال { بِمَا كُنتُمْ تَكْفُرُونَ } [الأنفال: 35] في النشاة الأولى والأخرى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "80:6",
      "similarity": 0.48546876146017937
    },
    {
      "verse": "14:37",
      "similarity": 0.03592836908344325
    },
    {
      "verse": "41:50",
      "similarity": 0.03224079846715989
    },
    {
      "verse": "10:87",
      "similarity": 0.03206854467378009
    },
    {
      "verse": "33:33",
      "similarity": 0.02978806343488896
    }
  ]
}