{
  "chapter": "الأنفال",
  "text": "ليميز الله الخبيث من الطيب ويجعل الخبيث بعضه على بعض فيركمه جميعا فيجعله فى جهنم او۟لئك هم الخسرون",
  "translations": [
    {
      "translation": "so that Allah can sift the bad out from the good, and pile the bad on top of one another, heaping them all together, and tip them into Hell. They are the lost.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That God may separate the bad from the good, and link the wicked together and cast them into Hell. These are verily the people who will lose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that Allah may separate the bad from the good, and join together all those who are bad into a pile one upon another, and cast them into Hell. They, it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will separate the wicked from the pure and will pile the wicked ones on top of one anothcr to be cast into hell. They are indeed lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that Allah may separate the filthy from the pure, and placing the filthy atop one another, make a heap and throw them into hell; it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that Allah may distinguish the wicked from the good, and put the wicked one over another, heap them together and cast them into Hell. Those! it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah might separate the impure from the good, and put the impure, some of it upon the other, and pile it up together, then cast it into hell; these it is that are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that God may distinguish the corrupt from the good, and place the corrupt one upon another, and so heap them up all together, and put them in Gehenna; those are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Allah may separate the wicked from the good, The wicked will He place piece upon piece, and heap them all together, and consign them unto hell. Such verily are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that God may separate the bad from the good, He will heap the wicked one upon another and then cast them into Hell. These will surely be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that Allah may distinguish the vile from the good; and the vile He shall place one upon anot her, and shall pile it all together, and shall place it into Hell. Those! it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that Allah may separate the bad ones from the good, and place the bad on one another, and pile them up together, and cast them into hell. It is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that Allah may separate the impure from the pure, put the impure, one on another, heap them together, and cast them into Hell. They will be the ones to have lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that Allah may distinguish the wicked (disbelievers, polytheists and doers of evil deeds) from the good (believers of Islamic Monotheism and doers of righteous deeds), and put the wicked (disbelievers, polytheists and doers of evil deeds) one on another, heap them together and cast them into Hell. Those! it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in order that Allah will separate the wicked from the good. He will heap the wicked one upon another, and then heap them together and cast them in Gehenna those shall be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That God may distinguish the bad from the good, and heap the bad on top of one another, and pile them together, and throw them in Hell. These are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[This is] so that Allah may distinguish the wicked from the good and place the wicked some of them upon others and heap them all together and put them into Hell. It is those who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:37] that God may distinguish (read li-yamīza, or li-yumayyiza, is semantically connected to takūnu, ‘it will be’ [from the previous verse]) the wicked, the disbeliever, from the good, the believer, and place the wicked one upon another, and heap them up all together and put them in Hell: those, they are the losers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That Allah may separate the wicked from the good) the disbeliever from the believer, the hypocrite from the sincere and the corrupt from the righteous. (The wicked will He place piece upon piece) gather together, (and heap them all together) i.e. the wicked, (and consign them) cast (unto hell. Such verily are the losers) in that they be punished.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَيَرْكُمَهُ جَمِيعاً } معنا فَيجمعُهُ جَمِيعاً بَعضُهُ فَوقَ بَعضٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإنَّما يفعل بهم سبحانه هذا { لِيَمِيزَ ٱللَّهُ } الناقد البصير لأعمال عباده { ٱلْخَبِيثَ } المنغمس في الكفر والضلال { مِنَ ٱلطَّيِّبِ } الصافي عن شوب الكدر مطلقاً { وَ } بعد فصله وتمييزه { يَجْعَلَ ٱلْخَبِيثَ } جملة واحدة، بأن يضم { بَعْضَهُ عَلَىٰ بَعْضٍ فَيَرْكُمَهُ } ويجمعه { جَمِيعاً فَيَجْعَلَهُ } ويطرحه بعد جمعه وتركيمه { فِي جَهَنَّمَ } الإمكان وجحيم الخذلان، وبالجملة: { أُوْلَـٰئِكَ } البعداء المنعمسون في خباثة الكفر والطغيان { هُمُ ٱلْخَاسِرُونَ } [الأنفال: 37] المقصورون على الخسران الأبدي، والمجبولون على الحرمان السرمدي، ليس لهم نصيب من مستلذات الجنان، وحظ من لقاء الرحيم الرحمن الكريم المنَّان\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}