{
  "chapter": "الأنفال",
  "text": "قل للذين كفروا۟ ان ينتهوا۟ يغفر لهم ما قد سلف وان يعودوا۟ فقد مضت سنت الاولين",
  "translations": [
    {
      "translation": "Say to those who are kafir that if they stop, they will be forgiven what is past; but if they return to it, they have the pattern of previous peoples in the past.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You tell the unbelievers in case they desist whatever has happened will be forgiven them. If they persist, they should remember the fate of those who have gone before them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[O Prophet!] Tell the unbelievers that if they desist from evil, their past shall be forgiven and if they revert to their past ways, then it is well known what happened with the people of the past.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad, tell the unbelievers, if you give up your evil behavior, God will forgive whatever you have done in the past. But if you transgras again, your fate will be the same as that of those (unbelievers) who lived before you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the disbelievers that if they desist, what has passed will be forgiven to them; and if they do the same, the tradition of former people has already passed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to those who have disbelieved, if they cease, their past will be forgiven. But if they return (thereto), then the examples of those (punished) before them have already preceded (as a warning).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to those who disbelieve, if they desist, that which is past shall be forgiven to them; and if they return, then what happened to the ancients has already passed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the unbelievers, if they give over He will forgive them what is past; but if they return, the wont of the ancients is already gone!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell those who disbelieve that if they cease (from persecution of believers) that which is past will be forgiven them; but if they return (thereto) then the example of the men of old hath already gone (before them, for a warning).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell those who are bent on denying the truth that if they desist, their past shall be forgiven, but if they persist in sin, they have an example in the fate of those who went before.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou unto those who have disbelieved: if they desist, that which is past shall be forgiven them, and if they return, then already gone forth is the dispensation of the ancients.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the faithless, if they cease [their belligerence against the Muslims], what is already past shall be forgiven them. But if they resume [their hostilities], then the precedent of the predecessors has already come to pass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the Unbelievers, if (now) they desist (from Unbelief), their past would be forgiven them; but if they persist, the punishment of those before them is already (a matter of warning for them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to those who have disbelieved, if they cease (from disbelief) their past will be forgiven. But if they return (thereto), then the examples of those (punished) before them have already preceded (as a warning).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell the unbelievers that if they abandon their ways He will forgive them what is past; but, if they return, that was indeed the way of their forefathers who have passed away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to those who disbelieve: if they desist, their past will be forgiven. But if they persist—the practice of the ancients has passed away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to those who have disbelieved [that] if they cease, what has previously occurred will be forgiven for them. But if they return [to hostility] - then the precedent of the former [rebellious] peoples has already taken place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:38] Say to the disbelievers, such as Abū Sufyān and his companions, that if they desist, from unbelief and from waging war against the Prophet (s), that which is past, of their deeds, will be forgiven them; but if they return, to waging war against him, the way of [dealing with] the ancients has already gone before!, that is, Our way [in dealing] with them, by destroying them: We will do the same with these ones.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجرى هذا الكلام على عادة القرآن في تعقيب الترهيب بالترغيب ، والوعيد بالوعد ، والعكس ، فأنذرهم بما أنذر ، وتَوعّدَهم بما توعد ثم ذكّرهم بأنهم متمكنون من التدارك وإصلاح ما أفسدوا ، فأمر الله نبيه صلى الله عليه وسلم بأن يقول لهم ما يفتح لهم باب الإنابة .والجملة استيناف يصح جعله بيانياً لأن ما تقدم بين يديه من الوعيد وقلة الاكتراث بشأنهم ، وذكر خيبة مساعيهم ، مما يثير في أنفُس بعضَهم والسامعين أن يتساءلوا عما إذا بقي لهم مخلص ينجيهم من ورطتهم التي ارتبقوا فيها ، فأمر الرسول بأن يقول لهم هذا المقال ليريهم أن باب التوبة مفتوح ، والإقلاع في مكنتهم .وأسند الفعل في الجملة المحكية بالقول إلى ضمير الغائبين لأنه حكاية بالمعنى روعي فيها جانب المخاطب بالأمر تنبيهاً على أنه ليس حَظه مجرد تبليغ مقالة ، فجُعل حَظه حظ لمخبر بالقضية الذي يُراد تقررها لديه قبل تبليغها ، وهو إذا بلغ إليهم يبلغ إليهم ما أعلم به وبُلغ إليه ، فيكون مخبراً بخبر وليس مجرد حامل لرسالة .والمراد بالانتهاء : الانتهاء عن شيء معلوم دَل عليه وصف الكفر هنا وما تقدمه من أمثاله وآثاره من الانفاق للصد عن سبيل الله ، أي إن ينتهوا عن ذلك ، وإنما يكون الانتهاء عن ذلك كله بالإيمان .و { ما قد سلف } هو ما أسلفوه من الكفر وآثاره ، وهذا ، وإن كان قضية خاصة بالمشركين المخاطبين ، فهو شامل كل كافر لتساوي الحال .ولفظ الغفران حقيقة شرعية في العفو عن جزاء الذنوب في الآخرة ، وذلك مهيع الآية فهو معلوم منها بالقصد الأول لا محالة ، ويلحق به هنا عذاب الله في الدنيا لقوله : { فقد مضت سنة الأولين }.وَاستنبط أيمتنا من هذه الآية أحكاماً للأفعال والتبعات التي قد تصدر من الكافر في حال كفره فإذا هو أسلم قبل أن يؤاخذ بها هل يُسقط عنه إسلامُه التبعات بها .وذلك يرجع إلى ما استقريته وأصّلته في دلالة آي القرآن على ما يصح أن تدل عليه ألفاظها وتراكيبها في المقدمة التاسعة من هذا التفسير ، فروى ابن العربي في «الأحكام» أن ابن القاسم ، وأشهب ، وابن وهب ، رووا عن مالك في هذه الآية : أن من طلّق في الشرك ثم أسلم فلا طلاق عليه ، ومن حلف يميناً ثم أسلم فلا حنث عليه فيها ، وروى عن مالك : إنما يعني عز وجل ما قد مضى قبل الإسلام من مال أو دم أو شيء ، قال ابن العربي وهو الصواب لعموم قوله : { إن ينتهوا يغفر لهم ما قد سلف } ، وإن ابن القاسم ، وابن وهب ، رويا عن مالك أن الكافر إذا افترى على مسلم أو سرق ثم أسلم يقام عليه الحد ، ولو زنى ثم أسلم أو اغتصب مسلمة ثم أسلم لسقط عنه الحد تفرقة بين ما كان حقاً لله محْضاً وما كان فيه حق للناس .وذكر القرطبي عن ابن المنذر : أنه حكى مثل ذلك عن الشافعي ، وأنه احتج بهذه الآية ، وفي «المدونة» تسقط عنه الحدود كلها .وذكر في «الكشاف» عن أبي حنيفة أن الحربي إذا أسلم لم تبق عليه تبعة ، وأما الذميّ فلا يلزمه قضاء حقوق الله وتبقى عليه حقوق الآدميين ، واحتج بهذه الآية ، وفي كتب الفتوى لعلماء الحنفية بعض مخالفة لهذا ، وحَكوا في المرتد إذا تاب وعاد إلى الإسلام أنه لا يلزمه قضاء ما فَاته من الصلاة ولا غرْم ما أصاب من جنايات ومتلفات . وعن الشافعي يلزم ذلك كله وهو ما نسبه ابن العربي إلى الشافعي بخلاف ما نسبه إليه ابن المنذر كما تقدم وعن أبي حنيفة يسقط عنه كل حق هو لله ولا يسقط عنه حق الناس وحجة الجميع هذه الآية تعميماً وتخصيصاً بمخصصات أخرى .وفي قوله تعالى : { إن ينتهوا يغفر لهم ما قد سلف } مُحسَن بديعي وهو الاتزان لأنه في ميزان الرجز .والمراد بالعَود الرجوع إلى ما هم فيه من مناوأة الرسول صلى الله عليه وسلم والمسلمين ، والتجهز لحربهم ، مثل صنعهم يوم بدر ، وليس المراد عودهم إلى الكفر بعد الانتهاء لأن مقابلته بقوله : { إن ينتهوا } تقتضي أنه ترديد بين حالتين لبيان ما يترتب على كل واحدة منهما وهذا كقول العرب بعضهم لبعض : «أسلِمْ أنتَ أم حرب» ولأن الذين كفروا لما يفارقوا الكفَر بعدُ فلا يكون المراد بالعود عودَهم إلى الكفر بعد أن يسلموا .والسنة العادة المألوفة والسيرة . وقد تقدم في قوله تعالى : { قد خلت من قبلكم سنن } في \\[ آل عمران : 137 \\].ومعنى { مضت } تقدمت وعَرَفَها الناس .وهذا الخبر تعريض بالوعيد بأنهم سيلقون ما لقيه الأولون ، والقرينةُ على إرادة التعريض بالوعيد أن ظاهر الإخبار بمضي سنة الأولين ، وهو من الإخبار بشيء معلوم للمخبَرين به ، وبهذا الاعتبار حسن تأكيده بقدْ إذ المراد تأكيد المعنى التعريضي .وبهذا الاعتبار صح وقوع قوله : { فقد مضت سنة الأولين } جزاء للشرط . ولولا ذلك لما كان بين الشرط وجوابه ملازمة في شيء .والأولون : السابقون المتقدمون في حالة ، والمراد هنا الأمم التي سبقت وعرفوا أخبارهم أنهم كذبوا رسل الله فلقوا عذاب الاستيصال مثل عاد وثمود قال تعالى : { فهل يَنظرون إلاّ سُنّة الأولين } \\[ فاطر : 43 \\].ويجوز أن المراد بالأولين أيضاً السابقون للمخاطبين من قومهم من أهل مكة الذين استأصلهم السيف يوم بدر ، وفي كل أولئك عبرة للحاضرين الباقين ، وتهديد بأن يصيروا مصيرهم .\n\n",
      "translations": [
        {
          "translation": "(Tell) Muhammad, (those who disbelieve) Abu Sufyan and his host (that if they cease) disbelief, idolatry, idol worship and fighting Muhammad (pbuh) (that which is past) of disbelief, idolatry, idol worship and fighting against the Prophet (pbuh) (will be forgiven them; but if they return (thereto)) i.e. to fighting Muhammad (pbuh) (then the example of the men of old hath already gone) that victory is given to Allah's friends against their enemies, such as was the case on the Day of Badr.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُل } يا أكمل الرسل { لِلَّذِينَ كَفَرُوۤاْ } تبشيراً لهم ووعداً: لا ييأس من روح الله وسعة جوده ورحمته عمَّا هم عليه من الكفر والضلال\n بل { إِن يَنتَهُواْ } ويعرضوا عن الكفر والإلحاد نحو الباطل الزائغ\n والميل إلى البدع والأهواء الفاسدة الكاسدة من تكذيب الكتب والرسل بالإيمان الخالص عن ظهر القلب\n ورفع المنازعة والمخاصمة مع رسول الله صلى الله عليه وسلم ومن تابعه { يُغَفَرْ لَهُمْ } ويعفى عنهم { مَّا قَدْ سَلَفَ } من الجرائم مطلقاً { وَإِنْ يَعُودُواْ } على كفرهم ونزاعهم\n ويرتدوا بعد إيمانهم وصلحهم { فَقَدْ مَضَتْ سُنَّتُ الأَوَّلِينَ } [الأنفال: 38] أي: الأمم الهالكة الذين كفروا بالله\n وخرجوا على رسله فأصابهم ما أصابهم\n وكذلك يصيبهم مثل ما أصابهم فليتوقعوا\n\n\n{ وَ } بعدما خرجوا من عهدهم ونقضوا ميثاقهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { قل للذين كفروا } كقريش وغيرهم: { إن ينتهوا } عن الكفر ومعاداة الرسول بالدخول في الإسلام، { يغفر لهم ما قد سلف } من ذنوبهم، ولو عظمت، { وإن يعودوا } إلى الكفر وقتاله { فقد مضت سُنَّتُ الأولين } أي: مضت عادتي مع الذين تحزبُوا على الأنبياء بالتدمير والهلاك، كعاد وثمود وأضرابهم، وكما فعل بهم يوم بدر، فليتوقعوا مثل ذلك، وهو تهديد وتخويف. الإشارة: قل للمنهمكين في الذنوب والمعاصي: لا تقنطوا من رحمتي، فإني لا يتعاظمني ذنب أغفره، فإن تنتهوا أغفر لكم ما قد سلف، وأنشدوا:\nوللشافعي رضي الله عنه:\nفإن لم ينته المنهمك في الهوى فقد مضت سُنة الله فيه بالطرد والإبعاد، ويخاف عليه سوء الختام، والعياذ بالله. ثم أمر بجهاد من لم ينته عن كفره، فقال: { وَقَاتِلُوهُمْ حَتَّىٰ لاَ تَكُونَ فِتْنَةٌ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:8",
      "similarity": 0.5125472748866398
    },
    {
      "verse": "43:56",
      "similarity": 0.4282536838984326
    },
    {
      "verse": "10:30",
      "similarity": 0.32487596536004604
    },
    {
      "verse": "15:65",
      "similarity": 0.32435379453134555
    },
    {
      "verse": "69:24",
      "similarity": 0.3235307669864929
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008038.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008038.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:38.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}