{
  "chapter": "الأنفال",
  "text": "او۟لئك هم المؤمنون حقا لهم درجت عند ربهم ومغفرة ورزق كريم",
  "translations": [
    {
      "translation": "They are in truth the muminun. They have high ranks with their Lord and forgiveness and generous provision.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are true believers. There are for them (high) ranks with their Lord, and pardon and noble provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such people are indeed true believers. They have high ranks with their Lord, and forgiveness for their sins and an honourable sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are the true believers. Their reward from their Lord will be high ranks, forgiveness, and a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the true Muslims; for them are ranks before their Lord, and forgiveness and an honourable sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who are the believers in truth. For them are grades of dignity with their Lord, and forgiveness and a generous provision (Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the believers in truth; they shall have from their Lord exalted grades and forgiveness and an honorable sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those in truth are the believers; they have degrees with their Lord, and forgiveness, and generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they who are in truth believers. For them are grades (of honour) with their Lord, and pardon, and a bountiful provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are the true believers. They have a high standing with their Lord, His forgiveness and an honourable provision made for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those: it is they who are the true believers. For them are degrees with their Lord and forgiveness and a provision honourable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who are truly the faithful. They shall have ranks near their Lord, forgiveness and a noble provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such in truth are the believers: they have grades of dignity with their Lord, and forgiveness, and generous sustenance:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who are the believers in truth. For them are grades of dignity with their Lord, and Forgiveness and a generous provision (Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those are, in truth, the believers. They shall have degrees with their Lord and forgiveness, and a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the true believers. They have high standing with their Lord, and forgiveness, and a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the believers, truly. For them are degrees [of high position] with their Lord and forgiveness and noble provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:4] Those, described in the way mentioned, are the true, the real, believers, without doubt. For them are ranks, stations in Paradise, with their Lord, and forgiveness, and generous provision, in Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجملة مؤكدة لمضمون جملة : { إنما المؤمنون الذين إذا ذكر الله } \\[ الأنفال : 2 \\] إلى آخرها ولذلك فصلت .وعُرف المسند إليه بالإشارة لوقوعه عقب صفات لتدل الإشارة على أنهم أحرياء بالحكم المسند إلى اسم الإشارة من أجل تلك الصفات ، فكان المخبرَ عنهم قد تميزوا للسامع بتلك الصفات فصاروا بحيث يشار إليهم .وفي هذه الجملة قصر آخر يشبه القصر الذي قوله : { إنما المؤمنون } \\[ الأنفال : 2 \\] حيث قصر الإيمان مرة أخرى على أصحاب تلك الصفات ولكنه قرن هنا بما فيه بيان المقصور وهو أنهم المؤمنون الأحقاء بوصف الإيمان .والحق أصله مصدر حَق بمعنى ثبت واستعمل استعمال الأسماء للشيء الثابت الذي لا شك فيه قال تعالى : { وعد الله حقاً ومن أصدق من الله قيلاً } \\[ النساء : 122 \\].ويطلق كثيراً ، على الكامل في نوعه ، الذي لاسترة في تحقق ماهية نوعه فيه ، كما يقول أحد لابنه البار به : أنت ابني حَقاً ، وليس يريد أن غيره من أبنائه ليسوا لرشدة ولكنه يريد أنت بنوتك واضحة آثارها ، ويطلق الحق على الصواب والحكمة فاسم الحق يجمع معنى كمال النوع .ولكل صيغة قصر : منطوق ومفهوم ، فمنطوقها هنا أن الذين جَمعوا ما دلت عليه تلك الصلات هم مؤمنون حقاً ، ومفهومها أن من انتفى عنه أحدُ مدلولات تلك الصلات لم يكن مؤمناً كاملاً ، وليس المقصود أن من ثبتت له إحداها كان مؤمناً كاملاً ، إذا لم يتصف ببقية خصال المؤمنين الكاملين ، فمعنى أولئك هم المؤمنون حقا : أن من كان على خلاف ذلك ليس بمؤمن حقا أي كاملاً .وهذا تأويل للكلام دعا إليه الجمع بين عديد الأدلة الواردة في الكتاب والسنة القولية والفعلية من ثبوت وصف الإيمان لكل من أيقن بأن الله منفرد بالإلهية وأن محمداً رسول الله إلى الناس كافة ، فتلك الأدلة بلغت مبلغ التواتر المعنوي المحصّل للعلم الضروري بأن الإخلال بالواجبات الدينية لا يسلب صفة الإيمان والإسلام عن صاحبه ، فليس حمل القصر على الادعائي هنا مجردَ صنع باليد ، أو ذهاب مع الهوى على أن شأن الاتصاف ببعض صفات الفضائل أن يتناسق مع نظائِرها فمن كان بحيث إذا ذكر الله وجل قلبه لا بد أن يكون بحيث إذا تُليت عليه آيات الله زادته إيماناً ، فهذا تحقيق معنى القصرين .ومما يزيد هذا المعنى وضوحاً ما روَى الطبراني ، عن الحارث بن مالك الأنصاري ، أن النبي صلى الله عليه وسلم قال للحارث بن مالك الأنصاري يا حارث كيف أصبحت قال أصبحت مؤمناً حقاً قال إعلم ما تقول أو انظرُ ما تقول إن لكل شيء حقيقة فما حقيقة إيمانك قال عزَفتْ نفسي عن الدنيا فأسهرتُ ليلي ، وأظمأتُ نهاري ، وكأني أنظر إلى عرش ربي ، وكأني أنظر إلى أهل الجنة يتزاورون ، وكأني أسمع عُوراء أهل النار ، فقال له يا حارث عرفتَ فالزَمْ ثلاثاً وهو حديث ضعيف وإن كثرتْ طرقه .فقول الحارث «أصبحت مؤمناً حقاً» ظاهر في أنه أراد منه مؤمناً كاملاً وكذلك قول النبي صلى الله عليه وسلم \" إن لكل شيء حقيقة فما حقيقة إيمانك \" ظاهر في أنه سأله عن ماكان به إيمانه كاملاً ولم يسأله عن أصل ماهية الإيمان لأنه لم يكن يشك في أنه من عداد المؤمنين .ومن هذا المعنى ما ذكره القرطبي وغيره أن رجلاً سأل الحسن البصري فقال له يا أبا سعيد أمومنٌ أنتَ فقال : «الإيمان إيماناننِ فإن كنتَ تسألني عن الإيمان بالله وملائكته وكتبه ورسله والجنة والنار والبعث والحساب ، فأنا به مؤمن ، وإن كنت تسألني عن قول الله تبارك وتعالى : { إنما المؤمنون الذين إذا ذكر الله وجلت قلوبهم } إلى قوله { أولئك هم المؤمنون حقا } \\[ الأنفال : 2 4 \\] فوالله ما أدري أنا منهم أم لا؟ .وانتصب { حقاً } على أنه مفعول مطلق صفة لمصدر محذوف دل عليه { المؤمنون } أي إيماناً حقاً ، أو على أنه موكدٌ لمضمون جملة { أولئك هم المؤمنون } أي ثبوت الإيمان لهم حق لا شبهة فيه ، وهو تحقيق لمعنى القصر بما هو عليه من معنى المبالغة ، وليس تأكيداً لرفع المجاز عن القصر حتى يصير بالتأكيد قصراً حقيقياً ، بل التأكيد بمعنى المبالغة اعتماداً على القرائن ، والأحسن أن يكون منصوباً على الحال من ضمير { هم } فيكون المصدر مؤولاً باسم الفاعل كما هو الشأن في وقوع المصدر حالاً مثل { أو تأتيهم الساعة بغتة } \\[ يوسف : 107 \\] ، أي محققين إيمانهم بجلائل أعمالهم ، وقد تقدم مثل هذا المصدر في قوله : { خالدين فيها أبداً وعد الله حقا } في سورة \\[ النساء : 122 \\].( وجملة : { لهم درجات } خبر ثان عن اسم الإشارة .واللام للاستحقاق ، أي درجات مستحقة لهم ، وذلك استعارة للشرف والكرامة عند الله ، لأن الدرجات حقيقتها ما يتخذ من بناء أو أعواد لإمكان تخطي الصاعد إلى مكان مرتفع مُنقطع عن الأرض ، كا تقدم عند قوله تعالى : { وللرجال عليهن درجةٌ } في سورة \\[ البقرة : 228 \\] ، وفي غير موضع ، وتستعار الدرجة لعناية العظيم ببعض من يصطفيهم فتشبه العناية بالدرجة تشبيه معقول بمحسوس ، لأن الدنو من العُلْو عُرفاً يكون بالصعود إليه في الدرجات ، فشبه ذلك الدنو بدرجات وقوله : { عند ربهم } قرينة المجاز .ويجوز أن تستعار الدرجة هنا لمكان جلوس المرتفع كدرجة المنبر كما في قوله تعالى : { وللرجال عليهن درجةٌ } \\[ البقرة : 228 \\] والقرينة هي .وقد دل قوله : { عند ربهم } على الكرامة والشرف عند الله تعالى في الدنيا بتوجيه عنايته في الدنيا ، وفي الآخرة بالنعيم العظيم .وتنوين { درجات } للتعظيم لأنها مراتب متفاوتة .والرزق اسم لما يُرزقُ أي يعطى للانتفاع به ، ووصفه بكريم بمعنى النفيس فهو وصف حقيقي للرزق ، وفعله كرُمَ بضم العينَ ، والكرم في كل شيء الصفات المحمودية في صنفه أو نوعه كما في قوله تعالى : { إني ألْقيَ إلي كتابٌ كريمٌ } في سورة \\[ النمل : 29 \\] ، ومنه إطلاق الكرم على السخاء والجود ، والوصفُ منه كريم ، وتصح إرادته هنا على أن وصف الرزق به مجازٌ عقلي ، أي كريم رازقه ، فإن الكريم يرزق بوفرة وبغير حساب .\n\n",
      "translations": [
        {
          "translation": "(Those are they who are in truth believers) they are truly and certainly believers. (For them are grades (of honour)) ranks of merit (with their Lord) in the Hereafter, (and pardon) for the sins they committed in the life of this world, (and a bountiful provision) a fair reward in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { أولئك هم المؤمنون حقاً } الإيمان الحقيقي { لهم درجات عند ربهم } من مراتب الصفات وروضات جنّات القلب { ومغفرة } من ذنوب الأفعال { ورزق كريم } من باب تجليات الصفات وعلومها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أُوْلۤـٰئِكَ } السعداء المقبولون عند الله { هُمُ ٱلْمُؤْمِنُونَ } المتحققون بمرتبة الإذعان والإيقان { حَقّاً } ثابتاً مستقراً بلا اضطراب وتزلزل { لَّهُمْ دَرَجَاتٌ } عظيمة { عِندَ رَبِّهِمْ } من درجات العلم والعين والحق { وَمَغْفِرَةٌ } ستر لأنانيتهم وتعيناتهم { وَرِزْقٌ كَرِيمٌ } [الأنفال: 4] معنوي بدلها\n يرزقون بها فرحين عنايةً من الله\n لأن من توجه نحو الحق\n ومال إلى جانبه ميلاً مسقطاً للتوجه إلى الغير مطلقاً\n وخرج عن لوازم الإمكان إلى حيث ينفق ويبذل جميع ما نسب إليه من أموال الدنيا إعراضاً عنها\n مخرجاً محبتها من قلبها أعطلى له سبحانه بدل إخلاصه من الرزق المعنوي ما لا عينٌ رأت ولا أذنٌ سمعت\n ولا خطر عى قلب بشر",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أولئك هم المؤمنون حقاً } لأنهم حققوا إيمانهم بأن ضموا إليه مكارم أعمال القلب\n من الخشية والإخلاص والتوكل\n ومحاسن أعمال الجوارح التي هي العِيار عليها\n كالصلاة والصدقة\n { لهم درجات عند ربهم } أي كرامات وعلو منزلة\n أو درجات الجنة يرتقونها بأعمالهم\n { ومغفرة } لما فرط من ذنوبهم\n { ورزقٌ كريم } أعده لهم في الجنة\n لا ينقطع مدده\n ولا ينتهي أمده\n بمحض الفضل والكرم\n الإشارة: الانفال الحقيقة هي المواهب التي ترد على القلوب\n من حضرة الغيوب من العلوم اللدنية والأسرار الربانية\n لا تزال تتوالى على القلوب\n حتى تغيب عما سوى المحبوب\n فيستغني غناء لا فقر معه أبداً\n وهذه غنائم خصوص الخصوص\n وغنائم الخصوص: هي القرب من الحبيب\n ومراقبة الرقيب\n بكمال الطاعة والجد والاجتهاد\n وهذه غنائم العباد والزهاد\n وغنائم عوام أهل اليمين: مغفرة الذنوب\n والستر على العيوب\n والنجاة من النار\n ومرافقة الأبرار\n وفي الحديث عنه صلى الله عليه وسلم أنه قال:\n \" مَنْ قَالَ عِندَ نَوْمِهِ: أسْتَغْفِر اللِّه َالعَظِيمَ الذي لا إله إلاّ هُوَ الحَيُّ القَيّومَ وَأَتُوبُ إِليْهِ\n غَفَرَ الله ذُنُوبَهُ\n وَإِنْ كَانَتْ مِثْلَ زَبَد البَحَرِ\n وعَدَدَ أَيَّامِ الدُّنْيَا \"\n \nقال الشيخ زروق: وهذه هي الغنيمة الباردة\n وهذه الأمور بيد الله وبواسطة رسول الله صلى الله عليه وسلم وهو معنى قوله { قل الأنفال لله والرسول } ثم دل على موجباتها فقال: { فاتقوا الله وأصلحوا ذات بينكم\n\n\n } الآية\n وقوله تعالى: { زادتهم إيماناً }: اعْلم أن الإيمان على ثلاثة أقسام: إيمان لا يزيد ولا ينقص وهو إيمان الملائكة\n وإيمان يزيد وينقص\n وهو إيمان عامة المسلمين\n وإيمان يزيد ولا ينقص وهو إيمان الأنبياء والرسل\n ومن كان على قدمهم من العارفين الروحانيين الراسخين في علم اليقين\n ومن تعلق بهم من المريدين السائرين\n بالطاعة والمعصية لتيقظهم وكمال توحيدهم\n وفي الحكم: \" وربما قضى عليك بالذنب فكان سبب الوصول \" وقال أيضاً: \" معصية أورثت ذلاً وافتقاراً خير من طاعة أورثت عزاً واستكباراً \" والله تعالى أعلم\n ثم تكلم على الخروج إلى غزوة بدر\n فقال: { كَمَآ أَخْرَجَكَ رَبُّكَ مِن بَيْتِكَ بِٱلْحَقِّ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:96",
      "similarity": 0.6918594801418709
    },
    {
      "verse": "3:163",
      "similarity": 0.6654079428999988
    },
    {
      "verse": "20:75",
      "similarity": 0.5855286347310293
    },
    {
      "verse": "46:19",
      "similarity": 0.5723912134845216
    },
    {
      "verse": "6:132",
      "similarity": 0.5459490686121589
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}