{
  "chapter": "الأنفال",
  "text": "او۟لئك هم المؤمنون حقا لهم درجت عند ربهم ومغفرة ورزق كريم",
  "translations": [
    {
      "translation": "They are in truth the muminun. They have high ranks with their Lord and forgiveness and generous provision.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are true believers. There are for them (high) ranks with their Lord, and pardon and noble provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such people are indeed true believers. They have high ranks with their Lord, and forgiveness for their sins and an honourable sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are the true believers. Their reward from their Lord will be high ranks, forgiveness, and a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the true Muslims; for them are ranks before their Lord, and forgiveness and an honourable sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who are the believers in truth. For them are grades of dignity with their Lord, and forgiveness and a generous provision (Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the believers in truth; they shall have from their Lord exalted grades and forgiveness and an honorable sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those in truth are the believers; they have degrees with their Lord, and forgiveness, and generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they who are in truth believers. For them are grades (of honour) with their Lord, and pardon, and a bountiful provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are the true believers. They have a high standing with their Lord, His forgiveness and an honourable provision made for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those: it is they who are the true believers. For them are degrees with their Lord and forgiveness and a provision honourable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who are truly the faithful. They shall have ranks near their Lord, forgiveness and a noble provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such in truth are the believers: they have grades of dignity with their Lord, and forgiveness, and generous sustenance:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who are the believers in truth. For them are grades of dignity with their Lord, and Forgiveness and a generous provision (Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those are, in truth, the believers. They shall have degrees with their Lord and forgiveness, and a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the true believers. They have high standing with their Lord, and forgiveness, and a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the believers, truly. For them are degrees [of high position] with their Lord and forgiveness and noble provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:4] Those, described in the way mentioned, are the true, the real, believers, without doubt. For them are ranks, stations in Paradise, with their Lord, and forgiveness, and generous provision, in Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those are they who are in truth believers) they are truly and certainly believers. (For them are grades (of honour)) ranks of merit (with their Lord) in the Hereafter, (and pardon) for the sins they committed in the life of this world, (and a bountiful provision) a fair reward in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أُوْلۤـٰئِكَ } السعداء المقبولون عند الله { هُمُ ٱلْمُؤْمِنُونَ } المتحققون بمرتبة الإذعان والإيقان { حَقّاً } ثابتاً مستقراً بلا اضطراب وتزلزل { لَّهُمْ دَرَجَاتٌ } عظيمة { عِندَ رَبِّهِمْ } من درجات العلم والعين والحق { وَمَغْفِرَةٌ } ستر لأنانيتهم وتعيناتهم { وَرِزْقٌ كَرِيمٌ } [الأنفال: 4] معنوي بدلها، يرزقون بها فرحين عنايةً من الله؛ لأن من توجه نحو الحق، ومال إلى جانبه ميلاً مسقطاً للتوجه إلى الغير مطلقاً، وخرج عن لوازم الإمكان إلى حيث ينفق ويبذل جميع ما نسب إليه من أموال الدنيا إعراضاً عنها، مخرجاً محبتها من قلبها أعطلى له سبحانه بدل إخلاصه من الرزق المعنوي ما لا عينٌ رأت ولا أذنٌ سمعت، ولا خطر عى قلب بشر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أولئك هم المؤمنون حقاً } لأنهم حققوا إيمانهم بأن ضموا إليه مكارم أعمال القلب، من الخشية والإخلاص والتوكل، ومحاسن أعمال الجوارح التي هي العِيار عليها، كالصلاة والصدقة، { لهم درجات عند ربهم } أي كرامات وعلو منزلة، أو درجات الجنة يرتقونها بأعمالهم، { ومغفرة } لما فرط من ذنوبهم، { ورزقٌ كريم } أعده لهم في الجنة، لا ينقطع مدده، ولا ينتهي أمده، بمحض الفضل والكرم\n الإشارة: الانفال الحقيقة هي المواهب التي ترد على القلوب، من حضرة الغيوب من العلوم اللدنية والأسرار الربانية، لا تزال تتوالى على القلوب، حتى تغيب عما سوى المحبوب، فيستغني غناء لا فقر معه أبداً، وهذه غنائم خصوص الخصوص، وغنائم الخصوص: هي القرب من الحبيب، ومراقبة الرقيب، بكمال الطاعة والجد والاجتهاد، وهذه غنائم العباد والزهاد، وغنائم عوام أهل اليمين: مغفرة الذنوب، والستر على العيوب، والنجاة من النار، ومرافقة الأبرار، وفي الحديث عنه صلى الله عليه وسلم أنه قال:\n\n \" مَنْ قَالَ عِندَ نَوْمِهِ: أسْتَغْفِر اللِّه َالعَظِيمَ الذي لا إله إلاّ هُوَ الحَيُّ القَيّومَ وَأَتُوبُ إِليْهِ، غَفَرَ الله ذُنُوبَهُ، وَإِنْ كَانَتْ مِثْلَ زَبَد البَحَرِ، وعَدَدَ أَيَّامِ الدُّنْيَا \"\n \n\nقال الشيخ زروق: وهذه هي الغنيمة الباردة، وهذه الأمور بيد الله وبواسطة رسول الله صلى الله عليه وسلم وهو معنى قوله { قل الأنفال لله والرسول } ثم دل على موجباتها فقال: { فاتقوا الله وأصلحوا ذات بينكم\n\n\n } الآية، وقوله تعالى: { زادتهم إيماناً }: اعْلم أن الإيمان على ثلاثة أقسام: إيمان لا يزيد ولا ينقص وهو إيمان الملائكة، وإيمان يزيد وينقص، وهو إيمان عامة المسلمين، وإيمان يزيد ولا ينقص وهو إيمان الأنبياء والرسل، ومن كان على قدمهم من العارفين الروحانيين الراسخين في علم اليقين، ومن تعلق بهم من المريدين السائرين، بالطاعة والمعصية لتيقظهم وكمال توحيدهم، وفي الحكم: \" وربما قضى عليك بالذنب فكان سبب الوصول \" وقال أيضاً: \" معصية أورثت ذلاً وافتقاراً خير من طاعة أورثت عزاً واستكباراً \" والله تعالى أعلم\n ثم تكلم على الخروج إلى غزوة بدر، فقال: { كَمَآ أَخْرَجَكَ رَبُّكَ مِن بَيْتِكَ بِٱلْحَقِّ }\n\n",
      "translations": []
    }
  ]
}