{
  "chapter": "الأنفال",
  "text": "واعلموا۟ انما غنمتم من شىء فان لله خمسه وللرسول ولذى القربى واليتمى والمسكين وابن السبيل ان كنتم ءامنتم بالله وما انزلنا على عبدنا يوم الفرقان يوم التقى الجمعان والله على كل شىء قدير",
  "translations": [
    {
      "translation": "Know that when you take any booty a fifth of it belongs to Allah, and to the Messenger, and to close relatives, orphans, the very poor and travellers, if you believe in Allah and in what We sent down to Our slave on the Day of Discrimination, the day the two groups met - Allah has power over all things -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that one-fifth of what you acquire as booty (of war) is for God and His Apostle, and for relatives and orphans, the poor and wayfarers, if you truly believe in God and what We revealed to Our votary on the day of victory over the infidels when the two armies clashed (at Badr). For God has the power to do any thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that one fifth of the spoils that you obtain belongs to Allah, to the Messenger, to the near of kin, to the orphans, and the needy, and the wayfarer. This you must observe if you truly believe In Allah and in what We sent down on Our servant on the day when the true was distinguished from the false, the day on which the two armies met in battle. Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that whatever property you may gain, one fifth belongs to God, the Messenger, the kindred, orphans, the needy and those who need money while on a journey. (This is the law) if you believe in God and what We revealed to Our Servant on the Day of Distinction (Badr) when the armies confronted each other. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that whatever you take as war booty, a fifth of that belongs to Allah and His Noble Messenger, and to relatives, and orphans, and the needy, and the traveller – if you have accepted faith in Allah and what We sent down to Our bondman on the decisive day – the day when two armies had met; and Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that whatever of war booty that you may gain, verily, one-fifth of it is assigned to Allah, and to the Messenger, and to the near relatives (of the Messenger), the orphans, the poor, and the wayfarer, if you have believed in Allah and in that which We sent down to Our servant on the Day of Criterion, the Day when the two forces met; and Allah is able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that whatever thing you gain, a fifth of it is for Allah and for the Apostle and for the near of kin and the orphans and the needy and the wayfarer, if you believe in Allah and in that which We revealed to Our servant, on the day of distinction, the day on which the two parties met; and Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that, whatever booty you take, the fifth of it is God's, and the Messenger's, and the near kinsman's, and the orphans', and for the needy, and the traveller, if you believe in God and that We sent down upon Our servant on the day of salvation,. the day the two hosts encountered; and God is powerful over everything;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that whatever ye take as spoils of war, lo! a fifth thereof is for Allah, and for the messenger and for the kinsman (who hath need) and orphans and the needy and the wayfarer, if ye believe in Allah and that which We revealed unto Our slave on the Day of Discrimination, the day when the two armies met. And Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that one-fifth of your battle gains belongs to God and the Messenger, to his close relatives and orphans, to the needy and travellers, if you believe in God and the revelation We sent down to Our servant on the Decisive Day, the day when the two forces met. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that whatsoever ye obtain of spoils then verily unto Allah belongeth a fifth thereof and unto the apostle and unto his kindreds and the orphans and the needy and the wayfarer if ye indeed have believed in Allah and that which We sent down on our bondmans on the day of distinction, the day whereon the two hosts met. And Allah is over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that whatever thing you may come by, a fifth of it is for Allah and the Apostle, for the relatives and the orphans, for the needy and the traveller, if you have faith in Allah and what We sent down to Our servant on the Day of Separation, the day when the two hosts met; and Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that out of all the booty that ye may acquire (in war), a fifth share is assigned to Allah,- and to the Messenger, and to near relatives, orphans, the needy, and the wayfarer,- if ye do believe in Allah and in the revelation We sent down to Our servant on the Day of Testing,- the Day of the meeting of the two forces. For Allah hath power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that whatever of war-booty that you may gain, verily one-fifth (1/5th) of it is assigned to Allah, and to the Messenger, and to the near relatives [of the Messenger (Muhammad SAW)], (and also) the orphans, Al-Masakin (the poor) and the wayfarer, if you have believed in Allah and in that which We sent down to Our slave (Muhammad SAW) on the Day of criterion (between right and wrong), the Day when the two forces met (the battle of Badr) - And Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that one fifth of whatever you take as spoils belong to Allah, the Messenger, kinsmen of the Messenger, the orphans, the needy, and the destitute traveler; if you believe in Allah and what We sent down to Our worshiper on the day of victory, the day when the two armies met. Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that whatever spoils you gain, to God belongs its fifth, and to the Messenger, and the relatives, and the orphans, and the poor, and to the wayfarer, provided you believe in God and in what We revealed to Our servant on the Day of Distinction, the day when the two armies met. God is Capable of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that anything you obtain of war booty - then indeed, for Allah is one fifth of it and for the Messenger and for [his] near relatives and the orphans, the needy, and the [stranded] traveler, if you have believed in Allah and in that which We sent down to Our Servant on the day of criterion - the day when the two armies met. And Allah, over all things, is competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:41] And know that whatever spoils you have taken, [you have] seized from the disbelievers by force, the fifth of   it is for God, to have it dispensed as He will, and for the Messenger and for the kinsmen, the kinsmen of the Prophet (s) from among the Banū Hāshim and the Banū [‘Abd] al-Muttalib, and the orphans, children of Muslims, those whose fathers have passed away and are in poverty, and the needy, those Muslims in [dire] need, and the traveller, those Muslims cut off during travel — in other words it [the fifth] is due to the Prophet (s) and [those of] these four categories in the way that he used to apportion it: a fifth of the fifth for each one and the remaining four fifths for those who had captured the spoils, if you believe in God, then be aware of that, and that which (wa-mā is a supplement to bi’Llāhi, ‘in God’) We sent down upon Our servant, Muhammad (s), in the way of angels and signs, on the Day of Discrimination, that is, the day of [the battle of] Badr, which discriminated between truth and falsehood, the day the two armies, the Muslims and the believers, met. And God has power over all things, including giving you victory despite your being few and their being greater in number.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And know) believers (that whatever) of wealth (you take as spoils of war, lo! a fifth thereof is for Allah) a fifth of the spoils of war is given in the way of Allah, (and for the messenger) and for the use of the Messenger (and for the kinsmen) and for the kinsmen of the Prophet (pbuh) (and orphans) who are other than the orphans of the Banu 'Abd al-Muttalib (and the needy) other than those of the Banu 'Abd al-Muttalib (and the wayfarer) and for the weak who is in need of help, whoever he may be. This fifth used to be divided at the time of the Prophet (pbuh) into five shares: one share for the Prophet (pbuh) which was the share given for the sake of Allah (Allah's share); a share for the Prophet's kinsmen, because the Prophet (pbuh) used to give to his kinsmen on behalf of Allah; a share for the orphans; a share for the needy; and a share for the wayfarer. When the Prophet (pbuh) died, the share of the Prophet (pbuh) and that of his kinsmen were cancelled due to the saying of Abu Bakr: \"I heard Allah's Messenger (pbuh) say: each prophet has, while still alive, an assigned means of subsistence, and when he dies, it is cancelled and belongs to no one\". Abu Bakr, 'Umar, 'Uthman and 'Ali in their respective reigns divided the fifth into three shares: a share for the orphans, other than the orphans of Banu 'Abd al-Muttalib, a share for the needy, other than the needy of 'Abd al-Muttalib, and a share for the wayfarers who are weak and in need of help; (if ye believe in Allah and that which We revealed unto Our slave) Muhammad (pbuh) (on the Day of Discrimination) and the day of the alternation of power and victory of Muhammad (pbuh); it is also said that the Day of Discrimination means the day when Allah discriminated between truth and falsehood, i.e. the Day of Badr, when Allah decreed victory and the spoils of war for the Prophet (pbuh) and his Companions, while inflicting death and defeat upon Abu Jahl and his host, (the day when the two armies) the army of Muhammad (pbuh) and that of Abu Sufyan (met. And Allah is Able to do all things): victory and the possession of the spoils of war for the Prophet (pbuh) and death and defeat for Abu Jahl and his host.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ واعلموا أنما غنمتم من شيء فأنّ لله خُمْسه } إلى قوله: { والله شديد العقاب } لا يقبل التأويل بحسب ما ورد فيه من الواقعة وإن شئت تطبيقه على تفاصيل وجودك أمكن أن نقول: واعلموا أيها القوى الروحانية أنما غَنمتم من العلوم النافعة والشائع المبنيّ عليها الإسلام في قوله: بُنِي الإسلام على خمس\n فإن لله خمسه\n وهو شهادة أن لا إله إلاّ الله وأنّ محمداً رسول الله\n باعتبار التوحيد الجمعي ولرسول القلب { ولذي القُرْبى } الذي هو السر\n ويتامى العاقلة النظرية والعملية\n والقوّة الكفرية\n ومساكين القوى النفسانية { وابْن السبيل } الذي هو النفس السالكة الداخلة في الغربة الجائبة منازل السلوك\n النابية عن مقرها الأصلي باعتبار التوحيد التفصيلي في العالم النبوي\n والأخماس الأربعة الباقية تقسم على الجوارح والأركان والقوى الطبيعية { إن كنتم آمنتم } الإيمان الحقيقي { بالله } جمعاً\n { وما أنزلنا على عبدنا يوم الفرقان } وقت التفرقة بعد الجمع تفصيلاً { يوم التقى الجمعان } من فريقي القوى الروحانية والنفسانية عند الرجوع إلى مشاهدة التفصيل في الجمع",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما انتصرتم وظفرتم عليهم { ٱعْلَمُوۤا أَنَّمَا غَنِمْتُمْ } منهم وأخذتم { مِّن شَيْءٍ } أي: مما يطلق عليه اسم الشيء حتى الخيط { فَأَنَّ لِلَّهِ خُمُسَهُ } أي: فاعلموا أن خمسه ثابت لله { وَ } يصرف من مال الله خمسه { لِلرَّسُولِ } المستخلف منه\n النائب عنه { وَ } بعد انقراضه يصرف إلى الولاة المقيمين لحدود الله\n وسهم آخر منه { لِذِي ٱلْقُرْبَىٰ } المنتمين إلى رسول الله صلى الله عليه وسلم من بني هاشم وعبد المطلب\n\n\n{ وَ } آخر حق { ٱلْيَتَامَىٰ } الذي لا مال له ولا متعهد { وَ } آخر حق { ٱلْمَسَاكِينِ } الذين أسكنهم الفقر والفاقة في زاوية الهوان والمذلة { وَ } آخر حق { ٱبْنِ ٱلسَّبِيلِ } المنقطعين عن الأوطان لمصلحة شرعية\n فعليكم أيها الحكام أن تحافظوا على هذه القسمة ولا تتجاوزوا عنها { إِن كُنتُمْ آمَنْتُمْ بِٱللَّهِ } المستوي على العدل القويم\n\n\nثمَّ قال سبحانه: { وَمَآ أَنزَلْنَا } بمقتضى جودنا ولطفنا من النصر والظفر على الأعداء والإمداد بالملائكة { عَلَىٰ عَبْدِنَا } وحبيبنا { يَوْمَ ٱلْفُرْقَانِ } الفارق بين الحق والباطل والمحق والمبطل\n وذلك { يَوْمَ ٱلْتَقَى ٱلْجَمْعَانِ } أي: الصنفان من الطرفين في بدر مع ضعف أهل الحق وقوة الكفار { وَٱللَّهُ } المتعزز برداء العظمة والكبرياء { عَلَىٰ كُلِّ شَيْءٍ } من نصر ضعفاء الأولياء وانهزام الأعداء { قَدِيرٌ } [الأنفال: 41]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: فأن لله: مبتدأ حُذف خبره، أي: فكون خمسة لله ثابت، أو خبر، أي: فالواجب كون خمسه لله. يقول الحق جل جلاله: { واعلموا أنما غَنِمتُم من شيء } مما أخذتموه من الكفار قهراً بالقتال، لا الذي هربوا عنه بلا قتال، فكله للإمام فَيء، يأخذ حاجته ويصرف باقيه في مصالح المسلمين، ولا الذي طرحه العدو خوف الغرق، فلواجده، بلا تخميس، وكذا ما أخذه من كان ببلاد العرب على وجه التلصيص، فأما ما أخذه بالقتال: فللَّه { خُمُسَه وللرسول ولذي القربى واليتامى والمساكين وابن السبيل } الجمهور على أن ذكر الله للتعظيم كقوله:\n[التوبة: 62]، وإنما المراد: قسم الخمس على الخمسة الباقية. واختلف العلماء في الخمسة، فقال مالك: الرأي للإمام، يلحقه ببيت الفَيء، ويعطي من ذلك البيت لقرابة رسول الله صلى الله عليه وسلم ما رآه، كما يعطي منه اليتامى والمساكين، وغيرهم، وإنما ذكر من ذكر على جهة التنبيه عليهم، لأنهم من أهم ما يدفع إليهم. وقال الشافعي: يعطي للخمسة المعطوفة على الله، ولا يجعل لله سهماً مختصاً، وإنما ذكر ابتداء تعظيماً، لأن الكل ملكه، وسهم الرسول يأخذه الإمام، يصرفه في المصالح، فيعطي للأربعة المعطوفة على الرسول، ويفضل أهل الحاجة. وقال مالك: لا يجب التعميم، فله أن يعطي الأحوج، وإن حرم غيره، ومبني الخلاف: هل اللام لبيان المصرف أو للاستحقاق، كما في آية الزكاة. وقال أبو حنيفة: على ثلاثة أسهم، لليتامى والمساكين وابن السبيل، قال: وسقط الرسول وذوو القربى بوفاته عليه الصلاة والسلام. وقال أبو العالية: يقسم على ستةٍ، أخذاً بظاهر الآية، ويصرف سهم الله إلى الكعبة، وسهم الرسول في مصالح المسلمين، وسهم ذوي القربى لأهل البيت الذين لا تحل لهم الزكاة، ثم يعطى سهم اليتامى والمساكين وابن السبيل. قال البيضاوي: وذوو القربى: بنو هاشم، وبنو المطلب، لِمَا رُوي: أنه صلى الله عليه وسلم قسم سهم ذوي القربى عليهما، فقال عثمان وجبير بن مطعم: هؤُلاء إِخْوانك بَنُو هِاشِمٍ لا ننكر فَضْلَهُمْ لمَكَانِك الذي جَعَلَك اللَّهُ مِنْهُمْ، أرأيت إخواننا من بَني المُطَّلِب، أعْطَيْتَهُمْ وحَرَمْتَنَا، وإنَّما نَحنُ وَهُمْ بمَنْزِلَةٍ وَاحِدةٍ؟ فَقَالَ عليه الصلاة والسلام:\n \" إِنَّهُمْ لَمْ يُفَارِقُونَا في جَاهِلِيَّةٍ ولا إٍسْلاَم \" \nوشَبَّكّ بَيْنَ أَصَابِعِهِ. وقيل: بنو هاشم وحدهم. قلت: وهو مشهور مذهب مالك وقيل: جميع قريش.هـ. ثم قال تعالى: { إنْ كنتم آمنتم بالله } ، أي: إن كنتم آمنتم بالله فاعلموا أنه جعل الخمس لهؤلاء، فسلموه إليه، واقنعوا بالأخماس الأربعة، { وما } وكذا إن كنتم آمنتم بما { أنزلنا على عبدنا } محمد صلى الله عليه وسلم من القرآن، في شأن الأنفال، ومن النصر والملائكة، { يوم الفرقان } يوم بدر، فإنه فرّق فيه بين الحق والباطل، { يوم التقى الجمعان } المسلمون والكفار، { والله على كل شيء قدير } فيقدر على نصر القليل على الكثير، بالإمداد بالملائكة، وبلا إمداد، ولكن حكمته اقتضت وجود الأسباب والوسائط، والله حكيم عليم.\nالإشارة: واعلموا أنما غنمتم من شيء من العلوم اللدنية، والمواهب القدسية، والأسرار الربانية، بعد مجاهدة العلائق والعوائق، حتى صار دين القلب كله لله، فللَّه خمسه فناء، وللرسول بقاءً، ولذي القربى واليتامى والمساكين وابن السبيل تعظيماً وآداباً. يعني: أن العلم بالله يقتضي القيام بهذه الوظائف: الفناء في الله، بالغيبة عما سواه، وشهود الداعي الأعظم، وهو رسول الله، والأدب مع عباد الله، ليتحقق الأدب مع الله. ثم تعالى أعلم بأسرار كتابه. ثم بيَّن يوم الفرقان، فقال: { إِذْ أَنتُمْ بِالْعُدْوَةِ ٱلدُّنْيَا وَهُم بِٱلْعُدْوَةِ ٱلْقُصْوَىٰ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:7",
      "similarity": 0.46806810149223516
    },
    {
      "verse": "24:9",
      "similarity": 0.4495158877791007
    },
    {
      "verse": "48:19",
      "similarity": 0.4252909136207072
    },
    {
      "verse": "8:69",
      "similarity": 0.3962495410532448
    },
    {
      "verse": "4:94",
      "similarity": 0.37578976070882175
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008041.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008041.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:41.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}