{
  "chapter": "الأنفال",
  "text": "اذ انتم بالعدوة الدنيا وهم بالعدوة القصوى والركب اسفل منكم ولو تواعدتم لاختلفتم فى الميعد ولكن ليقضى الله امرا كان مفعولا ليهلك من هلك عنۢ بينة ويحيى من حى عنۢ بينة وان الله لسميع عليم",
  "translations": [
    {
      "translation": "when you were on the nearer slope, and they were on the further slope and the caravan was lower down than you. If you had made an appointment with them you would have broken the appointment. However, it happened so that Allah could settle a matter whose result was preordained: so that those who died would die with clear proof, and those who lived would live with clear proof. Allah is All-Hearing, All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(That day) when you were at one end of the valley, (the unbelievers) at the other, and the caravan below you (on the lowland by the coast), you would surely have declined to fight if (the Makkans) had offered you battle. (But the battle did take place) that God may end the matter which had been accomplished, so that he who had to die may perish after a clear demonstration, and he who had to live may survive in the light of positive proof, for God hears all and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when you were encamped at the nearer end of the valley (of Badr) and they were at the farther end and the caravan below you (along the seaside). Had you made a mutual appointment to meet in encounter, you would have declined. But encounter was brought about so that Allah might accomplish what He had decreed, and that he who was to perish should perish through a clear proof, and who was to survive might survive through a clear proof. Surely Allah is All-Hearing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall when your army was positioned at the less defensible brink of the valley, (the pagans') army had the more defensible higher side of the valley and the caravan was led (out of your reach) below. This situation did not take place according to your previous plans, otherwise, everything would have been different. (It was God's plan) to place you in a vulnerable position, exposed to the enemy and it was His plan to lead the caravan out of your reach) so that His decree that you would be granted a victory by a miracle would become a doubtless fact and so that those who were to be destroyed would face destruction with a clear knowledge of the Truth and those who were to survive would also survive with a clear knowledge of the Truth. God is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you were on the near bank and the disbelievers on the far bank, and the caravan below you; and had you made an agreement between one another, you would have failed to reach on the appointed time – but this is in order that Allah may complete a thing that must be done – that he who dies may die by a clear proof and he who lives may live by a clear proof; and indeed Allah is surely, All Hearing, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And remember) when you (the Muslim army) were on the near side of the valley, and they on the farther side, and the caravan on the ground lower than you. Even if you had made a mutual appointment to meet, you would certainly have failed in the appointment, but (you met) that Allah might accomplish a matter already ordained (in His knowledge), so that those who were to be destroyed (for rejecting the faith) might be destroyed after a clear evidence, and those who were to live (believers) might live after a clear evidence. And surely, Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you were on the nearer side (of the valley) and they were on the farthest side, while the caravan was in a lower place than you; and if you had mutually made an appointment, you would certainly have broken away from the appointment, but-- in order that Allah might bring about a matter which was to be done, that he who would perish might perish by clear proof, and he who would live might live by clear proof; and most surely Allah is Hearing, Knowing;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when you were on the nearer bank, and they were on the farther bank, and the cavalcade was below you; and had you made tryst together, you would have surely failed the tryst; but that God might determine a matter that was done, that whosoever perished might perish by a clear sign, and by a clear sign he might live who lived; and surely God is All-hearing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When ye were on the near bank (of the valley) and they were on the yonder bank, and the caravan was below you (on the coast plain). And had ye trysted to meet one another ye surely would have failed to keep the tryst, but (it happened, as it did, without the forethought of either of you) that Allah might conclude a thing that must be done; that he who perished (on that day) might perish by a clear proof (of His Sovereignty) and he who survived might survive by a clear proof (of His Sovereignty). Lo! Allah in truth is Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You were on the nearer side of the valley, and they were on the farther side, and the caravan was below you. Had you wished to set a time by mutual agreement, you would certainly have disagreed on the timing. However, the encounter took place, so that God might settle a matter which had already been ordained, so that he who was to perish might perish after clear evidence of the truth, and he who was to live might live in clear evidence of the truth. Surely, God is all hearing and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time ye were on the hither side and they were on the yonder side and the caravan below you. And if ye had mutually appointed ye would surely have failed the appointment. But the action wao brought about in order that Allah may decree an affair already enacted, so that he who was to perish, should perish after an evidence and he who was to remain alive may remain alive after an evidence. And verily Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you were on the nearer side, and they on the farther side, while the caravan was below you, and had you agreed together on an encounter, you would have certainly failed to keep the tryst, but in order that Allah may carry through a matter that was bound to be fulfilled, so that he who perishes might perish by a manifest proof, and he who lives may live on by a manifest proof, and Allah is indeed all-hearing, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember ye were on the hither side of the valley, and they on the farther side, and the caravan on lower ground than ye. Even if ye had made a mutual appointment to meet, ye would certainly have failed in the appointment: But (thus ye met), that Allah might accomplish a matter already enacted; that those who died might die after a clear Sign (had been given), and those who lived might live after a Clear Sign (had been given). And verily Allah is He Who heareth and knoweth (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And remember) when you (the Muslim army) were on the near side of the valley, and they on the farther side, and the caravan on the ground lower than you. Even if you had made a mutual appointment to meet, you would certainly have failed in the appointment, but (you met) that Allah might accomplish a matter already ordained (in His Knowledge); so that those who were to be destroyed (for their rejecting the Faith) might be destroyed after a clear evidence, and those who were to live (i.e. believers) might live after a clear evidence. And surely, Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you were encamped on the nearside and they (the unbelievers) on the farther side, with the caravan below, had you made an appointment with them, you would have surely failed to keep it; but Allah sought to accomplish what He had ordained, so that by clear evidence, he who was destined to perish might perish, and he who was destined to live might live. Surely, Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall when you were on the nearer bank, and they were on the further bank, and the caravan was below you. Had you planned for this meeting, you would have disagreed on the timing, but God was to carry out a predetermined matter, so that those who perish would perish by clear evidence, and those who survive would survive by clear evidence. God is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Remember] when you were on the near side of the valley, and they were on the farther side, and the caravan was lower [in position] than you. If you had made an appointment [to meet], you would have missed the appointment. But [it was] so that Allah might accomplish a matter already destined - that those who perished [through disbelief] would perish upon evidence and those who lived [in faith] would live upon evidence; and indeed, Allah is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:42] When (idh substitutes for yawma, ‘the day’) you were on the nearer bank, the one nearer to Medina (read ‘udwa or ‘idwa, meaning ‘the side of a valley’), and they were on the yonder bank, the one further from it, and the cavalcade, the caravan, was, in a place, below you, the coastal side; and had you, and the [enemy] band, agreed to meet, for battle, you would have surely failed to keep meeting; but, He brought you together at a different time, that God might conclude a matter that was to be done, through His knowledge — namely, the victory of Islam and the obliteration of unbelief — He did this so, that he who perished might perish, might be a disbeliever [even], after a clear proof, that is, after a manifest proof has been established against him, namely, the triumph of the believers, despite their small number, over the larger [enemy] army; and that he who survived might live, might believe, after a clear proof; surely God is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ إذ } بدل من { يوم التقى الجمعان } \\[ الأنفال : 41 \\] فهو ظرف ب { لأنزلنا } \\[ الأنفال : 41 \\] أي زمن أنتم بالعدوة الدنيا ، وقد أريد من هذا الظرف وما أضيف إليه تذكيرهم بحالة حرجة كان المسلمون فيها ، وتنبيههم للطف عظيم حفّهم من الله تعالى ، وهي حالة موقع جيش المسلمين من جيش المشركين ، وكيف التقى الجيشان في مكان واحد عن غير ميعاد ، ووجَد المسلمون أنفسهم أمام عدوّ قوي العِدّة والعُدّة والمَكانة من حسن الموقع . ولولا هذا المقصد من وصف هذه الهيئة لما كان من داع لهذا الإطناب إذ ليس من أغراض القرآن وصف المنازل إذا لم تكن فيه عبرة .والعدوة بتثليث العين صفة الوادي وشاطئه ، والضمّ والكسر في العين أفصح وعليهما القراءات المشهورة ، فقرأه الجمهور بضمّ العين ، وقرأه ابن كثير ، وأبو عمرو ، و يعقوب بكسر العين .والمراد بها شاطىء وادي بدر . وبدر اسم ماء . { والدنيا } هي القريبة أي العدوة التي من جهة المدينة ، فهي أقربُ لجيش المسلمين من العُدوة التي من جهة مكة . و { العدوة القصوى } هي التي ممّا يلي مكة ، وهي كثيب ، وهي قصوى بالنسبة لموقع بلد المسلمين .والوصف ب { الدنيا } و { القصوى } يَشعُر المخاطبون بفائدته ، وهي أنّ المسلمين كانوا حريصين أن يسبقوا المشركين إلى العدوة القصوى ، لأنّها أصلب أرضاً فليس للوصف بالدنو والقصُو أثر في تفضيل إحدى العدوتين على الأخرى ، ولكنّه صادف أن كانت القصوى أسعدَ بنزول الجيش ، فلمّا سبق جيشُ المشركين إليها اغتمّ المسلمون ، فلمّا نزل المسلمون بالعدوة الدنيا أرسل الله المطر وكان الوادي دَهْساً فلبّد المطرُ الأرضَ ولم يعقهم عن المسير وأصاب الأرض التي بها قريش فعطّلهم عن الرحيل ، فلم يبلغوا بدراً إلاّ بعد أن وصل المسلمون وتخيروا أحسن موقع وسبقوا إلى الماء ، فاتّخذوا حوضاً يكفيهم وغوروا الماء ، فلمّا وصل المشركون إلى الماء وجدوه قد احتازه المسلمون ، فكان المسلمون يشربون ولا يجد المشركون ماء .وضمير { وهم } عائد إلى ما في لفظ { الجمعان } من معنى : جمعكم وجمع المشركين ، فلمّا قال : { إذ أنتم بالعدوة الدنيا } لم يبق معاد لضمير { وهم } إلاّ الجمع الآخر وهو جمع المشركين .و { الركب } هو ركب قريش الراجعون من الشام ، وهو العِير . { أَسْفَلَ } من الفريقين أي أخفض من منازلهما ، لأن العيِر كانوا سائِرين في طريق الساحل ، وقد تركوا ماءَ بدر عن يسارهم . ذلك أنّ أبا سفيان لمّا بلغه أنّ المسلمين خرجوا لتلقي عيره رجع بالعير عن الطريق التي تمرّ ببدر ، وسلك طريق الساحل لينجو بالعير ، فكان مسيره في السهول المنخفضة ، وكان رجال الركب أربعين رجلاً .والمعنى : والركب بالجهة السفلى منكم ، وهي جهة البحر وضمير { منكم } خطاب للمسلمين المخاطبين بقوله : { إذ أنتم بالعدوة الدنيا } والمعنى أنّ جيش المسلمين كان بين جماعتين للمشركين ، وهما جيش أبي سفيان بالعدوة القصوى ، وعير القوم أسفل من العدوة الدنيا ، فلو علم العدوّ بهذا الوضع لطبّق جماعتيه على جيش المسلمين ، ولكن الله صرفهم عن التفطّن لذلك وصرف المسلمين عن ذلك ، وقد كانوا يطمعون أن يصادفوا العير فينتهبوها كما قال تعالى :{ وتودون أن غير ذات الشوكة تكون لكم } \\[ الأنفال : 7 \\] ولو حاولوا ذلك لوقعوا بين جماعتين من العدوّ .وانتصب { أسفل } على الظرفية المكانية وهو في محلّ رفع خبر عن ( الركب ) أي والركب قد فاتكم وكنتم تأملون أن تدركوه فتنتهبوا ما فيه من المتاع .والغرض من التقييد بهذا الوقت ، وبتلك الحالة : إحضارها في ذكْرهم ، لأجل ما يلزم ذلك من شكر نعمة الله ، ومن حسن الظنّ بوعده والاعتماد عليه في أمورهم ، فإنّهم كانوا حينئذ في أشدّ ما يكون فيه جيش تجاه عدوّه ، لأنّهم يعلمون أنّ تلك الحالة كان ظاهرها ملائِماً للعدوّ ، إذ كان العدوّ في شوكة واكتمال عدّة ، وقد تمهدت له أسباب الغلبة بحسن موقع جيشه ، إذ كان بالعدوة التي فيها الماء لسقياهم والتي أرضها متوسّطة الصلابة ، فَأما جيش المسلمين فقد وجدوا أنفسهم أمام العدوّ في عدوة تسوخ في أرضها الأرجل من لين رمْلها ، مع قلّة مائِها ، وكانت العير قد فاتت المسلمين وحلّت وراء ظهور جيش المشركين ، فكانت في مأمن من أن ينالها المسلمون ، وكان المشركون واثقين بمكنة الذبّ عن عيرهم ، فكانت ظاهرةُ هذه الحالة ظاهرةَ خيبة وخوف للمسلمين ، وظاهرةَ فوز وقوة للمشركين ، فكان من عجيب عناية الله بالمسلمين أن قلب تلك الحالة رَأساً على عَقب ، فأنزل من السماء مطراً تعبّدت به الأرض لجيش المسلمين فساروا فيها غير مشفوق عليهم ، وتطهّروا وسَقَوا ، وصَارت به الأرض لجيش المشركين وحلاً يثقل فيها السيرَ وفاضت المياه عليهم ، وألقى الله في قلوبهم تهوين أمر المسلمين ، فلم يأخذوا حذرهم ولا أعدّوا للحرب عدّتها ، وجعلوا مقامهم هنالك مقام لهو وطرب ، فجعل الله ذلك سبباً لنصر المسلمين عليهم ، ورأوا كيف أنجز الله لهم ما وعدهم من النصر الذي لم يكونوا يتوقّعونه . فالذين خوطبوا بهذه الآية هم أعلم السامعين بفائدة التوقيت الذي في قوله : { إذ أنتم بالعدوة الدنيا } الآية . ولذلك تعيّن على المفسّر وصف الحالة التي تضمنّتها الآية ، ولولا ذلك لكان هذا التقييد بالوقت قليل الجدوى .وجملة { ولو تواعدتم لاختلفتم في الميعاد } في موضع الحال من { الجمعان } \\[ الأنفال : 41 \\] وعامل الحال فعل { التقى } \\[ الأنفال : 41 \\] أي في حال لقاء على غير ميعاد ، قد جاء ألزم ممّا لو كان على ميعاد ، فإنّ اللقاء الذي يكون موعوداً قد يتأخّر فيه أحد المتواعدَين عن وقته ، وهذا اللقاء قد جاء في إبان متّحد وفي مكان متجاور متقابل .ومعنى الاختلاف في الميعاد : اختلاف وقته بأن يتأخّر أحد الفريقين عن الوقت المحدود فلم يأتوا على سواء .والتلازم بين شرط { لو } وجوابها خفي هنا وقد أشكل على المفسّرين ، ومنهم من اضطرّ إلى تقدير كلام محذوف تقديره : ثم علمتم قلّتكم وكثرتكم ، وفيه أنّ ذلك يفضي إلى التخلّف عن الحضور لا إلى الاختلاف . ومنهم من قدر : وعلمتم قلّتكم وشعر المشركون بالخوف منكم لِما ألقى الله في قلوبهم من الرعب ، أي يجعل أحد الفريقين يتثاقل فلم تحضروا على ميعاد ، وهو يفضي إلى ما أفضى إليه القول الذي قبله ، ومنهم من جعل ذلك لما لا يخلو عنه الناس من عروض العوارض والقواطع ، وهذا أقرب ، ومع ذلك لا ينثلج له الصدر .فالوجه في تفسير هذه الآية أنّ { لو } هذه من قبيل ( لو ) الصُهَيْبِية فإنَّ لها استعمالات ملاكها : أن لا يقصد من ( لو ) ربطُ انتفاء مضمون جوابها بانتفاء مضمون شرطها ، أي ربط حصول نقيض مضمون الجواب بحصول نقيض مضمون الشرط ، بل يقصد أنّ مضمون الجواب حاصل لا محالة ، سواء فرض حصول مضمون شرطها أو فرض انتفاؤه ، إمّا لأنّ مضمون الجواب أولى بالحصول عند انتفاء مضمون الشرط ، نحو قوله تعالى : { ولو سمعوا ما استجابوا لكم } \\[ فاطر : 14 \\] ، وإمّا بقطع النظر عن أولَوية مضمون الجواب بالحصول عند انتفاء مضمون الشرط نحو قوله تعالى : { ولو ردوا لعادوا لما نهوا عنه } \\[ الأنعام : 28 \\]. ومحصّل هذا أنّ مَضمون الجزاء مستمرُّ الحصول في جميع الأحوال في فرض المتكلم ، فيأتي بجملة الشرط متضمنّةً الحالةَ التي هي عند السامع مظنةُ أن يحصلُ فيها نقيضُ مضمون الجواب . ومن هذا قول طفيل في الثناء على بني جعفر بن كِلاب: ... أبَوْا أنْ يمَلُّونا ولَوْ أنَّ أمَّناتلاَقِي الذي لاَقَوْه منا لَمَلَّتِ ... أي فكيف بغيرِ أمِّنا .وقد تقدّمت الإشارة إلى هذا عند قوله تعالى : { ولو أسمعهم لتولوا وهم معرضون } في هذه السورة \\[ 23 \\] ، وكنا أحلنا عليه وعلى ما في هذه الآية عند قوله تعالى : { ولو أنّنا نزّلنا إليهم الملائكة } الآية في سورة \\[ الأنعام : 111 \\].والمعنى : لو تواعدتم لاختلفتم في الميعاد ، أي في وقت ما تواعدتم عليه ، لأن غالب أحوال المتواعِدَين أن لا يستوي وفاؤهما بما تواعدا عليه في وقت الوفاء به ، أي في وقت واحدٍ ، لأنّ التوقيت كان في تلك الأزمان تقريباً يقدّرونه بأجزاء النهار كالضحى والعَصر والغروب ، لا ينضبط بالدرج والدقائق الفلَكية ، والمعنى : فبالأحرى وأنتم لم تتواعدوا وقد أتيتم سواء في اتّحاد وقت حلولكم في العُدوتين فاعلموا أنّ ذلك تيسير بقدر الله لأنّه قدر ذلك لتعلموا أنّ نصركم من عنده على نحو قوله : { وما رميت إذ رميت ولكنّ الله رمى } \\[ الأنفال : 17 \\].وهذا غير ما يقال ، في تقارب حصول حاللٍ لأناس : «كأنهم كانوا على ميعاد» كما قال الأسود بن يَعفر يرثي هلاك أحلافه وأنصاره. ... جَرَتتِ الرياحُ على محلّ ديارهمفكأنهم كانوا على مِيعاد ... فإنّ ذلك تشبيه للحصول المتعاقب .وضمير { اختلفتم } على الوجوه كلّها شامل للفريقين : المخاطبِين والغائبِين ، على تغليب المخاطبين ، كما هو الشأن في الضمائر مثله .وقد ظهر موقع الاستدراك في قوله : { ولكن ليقضى الله أمراً كان مفعولا } إذ التقدير : ولكن لم تتواعدوا وجئتم على غيرِ اتّعاد ليقضي اللَّهَ أي ليحقّق ويُنجز ما أراده من نصركم على المشركين . ولمّا كان تعليل الاستدراك المفادِ بلكِنْ قد وقع بفعللٍ مسند إلى الله كان مفيداً أنّ مجيئهم إلى العُدوتين على غير تواعد كان بتقدير من الله عِنايةً بالمسلمين .ومعنى { أمراً } هنا الشيء العظيم ، فتنكيره للتعظيم ، أو يجعل بمعنى الشأن وهم لا يطلقون ( الأمر ) بهذا المعنى إلاّ على شيءٍ مهمّ ، ولعلّ سبب ذلك أنه ما سمّي ( أمراً ) لا باعتبار أنّه ممّا يؤمر بفعله أو بعمله كقوله تعالى : { وكان أمراً مقضياً } \\[ مريم : 21 \\] وقوله : { وكان أمر الله قدراً مقدوراً } \\[ الأحزاب : 38 \\].و { كان } تدلّ على تحقّق ثبوت معنى خبرها لاسمها من الماضي مثل { وكان حقا علينا نصر المؤمنين } \\[ الروم : 47 \\] أي ثبت له استحقاق الحَقية علينا من قديم الزمن . وكذلك قوله : { وكان أمراً مقضياً } \\[ مريم : 21 \\]. فمعنى { كان مفعولا } أنّه ثبت له في علم الله أنّه يُفعل . فاشتق له صيغة مفعول من فَعَل للدلالة على أنّه حين قدرت مفعوليته فقد صار كأنّه فُعل ، فوصف لذلك باسم المفعول الذي شأنه أن يطلق على من اتّصف بتسلط الفعل في الحال لا في الاستقبال .فحاصل المعنى : لينجز الله ويوقع حدثاً عظيماً متّصفاً منذ القدم بأنّه محقّق الوقوع عند إبّانه ، أي حقيقاً بأن يُفعل حتّى كأنّه قد فعل لأنّه لا يمنعه ما يحفّ به من الموانع المعتادة .وجملة : { ليهلك من هلك عن بينة } في موضع بدل الاشتمال من جملة : { ليقضي الله أمراً كان مفعولا } لأنّ الأمر هو نصر المسلمين وقهر المشركين وذلك قد اشتمل على إهلاك المهزومين وإحياء المنصورين وحَفّه من الأحوال الدالّة على عناية الله بالمسلمين وإهانته المشركين ما فيه بيّنه للفريقين تقطع عذر الهالكين ، وتقتضي شكرَ الأحياء . ودخول لام التعليل على فعل { يهلك } تأكيد للام الداخلة على ل { يقضي } في الجملة المبدل منها . ولو لم تدخل اللام لقيل : يَهْلِكُ مرفوعاً .والهلاك : الموت والاضمحلال ، ولذلك قوبل بالحياة . والهَلاك والحياة مستعاران لمعنى ذهاب الشوكة ، ولمعنى نهوض الأمة وقوتها ، لأنّ حقيقة الهلاك الموت ، وهو أشد الضرّ فلذلك يشبَّه بالهلاك كلّ ما كان ضُرّاً شديداً ، قال تعالى : { يهلكون أنفسهم } \\[ التوبة : 42 \\] ، وبضدّه الحياة هي أنفع شيء في طبع الإنسان فلذلك يشبه بها ما كان مرغوباً ، قال تعالى : { لينذر من كان حياً } \\[ يس : 70 \\] وقد جمع التشبيهين قوله تعالى : { أو من كان ميتاً فأحييناه } \\[ الأنعام : 122 \\]. فإن الكفار كانوا في عزّة ومنعة ، وكان المسلمون في قِلّة ، فلما قضى الله بالنصر للمسلمين يوم بدر أخفق أمر المشركين ووهنوا ، وصار أمر المسلمين إلى جدّة ونهوض ، وكان كلّ ذلك ، عن بينة ، أي عن حجّة ظاهرة تدلّ على تأييد الله قوماً وخذلِه آخرين بدون ريببٍ .ومن البعيد حمل { يهلك } و { يحيى } على الحقيقة لأنّه وإن تحمَّله المعنى في قوله : { ليهلك من هلك } فلا يتحمّله في قوله : { ويحيى ممن حي } لأنّ حياة الأحياء ثابتة لهم من قبل يوم بدر .ودلّ معنى المجاوزة الذي في { عن } على أنّ المعنى ، أن يكون الهلاك والحياة صادرين عن بيّنة وبارزين منها .وقرأ نافع ، والبَزّي عن ابن كثير ، وأبو بكر عن عاصم ، ويعقوب ، وخلف «حَييَ» بإظهار الياءَيْن ، وقرأه البقية : «حَيَّ» بإدغام إحدى الياءين في الأخرى على قياس الإدغام وهما وجهان فصيحان .و { عن } للمجاوزة المجازية ، وهي بمعنى ( بعد ) ، أي : بعد بيّنة يتبيّن بها سبب الأمرين : هلاك من هلك ، وحياة من حيي .وقوله : { وإن الله لسميع عليم } تذييل يشير إلى أنّ الله سميع دعاء المسلمين طلب النصر ، وسميع ما جرى بينهم من الحوار في شأن الخروج إلى بدر ومن مودّتهم أن تكون غير ذات الشوكة هي إحدى الطائفتين التي يلاقونها ، وغير ذلك ، وعليم بما يجول في خواطرهم من غير الأمور المسموعة وبما يصلح بهم ويبني عليه مجد مستقبلهم .\n\n",
      "translations": [
        {
          "translation": "(When ye were) believers (on the near bank (of the valley)) close to Medina (and they) Abu Jahl and his host (were on the yonder bank) farther from Medina, beyond the valley, (and the caravan) of Abu Sufyan and his host (was below you (on the coast plain)) three miles away. (And had ye trysted to meet one another) in Medina to fight (ye surely would have failed to keep the tryst) to be able to do so, (but (it happened, as it did, without the forethought of either of you) that Allah might conclude a thing that must be done) giving victory and the spoils of war to the Prophet (pbuh) and his Companions, and death and defeat to Abu Jahl and his host; (that he who perished (on that day) might perish) he who perished as a disbeliever may perish (by a clear proof) after showing Allah's assistance to Muhammad (pbuh) (and he who survived) and was firm on faith (might survive) he whom Allah wills to make firm on faith (by a clear proof) after showing His assistance to Muhammad, Allah give him peace. It is also said that this means: so that he disbelieves he whom Allah willed him to disbelieve after seeing the clear proof (victory and seizure of the spoils of war by the Prophet (pbuh)) and so that he believes he whom Allah willed him to believe after seeing the clear proof. (Lo! Allah in truth is Hearer) of your supplications, (Knower) of the answer to your calls and assistance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذْ أَنتُمْ بِالْعُدْوَةِ ٱلدُّنْيَا وَهُم بِٱلْعُدْوَةِ ٱلْقُصْوَىٰ } والعُدْوةُ: شَفيرُ الوَادي\n والدُّنيَا: الأَدنى، وهو الأَقربُ\n والقُصوى: الأَبْعَدُ\n فالمُؤمنوُن كانُوا بِالعُدوةِ الدُّنيَا\n والكَافِرونَ بِالعُدوةِ القُصوى { وَٱلرَّكْبُ أَسْفَلَ مِنكُمْ } [أي] أبو سُفيان وأَصحابُهُ أَسفلُ مِنْهُم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {When you are in the world's enemy and they are in the quswa enemy} and the enemy: the valley's cleaver.\n\n\nAnd the world: the lowest, and it is the closest.\n\n\nThe farthest.\n The believers were in the {worldy} enemy.\n\n\nAnd the unbelievers with the most extreme hostility {and the lowest of you in rank} [that is], Abu Sufyan and his companions are lower in rank than them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إذ أنتم بالعدوة الدنيا } من مدينة العلم ومحل العقل الفرقاني { وهم بالعدوة القصوى } أي: الجهة السفلية البعيدة من الحق ومحل العلم وركب القوى الطبيعية الممتازة للقوى النفسانية { أسفل منكم } أي: من الفريقين { ولو تواعدتم } اللقاء للمحاربة من طريق العقل والحكمة دون طريق الرياضة والوحدة { لاختلفتم في الميعاد } لكون ذلك صعباً حينئذ\n موجباً للفشل والجبن { ولكن ليقضي الله أمراً كان مفعولاً } مقدّراً\n محققاً عنده\n واجباً وقوعه فعل ذلك { ليهلك من هلك عن بيّنة } هي كونها ملازمة للبدن الواجب الفناء منطبعة فيه { ويحيا من حيّ عن بيّنة } هي كونها مجرّدة عنه متصلة بعالم القدس الذي هو معدن الحياة الحقيقية الدائم البقاء",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكروا أيها المؤمنون ضعفكم ورثاثة حالكم وقت { إِذْ أَنتُمْ } مترددون { بِالْعُدْوَةِ ٱلدُّنْيَا } أي: على شفير الوادي التي هي أقرب إلى المدينة ولا ماء فيها\n ورمالها تسوخ أرجلكم وأنتم راحلون { وَهُم } متمكنون { بِٱلْعُدْوَةِ ٱلْقُصْوَىٰ } أي: على شفير الوادي الأبعد من المدينة والماء عندهم { وَٱلرَّكْبُ } أي: العير التي قصدتم نحوه قد كان بمكانٍ { أَسْفَلَ } وأبعد { مِنكُمْ } على ساحل البحر مقدار ثلاثة أميال\n وأنتم حيارى بين الإقدام والإحجام\n\n\n{ وَ } بالجملة: { لَوْ تَوَاعَدتُّمْ } أنتم وهم القتال في وقت معين بلا وحي من الله ووعد من جانبه { لاَخْتَلَفْتُمْ } أنتم ألبتة\n لضعفكم وقوتهم وهيبتهم { فِي ٱلْمِيعَادِ } الذي وعدتم معهم\n لرعيكم ورهبتكم منهم { وَلَـٰكِن } جمع سبحانه بلطفه شملكم ومكنكم في مكانكم\n وأمطر عليكم في ليلتكم { لِّيَقْضِيَ ٱللَّهُ } المولي لنصركم وغلبتكم { أَمْراً } حكماً مبرماً { كَانَ مَفْعُولاً } عنده وإن لم يفعل بعد\n وإنما فعل سبحانه بكم ما فعل من النصر والظفر بهم من القهر والقمع { لِّيَهْلِكَ } من الكفار { مَنْ هَلَكَ } أي: مات وانخذل غيظاً { عَن بَيِّنَةٍ } واضحة شاهدتها { وَيَحْيَىٰ } أيضاً من المسلمين { مَنْ حَيَّ } فرحاً { عَن بَيِّنَةٍ } واضحة لائحة انكشف بها { وَ } اعلموا { إِنَّ ٱللَّهَ } المطلع لضمائر عباده { لَسَمِيعٌ } لمناجاة كلا الفريقين { عَلِيمٌ } [الأنفال: 42] بنياتهم\n يفعل من كل منهم على مقتضى علمه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: إذ: بدل من يوم الفرقان\n أو ظرف لالْتقى\n أو لاذكر\n محذوفة\n والعدوة مثلث العين: شاطئ الوادي و الدنيا أي: القربى\n نعت له\n و القصوى: تأنيث الأقصى\n وكان قياسه: قلب الواو ياء\n كالدنيا والعليا تفرقة بين الاسم والصفة\n فجاء على الأصل\n كالقَود\n وسُمع فيه: \" القصيا \" على الأصل\n وهو شاذ\n و الركب: مبتدأ\n و أسفل: ظرف خبره\n يقول الحق جل جلاله: واذكروا { إذ أنتم بالعُدْوَة الدنيا } أي بعدوة الوادي القريبة من المدينة\n { وهم } أي: كفار قريش\n { بالعُدْوة القصوى } أي: البعيدة منها\n { والركبُ } أي: العير التي قصدتكم\n { أسفل منكم } أي: في مكان أسفل منكم\n يعني الساحل\n ثم جمع الله بينكم على غير ميعاد\n { ولو تواعدتُم } لهذا الجمع\n أنتم وهم للقتال\n ثم علمتم حالكم وحالهم { لاختلفتم في الميعاد } هيبة منهم لكثرتهم وقلتكم\n لتتحققوا أن ما اتفق لكم من الفتح والظفر ليس إلا صنيعاً من الله تعالى خارقاً للعادة\n فتزدادوا إيماناً وشكراً\n { ولكن } الله جمع بينكم من غير ميعاد { ليقضي اللَّهُ أمراً كان مفعولا } سابقاً في الأزل\n وهو نصر أوليائه وقهراً أعدائه في ذلك اليوم\n لا يختلف عنه ساعة\nBR>> { ليَهلِكَ من هلك عن بينة ويحيى مَنْ حَيَّ عن بينة } \n أي: قدَّر ذلك الأمر العجيب ليموت من يموت عن بينة عاينها\n ويعيش من يعيش عن حجة شاهدها\n لئلا يكون له حجة ومعذرة\n فإن وقعة بدر من الآيات الواضحة\n فكل من عاينها ولم يؤمن قامت الحجة عليه\n أو ليهلك بالكفر من هلك عن بينة وحجة قائمة عليه\n ويحيى بالإيمان من حي به عن بينة من ربه\n { وإنَّ الله لسميع عليمٌ } بكفر من كفر وإيمان من أمن\n فيجازي كلاًّ على فعله\n ولعل الجمع بين صفة السمع والعلم لاشتمال الأمرين على القول والاعتقاد\n واذكر أيضاً { إذْ يُريكَهُمُ الله في منامك قليلاً } \n كان صلى الله عليه وسلم قد رأى الكفار في نومه قليلاً\n فأخبر بذلك أصحابه\n فقويت نفوسهم وتجرؤوا على قتالهم\n وكانوا قليلاً في المعنى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:22",
      "similarity": 0.5009109886823369
    },
    {
      "verse": "36:20",
      "similarity": 0.4988391160878449
    },
    {
      "verse": "28:20",
      "similarity": 0.44004600880738126
    },
    {
      "verse": "17:1",
      "similarity": 0.428235285824839
    },
    {
      "verse": "95:5",
      "similarity": 0.3522661307907085
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008042.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008042.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:42.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}