{
  "chapter": "الأنفال",
  "text": "اذ يريكهم الله فى منامك قليلا ولو ارىكهم كثيرا لفشلتم ولتنزعتم فى الامر ولكن الله سلم انه عليمۢ بذات الصدور",
  "translations": [
    {
      "translation": "Remember when Allah showed them to you in your dream as only a few. If He had shown you them as hearts contain.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God showed (the Makkans) to be few in your dream, for if He had shown them to be many you would surely have lost courage and disagreed about the (wisdom) of the battle. But God spared you this, for He surely knows what is in the hearts of men.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when Allah showed them to you in your dream to be few in number. And had He showed them to you to be numerous, you would have flagged and disagreed with one another about fighting them. But Allah saved you. Surely Allah knows what is hidden in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In your dream, God showed (the pagans' army) as being only a few in number, for if He had showed them as a great number, you would have lost courage and would have started to quarrel among yourselves concerning this matter. But God saved you from that condition; He knows what is in your hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When O dear Prophet, Allah used to show the disbelievers in your dream as only a few*; and O Muslims, had He shown them to you as many, you would have certainly lost courage and disputed over the affair, but Allah rescued (you); indeed He knows what lies within the hearts. (* They numbered more but their actual strength was equal to only a few.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And remember) when Allah showed them to you as few in your dream; if He had shown them to you as many, you would surely have been discouraged, and you would surely have disputed in making a decision. But Allah saved (you). Certainly, He is the All-Knower of that is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Allah showed them to you in your dream as few; and if He had shown them to you as many you would certainly have become weak-hearted and you would have disputed about the matter, but Allah saved (you); surely He is the Knower of what is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God showed thee them in thy dream as few; and had He shown them as many you would have lost heart, and quarrelled about the matter; but God saved; He knows the thoughts in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Allah showed them unto thee (O Muhammad) in thy dream as few in number, and if He had shown them to thee as many, ye (Muslims) would have faltered and would have quarrelled over the affair. But Allah saved (you). Lo! He knoweth what is in the breasts (of men).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God showed them to you in your dream as small in number. If He had shown them to you as many, you would have lost heart and disputed about the matter; but God saved you. He has full knowledge of what is in the human heart.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time Allah shewed them few unto thee in thy dream. And had He shewn them numerous unto thee, surely ye would have flagged and surely ye would have disputed over the affair but Allah saved you. Verily He is the Knower of that which is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Allah showed them to you as few in your dream, and had He shown them as many, you would have lost heart, and disputed about the matter. But Allah spared you. Indeed He knows well what is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember in thy dream Allah showed them to thee as few: if He had shown them to thee as many, ye would surely have been discouraged, and ye would surely have disputed in (your) decision; but Allah saved (you): for He knoweth well the (secrets) of (all) hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And remember) when Allah showed them to you as few in your (i.e. Muhammad's SAW) dream, if He had shown them to you as many, you would surely have been discouraged, and you would surely have disputed in making a decision. But Allah saved (you). Certainly, He is the All-Knower of what is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah made them appear to you in a vision as a small band, had He showed them to you as many, your courage would have failed you and you would have quarreled over the affair. But Allah saved; He knows the inner most thoughts in the chests.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God made them appear in your dream as few. Had He made them appear as many, you would have lost heart, and disputed in the matter. But God saved the situation. He knows what the hearts contain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Remember, O Muhammad], when Allah showed them to you in your dream as few; and if He had shown them to you as many, you [believers] would have lost courage and would have disputed in the matter [of whether to fight], but Allah saved [you from that]. Indeed, He is Knowing of that within the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:43] Remember, when God showed them to you in your dream, in your sleep, as few, and so you informed your companions of this, and they were delighted, and had He shown them to you as many, you would have faltered, shrunk in cowardice, and quarrelled, fallen into disagreement, over the matter, the matter of fighting; but God saved, you, from faltering and quarrelling. He knows that which is in the breasts, that which is in the hearts.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ إذ يريكهم الله } بدل من قوله : { إذ أنتم بالعدوة الدنيا } \\[ الأنفال : 42 \\] فإنّ هذه الرؤيا ممّا اشتمل عليه زمان كونهم بالعدوة الدنيا لوقوعها في مدّة نزول المسلمين بالعدوة من بدر ، فهو بدل من بدل .والمنام مصدر ميمي بمعنى النوم ، ويطلق على زمن النوم وعلى مكانه .ويتعلق قوله : { في منامك } بفعل { يريكهم } ، فالإراءة إراءة رؤيا ، وأسندت الإراءة إلى الله تعالى؛ لأنّ رؤيا النبي صلى الله عليه وسلم وحي بمدلولها ، كما دلّ عليه قوله تعالى ، حكاية عن إبراهيم وابنه { قال يا بُنَيّ إنّيَ أرى في المنام أنِّي أذْبَحُك فانْظُر ماذا ترى قال يا أبَتتِ افعل ما تؤمر } \\[ الصافات : 102 \\] فإنّ أرواح الأنبياء لا تغلبها الأخلاط ، ولا تجول حواسهم الباطنة في العبث ، فما رؤياهم إلاّ مكاشفات روحانية على عالم الحقائِق .وكان النبي صلى الله عليه وسلم قد رأى رؤيا مناممٍ ، جيشَ المشركين قليلاً ، أي قليل العَدد وأخبر برؤياه المسلمين فتشجّعوا للقاء المشركين ، وحملوها على ظاهرها ، وزال عنهم ما كان يخامرهم من تهيّب جيش المشركين . فكانت تلك الرؤيا من أسباب النصر ، وكانت تلك الرؤيا منّة من الله على رسوله والمؤمنين ، وكانت قِلة العدد في الرؤيا رَمزاً وكناية عن وهن أمر المشركين لا عن قلّة عددهم .ولذلك جعلها الله في رؤيا النوم دون الوحي ، لأنّ صور المَرائي المنامية تكَون رموزاً لمعان فلا تُعَدُّ صورتها الظاهرية خلفاً ، بخلاف الوحي بالكلام .وقد حكاها النبي صلى الله عليه وسلم للمسلمين ، فأخذوها على ظاهرها ، لعلمهم أنّ رؤيا النبي وحي ، وقد يكون النبي قد أطلعه الله على تعبيرها الصائِب ، وقد يكون صرفه عن ذلك فظنّ كالمسلمين ظاهرها ، وكلّ ذلك للحكمة . فرؤيا النبي صلى الله عليه وسلم لم تخطىء ولكنها أوهمتهم قلّة العَدد ، لأنّ ذلك مرغوبهم والمقصود منه حاصل ، وهو تحقّق النصْر ، ولو أخبروا بعدد المشركين كما هو لجبنُوا عن اللقاء فضعفت أسباب النصر الظاهرة المعتادة التي تكسبهم حسن الأحدوثة . ورؤيا النبي لا تخطىء ، ولكنها قد تكون جارية على الصورة الحاصلة في الخارج ، كما ورد في حديث عائشة في بدء الوحي : أنّه كان لا يرى رؤيا إلاّ جاءت مثل فَلَق الصبح ، وهذا هو الغالب ، وخاصّة قبل ابتداء نزول المَلك بالوحي ، وقد تكون رؤيا النبي صلى الله عليه وسلم رمزية وكناية كما في حديث رؤياه بَقَراً تُذبح ، ويُقال له : الله خير ، فلم يعْلَم المراد حتّى تبيّن له أنّهم المؤمنون الذين قُتلوا يوم أُحد . فلمّا أراد الله خذل المشركين وهزمهم أرى نبيئه المشركين قليلاً كناية بأحد أسباب الانهزام ، فإنّ الانهزام يجيء من قلّة العدد . وقد يُمسك النبي عليه الصلاة والسلام عن بيان التعبير الصحيح لحكمة ، كما في حديث تعْبير أبي بكر رؤيا الرجل الذي قصّ رؤياه على رسول الله صلى الله عليه وسلم وقول النبي له :\" أصبتَ بعضاً وأخطأت بعضاً \" وأبى أن يبيّن له ما أصاب منها وما أخطأ . ولو أخبر الله رسوله ليُخبر المؤمنين بأنّهم غالبون المشركون لآمنوا بذلك إيماناً عقلياً لا يحصل منه ما يحصل من التصوير بالمحسوس ، ولو لم يخبره ولم يُرِه تلك الرؤيا لكان المسلمون يحسبون للمشركين حساباً كبيراً . لأنّهم معروفون عندهم بأنّهم أقوى من المسلمين بكثير .وهذه الرؤيا قد مضت بالنسبة لزمن نزول الآية ، فالتعبير بالفعل المضارع لاستحضار حالة الرؤيا العجيبة .والقليل هنا قليل العَدد بقرينة قوله : { كثيرا }. أراه إيّاهم قليلي العدد ، وجعل ذلك في المكاشفة النومية كناية عن الوهن والضعف . فإنّ لغة العقول والأرواح أوسع من لغة التخاطب ، لأنّ طريق الاستفادة عندها عقلي مستند إلى محسوس ، فهو واسطة بين الاستدلال العقلي المحض وبين الاستفادة اللغوية .وأخبر ب «قليل» و«كثير» وكلاهما مفرد عن ضمير الجمع لما تقدّم عند قوله تعالى : { معه ربيون كثير } \\[ آل عمران : 146 \\].ومعنى : { ولو أراكهم كثيراً لفشلتم } أنّه لو أراكهم رؤيا مماثلة للحالة التي تبصرها الأعين؛ لدخل قلوبَ المسلمين الفشلُ ، أي إذا حدثهم النبي بما رأى ، فأراد الله إكرام المسلمين بأن لا يدخل نفوسهم هلع ، وإن كان النصر مضموناً لهم .فإن قلت : هذا يقتضي أنّ الإراءة كانت متعيّنة ولِمَ لَمْ يَتْرُك الله إراءتَه جيش العدوّ فلا تكونَ حاجة إلى تمثيلهم بعَدد قليل ، قلتُ : يظهر أنّ النبي صلى الله عليه وسلم رجا أن يرى رؤيا تكشف له عن حال العدوّ ، فحقّق الله رجاءه ، وجنّبه ما قد يفضي إلى كدر المسلمين ، أو لعلّ المسلمين سألوا رسول الله صلى الله عليه وسلم أن يستعلم ربّه عن حال العدوّ .والفشل : الجبن والوهن . والتنازع : الاختلاف . والمراد بالأمر الخطة التي يجب اتباعها في قتال العدوّ من ثبات أو انجلاء عن القتال .والتعريف في { الأمر } للعهد وهو أمر القتال وما يقتضيه .والاستدراك في قوله : { ولكن الله سلم } راجع إلى ما في جملة : { ولو أراكهم كثيراً } من الإشعار بأنّ العدوّ كثير في نفس الأمر ، وأنّ الرؤيا قد تحاكي الصورة التي في نفس الأمر ، وهو الأكثر في مرائي الأنبياء ، وقد تحاكي المعنى الرمزيَّ وهو الغالب في مرائي غير الأنبياء ، مثل رؤيا مَلِك مصر سبعَ بقرات ، ورؤيا صاحبي يوسف في السِّجْن ، وهو القليل في مرائي الأنبياء مثل رؤيا النبي صلى الله عليه وسلم أنّه هَزَّ سيفاً فانكسر في يده ، فمعنى الاستدْراك رفع ما فرض في قوله : { ولو أراكهم كثيراً }. فمفعول { سلم } ومتعلِّقه محذوفان إيجازاً إذ دلّ عليه قوله : { لفشلتم ولتنازعتم } والتقدير : سَلَّمكم من الفَشَل والتنازع بأن سلمكم من سببهما ، وهو إراءتكم واقِع عدد المشركين ، لأنّ الاطّلاع على كثرة العدوّ يلقي في النفوس تهيّباً له وتخوّفاً منه ، وذلك ينقص شجاعة المسلمين الذين أراد الله أن يوفّر لهم منتهى الشجاعة .ووضع الظاهر موضع المضمر في قوله : { ولكن الله سلم } دون أن يقول : ولكنّه سلّم ، لقصد زيادة إسناد ذلك إلى الله ، وأنّه بعنايته ، واهتماماً بهذا الحادث .وجملة : { إنه عليم بذات الصدور } تذييل للمنة ، أي : أوحى إلى رسوله بتلك الرؤيا الرمزية ، لعلمه بما في الصدور البشرية من تأثّر النفوس بالمشاهدات والمحسوسات أكثر ممّا تتأثّر بالاعتقادات ، فعَلِم أنّه لو أخبركم بأنّ المشركين ينهزمون ، واعتقدتم ذلك لصِدْق إيمانكم ، لم يكن ذلك الاعتقاد مثيراً في نفوسكم من الشجاعة والإقدام ما يثيره إعتقادي أنّ عددهم قليل ، لأنّ الاعتقاد بأنّهم ينهزمون لا ينافي توقّع شدّة تَنْزِل بالمسلمين ، من موت وجراح قبل الانتصار ، فأمّا اعتقاد قلّة العدوّ فإنّها تثير في النفوس إقداماً واطمئنان بال ، فلعلمه بذلك أراكهم الله في منامك قليلاً .ومعنى { ذات الصدور } الأحوال المصاحبة لضمائر النفوس ، فالصدور أطلقت على ما حلّ فيها من النوايا والمضمرات ، فكلمة { ذَات } بمعنى صاحبة ، وهي مؤنث ( ذو ) أحدِ الأسماء الخمسة ، فأصل ألفها الواو ووزنها ( ذَوَت ) انقلبت واوها ألفاً لتحرّكها وانفتاح ما قبلها ، قال في «الكشّاف» في تفسير سورة \\[ فاطر : 38 \\] في قوله تعالى : { إنه عليم بذات الصدور } هي تأنيث ذُو ، وذُو موضوع لمعنى الصحبة من قوله: ... لتَغْنِيَ عَنّي ذَا إنائِك أجمَعايعني أنّ ذات الصدور الحالةُ التي قرارتها الصدور فهي صاحبتها وساكنتُها ، فذات الصدور النوايا والخواطر وما يهمّ به المرء وما يدبّره ويكيده .\n\n",
      "translations": [
        {
          "translation": "(When Allah showed them unto thee) Muhammad (in your dream) on the Day of Badr (as few in number, and if He had shown them to thee as many, ye (Muslims) would have faltered) you would have been fearful (and would have quarrelled over the affair) over the question of war. (But Allah saved (you)) He decreed otherwise. (Lo! He knoweth what is in the breasts (of men)) what is in people's heart.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَـٰكِنَّ ٱللَّهَ سَلَّمَ } معناهُ أَتمَّ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - {But Allah is Most forgiving} - means He is most complete in forgiveness.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إذْ يُرِيكهم الله } أيها القلب في منام تعطل الحواس الظاهرة وهدّوا القوى البدنية قليلي القدر\n ضعاف الحال { ولو أرَاكهم كثيراً } في حال غلبة صفات النفس { لفشلتم ولتنازعتم } في أمر كسرها وقهرها لانجذاب كل منكم إلى جهة { ولكن الله سلمَ } عن الفشل والتنازع بتأييده وعصمته { ولا تكونوا } ككفرة القوى النفسانية الذين { خرجوا من } ديار مقارّهم ومحالهم وحدودهم { بطراً ورئاء الناس } وإظهاراً للجلادة على الحواس\n { وإذ زيّن لهم } شيطان الوهم { أعمالهم } في التغلب على مملكة القلب وقواه { وقال لا غَالِبَ لكم اليوم من الناس } وأوهمهم تحقيق أمنيتهم بأن بصرهم أن لا غالب عليهم من ناس الحواس فكذا سائر القوى\n { وإني جار لكم } أمدّكم وأقوّيكم وأمنعكم من ناس القوى الروحانية { فلما تراءَتْ الفِئَتَان نكص على عقبيه } لشعوره بحال القوى الروحانية وغلبتها لمناسبته إياها بإدراك المعاني\n { وقال إني بريء منكم } لأني لست من جنسكم { إني أرى } من المعاني ووصول المدد إليهم من سماء الروح وملكوت عالم القدس { ما لا ترون إني أخاف الله } لشعوري ببعض أنواره وقهره { والله شديد العقاب } وفيه إشارة إلى قول سيد المرسلين: \" لكل أحد شيطان\n ولكن شيطاني أسلم على يديّ \"\n وهذا هو الدستور والأنموذج في أمثال ذلك إن أراد مريد تطبيق القصص على أحواله\n لكني قلما أعود إلى مثله بعد هذا لقلة الفائدة إلا في تصوير طريق السلوك وتخييل المبتدئ ما هو بصدده لتنشيطه في الترقي والعروج والله الهادي",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر يا أكمل الرسل وقت { إِذْ يُرِيكَهُمُ ٱللَّهُ } أي: أعدائك { فِي مَنَامِكَ قَلِيلاً } مما كانوا عليه\n تشجيعاً لكل ولأصحابك { وَلَوْ أَرَاكَهُمْ كَثِيراً } وعلى شوكتهم التي هم فيها { لَّفَشِلْتُمْ } وخيبتم ألبتة رهبةً وهيبةً { وَ } بعدما خيبتم { لَتَنَازَعْتُمْ فِي ٱلأَمْرِ } أي: أمر القتال بعدما عرفتم كثرتهم وشوكتهم\n بل تشرفون على الاستدبار والانهزام { وَلَـٰكِنَّ ٱللَّهَ سَلَّمَ } أي: أنعم عليكم بالسلامة من الفشل والتنازع بإنزال السكينة والوقار على قلوبكم\n بسبب تلبيس التقليل { إِنَّهُ عَلِيمٌ بِذَاتِ ٱلصُّدُورِ } [الأنفال: 43] بعلم مآل أمركم وعاقبته\n لذلك لبَّس عليكم\n ليجرئكم على القتال لإعلاء كلمة توحيده ونصر دينه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولو أراكَهُمْ كثيراً } في الحس { لفشلْتُمْ } لجبنتم\n { ولتنازعتم في الأمر } في أمر القتال\n وتفرقت آراؤكم\n { ولكنَّ الله سلَّم } أي: أنعم بالسلامة من الفشل والتنازع { إنه عليمٌ بذات الصدور } أي: يعلم ما يكون فيها من الخواطر وما يغير أحوالها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:46",
      "similarity": 0.6968479398811885
    },
    {
      "verse": "3:122",
      "similarity": 0.5470272128936405
    },
    {
      "verse": "3:152",
      "similarity": 0.5319054431494843
    },
    {
      "verse": "68:19",
      "similarity": 0.3477236550161057
    },
    {
      "verse": "30:23",
      "similarity": 0.34123631513071895
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008043.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008043.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:43.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}