{
  "chapter": "الأنفال",
  "text": "واذ يريكموهم اذ التقيتم فى اعينكم قليلا ويقللكم فى اعينهم ليقضى الله امرا كان مفعولا والى الله ترجع الامور",
  "translations": [
    {
      "translation": "Remember when Allah made you see them as few when you met them, and also made you seem few in their eyes. This was so that Allah could settle a matter whose result was preordained. All matters return to Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you faced them He made (the enemy) seem few to you in numbers, and made you appear fewer in their eyes, (it was) so that God could accomplish what had been decreed; for all things rest with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when He made them appear as few in your eyes when you met them in the battle just as He lessened you in their eyes so that Allah might accomplish what had been decreed. To Allah are all matters referred for decision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you met the pagans' army, God made them appear fewer in your eyes and you appear fewer in their eyes so that His miracle of granting you (an incredible) victory could easily be fulfilled. To God do all things return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when at the time of fighting He made the disbelievers seem few to you, and you as few in their sight, in order for Allah to conclude the matter that must be done; and towards Allah is the return of all matters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when you met, He showed them to you as few in your eyes and He made you appear as few in their eyes, so that Allah might accomplish a matter already ordained, and to Allah return all matters (for decision).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when He showed them to you, when you met, as few in your eyes and He made you to appear little in their eyes, in order that Allah might bring about a matter which was to be done, and to Allah are all affairs returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God showed you them in your eyes as few, when you encountered, and made you few in their eyes, that God might determine a matter that was done; and unto God all matters are returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when He made you (Muslims), when ye met (them), see them with your eyes as few, and lessened you in their eyes, (it was) that Allah might conclude a thing that must be done. Unto Allah all things are brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When at the time of your encounter He made them appear few in your eyes, and made you appear few in their eyes, it was so that God might bring about that which had been decreed. Everything returns to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time He shewed them few in your eyes when ye met and lessened you in their eyes in order that Allah might decree an affair already enacted; and unto Allah are all affairs returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when He showed them to you as few in your eyes, when you met them [on the battlefield], and He made you [appear] few in their eyes, [it was] in order that Allah may carry through a matter that was bound to be fulfilled, and to Allah all matters are returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when ye met, He showed them to you as few in your eyes, and He made you appear as contemptible in their eyes: that Allah might accomplish a matter already enacted. For to Allah do all questions go back (for decision).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "appear And (remember) when you met (the army of the disbelievers on the Day of the battle of Badr), He showed them to you as few in your eyes and He made you as few in their eyes, so that Allah might accomplish a matter already ordained (in His Knowledge), and to Allah return all matters (for decision).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you met them, He showed them in your eyes as being few, and decreased (your number) in their eyes so that Allah might determine what was ordained. To Allah all matters return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you met, He made them appear as few in your eyes, and made you appear fewer in their eyes, so that God may conclude a predetermined matter. To God all matters revert.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [remember] when He showed them to you, when you met, as few in your eyes, and He made you [appear] as few in their eyes so that Allah might accomplish a matter already destined. And to Allah are [all] matters returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:44] And when God made you see them, O believers, when you met — in your eyes as few, as 70 or 100, when they were [in fact] 1000, so that you would advance against them; and He made you seem as few in their eyes, so that they would advance and not turn back from fighting you — this was before close combat had begun, but when it began, He made them [the disbelievers] see these [believers] as twice their number, as stated in sūrat Āl ‘Imrān [Q. 3:13] — so that God might conclude a matter that was to be done; and to God all things are returned, reverting.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when He made you (Muslims), when ye met (them)) on the Day of Badr, (see them with your eyes as few) such that He emboldened you vis-a-vis them, (and lessened you in their eyes) such that they were emboldened vis-a-vis you, ((it was) that Allah might conclude a thing) so that Allah might give victory and the spoils of war to the Prophet (pbuh) and his Companions and bring about death and defeat for Abu Jahl 188 and his host (that must be done) that has to be. (Unto Allah all things) the end results of things (are brought back) in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكروا أيضاً إمداد الله إياكم بتلبيس الأمر عليكم { إِذْ يُرِيكُمُوهُمْ } أي: أعداءكم { إِذِ ٱلْتَقَيْتُمْ } صافين من الطرفين { فِيۤ أَعْيُنِكُمْ } كما في منامكم { قَلِيلاً } لتستقلوهم وتجترءوا عليهم { وَ } يلبس أمركم عليهم أيضاً تغريراً لهم ومكراً\n إذ { يُقَلِّلُكُمْ فِيۤ أَعْيُنِهِمْ } حتى لا يبالوا بكم ويجمعكم\n ولذلك قال أبو جهل حين تراءت الفئتان: إن محمداً وأصحابه أكلة جذور\n وإنما فعل سبحانه ما فعل من التلبيس على كلا الفريقين { لِيَقْضِيَ ٱللَّهُ أَمْراً كَانَ } عنده { مَفْعُولاً } حتماً { وَ } بالجملة: { إِلَى ٱللَّهِ } لا إلى غيره { تُرْجَعُ ٱلأُمُورُ } [الأنفال: 44] كلها\n إذ منه بدأ وإليع يعود",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { و } اذكر أيضاً { إذْ يُريكموهم } أي: يريكم الله الكفار\n { إذ التقيتم في أعينكم قليلاً } \n حتى قال ابن مسعود لمن إلى جنبه: أتراهم سبعين؟ فقال: أراهم مائة\n تثبتاً وتصديقاً لرؤيا الرسول صلى الله عليه وسلم\n { ويُقلِّلكم في أعينهم } \n حتى قال أبو جهل: إن محمداً وأصحابه أَكَلَهُ جزور ـ بفتح الهمزة والكاف ـ جمع آكل ـ\n أي: قدر ما يكفيهم جذور في أكلهم\n\nقال البيضاوي: قللهم في أعينهم قبل التحام القتال ليجترئوا عليهم ولا يستعدوا لهم\n ثم كثّرهم حين رأوهم مثليهم لتفجأهم الكثرة فتبهتهم وتكسر قلوبهم\n وهذا من عظائم آيات الله في تلك الوقعة\n فإن البصر\n وإن كان قد يرى الكثير قليلاً والقليل كثيراً\n لكن لا على هذا الوجه ولا إلى هذا الحد\n وإنما يتصور ذلك بصد الله الأبصارَ عن إبصار بعضٍ\n مع التساوي في المرئي\n هـ\n  وإنما فعل ذلك في الجهتين { ليقضيَ الله أمراً كان مفعولاً } أي: ليظهر الله أمراً كان سبق به القضاء والقدر\n فكان مفعولاً في سابق العلم\n لا محيد عنه\n ومن شأن الحكمة إظهار الأسباب والعلل\n كما أن من شأن القدرة إبراز ما سبق في الأزل\n وإنما كرره لاختلاف الفعل المعلل به لأن الأول علة لالتقائهم من غير ميعاد\n وهنا لتقليلهم في أعين الكفرة\n أو للتنبيه على أن المطلوب من العبد هو النظر إلى سابق القدر\n ليخف عليه ما يبرز منه من الشدائد والأهوال\n ولذلك قال أثره: { وإلى الله تُرجع الأمور } \n وإذا كانت الأمور كلها راجعة إلى الله تعالى فلا يسع العبد إلا الرضا والتسليم لكل ما يبرز منها\n فكل ما يبرز من عند الحبيب حبيب\n والله تعالى أعلم\n  الإشارة: الأرواح والأسرار بالعُدوة القريبة من بحر الحقائق\n ليس بينها وبينه إلا إظهار أدب العبودية\n وهو الذي بين بحر الحقيقة والشريعة\n والأنفس وسائر القواطع بالعدوة القصوى منه\n والقلب\n الذي هو الركب المنازع فيه\n بينهما\n أسفل من الروح\n وفوق مقام النفس\n الروح تريد أن تجذبه إليها ليسكن الحضرة\n والنفس وجنودها تريد أن تميله إليها ليسكن وطن الغفلة معها\n والحرب بينهما سجال تارة ترد عليه الواردات الإلهية\n التي هي جند الروح\n فتنزل عليه بغتة من غير ميعاد\n فتجذبه إلى الحضرة\n  وتارة ترد عليه الخواطر والهواجس الردية فتحطه إلى أرض الحظوظ بغتة\n ليقضي الله أمراً كان مفعولاً في سابق علمه\n فإذا أراد الله عناية عبد قلّل عنه مدد الأغيار\n حتى يراها كل شيء\n وقواه بمدد الأنوار حتى يغيب عنه كُل شيء فتذهب عنه ظلمة الأغيار وإذا أراد الله خذلان عبد قطع عنه مدد الأنوار\n وقوى عليه مدد الأغيار\n حتى ينحط إلى الدرك الأسفل من النار\n والعياذ بالله من سوء القضاء والقدر\n وإليه الإشارة بقوله: { ليهلك من هلك عن بينة ويحيى من حي عن بينة } الآية\n والله تعالى أعلم\n ثم ذكر ما يقوي مدد الأنواع\n وهو الصبر والذكر\n فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُوۤاْ إِذَا لَقِيتُمْ فِئَةً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:68",
      "similarity": 0.3500627621544604
    },
    {
      "verse": "3:109",
      "similarity": 0.31591530795050143
    },
    {
      "verse": "19:35",
      "similarity": 0.31559763847966693
    },
    {
      "verse": "26:147",
      "similarity": 0.3034579791864943
    },
    {
      "verse": "44:52",
      "similarity": 0.3034579791864943
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/8:44.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/8:44.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/8:44.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}