{
  "chapter": "الأنفال",
  "text": "واطيعوا۟ الله ورسوله ولا تنزعوا۟ فتفشلوا۟ وتذهب ريحكم واصبروا۟ ان الله مع الصبرين",
  "translations": [
    {
      "translation": "Obey Allah and His Messenger and do not quarrel among yourselves lest you lose heart and your",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey God and His Apostle, and do not disagree among yourselves or you will be unmanned and lose courage. Persevere, for God is with those who endure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and His Messenger, and do not quarrel with one another lest you should lose courage and your power depart. Be steadfast, surely Allah is with those who remain steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey God and His Messenger. Do not quarrel with each other lest you fail or lose honor. Exercise patience; God is with those who have patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and His Noble Messenger, and do not dispute with one another for you will lose courage again and your strength will be lost, and patiently endure; indeed Allah is with those who patiently endure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and His Messenger, and do not dispute (with one another) lest you lose courage and your strength departs, and be patient. Surely, Allah is with the patients.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and His Apostle and do not quarrel for then you will be weak in hearts and your power will depart, and be patient; surely Allah is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey God, and His Messenger, and do not quarrel together, and so lose heart, and your power depart; and be patient; surely God is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and His messenger, and dispute not one with another lest ye falter and your strength depart from you; but be steadfast! Lo! Allah is with the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey God and His Messenger, and avoid dissension, lest you falter and are no longer held in awe. Have patience: God is with those who are patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and His apostle, and dispute not, lest ye flag and your predominance depart, and be patient. Verily Allah is with the patient\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and His Apostle, and do not dispute, or you will lose heart and your power will be gone. And be patient; indeed Allah is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and His Messenger; and fall into no disputes, lest ye lose heart and your power depart; and be patient and persevering: For Allah is with those who patiently persevere:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and His Messenger, and do not dispute (with one another) lest you lose courage and your strength depart, and be patient. Surely, Allah is with those who are As-Sabirin (the patient ones, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey Allah and His Messenger and do not dispute with one another lest you should lose courage and your resolve weaken. Have patience Allah is with those who are patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey God and His Messenger, and do not dispute, lest you falter and lose your courage. And be steadfast. God is with the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and His Messenger, and do not dispute and [thus] lose courage and [then] your strength would depart; and be patient. Indeed, Allah is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:46] And obey God and His Messenger, and do not quarrel with one another, do [not] fall into dispute with one another, lest you falter, become cowardly, and your strength, your power and dominion, fade; and be patient. Surely God is with the patient, giving them victory and assistance.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And obey Allah and His messenger) in the matter of war, (and dispute not one with another) regarding war (lest ye falter) lest fear strikes you (and your strength depart from you) i.e. you are defeated; (but be steadfast!) in war along with your Prophet (Lo! Allah is with the steadfast) He helps the steadfast in war.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَتَذْهَبَ رِيحُكُمْ } معناهُ تَنقَطِعُ دَوْلَتُكُمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُ } في جميع حالاتكم، سيما عند المقابلة ومقاتلة العدو { وَلاَ تَنَازَعُواْ } باختلاف الآراء والأهواء، بل فوضوا أمورككم إلى الله ورسوله، وإن وقع النزاع والمخالفة بينكم { فَتَفْشَلُواْ } وتضعفوا فيفتر عزمكم { وَتَذْهَبَ رِيحُكُمْ } أي: دولتكم وهيبتكم التي ظهرت عليكم من نور الإسلام { وَ } بعدما سمعتم ما سمعتم { ٱصْبِرُوۤاْ } على مشاق الجهاد، ورابطوا قلوبكم إلى الله ورسوله { إِنَّ ٱللَّهَ مَعَ ٱلصَّابِرِينَ } [الأنفال: 46] المرابطين المتمكنين، يعين عليهم وينصرهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأطيعوا الله ورسوله } فيما يأمركم به وينهاكم عنه فإن الطاعة مفتاح الخيرات، { ولا تنازعوا } باختلاف الآراء كما فعلتم في شأن الأنفال، { فتفشلوا } وتجبنوا، { وتذهب ريحُكم } أي: ريح نصركم بانقطاع دولتكم، شبه النصر والدولة بهبوب الريح من حيث إنها تمشي على مرادها، لا يقدر أحد أن يردها، وقيل: المراد بها الريح حقيقة، فإن النصرة لا تكون إلا بريح يبعثه الله من ناحية المنصور تذهب إلى ناحية المخذول\n وفي الحديث:\n\n \" نُصِرتُ بالصِّبَا، وأُهْلِكَتْ عَادٌ بالدَّبُورِ \"\n \n",
      "translations": []
    }
  ]
}