{
  "chapter": "الأنفال",
  "text": "ولا تكونوا۟ كالذين خرجوا۟ من ديرهم بطرا ورئاء الناس ويصدون عن سبيل الله والله بما يعملون محيط",
  "translations": [
    {
      "translation": "Do not be like those who went out of their homes full of their own importance, ostentatiously, trying to hinder others from the way of God. But God encompasses all they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like those who came forth from their homes exulting, with a desire to be seen of men, and hindering others from the way of Allah. Allah encompasses all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be like those who marched out boastfully to show off their strength to people and hinder people from the way of God. God encompasses everyone's activities.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be like those who came out from their houses proudly, and to be seen by men, and they prevent people from Allah’s way; and all their actions are within Allah’s control.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like those who come out of their homes boastfully and to be seen of men, and hinder (men) from the path of Allah; and Allah is Muhit (eneompassing and thoroughly comprehending) all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like those who came forth from their homes in great exultation and to be seen of men, and (who) turn away from the way of Allah, and Allah comprehends what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be not as those who went forth from their habitations swaggering boastfully to show off to men, and barring from God's way; and God encompasses the things they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be not as those who came forth from their dwellings boastfully and to be seen of men, and debar (men) from the way of Allah, while Allah is surrounding all they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be like those who left their homes full of conceit and showing off to others. They debar others from the path of God: but God has knowledge of all their actions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like unto those who came forth from their homes vaunting and to be seen of men and hindering others from the way of Allah; and Allah is the Ecompasser of that which they work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be like those who left their homes vainly and to show off to the people, and to bar [other people] from the way of Allah, and Allah comprehends what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like those who started from their homes insolently and to be seen of men, and to hinder (men) from the path of Allah: For Allah compasseth round about all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like those who come out of their homes boastfully and to be seen of men, and hinder (men) from the Path of Allah. and Allah is Muhitun (encircling and thoroughly comprehending) all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be like those who left their homes elated with insolence and showing off to people, barring others from the Path of Allah but Allah encompasses what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be like those who left their homes boastfully, showing off before the people, and barring others from the path of God. God comprehends what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be like those who came forth from their homes insolently and to be seen by people and avert [them] from the way of Allah. And Allah is encompassing of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:47]   And do not be like those who went forth from their dwellings, to defend their caravan and but did not return after it had passed safely, in recklessness and to show off to men — when they said, ‘We will not return until we have drunk wine, sacrificed the camels, and have been entertained by singers at Badr, and [until] people have heard about this — barring, people, from the way of God, while God encompasses, in knowledge, what they do (ya‘malūna, also read ta‘malūna, ‘you do’), and will requite them for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Be not) in transgression (as those who came forth from their dwellings) i.e. Mecca (boastfully) impertinently (and to be seen of men) to gain reputation among men, (and debar (men) from the way of Allah) from Allah's Religion and obedience, (while Allah is surrounding all they do) regarding marching against the Prophet (pbuh) and the matter of war.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ تَكُونُواْ } أيها المؤمنون القاصدون نحو الجهاد { كَٱلَّذِينَ } أي: كالكفار الذين { خَرَجُواْ مِن دِيَارِهِم } يعني: مكة للقتال { بَطَراً } مفاخرين مباهين بعددهم وعُددهم { وَ } يقصدون بذلك الخروج { رِئَآءَ ٱلنَّاسِ } ليثنوا بالشجاعة والسماحة { وَ } هم بمجرد هذا القصد الفاسد والنية الكاسدة { يَصُدُّونَ } أي: ينصرفون ويحرفون { عَن سَبِيلِ ٱللَّهِ } الموضوع على العدل القويم، المسمى بالصراط المستقيم { وَٱللَّهُ } المطلع بجميع أحوالهم { بِمَا يَعْمَلُونَ } ويؤملون من المخايل الفاسدة { مُحِيطٌ } [الأنفال: 47] بعلمه الحضوري، يجازيهم عليها بمقتضى علمه وخبرته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}