{
  "chapter": "الأنفال",
  "text": "اذ يقول المنفقون والذين فى قلوبهم مرض غر هؤلاء دينهم ومن يتوكل على الله فان الله عزيز حكيم",
  "translations": [
    {
      "translation": "And when the hypocrites and those with sickness in their hearts said, 'These people have been deluded by their deen.' But those who put their trust in Allah will find Allah to be Almighty, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites, and those who had doubts in their hearts, said: \"Their faith has misled them.\" But whoever places his trust in God will find God mighty and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when the hypocrites and those whose hearts were diseased said: 'Their faith has deluded these (believers). But he who puts his trust in Allah shall find Allah All-Mighty. All-Wise.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites and those whose hearts are sick, say, \"The (believers') religion has deceived them.\" Those who trust in God will find Him Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites and those in whose hearts is a disease were saying, “These Muslims are proud of their religion”; and whoever trusts Allah, then indeed Allah is Almighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites and those in whose hearts was a disease (of disbelief) said: \"These people (Muslims) are deceived by their religion.\" But whoever puts his trust in Allah, then surely, Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites and those in whose hearts was disease said: Their religion has deceived them; and whoever trusts in Allah, then surely Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites, and those in whose hearts was sickness, said, 'Their religion has deluded them'; but whosoever puts his trust in God, surely God is All-mighty, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites and those in whose hearts is a disease said: Their religion hath deluded these. Whoso putteth his trust in Allah (will find that) lo! Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites and those whose hearts were perverted said, \"These people [the believers] must be deluded by their religion.\" But he who places his trust in God [knows that], God is Almighty and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time the hypocrites and these in whose hearts was a disease said: their religion hath be gulfed those. And whosoever relieth on Allah then verily Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites said, and [also] those in whose hearts is a sickness, ‘Their religion has deceived them.’ But whoever puts his trust in Allah, then Allah is indeed all-mighty, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! the hypocrites say, and those in whose hearts is a disease: \"These people,- their religion has misled them.\" But if any trust in Allah, behold! Allah is Exalted in might, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites and those in whose hearts was a disease (of disbelief) said: \"These people (Muslims) are deceived by their religion.\" But whoever puts his trust in Allah, then surely, Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the hypocrites and those in whose hearts was sickness said: 'Those, their religion has deceived them' But whosoever puts his trust in Allah, indeed Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites and those in whose hearts is sickness said, “Their religion has deluded these people.” But whoever puts his trust in God—God is Mighty and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Remember] when the hypocrites and those in whose hearts was disease said, \"Their religion has deluded those [Muslims].\" But whoever relies upon Allah - then indeed, Allah is Exalted in Might and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:49] When the hypocrites and those in whose hearts is a sickness, a weakness of faith, said, ‘Their religion has deluded them’, that is, the Muslims, for they had set out to fight a large army despite their small number, in the mistaken belief that they will be victorious because of this. God, exalted be He, says in response to them: but whoever relies on God, [whoever] puts his trust in Him, he will triumph; for truly God is Mighty, His way will prevail, Wise, in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيتعلّق { إذ يقول } بأقرب الأفعال إليه وهو قوله : { زين لهم الشيطان أعمالهم } \\[ الأنفال : 48 \\] مع ما عطف عليه من الأفعال ، لأنّ { إذ } لا تقتضي أكثر من المقارنة في الزمان بين ما تضاف إليه وبين متعلَّقها ، فتعين أن يكون قول المنافقين واقعاً في وقت تزيين الشيطان أعمال المشركين فيتم تعليق وقت قول المنافقين بوقت تزيين الشيطان أعمال المشركين ، وإنّما تُطلب المناسبة لذكر هذا الخبر عقب الذي وَليه هو ، وتلك هي أنّ كلا الخبرين يتضمّن قوّة جيش المشركين ، وضعف جيش المسلمين ، ويقينَ أولياء الشيطان بأنّ النصر سيكون للمشركين على المسلمين . فالخبر الأول عن طائفة أعانت المشركين بتأمينهم من عدوّ يخشونه فانحازت إليهم علناً ، وذلك يستلزم تقبيح ما أقحم المسلمون فيه أنفسهم إذ عمدوا إلى قتال قوم أقوياء . والخبر الثاني : عن طائفتين شوَّهتا صنيع المسلمين حَمَّقتَاهُم ونَسَبَتاهم إلى الغرور فأسرّوا ذلك ولم يبوحوا به ، وتحدّثوا به فيما بينهم ، أو أسرّوه في نفوسهم .فنَظْم الكلام هكذا : وزيَّن الشيطان للمشركين أعمالهم حين كان المنافقون يقبحون أعمال المسلمين ويصفونهم بالغرور وقلّة التدبير من اعتقادهم في دينهم الذي أوقعهم في هذا الغرور ويجول في نفوس الذين في قلوبهم مرض مثل هذا .و«القول» هنا مستعمل في حقيقته ومجازه : الشامل لحديث النفس ، لأنّ المنافقين يقولون ذلك بألسنتهم ، وأمّا الذين في قلوبهم مرض وهم طائفة غير المنافقين ، بل هم مَن لم يتمكّن الإيمان من قلوبهم . فيقولونه في أنفسهم لما لهم من الشكّ في صدق وعد النبي صلى الله عليه وسلم لأنّهم غير موالين للمنافقين ، ويجوز أن يتحدّثوا به بين جماعتهم .و«المرض» هنا مجاز في اختلال الاعتقاد ، شبه بالمرض بِوجهِ سوء عاقبته عليهم . وقد تقدّم في قوله تعالى : { في قلوبهم مرض } في أول \\[ البقرة : 10 \\].وأشاروا { بهؤلاء } إلى المسلمين الذين خرجوا إلى بدر ، وقد جرت الإشارة على غير مشاهد ، لأنّهم مذكورون في حديثهم أو مستحضَرون في أذهانهم ، فكانوا بمنزلة الحاضر المشاهد لهم وهم يتعارفون بمثل هذه الإشارة في حديثهم عن المسلمين .والغرور : الإيقاع في المضرّة بإيهام المنفعة ، وقد تقدّم عند قوله تعالى : { لا يغرنك تقلب الذين كفروا في البلاد } في سورة \\[ آل عمران : 196 \\] ، وقوله : { زخرف القول غروراً } في سورة \\[ الأنعام : 112 \\].والدين هو الإسلام ، وإسنادهم الغرور إلى الدين باعتبار ما فيه من الوعد بالنصر من نحو قوله : { إن يكن منكم عشرون صابرون يغلبوا مائتين } \\[ الأنفال : 65 \\] الآية ، أي غرّهم ذلك فخرجوا وهم عدد قليل للقاء جيش كثير ، والمعنى : إذ يقولون ذلك عند اللقاء وقبل حصول النصر . فإطلاق الغرور هنا مجاز ، وإسناده إلى الدين حقيقة عقلية .وجملة : { ومن يتوكل على الله فإن الله عزيز حكيم } معطوفة على جملة : { وإذ زين لهم الشيطان أعمالهم }\\[ الأنفال : 48 \\] لأنّها من جملة الأخبار المسوقة؛ لبيان عناية الله تعالى بالمسلمين ، وللامتنان عليهم ، فالمناسبة بينها وبين الجملة التي قبلها : أنها كالعلّة لخيبة ظنون المشركين ونصرائهم ، أي أنّ الله خيّب ظنونهم لأنّ المسلمين توكّلوا عليه وهو عزيز لا يغلب ، فمن تمسك بالاعتماد عليه نصره ، وهو حكيم يكوّن أسباب النصر من حيث يجهلها البشر .والتوكّل : الاستسلام والتفويض ، وقد تقدّم عند قوله تعالى : { فإذا عزمت فتوكل على الله } في سورة \\[ آل عمران : 159 \\].وجعل قوله : فإن الله عزيز حكيم } جواباً للشرط باعتبار لازمه وهو عزّة المُتَوكِّل على الله وإلفائه منجياً من مضيق أمره ، فهو كناية عن الجواب وهذا من وجوه البيان وهو كثير الوقوع في القرآن ، وعليه قول زهير :من يلقَ يوما على عِلاته هَرِماً ... يَلْقَ السماحة فيه والندى خُلقاأي ينل من كرمه ولا يتخلّف ذلك عنه في حال من الأحوال ، وقولُ الربيع بن زياد العبسي : ... مَن كان مسروراً بمقتل مالكفليأت نسوتنا بوجهِ نهار ... يجدِ النساء حواسراً يندبنهبالليل قبل تبلُّج الأسفار ... أي من كان مسروراً بمقتله فسروره لا يدوم إلاّ بعض يوم ثم يحزنه أخذ الثأرِ إمّا من ذلك المسرور إن كان هو القاتل أو من أحد قومه وذلك يُحزن قومه .\n\n",
      "translations": [
        {
          "translation": "(When the hypocrites) those who apostatised on the Day of Badr (and those in whose hearts is a disease) doubt and opposition as well as all disbelievers (said: Their religion) their profession of Allah's divine Oneness (hath deluded these) Muhammad (pbuh) and all his Companions. (Whoso putteth his trust in Allah) regarding His assistance (lo! Allah is Mighty) in His retribution against His enemies, (Wise) in giving assistance to those who put their trust in Him, just as He assisted His Prophet (pbuh) on the Day of Badr.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n حين خرجتم نحو العدو مجزئين مع قلتكم وكثرة عددكم: { غَرَّ هَـٰؤُلاۤءِ دِينُهُمْ } فألقوا أنفسهم إلى التهلكة بأيديهم بخروج ثلاثمائة عزل بلا عدة إلى زهاء ألف مستعدين\n لا تبالوا أيها المطمئنون بالإيمان بهم وبقولهم\n لا تفتروا وتضعفوا من هذياناتهم\n بل توكلوا على ربكم وفوضوا الأمر إليه { وَمَن يَتَوَكَّلْ عَلَى ٱللَّهِ } فهو حسبه { فَإِنَّ ٱللَّهَ عَزِيزٌ } غالب في ذاته\n قادر على إعانة من استعان منه { حَكِيمٌ } [الأنفال: 49] متقن في فعله وأمره\n ويأمر ما تستبعده العقول وتدهش فيه الأحلام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: واذكروا { إذْ يقول المنافقون } من أهل المدينة، أو نفر من قريش كانوا أسلموا وبقوا بمكة، فخرجوا يوم بدر مع الكفار، منهم: قيس بن الوليد بن المغيرة، وأبو القيس بن الفاكه بن المغيرة، والحارث بن ربيعة بن الأسود، وعلي بن أمية بن خلف، { و } هم { الذين في قلوبهم مرض } أي: شك لم تطمئن قلوبهم، بل بقي فيها شبهة، قالوا: { غرَّ هؤلاء دينُهُم } أي: اغتر المسلمون بدينهم، فأدخلوا أنفسهم فيما لا طاقة لهم به، فخرجوا وهم ثلاثمائة وبضعة عشر إلى زهاء ألف. فأجابهم الحق تعالى بقوله: { ومن يتوكل على الله فإن الله عزيزٌ } أي: غالب لا يذل من استجار به، وإن قلَّ، { حكيمٌ } يفعل بحكمته البالغة ما يستبعده العقل، ويعجز عن دركه الفهم. الإشارة: إذا عظم اليقين في قلوب أهل التقى أقدموا على أمور عظام، تستغرب العادة إدراكها، أو يغلب العطب فيها، فيقول المنافقون والذين في قلوبهم مرض: غرَّ هؤلاء طريقتهم، ومن يتوكل على الله فإن الله عزيز لا يُغلبْ، ولا يُغلبْ من انتسب إليه، وتوكل في أموره عليه، حكيم فلا يَخرج عن حكمته وقدرته شيء، أو عزيز لا يُذل من استجار به، ولا يضيع من لاذ به، والتجأ إلى ذماره، حكيم لا يقصر عن تدبير من توكل على تدبيره، قاله في الإحياء. ثم قال: وكل ما ذكر في القرآن من التوحيد هو تنبيه على قطع الملاحظة عن الأغيار، والتوكل على الواحد القهار. هـ. وبالله التوفيق. ثم ذكر عاقبة أهل النفاق والريب، فقال: { وَلَوْ تَرَىٰ إِذْ يَتَوَفَّى ٱلَّذِينَ كَفَرُواْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:12",
      "similarity": 0.7959889427198475
    },
    {
      "verse": "82:6",
      "similarity": 0.4089377163795028
    },
    {
      "verse": "3:24",
      "similarity": 0.40783921274899665
    },
    {
      "verse": "2:10",
      "similarity": 0.40731351582251607
    },
    {
      "verse": "35:5",
      "similarity": 0.4070999323699079
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008049.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008049.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:49.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}