{
  "chapter": "الأنفال",
  "text": "كما اخرجك ربك منۢ بيتك بالحق وان فريقا من المؤمنين لكرهون",
  "translations": [
    {
      "translation": "Just as your Lord brought you out from your house with truth, even though a group of the muminun disliked it,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As your Lord sent you from your home (to fight) for the true cause, a section of the faithful were averse,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Now with regard to the spoils the same situation exists as when) your Lord brought you forth from your home in a righteous cause while a party among the believers were much averse to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A group among the believers dislike (God's decree about the booty captured in war) as well as His command that you come out of your home for a truthful purpose (to fight for justice).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The way your Lord caused you, O dear Prophet to come forth from your home with the truth; and indeed a group of Muslims were unhappy about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As your Lord caused you to go out from your home with the truth; and verily, a party among the believers disliked it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even as your Lord caused you to go forth from your house with the truth, though a party of the believers were surely averse;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As thy Lord brought thee forth from thy house with the truth, and a part of the believers were averse to it,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even as thy Lord caused thee (Muhammad) to go forth from thy home with the Truth, and lo! a party of the believers were averse (to it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As it was your Lord who rightfully brought you forth from your house, even though some of the believers disliked it,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is like what time thy Lord had caused thee to go forthfrom thy house for a right cause, while a party among the believers were averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As your Lord brought you out from your home with a just cause, a part of the faithful were indeed reluctant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Just as thy Lord ordered thee out of thy house in truth, even though a party among the Believers disliked it,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As your Lord caused you (O Muhammad SAW) to go out from your home with the truth, and verily, a party among the believers disliked it;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is like when your Lord caused you to leave your home with the truth, though some of the believers disliked it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even as your Lord brought you out of your home with the truth, some believers were reluctant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[It is] just as when your Lord brought you out of your home [for the battle of Badr] in truth, while indeed, a party among the believers were unwilling,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:5] As your Lord brought you forth from your home with the truth (bi’l-haqq is semantically connected to akhraja, ‘He brought forth’), and indeed a party of the believers were averse, to going forth (the [last] sentence is a circumstantial qualifier referring to the [suffixed pronoun] kāf in akhrajaka, ‘He brought you forth’; kamā, ‘as’, is the predicate of an omitted subject, in other words: their aversion to this state [of affairs of the booty being God’s and the Prophet’s] is similar to their aversion when you were brought forth [to fight], which had actually been better for them: likewise is this [state of affairs better for them]). It happened that Abū Sufyān was returning from Syria with a caravan. The Prophet (s) and his followers went forth to plunder it; but Quraysh became aware of this, and so Abū Jahl and some Meccan fighters rode out to defend it — these constituted the ‘band’. Abū Sufyān drove the caravan via the coastal route and it managed to escape. Abū Jahl was then advised to return, but he refused and marched on towards Badr. The Prophet (s) consulted with his followers, saying to them, ‘God has promised me one of the two parties’. So they agreed with him to attack the [Meccan] band, but some of them were averse to this, complaining, ‘We have not come prepared for this!’, as God, exalted be He, says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Even as thy Lord caused thee to go forth) proceed, Muhammad, in that which your Lord has caused you to go forth (from thy home) from Medina (with the Truth) with the Qur'an; it is also said that this means: with war, (and lo! a party) a group (of the believers were averse (to it)) to fighting,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كَمَآ } أعطاك يا أكمل الرسل حين { أَخْرَجَكَ رَبُّكَ مِن بَيْتِكَ } حين أخبرك جبريل عليه السلام من إقبال عير مكة من قبل الشام، وفيها أبو سفيان ملتبساً { بِٱلْحَقِّ } المطابق للواقع { وَ } الحال { إِنَّ فَرِيقاً مِّنَ ٱلْمُؤْمِنِينَ لَكَارِهُونَ } [الأنفال: 5] خروجك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { كما أخرجك } خبر عن مبتدأ محذوف، أي: هذه الحال، وهي عزلهم عن تولية الأَنفال في كراهتهم لها، كحال إخراجك في الحرب في كراهتهم لها، أو حالهم في كراهية ما رأيت من تنفيلك للغزاة، مثل حالهم في كراهية خروجك، أو صفة لمصدر الفعل المقدر في قوله: { لله والرسول } أي: الأنفال تثبت لله وللرسول صلى الله عليه وسلم، مع كراهتهم، ثباتاً مثل ثبات إخراجك ربُّك من بيتك، يعني المدينة لأنها مسكنه أو بيته منها، وجملة: { وإن فريقاً } حال مِن أخرجك، أي: أخرجك في حال كراهية فريق من المؤمنين\n يقول الحق جل جلاله لنبيه صلى الله عليه وسلم: قد كره أصحابُك قسمتك للأنفال كما كرهوا إخراجك { ربُّك من بيتك بالحق } لقتال العدو، والحال أن { فريقاً من المؤمنين لكارهون } خروجك لذلك، وتلك الكراهية من قِبل النفس وطبع البشرية، لا من قِبل الإنكار في قلوبهم لأمر الله ورسوله، فإنهم راضون مستسلمون، غير أن الطبع ينزع لِحَظَّه، والعبد مأمور بمخالفته وجهاده",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:78",
      "similarity": 0.49749309468910907
    },
    {
      "verse": "17:38",
      "similarity": 0.4695564827209991
    },
    {
      "verse": "23:70",
      "similarity": 0.4577569096594738
    },
    {
      "verse": "10:82",
      "similarity": 0.4448606517278346
    },
    {
      "verse": "10:99",
      "similarity": 0.4339280278403069
    }
  ]
}