{
  "chapter": "الأنفال",
  "text": "كما اخرجك ربك منۢ بيتك بالحق وان فريقا من المؤمنين لكرهون",
  "translations": [
    {
      "translation": "Just as your Lord brought you out from your house with truth, even though a group of the muminun disliked it,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As your Lord sent you from your home (to fight) for the true cause, a section of the faithful were averse,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Now with regard to the spoils the same situation exists as when) your Lord brought you forth from your home in a righteous cause while a party among the believers were much averse to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A group among the believers dislike (God's decree about the booty captured in war) as well as His command that you come out of your home for a truthful purpose (to fight for justice).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The way your Lord caused you, O dear Prophet to come forth from your home with the truth; and indeed a group of Muslims were unhappy about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As your Lord caused you to go out from your home with the truth; and verily, a party among the believers disliked it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even as your Lord caused you to go forth from your house with the truth, though a party of the believers were surely averse;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As thy Lord brought thee forth from thy house with the truth, and a part of the believers were averse to it,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even as thy Lord caused thee (Muhammad) to go forth from thy home with the Truth, and lo! a party of the believers were averse (to it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As it was your Lord who rightfully brought you forth from your house, even though some of the believers disliked it,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is like what time thy Lord had caused thee to go forthfrom thy house for a right cause, while a party among the believers were averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As your Lord brought you out from your home with a just cause, a part of the faithful were indeed reluctant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Just as thy Lord ordered thee out of thy house in truth, even though a party among the Believers disliked it,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As your Lord caused you (O Muhammad SAW) to go out from your home with the truth, and verily, a party among the believers disliked it;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is like when your Lord caused you to leave your home with the truth, though some of the believers disliked it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even as your Lord brought you out of your home with the truth, some believers were reluctant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[It is] just as when your Lord brought you out of your home [for the battle of Badr] in truth, while indeed, a party among the believers were unwilling,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:5] As your Lord brought you forth from your home with the truth (bi’l-haqq is semantically connected to akhraja, ‘He brought forth’), and indeed a party of the believers were averse, to going forth (the [last] sentence is a circumstantial qualifier referring to the [suffixed pronoun] kāf in akhrajaka, ‘He brought you forth’; kamā, ‘as’, is the predicate of an omitted subject, in other words: their aversion to this state [of affairs of the booty being God’s and the Prophet’s] is similar to their aversion when you were brought forth [to fight], which had actually been better for them: likewise is this [state of affairs better for them]). It happened that Abū Sufyān was returning from Syria with a caravan. The Prophet (s) and his followers went forth to plunder it; but Quraysh became aware of this, and so Abū Jahl and some Meccan fighters rode out to defend it — these constituted the ‘band’. Abū Sufyān drove the caravan via the coastal route and it managed to escape. Abū Jahl was then advised to return, but he refused and marched on towards Badr. The Prophet (s) consulted with his followers, saying to them, ‘God has promised me one of the two parties’. So they agreed with him to attack the [Meccan] band, but some of them were averse to this, complaining, ‘We have not come prepared for this!’, as God, exalted be He, says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتشبيهُ حال بحال ، وهو متصل بما قبله : إما بتقدير مبتدأ محذوف ، هو اسم إشارة لما ذكر قبله ، تقديرُه : هذا الحال كحال ما أخرجك ربك من بيتك بالحق ، ووجه الشبه هو كراهية المؤمنين في بادىء الأمر لما هو خير لهم في الواقع وإما بتقدير مصدر لفعل الاستقرار الذي يقتضيه الخبر بالمجرور في قوله { الأنفال لله وللرسول } \\[ الأنفال : 1 \\] إذ التقدير : استقرت لله والرسول استقراراً كما أخرجك ربك ، أي فيما يلوح إلى الكراهية والامتعاض في بادىء الأمر ، ثم نوالهم النصرَ والغنيمةَ في نهاية الأمر ، فالتشبيه تمثيلي وليس مراعى فيه تشبيهُ بعض أجزاء الهيئة المشبهة ببعض أجزاء الهيئة المشبّه بها ، أي أن ما كرهتموه من قسمة الأنفال على خلاف مشتهاكم سيكون فيه خير عظيم لكم ، حسب عادة الله تعالى بهم في أمره ونهيه ، وقد دل على ما في الكلام من معنى مخالفة مشتهاهم قولُه { فاتقوا الله وأصلحوا ذات بينكم وأطيعوا الله ورسوله إن كنتم صادقين } \\[ الأنفال : 1 \\] كما تقدم ، مع قوله في هذه الجملة { وإن فريقاً من المؤمنين لكارهون }.فجملة : { وإن فريقاً } في موضع الحال والعامل فيها { أخرجك ربك } هذا وجه اتصال كاف التشبيه بما قبلها على ما الأظهر ، وللمفسرين وجوه كثيرة بلغت العشرين قد استقصاها ابن عادل ، وهي لا تخلو من تكلف ، وبعضها متحد المعنى وبعضها مختلفُه ، وأحسن الوجوه ما ذكره ابن عطية ومعناه قريب مما ذكرنا وتقديره بعيد منه .والمقصود من هذا الأسلوب : الانتقالُ إلى تذكيرهم بالخروج إلى بدر وما ظهر فيه من دلائِل عناية الله تعالى برسوله صلى الله عليه وسلم وبالمؤمنين .و { ما } مصدرية . والإخراج : إما مراد به الأمر بالخروج للغزو ، وإما تقديرُ الخروج لهم وتيسيره .والخروج مفارقة المنزل والبلدِ إلى حيننِ الرجوع إلى المكان الذي خرج منه ، أو إلى حيننِ البلوغ إلى الموضع المنتقل إليه .والإخراج من البيت : هو الإخراج المعيّن الذي خرج به النبي صلى الله عليه وسلم غازياً إلى بدر .والباء في { بالحق } للمصاحبة أي إخراجاً مصاحباً للحق ، والحق هنا الصواب ، لما تقدم آنفاً من أن اسم الحق جامع لمعنى كمال كل شيء في محامد نوعه .والمعنى أن الله أمره بالخروج إلى المشركين ببدر أمراً موافقاً للمصلحة في حال كراهة فريق من المؤمنين ذلك الخروج .وقد أشار هذا الكلام إلى السبب الذي خرج به المسلمون إلى بدر ، فكان بينهم وبين المشركين يوم بدر ، وذلك أنه كان في أوائل رمضان في السنة الثانية للهجرة إن قفلت عيرٌ لقريش فيها أموال وتجارة لهم من بلاد الشام ، راجعة إلى مكة ، وفيها أبو سفيان بن حرب في زهاء ثلاثين رجلاً من قريش ، فلما بلغ خبر هذه العير رسول الله صلى الله عليه وسلم ندب المسلمين إليها فانتدب بعضهم وتثاقل بعضٌ ، وهم الذين كرهوا الخروج ، ولم ينتظر رسول الله صلى الله عليه وسلم من تثاقلوا ومن لم يحْضر ظهرهم أي رواحلهم فسار وقد اجتمع من المسلمين ثلاثمائة وبضعة عشر خرجوا يوم ثمانية من رمضان ، وكانوا يحسبون أنهم لا يلقون حرباً وأنهم يغيرون على العير ثم يرجعون ، وبلغ أبا سفيان خبر خروج المسلمين فأرسل صارخاً يستصرخ قريشاً لحماية العير ، فتجهز منهم جيش ، ولما بلغ المسلمون وادي ذفرَان بلغهم خروج قريش لتلقي العير ، فاستشار رسول الله صلى الله عليه وسلم فأشاروا عليه بالمضي في سبيله وكانت العير يومئذ فاتتهم ، واطمأن أبو سفيان لذلك فأرسل إلى أهل مكة يقول إن الله نجى عيركم فارجعوا ، فقال أبو جهل لا نرجع حتى نَرِد بدراً ( وكان بدرٌ موضع ماء فيه سوق للعرب في كل عام ) فنقيم ثلاثاً ، فننحرَ الجُزر ونسقي الخمر وتعزف علينا القيان ، وتتسامع العرب بنا وبمسيرنا فلا يزالوا يهابوننا ويعلموا أن محمداً لم يصب العير ، وأنا قد أعضضناه ، فسار المشركون إلى بدر وتنبكتْ عيرهم على طريق الساحل وأعلم الله النبي صلى الله عليه وسلم بذلك فأعلم المسلمين ، فاستشارهم وقال : العيرُ أحبُ إليكم أم النفير ، فقال أكثرهم العير أحب إلينا من لقاء العدو ، فتغير وجه رسول الله صلى الله عليه وسلم ثم أعاد استشارتهم فأشار أكثرهم قائلين : عليك بالعير فإنا خرجنا للعير فظهر الغضبُ على وجهه .فتكلم أبو بكر ، وعمر ، والمقداد بنُ الأسود ، وسعدُ بن عبادةَ ، وأكثر الأنصار ، ففوضوا إلى رسول الله ما يرى أن يسير إليه صلى الله عليه وسلم فأمرهم حينئذ أن يسيروا إلى القوم ببدر فساروا . وكان النصر العظيم الذي هز به الإسلامُ رأسه .فهذا ما أشار إليه قوله تعالى : { وإن فريقاً من المؤمنين لكارهون } وذلك أنهم خرجوا على نية التعرض للعير ، وأن ليس دونَ العير قتال ، فلما أخبرهم عن تجمع قريش لقتالهم تكلم أبو بكر فأحسن ، وتكلم عمر فأحسن ، ثم قام المقداد بن الأسود فقال «يا رسول الله امضضِ لما أراك الله فنحن معك والله لا نقول لك كما قالت بنو إسرائيل لموسى اذهب أنت وربك فقاتلا إنّا هَهنا قاعدون ولكن اذهب أنت وربك فقاتلا إنا معكما مقاتلون ، نقاتل عن يمينك وعن شمالك وبين يديكَ وخلفك ، فوالذي بعثك بالحق لو سرت بنا إلى ( بَركِ الغماد ) ( بفتح باء برك وغين الغماد ومعجمة مكسورة موضع باليمن بعيد جداً عن مكة ) لجادلنا معك من دونه حتى تبلغه . ثم قال رسول الله صلى الله عليه وسلم \" أشيروا عليّ أيها الناس \" وإنما يريد الأنصار ، وذلك أنهم حين بايعُوه بالعقبة قالوا يومئذ «إنا بُرءاء من ذمامك حتى تصل إلى ديارنا فإذا وصلت إلينا فإنك في ذمتنا نمنعك مما نمنع منه أبناءنا ونساءنا» فكان رسول الله يتخوف أن يكون الأنصار لا يرون نصرَه إلا ممّن دَهمه بالمدينة ، وأن ليس عليهم أن يسير بهم من بلادهم ، فلما قال رسول الله صلى الله عليه وسلم «أشيروا عليّ قال له سعد بن معاذ «والله لكأنّك تريدنا يا رسول الله قال : أجلْ قال : فقد آمنّا بك وصدقناك وشهدنا أن ما جئت به هو الحق وأعطيناك على ذلك عهودنا ومواثيقنا على السمع والطاعة فامض يا رسول الله لما أردت فنحن معك فوالذي بعثك بالحق لو استعرضت بنا هذا البحرَ فخصته لخضناه معك وما تخلف منا رجل واحد وما نَكْرَهُ أن تلقى بنا عدونا غداً إنا لصبرٌ في الحرب صدقٌ في اللقاء لعل الله يريك بنا ما تقرُّ به عينُك فسِرْ بنا على بركة الله» فسُرَّ رسول الله صلى الله عليه وسلم ثم قال : سيروا وأبشروا فإن الله قد وعدني إحدى الطائفتين أي ولم يخص وعد النصر ، بتلقي العير فقط فما كان بعد ذلك إلا أن زال من نفوس المؤمنين الكارهين للقتال ما كان في قلوبهم من الكراهية ، وقوله { وإن فريقاً من المؤمنين لكارهون } في موضع الحال من الإخراج الذي أفادته ، ( ما ) المصدرية ، وهؤلاء هم الذين تثاقلوا وقت العزم على الخروج من المدينة ، والذين اختاروا العير دون النفيرِ حين استشارة وادي ذَفِرَان ، لأن ذلك كله مقترن بالخروج لأن الخروج كان ممتداً في الزمان ، فجملة الحال من قوله : { وإن فريقاً من المؤمنين لكارهون } حال مقارنة لعاملها وهو { أخرجك }.وتأكيد خبر كراهية فريق من المؤمنين بإن ولام الابتداء مستعمل في التعجيب من شأنهم بتنزيل السامع غير المنكر لوقوع الخبر منزلةَ المنكر لأن وقوع ذلك مما شأنه أن لا يقع ، إذ كان الشأن اتباع ما يحبه الرسول صلى الله عليه وسلم أو التفويضَ إليه ، وما كان ينبغي لهم أن يكرهوا لقاء العدو . ويستلزم هذا التنزيلُ التعجيبَ من حال المخبر عنهم بهذه الكراهية فيكون تأكيد الخبر كناية عن التعجيب من المخبر عنهم .\n\n",
      "translations": [
        {
          "translation": "(Even as thy Lord caused thee to go forth) proceed, Muhammad, in that which your Lord has caused you to go forth (from thy home) from Medina (with the Truth) with the Qur'an; it is also said that this means: with war, (and lo! a party) a group (of the believers were averse (to it)) to fighting,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ كما أخرجك } أي: هذه الحال - يعني حالهم في الاعتراض عليك في باب التنقيل - كحالهم في الاعتراض عليك عند إخراج ربّك إياك لأنهم لما احتجبوا عن فعل الله بأفعالهم رأوا الفعلين منك فكرهوا خروجك كما كرهوا تنفيلك وما فطنوا لإخراج ربّك إياك { من بَيْتك بالحق } أي: ملتبساً بالحق\n خارجاً به لا بنفسك\n فيكون بالحق حالاً من مفعول: أخرجك\n أو خروجاً ملتبساً بالذي هو الصواب والحكمة { يجادِلونَكَ في الحق } لاحتجابهم بأفعالهم وصفاتهم { بعدما تبين } عليك حاله بالتجلي أو تبين عليهم آثاره بالمعجزات من قبل\n أو بإعلامك إياهم بأن النصرة لهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كَمَآ } أعطاك يا أكمل الرسل حين { أَخْرَجَكَ رَبُّكَ مِن بَيْتِكَ } حين أخبرك جبريل عليه السلام من إقبال عير مكة من قبل الشام\n وفيها أبو سفيان ملتبساً { بِٱلْحَقِّ } المطابق للواقع { وَ } الحال { إِنَّ فَرِيقاً مِّنَ ٱلْمُؤْمِنِينَ لَكَارِهُونَ } [الأنفال: 5] خروجك\n\n\nومن كمال كراهتهم { يُجَادِلُونَكَ فِي ٱلْحَقِّ } الصريح الذي هو الجهاد\n سيما { بَعْدَ مَا تَبَيَّنَ } وظهر لك بوحي الله إياك\n ووعده النصر والظفر لك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { كما أخرجك } خبر عن مبتدأ محذوف\n أي: هذه الحال\n وهي عزلهم عن تولية الأَنفال في كراهتهم لها\n كحال إخراجك في الحرب في كراهتهم لها\n أو حالهم في كراهية ما رأيت من تنفيلك للغزاة\n مثل حالهم في كراهية خروجك\n أو صفة لمصدر الفعل المقدر في قوله: { لله والرسول } أي: الأنفال تثبت لله وللرسول صلى الله عليه وسلم\n مع كراهتهم\n ثباتاً مثل ثبات إخراجك ربُّك من بيتك\n يعني المدينة لأنها مسكنه أو بيته منها\n وجملة: { وإن فريقاً } حال مِن أخرجك\n أي: أخرجك في حال كراهية فريق من المؤمنين\n يقول الحق جل جلاله لنبيه صلى الله عليه وسلم: قد كره أصحابُك قسمتك للأنفال كما كرهوا إخراجك { ربُّك من بيتك بالحق } لقتال العدو\n والحال أن { فريقاً من المؤمنين لكارهون } خروجك لذلك\n وتلك الكراهية من قِبل النفس وطبع البشرية\n لا من قِبل الإنكار في قلوبهم لأمر الله ورسوله\n فإنهم راضون مستسلمون\n غير أن الطبع ينزع لِحَظَّه\n والعبد مأمور بمخالفته وجهاده\n وذلك الفريق الذي كره خروجك للقتال { يُجادلونك في الحق } أي: يخاصمونك في إيثارك الجهاد لإظهار الحق\n حيث أرادوا الرجوع للمدينة\n وقالوا: إنا لم نخرج لقتال\n قالوا ذلك { بعد ما تَبَيّن } لهم أنهم منصرون أينما توجهوا\n بإعلام الرسول لهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:78",
      "similarity": 0.49749309468910907
    },
    {
      "verse": "17:38",
      "similarity": 0.4695564827209991
    },
    {
      "verse": "23:70",
      "similarity": 0.4577569096594738
    },
    {
      "verse": "10:82",
      "similarity": 0.4448606517278346
    },
    {
      "verse": "10:99",
      "similarity": 0.4339280278403069
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008005.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008005.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}