{
  "chapter": "الأنفال",
  "text": "ذلك بان الله لم يك مغيرا نعمة انعمها على قوم حتى يغيروا۟ ما بانفسهم وان الله سميع عليم",
  "translations": [
    {
      "translation": "That is because Allah would never change a blessing He has conferred on a people until they had changed what was in themselves. Allah is All-Hearing, All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not withdraw a favour bestowed upon a people unless they change themselves, for God hears all and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This happened because Allah is not one to change the favour which He has bestowed upon a people until they have changed their attitude., Surely Allah is All-Hearing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not change the favor that He has bestowed on a nation unless that nation changes what is in its soul. God is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because Allah does not change the favour He has bestowed upon any people until they first change themselves, and indeed Allah is All Hearing, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is so because Allah will never change a grace which He has bestowed on a people until they change what is in themselves. And verily, Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because Allah has never changed a favor which He has conferred upon a people until they change their own condition; and because Allah is Hearing, Knowing;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because God would never change His favour that He conferred on a people until they changed what was within themselves; and that God is All-hearing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah never changeth the grace He hath bestowed on any people until they first change that which is in their hearts, and (that is) because Allah is Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God would never withdraw a favour that He had conferred upon a people unless they change what is in their hearts. God is all hearing and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This, because Allah is not one to change His favour wherewith He hath favoured a people until they have changed that which is in themselves; and verily Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah never changes a blessing that He has bestowed on a people unless they change what is in their own souls, and Allah is all-hearing, all-knowing:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because Allah will never change the grace which He hath bestowed on a people until they change what is in their (own) souls: and verily Allah is He Who heareth and knoweth (all things).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is so because Allah will never change a grace which He has bestowed on a people until they change what is in their ownselves. And verily, Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because Allah would never change His favor that He bestowed upon a nation until they change what is in their hearts. Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because God would never change a blessing He has bestowed on a people unless they change what is within themselves, and because God is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah would not change a favor which He had bestowed upon a people until they change what is within themselves. And indeed, Allah is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:53] That, chastisement of the disbelievers, is because God would never change a grace that He had conferred on a people, substituting it with affliction, until they have changed that which is in themselves, [until] they have exchanged the grace conferred upon them for unbelief, in the way that the Meccan disbelievers exchanged their being ‘fed against hunger’, their being made ‘safe from fear’ [cf. Q. 106:4] and the sending of the Prophet (s) to them, for unbelief, [for] barring against the way of God and [for] fighting Muslims; and [know] that God is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That is because Allah never changeth the grace He hath bestowed on any people) by sending them a Scripture, messenger and security (until they first change that which is in their hearts) by abstaining from giving thanks to Him, (and (that is) because Allah is Hearer) of your supplications, (Knower) of your answer.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ذلك بأن الله لم يك مغيّراً نعمة أنعمها على قوم } إلى آخره\n أي: كل ما يصل إلى الإنسان هو الذي يقتضيه استعداده ويسأله بدعاء الحال وسؤال الاستحقاق\n فإذا أنعم على أحد النعمة الظاهرة أو الباطنة لسلامة الاستعداد وبقاء الخيرية فيه لم يغيرها حتى أفسد استعداده وغيّر قبوله للصلاح بالاحتجاب وانقلاب الخير الذي فيه بالقوة إلى الشرّ لحصول الرين وارتكام الظلمة فيه بحيث لم يبق له مناسبة للخير ولا إمكان لصدوره منه\n فيغيرها إلى النقمة عدلاً منه وجوداً وطلباً من ذلك الاستعداد إياها بجاذبة الجنسية والمناسبة لا ظلماً وجوراً\n { هو الذي أيدك بِنَصْره وبالمؤمنين وألّف بين قلوبهم } لاتفاقها في الوجهة وخلاصها عن قيود صفات النفس التي تستلزم التخالف والتعاند لركونها إلى عالم التضاد واختلافها بالطباع\n فإن القلب ما دام واقفاً مع النفس ومراداتها واستولت عليه بصفاتها جذبته إلى الجهة السفلية وصيرت مطالبه جزئية مما يناسب مصالحها فيطلب ما يمنعه منه الآخر\n وتقع العداوة والبغضاء\n وتستولي القوة الغضبية الطالبة للجاه والكرامة والقهر والغلبة والرياسة والسلطنة\n ويقع الاستكبار والإباء والأنفة والاستنكاف\n ويؤدي إلى التقاطع والتهاجر والتحارب والتشاجر\n وكلما بَعُدَ عن الجهة السفلية بالتوجه إلى الجهة العلوية والتنوّر بأنوار الوحدة الصفاتية أو الذاتية\n ارتفع عن مقام النفس واتصل بالروح وصارت مطالبه كلية لا تتمانع ولا يتنافس فيها لإمكان حصولها لهذا بدون حرمان الآخر منه ومال إلى من يجانسه في الصفاء بالمحبة الذاتية لشدة المناسبة\n وكلما كان أقرب إلى الوحدة كانت قوة المحبة فيه أقوى لشدة قربه لمن تدين بدينه كالخطوط الآتية من محيط الدائرة إلى مركزها\n فبحسب قوة الإيمان شدّة الألفة بينهم\n { لو أنفقت ما في الأرض جميعاً ما ألّفت بين قلوبهم } لأن ما في الجهة السفلية تزيد في عداوتهم ومناوأتهم لاشتداد حرصهم وتكالبهم به { ولكن الله ألّف بينهم } بنور الوحدة التي تورث المحبة الروحانية والألفة القلبية فإن المحبة ظلّ الوحدة\n والألفة ظل المحبة\n والعدالة ظل الألفة { إنه عزيز } قويّ على دفع الكفرة وقهرهم باجتماع المؤمنين واتفاقهم { حكيم } يفعل ذلك بحكمة لإيقاع الإلفة والمحبة بين هؤلاء والتفرقة واختلاف الكلمة بين أولئك",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذٰلِكَ } أي: حلول الغضب والنكال عليهم { بِأَنَّ ٱللَّهَ } المنعم المفضل { لَمْ يَكُ مُغَيِّراً } مبدلاً محولاً { نِّعْمَةً أَنْعَمَهَا عَلَىٰ قَوْمٍ } تفضلاً وامتناناً { حَتَّىٰ يُغَيِّرُواْ } ويبلدوا { مَا بِأَنْفُسِهِمْ } من مقتضيات العبودية والانقياد بالخروج عن حدود الله\n ونقض عهوده وارتكاب نواهيه ومحظوراته\n وتكذيب آياته ورسله كما غيرها قريش { وَأَنَّ ٱللَّهَ } المطلع لأحوال عباده { سَمِيعٌ } لما يقولون على الله وعلى رسوله حين بطرهم وغفلتهم { عَلِيمٌ } [الأنفال: 53] بما يخفون في نفوسهم من الأباطيل",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلك } العذاب الذي حل بهم\n بسبب ذنوبهم وكفرهم لأن { الله لم يكُ مغيراً نعمةً أنعمها على قوم } فيبدلها بالنقمة\n { حتى يغيروا ما بأنفسهم } أي: حتى يبدلوا ما بأنفسهم\n من حال الشكر إلى حال الكفر\n أو من حال الطاعة إلى حال المعصية\n كتغيير قريش حالهم: من صلة الرحم\n والكف عن التعرض لإيذاء الرسول ومن تبعه\n بمعاداة الرسول\n والسعي في إراقة دم من تبعه\n والتكذيب بالآيات والاستهزاء بها\n إلى غير ذلك مما أحدثوه بعد البعثة\n { وأنَّ الله سميعٌ } لما يقولون: { عليم } بما يفعلون\n دأبهم في ذلك التغيير { كَدأْب آل فِرعون والذين من قبلهم كذّبوا بآيات ربهم فأهلكناهم بذنوبهم وأغرقنا آلَ فرعون } لمّا بدلوا وغيَّروا\n ولم يشكروا ما بأيديهم من النعم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:40",
      "similarity": 0.3206178190049308
    },
    {
      "verse": "9:115",
      "similarity": 0.30769387560790973
    },
    {
      "verse": "36:71",
      "similarity": 0.304601493747747
    },
    {
      "verse": "5:20",
      "similarity": 0.296757720946772
    },
    {
      "verse": "68:2",
      "similarity": 0.29486508149462093
    }
  ]
}