{
  "chapter": "الأنفال",
  "text": "الذين عهدت منهم ثم ينقضون عهدهم فى كل مرة وهم لا يتقون",
  "translations": [
    {
      "translation": "those with whom you make a treaty and who then break it every time. They have no taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those with whom you have made a treaty and who abrogate it every time, and do not fear God,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(especially) those with whom you entered into a covenant and then they broke their covenant time after time, and who do not fear Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who make promises but break them every time, and who have no piety.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those with whom you made a treaty, then they break their agreement each time and do not fear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those with whom you made a covenant, but they break their covenant every time and they do not have Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those with whom you make an agreement, then they break their agreement every time and they do not guard (against punishment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those of them with whom thou hast made compact then they break their compact every time, not being godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of them with whom thou madest a treaty, and then at every opportunity they break their treaty, and they keep not duty (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those with whom you have made a covenant, and who break their covenant on every occasion and have no fear [of God].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They with whom thou covenantedest, then they break their covenant every time, and they fear not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—Those with whom you made a treaty, and who violated their treaty every time, and who are not Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those with whom thou didst make a covenant, but they break their covenant every time, and they have not the fear (of Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those with whom you made a covenant, but they break their covenant every time and they do not fear Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those with whom you have made a treaty, then break their treaty with you every time; having no fear (of Allah),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of them with whom you made a treaty, but they violate their agreement every time. They are not righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ones with whom you made a treaty but then they break their pledge every time, and they do not fear Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:56] those of them with whom you have made a pact, not to support the idolaters, and then break their pact every time, they conclude one, and they are not fearful, of God, in their treachery.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah explained who these are, saying: (Those of them with whom thou madest a treaty) the Banu Qurayzah, (and, then at every opportunity they break their treaty, and they keep not duty (to Allah)) they do not ward off breaking their treaties.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإنما صاروا من شر الدواب؛ لأنهم { ٱلَّذِينَ عَاهَدْتَّ مِنْهُمْ } يا أكمل الرسل وأخذت مواثيقهم مراراً { ثُمَّ يَنقُضُونَ عَهْدَهُمْ فِي كُلِّ مَرَّةٍ } وما هي إلا من شدادتهم وخباثة طينتهم، وعدم فطنتهم لحكمة المعاهدة والمواثيق { وَهُمْ } من تركب جهلهم { لاَ يَتَّقُونَ } [الأنفال: 56] ولا يتركون الغدر والنفاق، ولا يوفون بالعهد والميثاق\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}