{
  "chapter": "الأنفال",
  "text": "فاما تثقفنهم فى الحرب فشرد بهم من خلفهم لعلهم يذكرون",
  "translations": [
    {
      "translation": "So if you come upon such people in war, make a harsh example of them to deter those coming after them so that hopefully they will pay heed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you meet them in battle, inflict on them such a defeat as would be a lesson for those who come after them, and that they may be warned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if you meet them in war, make of them a fearsome example for those who follow them that they may he admonished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you capture the (unbelievers) during a fight, teach them a lesson so that they thereafter will always be aware of the threat of your power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if you find them in battle, kill them in a manner which makes those behind them scamper back, in the hope that they may learn a lesson.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if you gain the mastery over them in war, then disperse those who are behind them, so that they may learn a lesson.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore if you overtake them in fighting, then scatter by (making an example of) them those who are in their rear, that they may be mindful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, if thou comest upon them anywhere in the war, deal with them in such wise as to scatter the ones behind them; haply they will remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou comest on them in the war, deal with them so as to strike fear in those who are behind them, that haply they may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should you encounter them in war, then deal with them in such a manner that those that follow them should abandon their designs and may take warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore if thou over-takest them in war, disperse thou through them those behind them, that haply they may be admonished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if you confront them in battle, treat them [in such a wise] as to disperse those who are behind them, so that they may take admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye gain the mastery over them in war, disperse, with them, those who follow them, that they may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if you gain the mastery over them in war, punish them severely in order to disperse those who are behind them, so that they may learn a lesson.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "if you meet them in battle, cause their example to scatter those behind them so that they remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you confront them in battle, make of them a fearsome example for those who follow them, that they may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if you, [O Muhammad], gain dominance over them in war, disperse by [means of] them those behind them that perhaps they will be reminded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:57] So if (fa-immā: here the letter nūn of the conditional particle in, ‘if’, has been assimilated with the extra mā) you come upon them, [if] you find them, anywhere in the war, [deal with them so as to] cause those, fighters, behind them to scatter, to disperse, by making an example of them and punishing them, so that they, the ones behind them, might remember, [that they might] take heed from their example.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If thou comest on them) if you imprison them (in the war, deal with them so as to strike fear in those who are behind them) such that they serve as a lesson to those who are behind them, (that haply they may remember) i.e. take admonition and avoid breaking their treaties.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِمَّا تَثْقَفَنَّهُمْ } وتظفرون عليهم { فِي ٱلْحَرْبِ فَشَرِّدْ بِهِم } وفرق جمعهم\n وشتت شملهم بحيث ينقطع منهم { مَّنْ } يأتي { خَلْفَهُمْ } من مظاهرهم ومعاوينهم { لَعَلَّهُمْ } بتشتيتك وتفريقك إياهم { يَذَّكَّرُونَ } [الأنفال: 57] يتعظون وينتبهون من أمرك وتأييدك فيؤمنوا بك وبما جئت به\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:61",
      "similarity": 0.21621732675287492
    },
    {
      "verse": "2:191",
      "similarity": 0.21282442473089475
    },
    {
      "verse": "60:2",
      "similarity": 0.2083425078140652
    },
    {
      "verse": "3:112",
      "similarity": 0.1733212115424009
    },
    {
      "verse": "4:91",
      "similarity": 0.14649877978239265
    }
  ]
}