{
  "chapter": "الأنفال",
  "text": "واما تخافن من قوم خيانة فانۢبذ اليهم على سواء ان الله لا يحب الخائنين",
  "translations": [
    {
      "translation": "If you fear treachery on the part of a people, revoke your treaty with them mutually. Allah does not love treacherous people.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you apprehend treachery from a people (with whom you have a treaty), retaliate by breaking off (relations) with them, for God does not like those who are treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you fear treachery from any people (with whom you have a covenant) then publicly throw their covenant at them. Allah does not love the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you are afraid of the treachery of some of your allies, you may disregard your treaty with them. God does not love the treacherous ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you apprehend treachery from a nation, then throw back their treaty towards them in reciprocity; indeed Allah does not like the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you fear treachery from any people, throw back (their covenant) to them (so as to be) on equal terms. Certainly Allah likes not the treacherous.) make a heading, Allah says to His Prophet,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you fear treachery on the part of a people, then throw back to them on terms of equality; surely Allah does not love the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if thou fearest treachery any way at the hands of a people, dissolve it with them equally; surely God loves not the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if thou fearest treachery from any folk, then throw back to them (their treaty) fairly. Lo! Allah loveth not the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you learn of treachery on the part of any people, throw their treaty back at them, so as to be on equal terms, for God does not love the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And shouldst thou fear treachery from any people cast back then unto them their covenant to be equal. Verily Allah approveth not the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you fear treachery from a people, break off [the treaty] with them in a like manner. Indeed Allah does not like the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou fearest treachery from any group, throw back (their covenant) to them, (so as to be) on equal terms: for Allah loveth not the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you (O Muhammad SAW) fear treachery from any people throw back (their covenant) to them (so as to be) on equal terms (that there will be no more covenant between you and them). Certainly Allah likes not the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you fear treachery from any of your allies, you can dissolve with them equally. Allah does not love the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you fear treachery on the part of a people, break off with them in a like manner. God does not like the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you [have reason to] fear from a people betrayal, throw [their treaty] back to them, [putting you] on equal terms. Indeed, Allah does not like traitors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:58] And if you fear, from any folk, who have concluded a pact with you, some treachery, in a pact, through some indication that comes to you, then cast it back to them, dissolve their pact, with fairness (‘alā sawā’ is a circumstantial qualifier), that is to say, while you and they have equal knowledge that the pact has been broken, by your apprising them thereof, lest they accuse you of treachery. Truly God does not love the treacherous.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if thou fearest) and if you know of a (treachery from any folk) from the Banu Qurayzah in that they broke their treaty, (then throw back to them (their treaty) fairly. Lo! Allah loveth not the treacherous) who break their treaties or commit any other act of treachery, whether it is the Banu Qurayzah or others.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱنْبِذْ إِلَيْهِمْ } معناه اعلِمْهُمْ واظْهِرْ لَهُمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Turn to them\" - meaning, make them know and show it to them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِمَّا تَخَافَنَّ مِن قَوْمٍ } عاهدت معهم\n وأخذت الميثاق عنهم { خِيَانَةً } ونقضاً من إمارات لاحت منهم وظهر عليهم { فَٱنْبِذْ } واطرح { إِلَيْهِمْ } أولاً عهدهم { عَلَىٰ سَوَآءٍ } بلا عذر وخداع\n وأظهر العداوة\n وارفع المعاهدة على رءوس الملأ\n ثمَّ اخرج عليهم بالقتال\n لئلا يؤدي إلى الخيانة والغدر { إِنَّ ٱللَّهَ } المتصف بالعدل القويم { لاَ يُحِبُّ ٱلخَائِنِينَ } [الأنفال: 58] المخادعين الغادرين\n سيما من المؤمنين الموحدين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { وإما تَخَافَنَّ من قوم } معاهدين { خيانةً } أي: نقص عهد بأمارات تلوح لك\n { فانبِذْ إليهم } أي: فاطرح إليهم عهدهم { على سواءٍ } أي: على عدل وطريق قصد في العداوة\n ولا تناجزهم بالحرب قبل العلم بالنبذ\n فإنه يكون خيانة منك\n أو على سواء في العلم بنقض العهد\n فتستوي معهم في العلم بنقض العهد\n { إنَّ الله لا يُحب الخائنين } أي: لا يرضى فعلهم\n وهو تعليل للأمر بالنبذ والنهي عن مناجزة القتال المدلول عليه بالحال\n { ولا تحسبن } \n يا محمد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:27",
      "similarity": 0.569089285981041
    },
    {
      "verse": "4:107",
      "similarity": 0.5334622004524602
    },
    {
      "verse": "12:52",
      "similarity": 0.49326506465530534
    },
    {
      "verse": "40:19",
      "similarity": 0.47741351707637
    },
    {
      "verse": "4:105",
      "similarity": 0.4745814121693189
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008058.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008058.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:58.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}