{
  "chapter": "الأنفال",
  "text": "يجدلونك فى الحق بعدما تبين كانما يساقون الى الموت وهم ينظرون",
  "translations": [
    {
      "translation": "arguing with you about the Truth after it had been made clear as though they were being driven to their death with open eyes.*",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who argued with you about the matter even after it had become quite clear, as if they were being pushed into (the arms of) death as they waited.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They disputed with you about the truth after that had become evident, as if they were being driven to death with their eyes wide open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Knowing it well (that a fight in which they are to take part is about to take place), they act as though they are being driven to death which they can see before their very eyes. Despite their knowledge of the truth, they still argue with you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Disputing with you regarding the truth after it had been made clear, as if they were being herded towards a visible death.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Disputing with you concerning the truth after it was made manifest, as if they were being driven to death, while they were looking (at it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They disputed with you about the truth after it had become clear, (and they went forth) as if they were being driven to death while they saw (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "disputing with thee concerning the truth after it had become clear, as though they were being driven into death with their eyes wide open.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Disputing with thee of the Truth after it had been made manifest, as if they were being driven to death visible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they disputed with you concerning the truth after it had become manifest, as though they were being driven to their death with open eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Disputing with thee respecting the right cause after it had become manifest, as though they were led forth unto death while they looked on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They disputed with you concerning the truth after it had become clear, as if they were being driven towards death as they looked on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Disputing with thee concerning the truth after it was made manifest, as if they were being driven to death and they (actually) saw it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Disputing with you concerning the truth after it was made manifest, as if they were being driven to death, while they were looking (at it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They argued with you about the truth after it had been made clear, as though they were being led to certain death while looking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Arguing with you about the truth after it was made clear, as if they were being driven to death as they looked on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Arguing with you concerning the truth after it had become clear, as if they were being driven toward death while they were looking on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:6] They dispute with you concerning the truth, [the order] to fight, after it had become clear, [after it had] become evident to them, as though they were being driven to death while they looked, at it [death] with their very eyes, utterly averse to it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Disputing with thee of) arguing with you about (the Truth) the war (after it had been made manifest) that you do not act upon or command anything except that with which your Lord has commanded you, (as if they were being driven to death visible) driven to death while looking straight at it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن كمال كراهتهم { يُجَادِلُونَكَ فِي ٱلْحَقِّ } الصريح الذي هو الجهاد، سيما { بَعْدَ مَا تَبَيَّنَ } وظهر لك بوحي الله إياك، ووعده النصر والظفر لك، وهم من غاية رعبهم حين خروجهم { كَأَنَّمَا يُسَاقُونَ إِلَى ٱلْمَوْتِ } مثل البهائم إلى المسلخ { وَهُمْ } حينئذٍ { يَنظُرُونَ } [الأنفال: 6] حيارى مرعوبين، ومع أ،هم كتب له الظفر والغنيم، والغلبة من عند ربهم\n\n\n\n\n \" وذلك أن عير قريش أقبلت من الشام، وفيهم أبو سفيان مع أربعين من الفرسان ومعهم تجارة عظيمة، فأخبر جبريل رسول الله صلى الله عليه وسلم، فأخبر به الرسول للمؤمنين فخرجوا مسرعين بلا عدة استقلالاً لهم وميلاً إلى أموالهم، فلمَّا خرجوا من المدينة بلغ خبر خروجهم إلى العير فانصرفوا إلى الطريق، وأرسلوا خبرهم إلى مكة فاستغاثوا، فخرج أبو جهر مع جمع كثير فمضوا إلى بدر، وكان رسول الله صلى الله عليه وسلم بوادي دفران، فنزل جبريل عليه السلام ثانياً يعده إحدى الطائفتين؛ أي: العدو و العير، فاستشار رسول الله صلى الله عليه وسلم أصحابه، وإن كان رأيه إلى المقاتلة مع العدو\n \n\n \n\n فقال بعضهم: هلاَّ ذكرت لنا القتال؛ حتى نتأهب له، إنَّا خرجنا للعير، فقال صلى الله عليه وسلم: \" إن العير مضت على ساحل البحر، وهذا أبو جهل قد أقبل \" ، فقالوا كارهين مرعوبين خائفين: يا رسول الله صلى الله عليه وسلم عليك بالعير، ودع العدو فضغب صلى الله عليه وسلم، فقال المقداد بن عمرو: يا رسول الله امض بما أمرك الله، فإنَّا معك حيثما أحببت، لا نقول لك ما قال بنو إسرائيل لموسى: اذهب انت وربك فقالات، إنَّا هاهنا قاعدون، ولكن نقول: إذه بأنت وربك فقالا، إنَّا معمكما مقاتلون، فوالذي بعثك بالحق لو سرت بنا إلى برك الغماد - مدينة بأقضى الحبشة - مضينا معك لا تكاسل و مخالفة، فدعا صلى الله عليه وسلم خيراً\n \n\n \n\n ثمَّ قال صلى الله عليه وسلم: اجتمعوا علي أيها الناس، يريد الأنصار القائلين حين بايعوه على العقبة أنهم براء من ذمامه حتى يصل إلى ديارهم، فتخوف ألاَّ يروا نصرته إلا على عدوهم بالمدينة، فقال له سعد بن معاذ: لكأنك تريدنا يا رسول الله؟ قال: أجل، قال: قد آمنا لك وصدقناك، وشهدنا أن ما جئت به هو الحق، وأعطينا على ذلك عهوداً ومواثيق على السمع والطاعة لما أمرت، فوالذي بعثك بالحق لو استعرضت على البحر لخضنا معك بلا تخلف أتحسب أنَّا إذا لا قينا العدو نتكاسل ونتساهل، ولعل الله يريد منا ما تقر به عينك\n \n\n \n\n ففرح رسول الله صلى الله عليه وسلم، ونشطه ول سعد، ثمَّ قال: \" سيروا على بركة الله، وأبشروا فإن الله سبحانه وعدني الآن إحدى الطائفتين، والله لكأني الآن أنظر إلى مصارع القوم \"\n \n\n \n\n \n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وذلك الفريق الذي كره خروجك للقتال { يُجادلونك في الحق } أي: يخاصمونك في إيثارك الجهاد لإظهار الحق، حيث أرادوا الرجوع للمدينة، وقالوا: إنا لم نخرج لقتال، قالوا ذلك { بعد ما تَبَيّن } لهم أنهم منصرون أينما توجهوا، بإعلام الرسول لهم، لكن الطبع البشري ينزع إلى مواطن السلامة { كأنما يُساقون إلى الموت وهم ينظرون } أي: يكرهون القتال كراهة من يُساق إلى الموت، وهو يشاهد أسبابه، وكان ذلك لقلة عددهم وعدم تأهبهم، إذ رُوي أنهم كانوا رجّالة، وما كان فيهم إلا فارسان، وذلك أن رسول الله صلى الله عليه وسلم لم يخرج لقصد الجهاد، وإنما لملاقاة عير قُرَيْش، لمّا سمع أنها قدمت من الشّام، وفيها تجارةٌ عَظيِمةٌ، ومعها أربعُون رَاكباً، فيهم أَبُو سُفْيان، وعمرو بنُ العاص، ومخرفة بن نوفل، وعمروبن هِشَام، فأراد رَسُول اللَّه صلى الله عليه وسلم أن يتعرض لها ويأخذها غنيمة، حيث أخبره جبريلُ بقدومها من الشام، فأخبرَ رسولُ الله صلى الله عليه وسلم المسلمين، فأعْجَبَهُم تلقيها، لكثرةِ المال وقلةِ الرجالِ، فلما خرجُوا، بَلَغ الخبرُ أبا سفيان، فسلك بالعير طريق السَاحِل، واستأجر من يذهب إلى مكة يستنفرها، فلما بلغهم خروج رسول الله صلى الله عليه وسلم لعيرهم، نادى أبو جهل فوق الكعبة: يا أهل مكة، النَّجَاء، النجاء على كل صَعْبٍ وذَلُولٍ، عِيرُكُمْ وأَمْوالكم إن أصَابَهَا مُحَمَّدٌ لن تُفْلِحُوا بعدها أبداً\n وقد رأت، قبل ذلك بثلاث ليال، عاتكةُ بنت المطلب، رؤيا وهو أن رجلاً تمثل على جبل قبيس فنادى: يا آل لكع، اخرجوا إلى مصارعكم، ثم تمثل على الكعبة، فنادى مثل ذلك، ثم أخذ حجراً فضرب به، فلم يبق بيت في مكة إلا دخلة شيء من ذلك الحجر، فحدثت بها العباس، وبلغ ذلك أبا جهل، فقال: أما ترضى رجالهم أن يتنبؤوا حتى تتنبأ نساؤهم؟ لنتربص ثلاثاً، فإن لم يظهر ما تقول لنكتبن عليكم يا بني هاشم أنكم أكذب بيت في العرب، فلما مضت ثلاث ليال جاء رسولُ أبي سفيان ليستنفرهم\n\n\nفخرج أبو جهل بجموع أهل مكة، ومضى بهم إلى بدر، وهو ماء كانت العرب تجتمع عليه لسوقهم يوماً في السنة، وكان رسول الله صلى الله عليه وسلم بوادي ذَفِران، فنزل عليه جبريل بالوعد بإحدى الطائفتين: إما العيرُ وإما قُرَيْش، فاستشار فيه أصحابه، فقال بعضهم: ما خرجنا لقتال ولا تهيأنا له، وردد عليهم وقال: إن العير قد مضت على ساحل البحر، وهذا أبو جهل قد أقبل، فقالوا: يا رسول الله، عَلَيكَ بالعيرِ ودَع العَدو، فغضب رسول الله صلى الله عليه وسلم، فقام أبو بكر وعُمَرُ فأحْسَنَا، ثم قام سَعْدُ بن عُبادة فقال: انظرُ في أمْرِكَ، وامْضِ، فواللَّهِ لَو سِرْتَ إلى عَدَنٍ ما تَخَلَفَ رجلٌ مِنْ الأنْصارِ، ثم قام المقِدَادُ بنُ عَمْرٍو فقال: امْضِ يا رسول الله لما أمرك ربك، فإنا معك حيثما أحببتَ، لا نقولُ كما قالت بنو إسرائيل:\n\n[المائدة: 24]، ولكن اذهب أنت وربك فقاتِلاَ إنا معكُما مقاتلونَ، فتبسم رسول الله صلى الله عليه وسلم، فقال:\n\n \" أشيروا عَلَيَّ أيّها الناسُ \" \n\n، يريدُ الأنصار لأنهم كانوا عددهم، وقد شرطوا حين بايعوه بالعقبة أنهم بُرءاء من ذمامه حتى يصل إلى ديارهم، فتخوف ألاّ يروا نصرته إلا على عدو دهمه بالمدينة، فقام سَعْدُ بنُ معَاٍذ وقال:لَكأنَّكَ تُرِيدُنَا يا رسولِ الله؟ فقال: أجَلْ، فقال: قد آمنّا بِك وصَدَّقْنَاكَ، وشهدنا أن ما جئْتَ بِهِ هو الحقُّ فأعطَيْنَاكَ على ذلِك عُهُودَنَا ومَوَاثِيقَنَا على السَّمْعِ والطَّاعّةِ، فامْضِ يا رَسُولَ اللهِ لما أرْدتَ، فوالذي بَعَثَكَ بالْحق لو اسْتَعْرَضت بنا هذا البَحْرَ فخُضته لخضْنَاهُ مَعَكَ، ما تَخَلَّفَ مِنّا رَجُلٌ واحِدٌ، وما نَكرَهُ أن تَلقِي بِنَا عَدُوِّنَا، وإنا لَصُبُرٌ عِندَ الحَربِ، صُدُقٌ عندَ الِّلقَاءِ، ولعَلَّ اللَّهَ يُريكَ منا ما تقرُّ بِه عينُكَ، فَسِرْ بنا على بَركَةِ اللهِ، فنشطه قوله، ثم قال:\n\n \" سِيرُواعَلَى بَركَةِ الله، وأبْشِرُوا فِإنَّ الله قد وَعَدَنِي إِحْدَى الطَّائفَتَينِ، واللهِ لكأنّي أنْظرُ إلى مَصارع القَوْم \"\n \n\nثم مضى رسول الله صلى الله عليه وسلم حتى نزل بأصحابه آخر مياه من مياه بدر، فَبُني له هناك عريش، فجلس فيه هو وأبو بكر، فلما انتشب القتال أخذ قبضة من تراب فرمى بها وجوه القوم، وقال: شاهت الوجوه، فلم تبق عين من الكفار إلا وقع فيها شيء منها، ونزلت الملائكة في العنان، أي: السماء، فقتل منهم سبعون، وأُسر سبعون، وقيل: إن رسول الله صلى الله عليه وسلم لما فرغ من غزوة بدر، قيل له: عليك بالعير، فقال العباس ـ وقد أعطاك ما وعدك، فكره بعضهم قوله، ثم رجع صلى الله عليه وسلم إلى المدينة منصوراً فرحاً مسروراً، وقد أنجزه الله ما وعده\n\n\nالإشارة: من حكمته تعالى الجارية في عبادة أن كل ما يثقل على النفوس ويشق عليها في بدايته تكون عاقبته الفتح والنصر، والهناء والسرور، فكل ما تكرهه النفوس فغايته حضرة القدوس، وما تحقق سير السائرين إلا بمحاربة نفوسهم ومخالفة عوائدهم\n وفي الحديث عنه صلىالله عليه وسلم، قال لابن عباس في حديث طويل:\n\n \" وَفِي الصَّبْرِ عَلَى مَا تَكْرَهُ خَيْر كَثِير \" \n\nوالله تعالى أعلم\n ثم ذكر بقية قصة بدر، فقال: { وَإِذْ يَعِدُكُمُ ٱللَّهُ إِحْدَى ٱلطَّائِفَتِيْنِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "75:30",
      "similarity": 0.5478592454605826
    },
    {
      "verse": "50:21",
      "similarity": 0.49971365980401655
    },
    {
      "verse": "68:42",
      "similarity": 0.41586808236054784
    },
    {
      "verse": "25:7",
      "similarity": 0.3665906555469533
    },
    {
      "verse": "22:68",
      "similarity": 0.3624274128923899
    }
  ]
}