{
  "chapter": "الأنفال",
  "text": "واعدوا۟ لهم ما استطعتم من قوة ومن رباط الخيل ترهبون به عدو الله وعدوكم وءاخرين من دونهم لا تعلمونهم الله يعلمهم وما تنفقوا۟ من شىء فى سبيل الله يوف اليكم وانتم لا تظلمون",
  "translations": [
    {
      "translation": "Arm yourselves against them with all the firepower and cavalry you can muster, to terrify the enemies of Allah and your enemies, and others besides them whom you do not know. Allah knows them. Anything you spend in the Way of Allah will be repaid to you in full. You will not be wronged.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prepare against them whatever arms and cavalry you can muster, that you may strike terror in (the hearts of) the enemies of God and your own, and others besides them not known to you, but known to God. Whatever you spend in the way of God will be paid back to you in full, and no wrong will be done to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make ready for an encounter against them all the forces and well-readied horses you can muster that you may overawe the enemies of Allah and your own enemies and others besides them of whom you are unaware but of whom Allah is aware. Whatever you may spend in the cause of Allah shall be fully repaid to you, and you shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mobilize your (defensive) force as much as you can to frighten the enemies of God and your own enemies. This also will frighten those who are behind them whom you do not know but God knows well. Whatever you spend for the cause of God, He will give you sufficient recompense with due justice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And keep ready for them the maximum of forces you can and the maximum number of horses you can keep tethered, in order to instil awe in the hearts of those who are the enemies of Allah and who are your enemies, and in the hearts of some others whom you do not know; Allah knows them; and whatever you spend in Allah's cause will be repaid to you in full and you will never be in a loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And make ready against them all you can of power, including steeds of war to threaten the enemy of Allah and your enemy, and others besides them, whom you may not know but whom Allah does know. And whatever you shall spend in the cause of Allah shall be repaid unto you, and you shall not be treated unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And prepare against them what force you can and horses tied at the frontier, to frighten thereby the enemy of Allah and your enemy and others besides them, whom you do not know (but) Allah knows them; and whatever thing you will spend in Allah's way, it will be paid back to you fully and you shall not be dealt with unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make ready for them whatever force and strings of horses you can, to terrify thereby the enemy of God and your enemy, and others besides them that you know not; God knows them. And whatsoever you expend in the way of God shall be repaid you in full; you will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make ready for them all thou canst of (armed) force and of horses tethered, that thereby ye may dismay the enemy of Allah and your enemy, and others beside them whom ye know not. Allah knoweth them. Whatsoever ye spend in the way of Allah it will be repaid to you in full, and ye will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prepare any strength you can muster against them, and any cavalry with which you can overawe God's enemy and your own enemy as well, and others besides them whom you do not know, but who are known to God. Anything you spend in the way of God will be repaid to you in full. You will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And get ready against them whatsoever ye can of force and wellfed horses whereby ye may overawe the enemy of Allah and your enemy and others besides them whom ye know not Allah knoweth them. And whatsoever ye expend in the way of Allah shall be repaid to you in full; and ye shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prepare against them whatever you can of [military] power and war-horses, awing thereby the enemy of Allah, and your enemy, and others besides them, whom you do not know, but Allah knows them. And whatever you spend in the way of Allah will be repaid to you in full, and you will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Against them make ready your strength to the utmost of your power, including steeds of war, to strike terror into (the hearts of) the enemies, of Allah and your enemies, and others besides, whom ye may not know, but whom Allah doth know. Whatever ye shall spend in the cause of Allah, shall be repaid unto you, and ye shall not be treated unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And make ready against them all you can of power, including steeds of war (tanks, planes, missiles, artillery, etc.) to threaten the enemy of Allah and your enemy, and others besides whom, you may not know but whom Allah does know. And whatever you shall spend in the Cause of Allah shall be repaid unto you, and you shall not be treated unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muster against them whatever you are able of force and tethers (ropes) of horses, so that you strike terror into the enemies of Allah and your enemy, and others besides them whom you do not know but Allah does. All that you spend in the Way of Allah shall be repaid to you. You shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And prepare against them all the power you can muster, and all the cavalry you can mobilize, to terrify thereby God’s enemies and your enemies, and others besides them whom you do not know, but God knows them. Whatever you spend in God’s way will be repaid to you in full, and you will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And prepare against them whatever you are able of power and of steeds of war by which you may terrify the enemy of Allah and your enemy and others besides them whom you do not know [but] whom Allah knows. And whatever you spend in the cause of Allah will be fully repaid to you, and you will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:60] Make ready for them, for fighting them, whatever force you can, the Prophet (s) said that this refers to ‘archers’, as reported by Muslim, and of horses tethered (ribāt is a verbal noun, meaning, ‘restraining them [for use] in the way of God’) that thereby you may dismay, terrify, the enemy of God and your enemy, namely, the disbelievers of Mecca, and others besides them, that is, other than those — namely, the hypocrites or the Jews, whom you know not: God knows them. And whatever thing you expend in the way of God, its requital, shall be repaid to you in full, and you will not be wronged, [you will not] be diminished anything thereof.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Make ready for them) for the Banu Qurayzah as well as for others (all thou canst of force) of arms (and of horses tethered) of female tethered horses which are prepared for fighting, (that thereby ye may dismay) that you may strike fear by means of these horses in (the enemy of Allah) with regard to religion (and your enemy) by killing them, (and others beside them) besides the Banu Qurayzah and all the Arabs; it is also said that this is a reference to the disbelievers among the jinn (whom you know not) you do not know their number. (Allah knoweth them) Allah knows their number. (Whatsoever) of wealth (you spend in the way of 190 Allah) in obedience of Allah, whether it is arms or horses (it will be repaid to you in full) its reward will be repaid to you, none of it will be diminished, (and ye will not be wronged) your reward will not be diminished.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تُرْهِبُونَ بِهِ عَدْوَّ ٱللَّهِ وَعَدُوَّكُمْ } معناه تَخْزُونَ ويقالُ: تُخِيفُونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {You shall strive against the disbelievers and the hypocrites} [means that] you shall expose and confront them. And it is said, {You shall fear them} [i.e. the disbelievers and hypocrites].",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَعِدُّواْ } أيها المؤمنون { لَهُمْ مَّا ٱسْتَطَعْتُمْ مِّن قُوَّةٍ } أي: هيئوا لقتالهم من الآلات والأسباب ما يحتاجون في حرابهم\n سيما آلات الرمي { وَمِن } جملة العدة: { رِّبَاطِ ٱلْخَيْلِ } أي: شد الفرس وارتياضه ليوم الحرب ما يفعله ويشده الأبطال المتشوقون إلى القتال { تُرْهِبُونَ بِهِ } أي: بالأعداد والشد { عَدْوَّ ٱللَّهِ وَعَدُوَّكُمْ } وهم الذي في حواليكم يقاتلونكم\n ويخاصمون معكم جهرةً وعلانيةً\n يعني: كفار مكة\n\n\n{ وَ } ترهبون به أيضاً { آخَرِينَ مِن دُونِهِمْ } يعني: الذين ينفاقون معكم ويظهرون إطاعتكم وإخاءكم ظاهراً\n ويريدون إهلاككم ومقتكم في بواطنهم { لاَ تَعْلَمُونَهُمُ } أي: عداوتهم\n لإخفائهم وإظهارهم صدقاتكم { ٱللَّهُ } المطلع لضمائرهم { يَعْلَمُهُمْ } ويعلم عداوتهم ونفاقهم\n ويجازيهم عليها { وَمَا تُنفِقُواْ مِن شَيْءٍ } للأعداء والتجهيز { فِي سَبِيلِ ٱللَّهِ } ونصر دينه\n وإعلاء كلمة توحيده { يُوَفَّ إِلَيْكُمْ } جزاؤه بأضعاف ما تصرفون وآلافه { وَأَنْتُمْ } في إنفاقكم وإعدادكم { لاَ تُظْلَمُونَ } [الأنفال: 60] أي: لا تنقصون من جزائه ولا تخسرون\n بل تربحون وتفوزون بما ترضى به نفوسكم\n وبما لا تدركه عقولكم من الكرامة تفضلاً وامتناناً\n\n\n{ وَ } بعدما أعددتم عددكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { وأعدوا لهم } ، أي: لناقضي العهد، أو لمطلق الكفار، { ما استطعتم من قوة } ، أي: ما قدرتم عليه من كل ما يتقوى به في الحرب. وعن عقبة ابن عامر، قال: سمعت رسول الله صلى الله عليه وسلم يقول على المنبر:\n \" ألاَ إنَّ القُوَّة الرَّمْي \" \nقالها ثلاثاً، ولعله عليه الصلاة والسلام خصه بالذكر لأنه أعظم القوى، { و } أعدوا لهم أيضاً { من رباط الخيل } اي: من الخيل المربوطة للجهاد، وهو اسم للخيل التي تربط في سبيل الله، بمعنى مفعول، أو مصدر، أو جمع ربيط كفصيل وفصال. والمراد: الحث على استعداد الخيل العتاق التي تربط وتعلف بقصد الجهاد، وهو من جملة القوة، فهو من عطف الخاص على العام، للاعتناء بأمر الخيل لما فيها من الإرهاب. ولذلك قال: { تُرهِبون به } أي: تخوفون بذلك الأعداء، أو بما ذكر من الخيل المربوطة، { عدو الله وعدوَّكم } يعني كفار مكة، { وآخرين من دُونهم } أي: من غيرهم من الكفرة، كفارس والروم وسائر الكفرة، { لا تعلمونَهم } ، أي لا تعرفونهم اليوم، { الله يعلمهم } ،وسيمكنكم منهم، فتقاتلونهم وتملكون ملكهم، { وما تُنفقوا من شيء في سبيل الله } ، في شأن الاستعداد، وغيره مما يستعان به على الجهاد، { يُوف إليكم } جزاؤه، { وأنتم لا تُظلمون } بتضييع عمل أو نقص أجر، بل يضاعفه لكم أضعافاً كثيرة، بسبعمائة أو أكثر. والله تعالى أعلم. الإشارة: وأعدوا لجهاد القواطع والعلائق التي تعوقكم عن الحضرة، ما استطعتم من قوة، وهو العزم على السير من غير التفات، ومن رباط القلوب في حضرة الحق، تُرهبون به عدو الله، وهو الشيطان، وعدوكم، وهي النفس، وآخرين من دونهم: الحظوظ واللحوظ وخفايا خدع النفوس، لا تعلمونهم، الله يعلمهم كالرياء والشرك الخفي، فإنه يدب دبيب النمل، وما تنفقوا من شيء يُوف إليكم أضعافاً مضاعفة، بالعز الدائم والغنى الأكبر، وأنتم لا تُظلمون. وقال الورتجبي: أَعلم الله المؤمنين والعارفين استعداد قتل أعداء الله، وسمى آلة القتال بقوة، وتلك القوة قوة الإلهية التي لا ينالها العارف من الله إلا بخضوعه بين يديه، بنعت الفناء في جلاله، فإذا كان كذلك يلبسه الله لباس عظمته ونور كبريائه وهيبته، ويغريه إلى الدعاء عليهم، ويجعله منبسطاً، حتى يقول في سره: إلهي خذهم، فيأخذهم بلحظة، ويسقطهم صرعى بين يديه بعونه وكرمه، ويسلي قلب وليه بتفريجه من شرور مُعارضيه ومنكريه، وذلك سهم رمى نفوس الهمة عن كنانة الغيرة، كما رمى نبي الله صلى الله عليه وسلم إلى منكريه حين قال:\n \" شاهت الوجوه \" \nوهذا الرمي من الله بقوله: { وما رميت إذ رميت ولكن الله رمى }. سمعت أن ذا النون المصري رضي الله عنه كان في غزو، وغلب المشركون على المؤمنين، فقيل له: لو دعوت الله، فنزل عن دابته وسجد، فهُزم المشركون في لحظة،وأُخذوا جميعاً، وأُسروا، وقُتلوا.\nوأيضاً: وأعدوا: أي اقتبسوا من الله قوة من قوى صفاته لنفوسكم حتى يقويكم في محاربتها. قال أبو علي الروذباري، في قوله: { وأعدوا لهم ما استطعتم من قوة } ، فقال: القوة هي الثقة بالله، قيل ظاهر الآية: إنه الرمي بسهام القِسي. وفي الحقيقة: رمي سهام الليالي في الغيب بالخضوع والاستكانة، ورمي القلب إلى الحق معتمداً عليه، راجعاً إليه عما سواه. هـ. ثم بيّن أن المعول على الله ونصرته، لا على السلاح والآلات بقوله: { هو الذي أيدك بنصره وبالمؤمنين } ، أي: قواك بقوته الأزلية، ونصرك بنصرته الأبدية، ووفق المؤمنين بإعانتك على عدوك. ثم بيّن سبحانه أن نصرة المؤمنين لم تكن إلا بتأليفه بين قلوبهم، وجمعهم على محبة الله ومحبة رسوله، بعد تباينها بتفريقة الهموم في أودية الامتحان، بقوله: { وألَّف بين قلوبهم }. وقال القشيري: الإشارة بقوله: { تُرهبون }: إلى أنه لا يجاهد على رجاء غنيمةٍ ينالها، أو إشفاء صدر عن قضية حقد، بل قصده أن تكون كلمة الله هي العليا. هـ. ثم دلَّ على الصلح لمصلحة، فقال: { وَإِن جَنَحُواْ لِلسَّلْمِ فَٱجْنَحْ لَهَا }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:200",
      "similarity": 0.5184252856645587
    },
    {
      "verse": "18:14",
      "similarity": 0.37983250278845143
    },
    {
      "verse": "28:10",
      "similarity": 0.36914283258749986
    },
    {
      "verse": "2:40",
      "similarity": 0.2712542242888014
    },
    {
      "verse": "8:11",
      "similarity": 0.2594919985392959
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/8:60.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/8:60.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/8:60.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}