{
  "chapter": "الأنفال",
  "text": "وان يريدوا۟ ان يخدعوك فان حسبك الله هو الذى ايدك بنصره وبالمؤمنين",
  "translations": [
    {
      "translation": "If they intend to deceive you, Allah is enough for you. It is He who supported you with His help and with the muminun,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they try to cheat you, God is surely sufficient for you. It is He who has strengthened you with His help and with believers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And should they seek to deceive you, Allah is sufficient for you. He it is Who strengthened you with His succour and the believers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they want to deceive you, God is All-sufficient for you. It is God who supported you with His own help and with that of the believers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they wish to deceive you, then indeed Allah is Sufficient for you; it is He Who has given you strength, with His help and with the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they intend to deceive you, then verily, Allah is All-Sufficient for you. He it is Who has supported you with His help and with the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they intend to deceive you-- then surely Allah is sufficient for you; He it is Who strengthened you with His help and with the believers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they desire to trick thee, God is sufficient for thee; He has confirmed thee with His help, and with the believers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they would deceive thee, then lo! Allah is Sufficient for thee. He it is Who supporteth thee with His help and with the believers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should they seek to deceive you, God is enough for you: it was He who strengthened you with His help, and rallied the faithful around you, and bound their hearts together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they seek to deceive thee, then verily Allah is sufficient unto thee. He it is who aided thee with His succour and with the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they desire to deceive you, Allah is indeed sufficient for you. It is He who strengthened you with His help and with the means of the faithful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should they intend to deceive thee,- verily Allah sufficeth thee: He it is That hath strengthened thee with His aid and with (the company of) the Believers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they intend to deceive you, then verily, Allah is All-Sufficient for you. He it is Who has supported you with His Help and with the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should they seek to deceive you, Allah is sufficient for you. It is He who supported you with His victory and with believers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they intend to deceive you—God is sufficient for you. It is He who supported you with His aid, and with the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they intend to deceive you - then sufficient for you is Allah. It is He who supported you with His help and with the believers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:62] And if they desire to trick you, by making a [peace] settlement in order to make preparations [for war] against you, then God is sufficient for you. He it is Who strengthened you with His help and with the believers;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if they) the Banu Qurayzah (would deceive thee) by signing a treaty of peace with you, (then lo! Allah is sufficient for thee) Allah is sufficient and enough for you. (He it is Who supporteth thee) He gives you strength and assists you (with His help) on the Day of Badr (and with the believers) with the Aws and the Khazraj,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِن يُرِيدُوۤاْ } بعدما صالحوا وعاهدوا { أَن يَخْدَعُوكَ } ويمكروا بك وبأصحابك فلا تبالوا بهم وبغدرهم وخداعهم { فَإِنَّ حَسْبَكَ } أي: كافيك وظهيرك\n ومولى جميع أمورك { ٱللَّهُ } الرقيب عليك في جميع حالاتك\n كيف لا يرقبك من مكرهم { هُوَ ٱلَّذِيۤ أَيَّدَكَ } وقواك\n وأظفرك عليهم { بِنَصْرِهِ } بلا أعداء ورباط خيل { وَ } بعد تأييدك بنصره أيدك أيضاً { بِٱلْمُؤْمِنِينَ } [الأنفال: 62] بإيمانهم وإطاعتهمن لك\n وبذل مالهم ومهجهم لتقويتك وإعلاء دينك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:9",
      "similarity": 0.8174127294790421
    },
    {
      "verse": "4:142",
      "similarity": 0.4978867847957063
    },
    {
      "verse": "51:47",
      "similarity": 0.31203629267379623
    },
    {
      "verse": "38:17",
      "similarity": 0.26396099611276497
    },
    {
      "verse": "61:14",
      "similarity": 0.24189347930951718
    }
  ]
}