{
  "chapter": "الأنفال",
  "text": "والف بين قلوبهم لو انفقت ما فى الارض جميعا ما الفت بين قلوبهم ولكن الله الف بينهم انه عزيز حكيم",
  "translations": [
    {
      "translation": "and unified their hearts. Even if you had spent everything on the earth, you could not have unified their hearts. But Allah has unified them. He is Almighty, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whose hearts He cemented with love. You could never have united their hearts even if you had spent whatever (wealth) is in the earth; but God united them with love, for He is all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and joined their hearts. Had you given away all the riches of the earth you could not have joined their hearts, but it is Allah Who joined their hearts. Indeed He is All-Mighty. All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "among whose hearts He has placed affection and unity. If you were to spend the wealth of the whole earth, you would not have been able to unite their hearts but God has been able to unite them. God is Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And has created harmony among their hearts; if you had spent all that is in the earth you could not have created harmony among their hearts, but Allah has created harmony among them; indeed He only is Almighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has united their (believers') hearts. If you had spent all that is in the earth, you could not have united their hearts, but Allah has united them. Certainly He is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And united their hearts; had you spent all that is in the earth, you could not have united their hearts, but Allah united them; surely He is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and brought their hearts together. Hadst thou expended all that is in the earth, thou couldst not have brought their hearts together; but God brought their hearts together; surely He is All-mighty, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for the believers) hath attuned their hearts. If thou hadst spent all that is in the earth thou couldst not have attuned their hearts, but Allah hath attuned them. Lo! He is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if you had spent all that is on the earth, you could not have bound their hearts together, but God has bound them together. Surely, He is Mighty and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He united their hearts. Hadst thou expended all that is on the earth thou couldst not have united their hearts, but Allah united them; verily He is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and united their hearts. Had you spent all that is in the earth, you could not have united their hearts, but Allah united them together. Indeed He is all-mighty, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (moreover) He hath put affection between their hearts: not if thou hadst spent all that is in the earth, couldst thou have produced that affection, but Allah hath done it: for He is Exalted in might, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has united their (i.e. believers') hearts. If you had spent all that is in the earth, you could not have united their hearts, but Allah has united them. Certainly He is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and brought their hearts together. If you had given away all the riches of the earth, you could not have so united them, but Allah has united them. He isAlmighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He united their hearts. Had you spent everything on earth, you would not have united their hearts, but God united them together. He is Mighty and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And brought together their hearts. If you had spent all that is in the earth, you could not have brought their hearts together; but Allah brought them together. Indeed, He is Exalted in Might and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:63] and reconciled, brought together, their hearts, after old feuds [had divided them]. Had you expended all that is in the earth, you could not have reconciled their hearts, but God reconciled their hearts, through His power. Truly He is Mighty, His way prevailing, Wise, nothing being beyond [the scope of] His wisdom.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (as for the believers) hath attuned their hearts) he united their hearts and word by means of Islam. (If thou hadst spent all that is in the earth) of gold and silver (thou couldst not have attuned their hearts) or their word, (but Allah hath attuned them) He united their hearts by means of faith. (Lo! He is Mighty) in His kingdom and sovereignty, (Wise) in His command and decree.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَلَّفَ بَيْنَ قُلُوبِهِمْ } بحيث ارتفع غشاوة الحمية وحجب العصب عن ضمائرهم مطلقاً\n وصاروا في محبتك ومودتك مستوية الأقدام\n متحابين لله\n منخلعين عن لوازم البشرية مطلقاً\n مع كونهم في جاهليتهم على التغالب والتهالك بمقتضى الحمية الجاهلية والغيرة البشرية بحيث { لَوْ أَنفَقْتَ } وصرفت { مَا فِي ٱلأَرْضِ جَمِيعاً } لائتلافهم واجتماعهم { مَّآ أَلَّفَتْ بَيْنَ قُلُوبِهِمْ } لشدة بغضهم ونفاقهم { وَلَـٰكِنَّ ٱللَّهَ } المحول لأحال عباده { أَلَّفَ بَيْنَهُمْ } بمقتضى لطفه وجماله\n لينصروك ويقبلوا دينك\n ويصلوا إلى مرتبة اليقين والعرفان\n ويتحققوا في مقر التوحيد { إِنَّهُ عَزِيزٌ } غالب على جميع مراداته ومقدوراته { حَكِيمٌ } [الأنفال: 63] متقن في جميع أفعاله\n يفعل ما يشاء ويحكم ما يريد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وألَّفَ بين قلوبهم } مع ما كان فيها من زمن الجاهلية من المعصية والضغائن والتهالك على الانتقام\n حتى لا يكاد يأتلف فيهم قلبان\n ثم صاروا كنفس واحدة\n وهذا من معجزاته صلى الله عليه وسلم\n قال تعالى: { لو أنفقتَ ما في الأرض جميعاً } \n في إصلاح ما بينهم\n { ما ألفت بين قلوبهم } لتناهي عداوتهم إلى حد لو أنفق منفق في  إصلاح ذات بينهم ما في الأرض من الأموال لم يقدر على الألفة بينهم\n { ولكنَّ الله ألفَ بينهم } بقدرته البالغة فإنه المالك للقلوب يُقبلها كيف يشاء\n { إنه عزيز } تام القدرة\n لا يَعصي عليه ما يريده\n { حكيم } يعلم كيف ينبغي أن يفعل ما يريده\n قيل: إن الآية نزلت في الأوس والخزرج\n كان بينهم إِحنٌ وضغائن لا أمد لها\n ووقائع هلكت فيها ساداتهم\n فأنساهم الله ذلك\n وألَّف بينهم بالإسلام\n حتى تصادقوا وصاروا أنصار الدين\n وبالله التوفيق\n الإشارة: وإن مالت النفس وجنودها إلى الصلح مع صاحبها بأن ألقت السلاح\n ومالت إلى فعل كل ما فيه خير وصلاح\n وعقدت الرجوع عن هواها\n والدؤوب على طاعة مولاها\n فالواجب عقد الصلح معها\n وتصديقها فيما تأمر به أو تَنْهَى عنه\n مما يرد عليها\n مع التوكل على مولاها\n فإن خدعت بعد ذلك\n أو رجعت إلى مألوفها\n فالله يكفي أمرها\n ويقوي صاحبها على درها\n إما بسبب شيخ كامل\n أو أخ صالح\n فإن الصحبة فيها سر كبير\n لا سيما مع أهل الصفاء\n الذين صفت قلوبهم\n وألف الله بينهم بالمحبة والوداد\n وحسن الظن والاعتقاد\n وإما بسابق عناية ربانية وقوة إلهية\n وبالله التوفيق\n ثم أمر نبيه بالاكتفاء بالله وعدم الالتفات إلى ما سواه\n فقال: { يٰأَيُّهَا ٱلنَّبِيُّ حَسْبُكَ ٱللَّهُ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "97:3",
      "similarity": 0.4206979712882311
    },
    {
      "verse": "2:243",
      "similarity": 0.3814649535994562
    },
    {
      "verse": "22:47",
      "similarity": 0.3609026312874902
    },
    {
      "verse": "3:124",
      "similarity": 0.3551051094874761
    },
    {
      "verse": "37:147",
      "similarity": 0.3162288590250913
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008063.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008063.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:63.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}