{
  "chapter": "الأنفال",
  "text": "يايها النبى حرض المؤمنين على القتال ان يكن منكم عشرون صبرون يغلبوا۟ ما۟ئتين وان يكن منكم ما۟ئة يغلبوا۟ الفا من الذين كفروا۟ بانهم قوم لا يفقهون",
  "translations": [
    {
      "translation": "O Prophet! spur on the muminun to fight. If there are twenty of you who are steadfast, they will overcome two hundred; and if there are a hundred of you, they will overcome a thousand of those who are kafir, because they are people who do not understand.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, urge the faithful to fight. If there are twenty among you with determination they will vanquish two hundred; and if there are a hundred then they will vanquish a thousand unbelievers, for they are people devoid of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Rouse the believers to fighting. If they be twenty of you who persevere they shall vanquish two hundred; and if there be of you a hundred, they shall vanquish a thousand of those who disbelieve, for they are a people who lack understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prophet, mobilize the believers for the battle. It will take only twenty of your men who are steadfast (in prayer) to defeat two hundred unbelieving men. Your two hundred men would defeat their two thousand; the unbelievers have no understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Herald of the Hidden! Urge the believers to fight; if there are twenty persevering men among you, they shall overcome two hundred; and if there are a hundred among you, they shall overcome a thousand disbelievers because the disbelievers are a people who do not have sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Urge the believers to fight. If there are twenty steadfast persons among you, they will overcome two hundred, and if there be a hundred steadfast persons they will overcome a thousand of those who disbelieve, because they (the disbelievers) are people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! urge the believers to war; if there are twenty patient ones of you they shall overcome two hundred, and if there are a hundred of you they shall overcome a thousand of those who disbelieve, because they are a people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, urge on the believers to fight. If there be twenty of you, patient men, they will overcome two hundred; if there be a hundred of you, they will overcome a thousand unbelievers, for they are a people who understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Exhort the believers to fight. If there be of you twenty steadfast they shall overcome two hundred, and if there be of you a hundred (steadfast) they shall overcome a thousand of those who disbelieve, because they (the disbelievers) are a folk without intelligence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prophet, urge the believers to fight; if there are twenty of you who are steadfast, they will overcome two hundred, and if there are a hundred of you, they will overcome a thousand of those who deny the truth, for they are devoid of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! urge the believers unto fighting. If there be twenty of you persevering, they will overcome two hundred, and if there be of you a hundred, they will overcome a thousand of those who disbelieve, for they are a people who understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Urge on the faithful to fight: If there be twenty patient men among you, they shall overcome two hundred; and if there be a hundred of you, they shall overcome a thousand of the faithless, for they are a lot who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! rouse the Believers to the fight. If there are twenty amongst you, patient and persevering, they will vanquish two hundred: if a hundred, they will vanquish a thousand of the Unbelievers: for these are a people without understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet (Muhammad SAW)! Urge the believers to fight. If there are twenty steadfast persons amongst you, they will overcome two hundred, and if there be a hundred steadfast persons they will overcome a thousand of those who disbelieve, because they (the disbelievers) are people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, urge the believers to fight. If there are twenty patient men among you, you shall overcome two hundred, and if there are a hundred, they shall overcome a thousand unbelievers, for they are a nation who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O prophet! Rouse the believers to battle. If there are twenty steadfast among you, they will defeat two hundred; and if there are a hundred of you, they will defeat a thousand of those who disbelieve; because they are a people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, urge the believers to battle. If there are among you twenty [who are] steadfast, they will overcome two hundred. And if there are among you one hundred [who are] steadfast, they will overcome a thousand of those who have disbelieved because they are a people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:65] O Prophet, urge on, exhort, the believers to fight, the disbelievers. If there be twenty of you, steadfast, they will overcome two hundred, of them. If there be (read as yakun or takun) a hundred of you, they will overcome a thousand of those who disbelieve, for they are a people who do not understand (this [sentence] is predicative, but functions as an imperative, in other words, let the twenty of you fight the two hundred [of them], and the hundred [of you], the thousand [of them], and let them stand firm against them; but when they became numerous this was abrogated by God’s saying):\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(O Prophet! Exhort the believers) prompt and encourage them (to fight) on the Day of Badr. (If there be of you twenty steadfast) in war, seeking their reward only from Allah (they shall overcome two hundred) of the idolaters, (and if there be of you a hundred steadfast they shall overcome) shall fight (a thousand of those who disbelieve, because they (the disbelievers) are a folk without intelligence) they do not understand the command of Allah and His divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلنَّبِيُّ } المظفر المنصور بنصر الله { حَرِّضِ } ورغب { ٱلْمُؤْمِنِينَ } الموحدين { عَلَى ٱلْقِتَالِ } في سبيل الله\n لترويج توحيده\n وقل لهم نيابةً عنا ووعداً منا: { إِن يَكُن مِّنكُمْ } أيها المؤمنون { عِشْرُونَ صَابِرُونَ } مستقرون ثابتون تجاه العدو { يَغْلِبُواْ مِئَتَيْنِ } منهم بتأييد منَّا وعون { وَإِن يَكُنْ مِّنكُمْ مِّئَةٌ } صابرة راسخة\n متمكنة { يَغْلِبُوۤاْ أَلْفاً مِّنَ ٱلَّذِينَ كَفَرُواْ } بإمدادنا إياكم إلى حيث يقاوم واحد منكم عشرة منهم\n ذلك المغلوبية والانهزام إنما عرض عليهم { بِأَنَّهُمْ قَوْمٌ لاَّ يَفْقَهُونَ } [الأنفال: 65] أي: لا يصلون إلى مرتبة العلم اليقيني بالله وكتبه ورسله\n حتى يترقوا منه إلى مرتبة العين والحق\n بل يبقون على مرتبة الحيوانية مهانين مغلوبين مخذولين\n\n\nهذا في بدء الإسلام وضعف المسلمين وقلتهم\n وبعدما ارتفع قدره وعلا رتبته وكثر أ÷له وانتشر في الآفاق قال سبحانه: { ٱلآنَ } أي: حين كثر عددكم وعُددكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: التحريض: هو الحث على الشيء والمبالغة في طلبه\n وهو من الحرض\n الذي هو الإشفاء على الهلاك\n يقول الحق جل جلاله: { يا أيها النبي حرّض المؤمنينَ } أي: حثهم { على القتال } أي: الجهاد\n ثم أمرهم بالصبر والثبات للعدو بقوله: { إنْ يكنْ منكم عشرون صابرون يغلبوا مائتين\n وإن يكن منكم مائة يغلبوا ألفاً من الذين كفروا } \n وهذا خبر بمعنى الأمر\n أي: يقاتل العشرون منكم المائتين\n والمائة الألف\n وليثبتوا لهم\n ولا يصح أن يكون خبراً محضاً إذ لو كان خبراً محضاً لَمَا تخلف في الواقع\n ولو في جزئية إذ خبره تعالى لا يخلف\n قال الفخر الرازي: حَسُن هذا التكليف لِما كان مسبوقاً بقوله: { حسبُكَ الله ومن اتبعك من المؤمنين } فلما وعد المؤمنين بالكفاية والنصر كان هذا التكليف سهلاً لأن من تكفل الله بنصره فإن أهل العالم لا يقدرون على إذايته\nهـ\n وإنما كان القليل من المؤمنين يقاوم الكثير من الكفار { بأنهم } بسبب أنهم { قوم لا يفقهون } \n أي: لأنهم جهلة بالله واليوم الآخر\n فلا يثبتون ثبات المؤمنين\n رجاء الثواب والترقي في الدرجات\n قتلوا أو ماتوا\n بخلاف الكفار فلا يستحقون من الله إلا الهوان والخذلان\n ولمّا كلفهم بهذا في أول الإسلام\n وشقَّ ذلك عليهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:84",
      "similarity": 0.45984353576134746
    },
    {
      "verse": "37:147",
      "similarity": 0.42630858980479625
    },
    {
      "verse": "8:66",
      "similarity": 0.419716808052983
    },
    {
      "verse": "12:85",
      "similarity": 0.3024297293159297
    },
    {
      "verse": "24:2",
      "similarity": 0.22486805147825725
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/8:65.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/8:65.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:65.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}