{
  "chapter": "الأنفال",
  "text": "الـن خفف الله عنكم وعلم ان فيكم ضعفا فان يكن منكم ما۟ئة صابرة يغلبوا۟ ما۟ئتين وان يكن منكم الف يغلبوا۟ الفين باذن الله والله مع الصبرين",
  "translations": [
    {
      "translation": "Now Allah has made it lighter on you, knowing there is weakness in you. If there are a hundred of you who are steadfast, they will overcome two hundred; and if there are a thousand of you, they will overcome two thousand with Allah's permission. Allah is with the steadfast.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has lightened your burden as He knows you are weak: So, if there are a hundred men of firm determination among you, they will vanquish two hundred; and if there are a thousand of you they will vanquish two thousand by the will of God, for God is with those who are determined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has now lightened your burden for He found weakness in you. So if there be hundred of you who persevere, they shall vanquish two hundred; and if there be a thousand of you they shall, by the leave of Allah, vanquish two thousand. Allah is with those who persevere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now that God has eased your burden, He has found you to be weak. A hundred of your steadfast men would defeat two hundred of theirs and a thousand of yours would defeat two thousand of the unbelievers, by the will of God. God is with those who have patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So now Allah has made an ease upon you and He knows that you are weak; so if there are a hundred persevering men among you, they shall overcome two hundred; and if there are a thousand among you, they shall overcome two thousand by the command of Allah; and Allah is with those who patiently endure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now Allah has lightened your (task), for He knows that there is weakness in you. So if there are of you a hundred steadfast persons, they shall overcome two hundred, and if there are a thousand of you, they shall overcome two thousand by the leave of Allah. And Allah is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the present Allah has made light your burden, and He knows that there is weakness in you; so if there are a hundred patient ones of you they shall overcome two hundred, and if there are a thousand they shall overcome two thousand by Allah's permission, and Allah is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now God has lightened it for you, knowing that there is weakness in you. If there be a hundred of you, patient men, they will overcome two hundred; if there be of you a thousand, they will overcome two thousand by the leave of God; God is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now hath Allah lightened your burden, for He knoweth that there is weakness in you. So if there be of you a steadfast hundred they shall overcome two hundred, and if there be of you a thousand (steadfast) they shall overcome two thousand by permission of Allah. Allah is with the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has now lightened your burden, for He knows that there is weakness in you. If there are a hundred of you who are steadfast, they will overcome two hundred; and if there are a thousand of you, they will overcome two thousand by God's will. God is with the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now Allah hath lightened your burden, and He knoweth that verily there is in you a weakness. So if there be a hundred of you persevering, they will overcome two hundred, and if there be a thousand of you they will overcome two thousand, by the command of Allah and Allah is with the persevering.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now Allah has lightened your burden, knowing that there is weakness in you. So if there be a hundred patient men among you, they shall overcome two hundred; and if there be a thousand, they shall overcome two thousand, by Allah’s leave; and Allah is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the present, Allah hath lightened your (task), for He knoweth that there is a weak spot in you: But (even so), if there are a hundred of you, patient and persevering, they will vanquish two hundred, and if a thousand, they will vanquish two thousand, with the leave of Allah: for Allah is with those who patiently persevere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now Allah has lightened your (task), for He knows that there is weakness in you. So if there are of you a hundred steadfast persons, they shall overcome two hundred, and if there are a thousand of you, they shall overcome two thousand with the Leave of Allah. And Allah is with As-Sabirin (the patient ones, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has now lightened it for you, for He knows that there is weakness amongst you. If there are a hundred patient men among you, they shall overcome two hundred; and if there are a thousand, they shall, by the permission of Allah, defeat two thousand. Allah is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has now lightened your burden, knowing that there is weakness in you. If there are a hundred steadfast among you, they will defeat two hundred; and if there are a thousand of you, they will defeat two thousand by God’s leave. God is with the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now, Allah has lightened [the hardship] for you, and He knows that among you is weakness. So if there are from you one hundred [who are] steadfast, they will overcome two hundred. And if there are among you a thousand, they will overcome two thousand by permission of Allah. And Allah is with the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:66] Now God has lightened [the burden] for you, for He knows that there is weakness (read du‘fan or da‘fan) in you, [making you unable] to fight ten times your number. So if there be (read as yakun or takun) a hundred of you, steadfast, they will overcome two hundred, of them; and if there be a thousand of you, they will overcome two thousand by the leave of God, by His will (this is predicative, functioning as an imperative, in other words: fight twice your number and stand firm against them). And God is with the steadfast, by His support [of them].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Now hath Allah lightened your burden, for He knoweth that there is weakness in you) in relation to fighting. (So if there be of you a steadfast hundred) who seek their reward only from Allah (they shall overcome) they shall fight (two hundred, and if there be of you a thousand (steadfast) they shall overcome) they shall fight (two thousand by permission of Allah. Allah is with the steadfast) He helps the steadfast in war by making them triumphant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وثقل عليكم ما أمرتم { خَفَّفَ ٱللَّهُ } الميسر لأموركم أثقالكم { عَنكُمْ وَعَلِمَ } بعلمه الحضوري { أَنَّ فِيكُمْ ضَعْفاً } تستثقلون بتحمل المأمور به\n أمركم ثابتاً بقوله: { فَإِن يَكُنْ مِّنكُمْ مِّئَةٌ صَابِرَةٌ } ثابتة { يَغْلِبُواْ مِئَتَيْنِ } منهم { وَإِن يَكُن مِّنكُمْ أَلْفٌ يَغْلِبُوۤاْ أَلْفَيْنِ بِإِذْنِ ٱللَّهِ } ونصره وتأييده { وَٱللَّهُ } المراقب لأحوال عباده { مَعَ ٱلصَّابِرِينَ } [الأنفال: 66] المتجملين في متاعب أمور الدين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:147",
      "similarity": 0.5622711868783128
    },
    {
      "verse": "8:65",
      "similarity": 0.4197168080529829
    },
    {
      "verse": "10:91",
      "similarity": 0.38258537416435956
    },
    {
      "verse": "10:51",
      "similarity": 0.3718195984969245
    },
    {
      "verse": "4:18",
      "similarity": 0.31859242021351175
    }
  ]
}