{
  "chapter": "الأنفال",
  "text": "ما كان لنبى ان يكون له اسرى حتى يثخن فى الارض تريدون عرض الدنيا والله يريد الءاخرة والله عزيز حكيم",
  "translations": [
    {
      "translation": "No apostle should take captives until he has battled and subdued the country. You desire the vanities of this world, but God wills (for you the reward) of the world to come; and God is all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It behoves not a Prophet to take captives until he has sufficiently suppressed the enemies in the land. You merely seek the gains of the world whereas Allah desires (for you the good) of the Hereafter. Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet is not supposed to take any captives to strengthen his position on the earth. You want worldly gains but God wants the life hereafter for you. God is Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It does not befit any Prophet to capture the disbelievers alive until he has profusely shed their blood in the land; you people desire the wealth of this world; and Allah wills the Hereafter, and Allah is Almighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not (fitting) for a Prophet that he should have prisoners of war until he has fought (his enemies thoroughly) in the land. You desire the goods of this world, but Allah desires (for you) the Hereafter. And Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not fit for a prophet that he should take captives unless he has fought and triumphed in the land; you desire the frail goods of this world, while Allah desires (for you) the hereafter; and Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for any Prophet to have prisoners until he make wide slaughter in the land. You desire the chance goods of the present world, and God desires the world to come; and God is All-mighty, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for any prophet to have captives until he hath made slaughter in the land. Ye desire the lure of this world and Allah desireth (for you) the Hereafter, and Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not right for a Prophet to keep captives unless he has battled strenuously in the land. You desire the gain of this world, while God desires for you the Hereafter -- God is mighty and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It behoveth not a prophet that he should have captives until he hath greatly slaughtered in the land. Ye seek the gear of the world, while Allah seeketh the Hereafter; and Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A prophet may not take captives until he has thoroughly decimated [the enemy] in the land. You desire the transitory gains of this world, while Allah desires [for you] [the reward of] the Hereafter, and Allah is all-mighty, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not fitting for a prophet that he should have prisoners of war until he hath thoroughly subdued the land. Ye look for the temporal goods of this world; but Allah looketh to the Hereafter: And Allah is Exalted in might, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for a Prophet that he should have prisoners of war (and free them with ransom) until he had made a great slaughter (among his enemies) in the land. You desire the good of this world (i.e. the money of ransom for freeing the captives), but Allah desires (for you) the Hereafter. And Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for any Prophet to have prisoners in order to slaughter many in the land. You want the gains of this life, and Allah wants the Everlasting Life, and Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for a prophet to take prisoners before he has subdued the land. You desire the materials of this world, but God desires the Hereafter. God is Strong and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for a prophet to have captives [of war] until he inflicts a massacre [upon Allah 's enemies] in the land. Some Muslims desire the commodities of this world, but Allah desires [for you] the Hereafter. And Allah is Exalted in Might and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:67] The following was revealed when they ransomed those taken captive at Badr: It is not for any Prophet to have (read as an takūna lahu or an yakūna lahu) prisoners until he has made slaughter in the land, going all the way in fighting disbelievers. You, O believers, desire the transient things of this world, its ephemeral gains, by ransoming, while God desires, for you, the Hereafter, that is, its reward, through your killing them; and God is Mighty, Wise: this was abrogated by His words [and set them free] afterward either with grace or by ransom [Q. 47:4].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It is not for any Prophet) it is not proper for any Prophet (to have captives) from among disbelievers (until he hath made slaughter) until he conquers (in the land) by means of fighting. (Ye desire the lure of this world) by taking ransoms for the prisoners of Badr (and Allah desireth (for you) the Hereafter, and Allah is Mighty) in His retribution against His enemies, (Wise) by helping His friends.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { حَتَّىٰ يُثْخِنَ فِي ٱلأَرْضِ } معناهُ يَغْلِبُ ويُبالغُ\n ويقالُ حتَّى يَظْهرَ عَلَى الأَرضِ\n\n\n\n\nوقوله تعالى: { تُرِيدُونَ عَرَضَ ٱلدُّنْيَا } معنى عَرضُهَا: مَتَاعُهَا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ أشار سبحانه إلى سر جواز أخذ الفدية والجزية للرسل والأنبياء، ووقَّته وسبَّبه فقال: { مَا كَانَ } أي: ما صح وجاز { لِنَبِيٍّ } من الأنبياء { أَن يَكُونَ لَهُ } وفي يده { أَسْرَىٰ } من الكفار يفديهم على المال، ويخلي سبيلهم { حَتَّىٰ يُثْخِنَ فِي ٱلأَرْضِ } أي: لا يجوز لهم أخذ الفدية إلى أن يكثر القتل وبذل الكفار، ويعز الدين ويغلب أهله إلى حيث اضطر المخالفون لتخليص نفوسهم إلى الفدية، مع أنه لا يتوقع منهم المنازعة والمخاصمة أصلاً، وصاروا مهانين مقهورين، ومتى لم يصلوا إلى هذه المرتبة لم يصح أخذ الفدية، وإذا كان أمر الفدية هكذا، كيف { تُرِيدُونَ } أيها المؤمنون بأخذها { عَرَضَ ٱلدُّنْيَا } ومتاعها وحطامها { وَٱللَّهُ } المصلح لأحوالكم، المدبر لأموركم { يُرِيدُ } لكم { ٱلآخِرَةَ } وثوابها بأخذها، وما يترتب عليها من اللذات الروحانية، وأنتم تقصدون أن تستلذوا بحطام الدنيا ومزخرفاتها { وَٱللَّهُ } المراقب لحالاتكم { عَزِيزٌ } غالب فيما أراد لأجلكم { حَكِيمٌ } [الأنفال: 67] ريد لكم ما يليق بحالكم؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ما كان لنبي أن يكونَ له أسرى } يقبضها { حتى يُثخِنَ } أي: يبالغ { في الأرض } بالقتل حتى يذل الكفر ويقل حزبه، ويعز الإسلام ويستولي أهله\n { تُريدون } بقبض الأسارى { عَرَض الدنيا } حطامها بأخذ الفداء منهم، { والله يُريدُ الآخرة } أي: يريد لكم ثواب الآخرة، الذي يدوم ويبقى، أو يريد سبب نيل الآخرة من إعزاز دينه وقمع أعدائه، { والله عزيز } يغلب أولياءه على أعدائه، { حكيم } يعلم ما يليق بكمال حالهم ويخصهم بها، كما أمر بالإثخان، ومَنَعَ مِنْ أخذ الفداء حين كانت الشوكة للمشركين، وخيَّر بينه وبين المنِّ لما تحولت الحال، وصارت الغلبة للمؤمنين\n رُوي أنه عليه الصلاة والسلام أُتِيَ يوم بدر بسَبْعِينَ أسِيراً، فيهم العَبَّاس وعَقيلُ بن أَبي طَالِبٍ، فاستأْذن فِيهِمْ فقال أبو بكر رضي الله عنه: قَومُكَ وأهلُك، اسْتَبِقهِمْ، لعلَّ الله يَتُوب عَلَيْهِمْ، وخُذْ مِنْهُمْ فدْيةً تُقَوِّي بِها أَصْحَابَكَ\n وقال عمر رضي الله عنهم: اضْربْ أعْنَاقَهُمْ، فإنهم أئِمَّةُ الكُفْر وإنَّ الله أغْنَاكَ عَنِ الفِدَاءِ، فمكِّني من فُلاَن ـ لنَسِيبٍ لَهُ ـ ومكِّنَ عَليّاً وحَمْزَةَ مِنْ أخويهما، فَلْنَضْربْ أَعنَاقَهُمْ فلم يَهْو ذلك رسول الله صلى عليه وسلم، وقال:\n\n \" إنَّ اللَّهَ لَيُلَيِّنَ قُلُوبَ رِجَالٍ حَتَّى تكُونَ أَلْيَنَ من كُلّ لين، وإن الله ليُشَدِّدُ قُلوب رِجَالٍ حتَّى تَكُونَ أَشَدَّ من الحِجَارَةِ، وإن مَثلَكَ يا أَبَا بَكْر مَثَلُ إبراهيم \" \n\n، قال:\n\n[إبراهيم: 36]، ومَثَلُكَ يا عُمَرُ مَثَلُ نوح، قال:\n\n[نوح: 26]\n فخيَّر أصحابه، فأخذوا الفداء، فنزلت، فدخل عمر رضي الله عنه على رسول الله صلى الله عليه وسلم، فإذا هو وأبو بكر يَبْكِيانِ، فقال: يا رسول الله:أخْبِرْنيِ، فَإنْ أجد بُكاء بَكَيْتُ، وإلا تَبَاكيْتُ؟ فقال:\n\n \" أبكِي على أصْحَابِكَ في أخْذِهُمُ الفداء، ولقد عُرض عليَّ عذابُهم أدْنَى مِنْ هذِهِ الشَّجَرة \" \n\nلِشَجَرَة قَرِيبَةٍ\n والآية دليل على أن الأنبياء ـ عليهم السلام ـ يجتهدون، وأنه قد يكون الخطأ، ولكن لا يقرون عليه\n قاله البيضاوي\n قال القشيري: أخَذَ النبي صلى الله عليه وسلم يوم بدر منهم الفداء، وكان ذلك جائزاً لوجوب العصمة، ولكن قتلهم كان أَوْلى\n هـ\n وقال ابن عطية: إنما توجه العتاب للصحابة على استبقاء الرجال دون قتلهم، لا على الفداء لأن الله تعالى قد كان خيَّرهم، فاختاروا الفداء على أن يقتل منهم سبعين، كما تقدم في سورة آل عمران\n ثم قال: والنبي عليه الصلاة السلام خارج عن ذلك الاستبقاء\n انظر تمامه في الحاشية\n فإن قلت: إذا كان الحق تعالى خيَّرهم فكيف عاتبهم، وهم لم يرتكبوا محظوراً؟ فالجواب: أن العتاب تابع لعلو المقام، فالخواص يُعاتبون على المباح، إن كان فعله مرجوحاً، والحق تعالى إنما عاتبهم على رغبتهم في أمر دنيوي، وهو الفداء، حتى آثروا قتل أنفسهم على أخذه، ويدل عليه قوله: { تُريدون عَرَض الدنيا } ، وهذا إنما كان في بعضهم، وجُلهم إنما اختاروا الفداء استبقاء لقرابة الرسول عليه الصلاة والسلام\n\n\nوالله تعالى أعلم",
      "translations": []
    }
  ]
}