{
  "chapter": "الأنفال",
  "text": "لولا كتب من الله سبق لمسكم فيما اخذتم عذاب عظيم",
  "translations": [
    {
      "translation": "Were it not for a prior decree which had already proceeded from Allah, a terrible punishment would have afflicted you on account of what you took.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had this not been decreed by God in advance, you would have suffered a grievous punishment for what you took (as booty).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there not been a previous decree from Allah, a stern punishment would have afflicted you for what you have taken.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Had you taken captives) before being allowed by God's revelations, a great torment would have struck you for what you had done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah not pre-destined a matter then, O Muslims, a terrible punishment would have come upon you due to the ransom you took from the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not a previous ordainment from Allah, a severe torment would have touched you for what you took.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not for an ordinance from Allah that had already gone forth, surely there would have befallen you a great chastisement for what you had taken to.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been for a prior prescription from God, there had afflicted you, for what you took, a mighty chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been for an ordinance of Allah which had gone before, an awful doom had come upon you on account of what ye took.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been for a writ from God that had already gone forth, you would have been severely punished on account of what you took.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not that a writ had already gone forth from Allah, there would surely have touched you a mighty torment for that which ye took\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been for a prior decree of Allah, surely there would have befallen you a great punishment for what you took.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been for a previous ordainment from Allah, a severe penalty would have reached you for the (ransom) that ye took.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not a previous ordainment from Allah, a severe torment would have touched you for what you took.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there not been a previous writing from Allah, you would have been afflicted by a mighty punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not for a predetermined decree from God, an awful punishment would have afflicted you for what you have taken.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If not for a decree from Allah that preceded, you would have been touched for what you took by a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:68] Had it not been for an ordinance from God which had preceded, making spoils and the taking of captives lawful for you, an awful chastisement would have afflicted you for what you took, as ransom.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Had it not been for an ordinance of Allah which had gone before) had it not been for Allah's decree that spoils of war were lawful for the community of Muhammad (pbuh); it is also said that this means: had it not been that Allah decreed felicity for the people of Badr, (an awful) a severe (doom had come upon you on account of what ye took) would have befallen you because of the ransoms you took. 191\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَّوْلاَ كِتَابٌ } حكم وأمر ثابت نازل { مِّنَ ٱللَّهِ } المنتقم الغيور { سَبَقَ } من سابق علمه بألا يأخذ المجتهد المخطئ بخطئه { لَمَسَّكُمْ } أصابكم ونزل عليكم { فِيمَآ أَخَذْتُمْ } وافتديتم من أسارى بدر { عَذَابٌ عَظِيمٌ } [الأنفال: 68] مقدار ما فوتم من حكمة الله وأبطلتم حكمه\n\n\n \" روي أنه صلى الله عليه وسلم أتى يوم بدر بسبعين أسيراً فيهم العباس وعقيل بن أبي طالب\n فاستشار رسول الله صلى الله عليه وسلم فيهم\n فقال أبو بكر رضي الله عنه: قومك وأهلك استبقهم لعل الله يتوب عليهم\n وخذ منهم فدية يقوى بها أصحابك\n وقال عمر رضي الله عنه: اضرب أعناقهم فإنهم أئمة الكفر\n فإن الله أغناك من الفداء فمكني من فلان\n لنسب له\n ومكن علياً وحمرمة من أخويهما\n فنلضرب أعناقهم\n \n \n فقال رسول الله صلى الله عليه وسلم: \" مثلك يا أبا بكر مثل إبراهيم عليه السلام حيث قال: { فَمَن تَبِعَنِي فَإِنَّهُ مِنِّي وَمَنْ عَصَانِي فَإِنَّكَ غَفُورٌ رَّحِيمٌ } \n مثلك يا عمر مثل نوح حيث قال: { رَّبِّ لاَ تَذَرْ عَلَى ٱلأَرْضِ مِنَ ٱلْكَافِرِينَ دَيَّاراً } \" فخير أصحابه فأخذوا الفداء\n فزلت\n \n \n فدخل عمر على رسول الله صلى الله عليه وسلم فإذا هو وأبو بكر يبكيان\n فقال: يا رسول الله صلى الله عليه وسلم أخبرني\n فإن أجد بكاء بكيت و إلا تباكيت\n فقال: أبكي على أصحابك في أخذهم الفداء ولقد عرض علي عذابهم أدنى من هذه \" لشجرةٍ قريبة عنده\n فقال صلى الله عليه وسلم: \" لو نزل العذاب لما برئ منه غير عغمر وسعد بن معاذ \"\n \n \nومتى اجتهدتم في أخذ الفدية من الأسرى فأخذتم الفدية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى في تمام عتابهم: { لولا كتابٌ من الله سبق } أي: لولا حكم الله سبق إثباته في اللوح المحظوظ، وهو ألا يعاقب المخطئ في اجتهاده، أو أنه سيحل لكم الغنائم، أو ما سبق في الأزل من العفو عنكم، { لمسّكم فيما أخذتُم } من الفداء أو من الأسارى، { عذابٌ عظيم }\n رُوي أنه عليه الصلاة والسلام قال، حيث نزلت:\n\n \" لو نزل العذاب ما نجا منه غير عمر وسعد بن معاذ \" \n\nوذلك لأنه أيضاً أشار بالإثخان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:156",
      "similarity": 0.5236089532270213
    },
    {
      "verse": "56:10",
      "similarity": 0.5206428706464031
    },
    {
      "verse": "79:4",
      "similarity": 0.519498316727279
    },
    {
      "verse": "21:27",
      "similarity": 0.4785768608861948
    },
    {
      "verse": "21:101",
      "similarity": 0.46856174452638905
    }
  ]
}