{
  "chapter": "الأنفال",
  "text": "فكلوا۟ مما غنمتم حللا طيبا واتقوا۟ الله ان الله غفور رحيم",
  "translations": [
    {
      "translation": "So make full use of any booty you have taken which is halal and good; and have taqwa of Allah. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But now use such of the spoils as are lawful and good, and fear God, for God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat that which you have obtained - for it is lawful and clean--and fear Allah. Surely Allah is Ever-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Use what you have acquired (from the battle) as your own good, lawful property. Have fear of God; He is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore benefit from the booty you have received, lawful and good; and keep fearing Allah; indeed Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So enjoy what you have gotten of booty in war, lawful and good, and have Taqwa of Allah. Certainly, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat then of the lawful and good (things) which you have acquired in war, and be careful of (your duty to) Allah; surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat of what you have taken as booty, such as is lawful and good; and fear you God; surely God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now enjoy what ye have won, as lawful and good, and keep your duty to Allah. Lo! Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat of that which you have gained in war as lawful and good, and fear God. Surely, God is most forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat ye then of that which ye have obtained of spoi1, lawful and clean, fear Allah; verily Allah is Forgiving, Merciful\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Avail yourselves of the spoils you have taken as lawful and good, and be wary of Allah. Indeed Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But (now) enjoy what ye took in war, lawful and good: but fear Allah: for Allah is Oft-forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So enjoy what you have gotten of booty in war, lawful and good, and be afraid of Allah. Certainly, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat of what you have taken from the spoils; such is lawful and good, and fear Allah. Allah is Forgiving and Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So consume what you have gained, legitimate and wholesome; and remain conscious of God. God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So consume what you have taken of war booty [as being] lawful and good, and fear Allah. Indeed, Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:69] Now eat of what you have plundered, as lawful and good, and fear God. Truly God is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Now enjoy what ye have won) at Badr of spoils of war, (as lawful and good, and keep your duty to Allah) and fear Allah regarding this. (Lo! Allah is Forgiving) He overlooks transgressions, (Merciful) regarding that which ensued from you at Badr concerning the ransom of prisoners.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وإن كان اجتهادكم خطأ { فَكُلُواْ مِمَّا غَنِمْتُمْ } بعد إخراج الخمس وافتديتم من الأسرى\n إذ هي من جملة الغنيمة { حَلاَلاً } مستحلين مستبيحين { طَيِّباً } خالياً عن وصمة الشبهة\n لاجتهادكم في أخذها { وَٱتَّقُواْ ٱللَّهَ } من المبادرة في الأمور\n واحتاطوا فيها { إِنَّ ٱللَّهَ } المدبر لأموركم { غَفُورٌ } لما صدر عنكم من المبادرة إلى الفدية { رَّحِيمٌ } [الأنفال: 69] أباح لكم ما أخذتم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم أباح لهم الغنائم وأخذ الفداء فقال: { فكلوا مما غنمتُم } من الكفار\n ومن جملته: الفدية\n فإنها من الغنائم\n { حلالاً طيباً } أي: أكلاً حلالاً\n فائدته: إزاحة ما وقع في نفوسهم بسبب تلك المعاتبة\n أو حرمتها على المتقدمين\n رُوي أنه لما عاتبهم أمسكوا عنها حتى نزلت: { فكلوا مما غنمتم } \n ووصفة بالطيب تسكيناً لقلوبهم\n وزيادة في حليتها\n وفي الحديث عنه صلى الله عليه وسلم:\n \" أُعْطِيتُ خَمْساً لِيَ لَمْ يُعْطَهُنَّ أّحّدٌ من الأَنْبِيَاءِ قَبْلِي: أُحِلَّتْ لِيَ الغَنَائِمُ\n ونُصِرْتُ بالرُّعْبِ مسِيرَةَ شَهْرٍ وجُعِلَتْ لِيَ الأَرْضُ مَسْجِداً وطهُوراً وأُعْطِيتُ الشَّفَاعَةَ\n وخُصصتُ بِجَوَامعِ الكلمِ \" \nأو كما قال عليه الصلاة والسلام\n ثم قال تعالى: { واتقوا الله } في مخالفته { إن الله غفور رحيم } أي: يغفر لكم ما فرط\n ويرحمكم بإباحة ما حرم على غيركم توسعةً عليكم\n والله تعالى أعلم\n  الإشارة: ما ينبغي للفقير المتوجه أن يكون له أتباع يتصرف فيهم ويستفيد منهم\n عوضاً عن الدنيا\n حتى يبالغ في قتل نفسه وتموت\n ويأمن عليها الرجوع إلى وطنها من حب الرئاسة والجاة\n أو جمع المال\n والتمتع بالحظوظ\n فإن تعاطي ذلك قبل موت نفسه كان ذلك سبب طرده\n وتعجيل العقوبة له\n حتى إذا تداركه الله بلطفه\n وسبقت له عناية من ربه\n فيقال له حينئذٍ: لولا كتاب من الله سبق لمسك فيما أخذت عذاب عظيم\n ثم بشَّر الأسارى بخلف ما أخذ منهم من الفداء بأكثر منه\n فقال: { يٰأَيُّهَا ٱلنَّبِيُّ قُل لِّمَن فِيۤ أَيْدِيكُمْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "48:19",
      "similarity": 0.703854757493971
    },
    {
      "verse": "48:20",
      "similarity": 0.49312739672911826
    },
    {
      "verse": "5:88",
      "similarity": 0.47927534443506326
    },
    {
      "verse": "4:94",
      "similarity": 0.46666105875905534
    },
    {
      "verse": "8:41",
      "similarity": 0.39624954105324484
    }
  ]
}