{
  "chapter": "الأنفال",
  "text": "يايها النبى قل لمن فى ايديكم من الاسرى ان يعلم الله فى قلوبكم خيرا يؤتكم خيرا مما اخذ منكم ويغفر لكم والله غفور رحيم",
  "translations": [
    {
      "translation": "O Prophet, tell the captives you have taken: \"If God finds some good in your hearts, He will reward you with something better than was taken away from you, and forgive your sins, for God is forgiving and kind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Say to the captives in your hands: 'If Allah finds any goodness in your hearts He will give you that which is better than what has been taken away from you, and He will forgive you. Allah is Ever-Forgiving, Most Merciful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prophet, tell the captives with you, \"If God finds anything good in your hearts, He will give you a better reward than that which was taken from you and will forgive you. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Herald of the Hidden! Say to the captives whom you possess, “If Allah finds any goodness in your hearts, He will give you better than what has been taken from you, and will forgive you; and Allah is Oft Forgiving, Most Merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Say to the captives that are in your hands: \"If Allah knows any good in your hearts, He will give you something better than what has been taken from you, and He will forgive you, and Allah is Oft-Forgiving, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! say to those of the captives who are in your hands: If Allah knows anything good in your hearts, He will give to you better than that which has been taken away from you and will forgive you, and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, say to the prisoners in your hands: 'If God knows of any good in your hearts He will give you better than what has been taken from you, and He will forgive you; surely God is All-forgiving, All-compassionate.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Say unto those captives who are in your hands: If Allah knoweth any good in your hearts He will give you better than that which hath been taken from you, and will forgive you. Lo! Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prophet, tell those you have taken captive: \"If God knows of any good in your hearts, He will give you something better than what has been taken from you, and He will forgive you: God is Forgiving and Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! say Unto the captives who are in your hands: if Allah knoweth any good in Your hearts He will give you better than that which hath been taken away from you, and shall forgive you; and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Say to the captives who are in your hands, ‘If Allah finds any good in your hearts, He will give you [something which is] better than what has been taken away from you, and He will forgive you, and Allah is all-forgiving, all-merciful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! say to those who are captives in your hands: \"If Allah findeth any good in your hearts, He will give you something better than what has been taken from you, and He will forgive you: for Allah is Oft-forgiving, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Say to the captives that are in your hands: \"If Allah knows any good in your hearts, He will give you something better than what has been taken from you, and He will forgive you, and Allah is Oft-Forgiving, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, say to those you have taken captive in your hand: 'If Allah finds goodness in your hearts, He will give you that which is better than what has been taken from you, and He will forgive you. Allah is Forgiving, the Most Merciful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O prophet! Say to those you hold prisoners, “If God finds any good in your hearts, He will give you better than what was taken from you, and He will forgive you. God is Forgiving and Merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, say to whoever is in your hands of the captives, \"If Allah knows [any] good in your hearts, He will give you [something] better than what was taken from you, and He will forgive you; and Allah is Forgiving and Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:70] O Prophet, say to those captives who are in your hands: (asrā, may also be read as asārā) ‘If God knows of   any good, any faith or sincere devotion, in your hearts He will give you better than that which has been taken from you, by way of ransom, by His multiplying it for you in this world and rewarding you in the Hereafter, and will forgive you, your sins. Truly God is Forgiving, Merciful’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(O Prophet, Say unto those captives who are in your hands) i.e. 'Abbas [Ibn 'Abd al-Muttalib]: If Allah knoweth any good) faith and sincerity (in your hearts He will give you better than that which hath been taken from you) of ransom, (and will forgive you) the sins you committed in the pre-Islamic period. (Lo! Allah is Forgiving, Merciful) towards he who believes in Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلنَّبِيُّ } المبعوث لتكميل الخلائق { قُل } على وجه العظة والتذكير بمقتضى شفقة النبوة والإرشاد { لِّمَن فِيۤ أَيْدِيكُمْ مِّنَ ٱلأَسْرَىٰ إِن يَعْلَمِ ٱللَّهُ } المطلع لضمائركم واستعداداتكم { فِي قُلُوبِكُمْ خَيْراً } إيماناً وإيقاناً، واطمئناناً وعرفاناً { يُؤْتِكُمْ خَيْراً مِّمَّآ أُخِذَ مِنكُمْ } من حطام الدنيا، وهي اللذات الروحانية والكشوف والمشاهدات التي لا مقدار للذات الجسمانية دونها { وَيَغْفِرْ لَكُمْ } ما صدر عنكم من الكفر والعصيان { وَٱللَّهُ } الهادي لعباده نحو توحيده { غَفُورٌ } لذنوبهم بعدما وفقهم للإيمان والإطاعة { رَّحِيمٌ } [الأنفال: 70] يرحمهم بعدما رجعوا نحوه وأنابوا\n\n\n\n\n \" رُوي أنها نزلت في العباس رضي الله عنه كلفه رسول الله صلى الله عليه وسلم أن يفدي نفسه وابني أخويه: عقيل بن أبي طالب، ونوفل بن الحارث، فقال: يا محمد تركتني أتكفف قريشاً ما بقيت فقال: صلى الله عليه وسلم: \" فأين الذي دفعته إلى أم الفضل وقت خروجك فقلت لها: إني لا أدري ما يصيبني في وجهي هذا، فإن حدث لي حدث فهو لك ولعبد الله وعبيد الله والفضل وقثم \" ، وقال العباس: وما يدريك؟ قال صلى الله عليه وسلم: \" أخبرني ربي \"\n \n\n \n\n قال أشهد أنك صادق، وأن لا إله إلا الله وأنك رسول الله، والله لم يطلع عليه أحد إلا الله، ولقد دفعته إليها في سواد الليل، فقال العباس رضي الله عنه: فأبدلني الله خيراً من ذلك إلى الآن عشرين عبداً، إن أدناهم ليضرب عشرين ألفاً، وأعطاني زمزم ما أ؛ب أن لي بها أموال أهل مكة، وأنا أنتظر المغفرة من ربكم \" \n\nيعني: الموعود بقوله: { وَيَغْفِرْ لَكُمْ وَٱللَّهُ غَفُورٌ رَّحِيمٌ } [الأنفال: 70]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: أسْرى: جمع أسير، ويجمع على أسارى\n وقرئ بهما، و خيراً مما: اسم تفضيل، وأصله: أًخْيَر، فاستغنى عنه بخير، وكذلك شر أصله: أشر، قال في الكافية:\n",
      "translations": []
    }
  ]
}