{
  "chapter": "الأنفال",
  "text": "وان يريدوا۟ خيانتك فقد خانوا۟ الله من قبل فامكن منهم والله عليم حكيم",
  "translations": [
    {
      "translation": "But if they mean to betray you, they have already previously betrayed Allah, so He has given you power over them. Allah is All-Knowing, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they try to deceive you, remember they have deceived God before. So He gave you mastery over them, for God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they seek to betray you, know that they had already betrayed Allah. Therefore He made you prevail over them. Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be surprised that they want to be dishonest with you; they have always been dishonest with God. However, He has power over them. God is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they wish to deceive you, they have already been disloyal to Allah, because of which He has given these disbelievers in your control; and Allah is All Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they intend to betray you, they indeed betrayed Allah before. So He gave (you) power over them. And Allah is All-Knower, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they intend to act unfaithfully towards you, so indeed they acted unfaithfully towards Allah before, but He gave (you) mastery over them; and Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they desire treachery against thee, they have tricked God before; but He has given thee power over them; and God is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they would betray thee, they betrayed Allah before, and He gave (thee) power over them. Allah is Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they would betray you, they betrayed God before, and He gave [you] power over them. God is aware and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they seek defrauding thee, then they have defrauded Allah before, yet he gave thee power over them; and Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they seek to betray you, then they have already betrayed Allah earlier, and He gave [you] power over them; and Allah is all-knowing, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they have treacherous designs against thee, (O Messenger!), they have already been in treason against Allah, and so hath He given (thee) power over them. And Allah so He Who hath (full) knowledge and wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they intend to betray you (O Muhammad SAW), they have already betrayed Allah before. So He gave (you) power over them. And Allah is All-Knower, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they seek to betray you, they had betrayed Allah before, but He has let you overcome them. Allah is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they intend to betray you, they have already betrayed God, and He has overpowered them. God is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they intend to betray you - then they have already betrayed Allah before, and He empowered [you] over them. And Allah is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:71] And if they, the captives, desire to betray you, through words which they speak [to you], they have betrayed God before, before Badr, through unbelief; but He has given [you] power over them, at Badr, through slaying and capture, so let them anticipate the like if they return [to betrayal]; and God is Knower, of His creatures, Wise, in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if they would betray thee) through faith, Muhammad, (they betrayed Allah before) this, by shunning faith and committing transgressions, (and He gave (thee) power over them) He made you triumph over them at Badr. (Allah is Knower) of what is in their hearts of treachery, (Wise) in that which He decreed upon them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِن يُرِيدُواْ } أولئك الأسارى { خِيَانَتَكَ } بعدما عاهدت معهم وتلفطت بهم فلا تتعجب من خيانته ونقضهم { فَقَدْ خَانُواْ ٱللَّهَ } بالكفر والشرك، ونقض العهد والخروج عن مقتضى المأمور { مِن قَبْلُ فَأَمْكَنَ } أي: أمكنك ومكنك أولاً عليهم حتى انتقمت { مِنْهُمْ } يوم بدر بالقتل والأسر، فإن عادوا ورجعوا بالخيانة أمكنكم ثانياً وثالثاً فلا تبال بهم وبخيانتهم فإن الله معينك وناصرك، يعصمك من مكائدهم { وَٱللَّهُ } المطلع لمخايلهم { عَلِيمٌ } بنياتهم { حَكِيمٌ } [الأنفال: 71] بمجازاتهم يجازيهم على مقتضى علمه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:27",
      "similarity": 0.659842035434729
    },
    {
      "verse": "12:52",
      "similarity": 0.5603471253635466
    },
    {
      "verse": "4:105",
      "similarity": 0.5448599974354327
    },
    {
      "verse": "40:19",
      "similarity": 0.5420170059888315
    },
    {
      "verse": "4:107",
      "similarity": 0.5284566599302069
    }
  ]
}