{
  "chapter": "الأنفال",
  "text": "والذين ءامنوا۟ وهاجروا۟ وجهدوا۟ فى سبيل الله والذين ءاووا۟ ونصروا۟ او۟لئك هم المؤمنون حقا لهم مغفرة ورزق كريم",
  "translations": [
    {
      "translation": "Those who have iman and have made hijra and done jihad in the Way of Allah and those who have given refuge and help, they are the true muminun. They will have forgiveness and generous provision.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who accepted the faith and abandoned their homes, and struggled in the cause of God, and those who gave them shelter and helped them, are veritably true believers. For them is forgiveness and noble sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and have migrated and strove in the way of Allah, and those who gave them refuge and help - it is they who are the true believers. Theirs shall be forgiveness and honourable sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers who left their homes, and strove for the cause of God and those who gave them refuge and helped them, are true believers. They will have forgiveness (from their Lord) and (will be granted) honorable provisions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed and migrated and fought in Allah's cause, and those who gave shelter and provided help – it is they who are the true believers; for them is pardon, and an honourable sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed, and emigrated and strove hard in the cause of Allah (Al-Jihad), as well as those who gave (them) asylum and aid -- these are the believers in truth, for them is forgiveness and a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who believed and fled and struggled hard in Allah's way, and those who gave shelter and helped, these are the believers truly; they shall have forgiveness and honorable provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe, and have emigrated and struggled in the way of God. those who have given refuge and help those in truth are the believers, and theirs shall be forgiveness and generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believed and left their homes and strove for the cause of Allah, and those who took them in and helped them - these are the believers in truth. For them is pardon, and bountiful provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have believed and migrated and striven for the cause of God, as well as those who have given them refuge and support, are the true believers; they shall have forgiveness and an honourable provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe and have emigrated and striven hard in the way of Allah, those who sheltered and succoured --these! they are the believers in very truth; for them shall be forgiviness and honourable provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have believed, migrated, and waged jihad in the way of Allah, and those who gave them shelter and help, it is they who are truly the faithful. For them shall be forgiveness and a noble provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and adopt exile, and fight for the Faith, in the cause of Allah as well as those who give (them) asylum and aid,- these are (all) in very truth the Believers: for them is the forgiveness of sins and a provision most generous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed, and emigrated and strove hard in the Cause of Allah (Al-Jihad), as well as those who gave (them) asylum and aid; - these are the believers in truth, for them is forgiveness and Rizqun Karim (a generous provision i.e. Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and migrated from their homes and fought for the Way of Allah, and those who have sheltered them and helped them they are truly the believers. Theirs shall be forgiveness and a generous provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believed, and emigrated, and struggled for God’s cause, and those who gave shelter and support—these are the true believers. They will have forgiveness, and a bountiful provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who have believed and emigrated and fought in the cause of Allah and those who gave shelter and aided - it is they who are the believers, truly. For them is forgiveness and noble provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:74] And those who believed and emigrated and strove for the way of God, and those who provided refuge and assisted — those are the true believers, and for them is forgiveness and a generous provision, in Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who believed) in Muhammad (pbuh) and in the Qur'an (and left their homes) and migrated from Mecca to Medina (and strove for the cause of Allah) in obedience of Allah, (and those who took them in) those who hosted Muhammad (pbuh) and his Companions (and helped them) at Badr (these are the believers in truth) truly and certainly. (For them is pardon) for the sins they committed in the life of this world, (and a bountiful provision) a good reward in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ } أي: سلكوا وسافروا، وبعدما تحققوا باليقين العلمي { وَجَٰهَدُواْ } أي: ارتضاوا؛ أي: انخلعوا عن جلباب التعين { فِي سَبِيلِ ٱللَّهِ } الذي هو الفناء فيه؛ ليتحققوا باليقين العيني { وَٱلَّذِينَ ءَاوَواْ } ووالوا ألوياء الإرادة { وَّنَصَرُوۤاْ } أرباب الطلب { أُولَـٰئِكَ } الواصلون المبرزون { هُمُ ٱلْمُؤْمِنُونَ } المتحققون، المبثتون في مرتبة اليقين الحقي { حَقّاً } ثابتاً بلا دغدغة استكمال وانتظار، متقرراً في مقر التوحيد ومقعد المصدق عند مليك مقتدر { لَّهُمْ } بعد وصولهم إلى مقرهم { مَّغْفِرَةٌ } ستر لأنانيتهم التي كانوا عليها على مقتضى تعيناتهم { وَرِزْقٌ كَرِيمٌ } [الأنفال: 74] من الكشف والشهود، نزلاً ن عند العزيز العليم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقال البيضاوي: لما قسم المؤمنين ثلاثة أقسام، ـ أي: مهاجرين، وأنصار، ومن آمن ولم يهاجر ـ بين أن الكاملين في الإيمان منهم هم الذين حققوا إيمانهم، بتحصيل مقتضاه من الهجرة، والجهاد، وبذل المال، ونصرة الحق، ووعد لهم الوعد الكريم، فقال: { لهم مغفرة ورزق كريم } لا تبعة له، ولا فتنة فيه\n ثم ألحق بهم في الأمرين من يلتحق بهم ويتسم بسمتهم فقال: { والَّذيِنَ ءَامَنُوا مِن بَعدُ وَهَاجَرُوا وَجَهَدُوا مَعَكُم فَأُولَئِكَ مَنكُم\n\n\n }  أي: من جملتكم أيها المهاجرين والأنصار\n هـ\n  ثم نسخ الميراث المتقدم، فقال: {\n\n\n وَأْوْلُواْ ٱلأَرْحَامِ بَعْضُهُمْ أَوْلَىٰ بِبَعْضٍ فِي كِتَابِ ٱللَّهِ إِنَّ ٱللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:72",
      "similarity": 0.597371026611908
    },
    {
      "verse": "2:218",
      "similarity": 0.591828589734415
    },
    {
      "verse": "16:110",
      "similarity": 0.5396045273498594
    },
    {
      "verse": "8:75",
      "similarity": 0.5169494092110477
    },
    {
      "verse": "22:58",
      "similarity": 0.4481290730333886
    }
  ]
}