{
  "chapter": "الأنفال",
  "text": "والذين ءامنوا۟ منۢ بعد وهاجروا۟ وجهدوا۟ معكم فاو۟لئك منكم واو۟لوا۟ الارحام بعضهم اولى ببعض فى كتب الله ان الله بكل شىء عليمۢ",
  "translations": [
    {
      "translation": "Those who have iman and make hijra later on and accompany you in doing jihad, they also are of your number. But blood relations are closer to one another in the Book of Allah. Allah has knowledge of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who accepted the faith and left their homes and fought by your side, are your brothers; yet those who are related by blood are closer to one another according to the decree of God. Verily God knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed afterwards and migrated and strove along with you: they belong to you. But those related by blood are nearer to one another according to the Book of Allah. Allah has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who accepted the faith later, left their homes and strove with you for the cause of God are also your people. They relatives are nearer to each other according to the Book of God. God has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who afterwards believed and migrated and fought along with you – they too are from among you; and family members (blood relations) are nearer to one another in the Book of Allah; indeed Allah knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed afterwards, and emigrated and strove hard along with you, they are of you. But kindred by blood are nearer to one another (regarding inheritance) in the decree ordained by Allah. Verily, Allah is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who believed afterwards and fled and struggled hard along with you, they are of you; and the possessors of relationships are nearer to each other in the ordinance of Allah; surely Allah knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who have believed afterwards and emigrated, and struggled with you -- they belong to you; but those related by blood are nearer to one another in the Book of God; surely God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who afterwards believed and left their homes and strove along with you, they are of you; and those who are akin are nearer one to another in the ordinance of Allah. Lo! Allah is Knower of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who have believed later on, and emigrated and struggled for God's sake alongside you are also a part of you. But as to blood relations, they are nearer one to another in the Book of God. God has full knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed after wards and emigrated and strave hard along with you: these also are of you; and the kindred by blood are nearer unto one anot her in Allah's decree; verily Allah is of everything the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believed afterwards and migrated, and waged jihad along with you, they belong to you; but the blood relatives are more entitled to inherit from one another in the Book of Allah. Indeed Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who accept Faith subsequently, and adopt exile, and fight for the Faith in your company,- they are of you. But kindred by blood have prior rights against each other in the Book of Allah. Verily Allah is well-acquainted with all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed afterwards, and emigrated and strove hard along with you, (in the Cause of Allah) they are of you. But kindred by blood are nearer to one another regarding inheritance in the decree ordained by Allah. Verily, Allah is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed afterwards and emigrated, and struggled with you they are of you. And in the Book of Allah, the near kinsmen deserve one another (in inheritance). Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believed afterwards, and emigrated and struggled with you—these belong with you. But family members are nearer to one another in the Book of God. God is Cognizant of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed after [the initial emigration] and emigrated and fought with you - they are of you. But those of [blood] relationship are more entitled [to inheritance] in the decree of Allah. Indeed, Allah is Knowing of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:75] And those who believed afterwards, that is, after the first believers and emigrants, and emigrated and strove with you — they are of you, O Muhājirūn and Ansār; and those related by blood, kinsmen, are nearer to one another, in terms of inheritance, than [those who share] inheritance on account of [their common] faith and emigration mentioned in the previous verse, according to the Book of God, the Preserved Tablet (al-lawh almahfūz). Truly God is Knower of all things, including the wisdom regarding [the rules of] inheritance. Medinese [entirely], or [Medinese] except for the last two verses ending with verse 130 [which are Meccan], or [Medinese] except for one verse. The basmala, ‘In the name of God, the Compassionate, the Merciful’, does not preface this [sūra] because the Prophet (s) was not commanded to [recite] it [in this way], as may be understood from a hadīth reported by al-Hākim, in which he states [by way of an isnād] from ‘Alī that the basmala is [invoked] for ‘security’ (amān), whereas this [sūra] was revealed to remove security by way of the sword. According to [a hadīth related] by Hudhayfa [b. al-Yamān]: ‘You call it the sūra of Repentance, but it is actually the sūra of Chastisement (al-‘adhāb)’. Al-Bukhārī reported [by way of an isnād] from al-Barā’ [b. ‘Āzib] that this was the last sūra to be revealed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who afterwards) after the first Emigrants (believed) in Muhammad (pbuh) and in the Qur'an (and left their homes) and migrated from Mecca to Medina (and strove along with you) against the enemy, (they are of you) they are with you in secret and openly; (and those who are akin) those who are related by their lineage, the closer then the one who comes next, etc., (are nearer one to another) in relation to the division of estates (in the ordinance of Allah) in the Guarded Tablet. With this verse, the first verse was abrogated. (Lo! Allah is Knower) He knows the idolaters' breaking of their treaties (of all things) the division of estates, 192 what is good for you as well as other things. And Allah knows best the inner meanings of His Scripture'. And of the surah in which repentance is mentioned, which is Medinan in its entirety-except, it is said, the last two verses which are Meccan-and consists of 129 verses, 2,467 words and 10,000 letters: Surah 9: Repentance (al-Tawbah) And of the surah in which repentance is mentioned, which is Medinan in its entirety — except, it is said, the last two verses which are Meccan — and consists of 129 verses, 2,467 words and 10,000 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ بشَّر سبحانه بما بشَّر به من اقتفى أثركم أيها المكاشفون الواصلون، وسلك سبيلكم من أصحاب الإرادة والطلب، فقال: { وَٱلَّذِينَ آمَنُواْ مِن بَعْدُ وَهَاجَرُواْ } كما هاجرتم أيها الفائزون الواصلون { وَجَاهَدُواْ مَعَكُمْ } في سبيل الله وترويج دينه وسنته بأنفسهم وأموالهم كما جاهدتم أنتم { فَأُوْلَـٰئِكَ } المجاهدون الباذلون { مِنكُمْ } أي: من جملتكم وعدادكم، وأجرهم عند الله مثل أجركم، وهم إخوانكم وأرحامكم في الدين { وَأْوْلُواْ ٱلأَرْحَامِ } وذووا المناسبات والقرابات في الدين والعرفان { بَعْضُهُمْ أَوْلَىٰ بِبَعْضٍ } في الولاية والنصر، والمصاحبة والمؤاخاة { فِي كِتَابِ ٱللَّهِ } أي: في حضرة علمه ولوح قضائه { إِنَّ ٱللَّهَ } المتجلي على ذرائر الآفاق { بِكُلِّ شَيْءٍ } من رقائق المناسبات ودقائقها { عَلِيمٌ } [الأنفال: 75] بعلمه الحضوري، لا يعرب عن حضوره شيء\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها المتوجه نحو الفناء، المهاجر عن ورطة الغفلة والغرور، أن تقتفي في سلوكك هذا أثر أهل الهجرة والنصرة المرابطين قلوبهم لتوحيد الجق، الباذلين مهجهم في تقوية من ظهر عليه صلى الله عليه وسلم وترويج دينه سنته، المتخلقين بأخلاقه، المتعطشين بزلال مشربه المستظلين بظل روائه، المستمسكين بعروة ولايته، ولا يحصل لك هذا إلا بالركون والإعراض التام عن متقضيات القوى البشرية ولوازم الطبيعة مطلقاً، كهؤلاء الكرام المنخلعين عن جميع ما يشوشهم من لوازم هوياتهم في معاشهم حتى عن الأهل والأوطان\n\n\n\n\nلذلك انكشف لهم من الحقائق والمعارف والمكاشفات والمشاهدات إلى حيث اضمحلت عن عيون بصائرهم ما سوى الحق مطلقاً، وصاروا فانين في الله، متحققين بمقام\n\n \" وبي يسمع وبي يبصر وبي يبطش\n\n\n \" \n\n، ولك في عزيمتك هذا التشبث بكتاب الله الذي هو المرشد الحقيقي، وبأحاديث الرسول صلى الله عليه وسلم وبكلمات المشايخ العظام - قدس الله أرواحهم - ولا سيما ذلك الاستمداد من قلوب البدلاء والوالهين، الحائرين بمطالعة وجه الله الكريم؛ إذ هم لاستغراقهم في بحر الشهود انخعلوا عن لوازم هوياتهم، وما لنا من حالاتهم إلا الحسرة والعبرة إن كنا من أهل الاعتبار والاستبصار\n\n\n\n\nربنا اهدنا إليك بأي طريق شئت، إنك بفضلك وجودك تهدي من تشاء من عبادك وإنك على ما تشاء قدير\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n يقول الحق جل جلاله: { وأولُوا الأرحامِ } من قرابة النسب، { بعضُهم أوْلى ببعض } في التوارث من الأجانب، وظاهره: توريث ذوي الأرحام، كالخال والعمة وسائر ذوي الأرحام، وبه قال أبو حنيفة، ومنعه مالك، ورأى أن الآية منسوخة بآية المواريث التي في النساء، أو يراد بالأولية: غير الميراث، كالنصرة وغيرها\n وقوله: { في كتابِ الله } أي: في القرآن، أو اللوح المحفوظ\n { إن الله بكل شيء عليم } من أمر المواريث وغيرها، أو عليم بحكمة إناطتها بنسبة الإسلام والمظاهرة أولاً، بالقربة ثانياً، والله تعالى أعلم\n الإشارة: الناس ثلاثة: عوام، وخواص، وخواص الخواص\n فالعوام: هم الذين لا شيخ لهم يصلح للتربية\n والخواص: هم الذين صحبوا شيخ التربية، ولم ينهضوا إلى مقام التجريد\n وخواص الخواص: هم الذين صحبوا شيخ التربية وتجردوا ظاهراً وباطناً، خربوا ظواهرهم، وعمّوا بواطنهم، وهم الذين خاضوا بحار التوحيد، وذاقوا أسرار التفريد\n وهم الذين أشار المجذوب إلى مقاومهم بقوله:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:110",
      "similarity": 0.6424459808424384
    },
    {
      "verse": "2:218",
      "similarity": 0.6095779811333499
    },
    {
      "verse": "8:72",
      "similarity": 0.530420427542825
    },
    {
      "verse": "8:74",
      "similarity": 0.5169494092110479
    },
    {
      "verse": "33:6",
      "similarity": 0.4531424907106144
    }
  ]
}