{
  "chapter": "الأنفال",
  "text": "والذين ءامنوا۟ منۢ بعد وهاجروا۟ وجهدوا۟ معكم فاو۟لئك منكم واو۟لوا۟ الارحام بعضهم اولى ببعض فى كتب الله ان الله بكل شىء عليمۢ",
  "translations": [
    {
      "translation": "Those who have iman and make hijra later on and accompany you in doing jihad, they also are of your number. But blood relations are closer to one another in the Book of Allah. Allah has knowledge of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who accepted the faith and left their homes and fought by your side, are your brothers; yet those who are related by blood are closer to one another according to the decree of God. Verily God knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed afterwards and migrated and strove along with you: they belong to you. But those related by blood are nearer to one another according to the Book of Allah. Allah has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who accepted the faith later, left their homes and strove with you for the cause of God are also your people. They relatives are nearer to each other according to the Book of God. God has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who afterwards believed and migrated and fought along with you – they too are from among you; and family members (blood relations) are nearer to one another in the Book of Allah; indeed Allah knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed afterwards, and emigrated and strove hard along with you, they are of you. But kindred by blood are nearer to one another (regarding inheritance) in the decree ordained by Allah. Verily, Allah is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who believed afterwards and fled and struggled hard along with you, they are of you; and the possessors of relationships are nearer to each other in the ordinance of Allah; surely Allah knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who have believed afterwards and emigrated, and struggled with you -- they belong to you; but those related by blood are nearer to one another in the Book of God; surely God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who afterwards believed and left their homes and strove along with you, they are of you; and those who are akin are nearer one to another in the ordinance of Allah. Lo! Allah is Knower of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who have believed later on, and emigrated and struggled for God's sake alongside you are also a part of you. But as to blood relations, they are nearer one to another in the Book of God. God has full knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed after wards and emigrated and strave hard along with you: these also are of you; and the kindred by blood are nearer unto one anot her in Allah's decree; verily Allah is of everything the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believed afterwards and migrated, and waged jihad along with you, they belong to you; but the blood relatives are more entitled to inherit from one another in the Book of Allah. Indeed Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who accept Faith subsequently, and adopt exile, and fight for the Faith in your company,- they are of you. But kindred by blood have prior rights against each other in the Book of Allah. Verily Allah is well-acquainted with all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed afterwards, and emigrated and strove hard along with you, (in the Cause of Allah) they are of you. But kindred by blood are nearer to one another regarding inheritance in the decree ordained by Allah. Verily, Allah is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed afterwards and emigrated, and struggled with you they are of you. And in the Book of Allah, the near kinsmen deserve one another (in inheritance). Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believed afterwards, and emigrated and struggled with you—these belong with you. But family members are nearer to one another in the Book of God. God is Cognizant of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed after [the initial emigration] and emigrated and fought with you - they are of you. But those of [blood] relationship are more entitled [to inheritance] in the decree of Allah. Indeed, Allah is Knowing of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:75] And those who believed afterwards, that is, after the first believers and emigrants, and emigrated and strove with you — they are of you, O Muhājirūn and Ansār; and those related by blood, kinsmen, are nearer to one another, in terms of inheritance, than [those who share] inheritance on account of [their common] faith and emigration mentioned in the previous verse, according to the Book of God, the Preserved Tablet (al-lawh almahfūz). Truly God is Knower of all things, including the wisdom regarding [the rules of] inheritance. Medinese [entirely], or [Medinese] except for the last two verses ending with verse 130 [which are Meccan], or [Medinese] except for one verse. The basmala, ‘In the name of God, the Compassionate, the Merciful’, does not preface this [sūra] because the Prophet (s) was not commanded to [recite] it [in this way], as may be understood from a hadīth reported by al-Hākim, in which he states [by way of an isnād] from ‘Alī that the basmala is [invoked] for ‘security’ (amān), whereas this [sūra] was revealed to remove security by way of the sword. According to [a hadīth related] by Hudhayfa [b. al-Yamān]: ‘You call it the sūra of Repentance, but it is actually the sūra of Chastisement (al-‘adhāb)’. Al-Bukhārī reported [by way of an isnād] from al-Barā’ [b. ‘Āzib] that this was the last sūra to be revealed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nبعد أن منع الله ولاية المسلمين للذين آمنوا ولم يهجروا بالصراحة ، ابتداءً ونفى عن الذين لم يهاجروا تحقيق الإيمان ، وكان ذلك مثيراً في نفوس السامعين أن يتساءلوا هل لأولئك تمكن من تدارك أمرهم بِرأببِ هذه الثَّلمة عنهم ، ففتح الله باب التدارك بهذه الآية : { والذين آمنوا من بعد وهاجروا وجاهدوا معكم فأولئك منكم }.فكانت هذه الآية بياناً ، وكان مقتضى الظاهر أن تكون مفصولة غير معطوفة ، ولكن عدل عن الفصل إلى العطف تغليباً لمقام التقسيم الذي استوعبته هذه الآيات .ودخول الفاء على الخبر وهو { فأولئك منكم } لتضمين الموصول معنى الشرط من جهة أنّه جاء كالجواب عن سؤال السائِل ، فكأنّه قيل : وأمّا الذين آمنوا من بعد وهاجروا الخ ، أي : مهما يكن من حال الذين آمنوا ولم يهاجروا ، ومن حال الذين آمنوا وهاجروا والذين آووا ونصروا ، ف { الذين آمنوا من بعد وهاجروا وجاهدوا معكم فأولئك منكم } وبذلك صار فعل { آمنوا } تمهيداً لما بعده من { هاجروا وجاهدوا } لأن قوله : { من بعد } قرينة على أنّ المراد : إذا حصل منهم ما لم يكن حاصلاً في وقت نزول الآيات السابقة ، ليكون أصحاب هذه الصلة قسماً مغايراً للأقسام السابقة . فليس المعنى أنّهم آمنوا من بعد نزول هذه الآية ، لأنّ الذين لم يكونوا مؤمنين ثم يؤمنون من بعد لا حاجة إلى بيان حكم الاعتداد بإيمانهم ، فإنّ من المعلوم أنّ الإسلام يجُبُّ ما قبَله ، وإنّما المقصود : بيان أنّهم إن تداركوا أمرهم بأن هاجروا قُبلوا وصاروا من المؤمنين المهاجرين ، فيتعيّن أنّ المضاف إليه المحذوفَ الذي يشير إليه بناء { بعدُ } على الضمّ أن تقديره : من بعد ما قلناه في الآيات السابقة ، وإلاّ صار هذا الكلام إعادة لبعض ما تقدّم ، وبذلك تسقط الاحتمالات التي تردّد فيها بعض المفسّرين في تقدير ما أضيف إليه ( بعد ).وفي قوله : { معكم } إيذان بأنّهم دُون المخاطبين الذين لم يستقرّوا بدار الكفر بعد أن هاجر منها المؤمنون ، وأنّهم فرطوا في الجهاد مدة .والإتيان باسم الإشارة للذين آمنوا من بعدُ وهاجروا ، دون الضمير ، للاعتناء بالخبر وتمييزهم بذلك الحكم .و«من» في قوله : { منكم } تبعيضية ، ويعتبر الضمير المجرور بمن ، جماعة المهاجرين أي فقد صاروا منكم ، أي من جماعتكم وبذلك يعلم أنّ ولايتهم للمسلمين .{ وَأُوْلُواْ الأرحام بَعْضُهُمْ أولى بِبَعْضٍ فِي كتاب الله إِنَّ الله بِكُلِّ شَىْءٍ عَلِيمٌ }.قال جمهور المفسّرين قوله : { فأولئك منكم } أي مثلكم في النصر والموالاة ، قال مالك : إنّ الآية ليست في المواريث ، وقال أبو بكر بن العربي : قوله : { فأولئك منكم } «يعني في الموالاة والميراث على اختلاف الأقوال ، أي اختلاف القائلين في أنّ المهاجر يرث الأنصاري والعكس ، وهو قول فرقة .وقالوا : إنّها نسخت بآية المواريث .عطف جملة على جملة فلا يقتضي اتّحاداً بين المعطوفة والمعطوف عليها ، ولكن وقوع هذه الآية بإثر التقاسيم يؤذن بأنّ لها حظّاً في إتمام التقسيم ، وقد جعلت في المصاحف مع التي قبلها آية واحدة .فيظهر أنّ التقاسيم السابقة لمّا أثبتت ولاية بين المؤمنين ، ونفت ولايةً من بينهم وبين الكافرين ، ومِن بينهم وبين الذين آمنوا ولم يهاجروا حتّى يهاجروا ، ثم عادت على الذين يهاجرون من المؤمنين بعد تقاعسهم عن الهجرة بالبقاء في دَار الكفر مدّة ، فبيّنت أنّهم إن تداركوا أمرهم وهاجروا يدخلون بذلك في ولاية المسلمين ، وكان ذلك قد يشغل السامعين عن وَلاية ذوي أرحامهم من المسلمين ، جاءت هذه الآية تذكّر بأنّ ولاية الأرحام قائمة وأنّها مرجّحة لغيرها من الولاية فموقعها كموقع الشروط ، وشأن الصفات والغايات بعد الجُمل المتعاطفة أنّها تعود إلى جميع تلك الجمل ، وعلى هذا الوجه لا تكون هذه الآية ناسخة لما اقتضته الآيات قبلها من الولاية بين المهاجرين والأنصار بل مقيّدةً الإطلاقَ الذي فيها .وظاهر لفظ { الأرحام } جَمْعُ رَحِم وهو مقّر الولد في بطن أمّه ، فمن العلماء من أبقاه على ظاهره في اللغة ، فجعل المراد من أولي الأرحام ذوي القرابة الناشئة عن الأمومة ، وهو ما درج عليه جمهور المفسّرين ، ومنهم من جعل المراد من الأرحام العصابات دون المولودين بالرحم . قاله القرطبي ، واستدلّ له بأنّ لفظ الرحم يراد به العصابة ، كقول العرب في الدعاء «وصلتْك رحم» ، وكقول قُتَيّلة بنتتِ النضر بن الحارث: ... ظَلّتْ سيوف بني أبيه تَنوشهللَّه أرحام هناك تمزّق ... حيث عَبرت عن نَوش بني أبيه بتمزيق أرحام .وعُلم من قوله : { أولى } هو صيغة تفضيل أنّ الولاية بين ذوي الأرحام لا تعتبر إلا بالنسبة لمحلّ الولاية الشرعية فأولوا الأرحام أوْلى بالولاية ممّن ثبتت لهم ولاية تامّة أو ناقصة كالذين آمنوا ولم يهاجروا في ولاية النصر في الدين إذا لم يقم دونها مانع من كفر أو ترك هجرة ، فالمؤمنون بعضهم لبعض أولياء ولاية الإيمان ، وأولو الأرحام منهم بعضهم لبعض أولياء ولايةَ النسب ، ولولاية الإسلام حقوق مبيّنة بالكتاب والسنّة ، ولولاية الأرحام حقوق مبيّنة أيضاً ، بحيث لا تُزاحم إحدى الولايتين الأخرى ، والاعتناءُ بهذا البيان مؤذن بما لوشائج الأرحام من الاعتبار في نظر الشريعة ، فلذلك عَلقت أولوية الأرحام بأنّها كائنة في كتاب الله أي في حكمه .وكتابُ الله قضاؤه وشرعه ، وهو مصدر ، إمّا باق على معنى المصدرية ، أو هو بمعنى المفعول ، أي مكتوبة كقول الراعي: ... كانَ كتابُها مفعولاًوجَعْلُ تلك الأولوية كائنة في كتاب الله كنايةٌ عن عدم تعبيره ، ا لأنّهم كانوا إذا أرادوا توكيد عهد كتبوه . قال الحارث بن حِلَّزة: ... حَذر الجَوْر والتَّطَاخِي وهل ينْقُض ما في المهارق الأهواء ... فتقييد أولوية أولي الأرحام بأنّها في كتاب الله للدلالة على أنّ ذلك حكم فطري قدّره الله وأثبته بما وضع في الناس من الميل إلى قراباتهم ، كما ورد في الحديث :« إن الله لما خلق الرحِمَ أخذت بقائمة من قوائم العرش وقالت: هذا مقام العائذِ بك من القَطيعة » الحديثَ. فلمّا كانت ولاية الأرحام أمراً مقرراً في الفطرة ، ولم تكن ولاية الدين معروفة في الجاهلية بيّن الله أنّ ولاية الدين لا تُبطل ولاية الرحم إلاّ إذا تعارضتا ، لأنّ أواصر العقيدة والرأي أقوى من أواصر الجسد ، فلا يغيّره ما ورد هنا من أحكام ولاية الناس بعضهم بعضاً ، وبذلك الاعتبار الأصلي لولاية ذوي الأرحام كانوا مقدمين على أهل الولاية ، حيث تكون الولاية ، وينتفي التفضيل بانتفاء أصلها ، فلا ولاية لأولي الأرحام إذا كانوا غير مسلمين .واختلف العلماء في أنّ ولاية الأرحام هنا هل تشمل ولاية الميراث : فقال مالك بن أنس هذه الآية ليست في المواريث أي فهي ولاية النصر وحسن الصحبة ، أي فنقصر على موردها ولم يرها مساوية للعام الوارد على سبب خاصّ إذ ليست صيغتها صيغة عموم ، لأن مناط الحكم قوله : { أولى ببعض }.وقال جماعة تشمل ولاية الميراث ، ثم اختلفوا فمنهم من قال : نُسِخت هذه الولاية بآية المواريث ، فبطل توريث ذوي الأرحام بقول النبي صلى الله عليه وسلم « ألْحِقوا الفرائض بأهلها فما بقي فلأِوْلى رجللٍ ذَكَرٍ » فيكون تخصيصاً للعموم عندهم .وقال جماعة يرث ذوو الأرحام وهم مقدمون على أبناء الأعمام ، وهذا قول أبي حنيفة وفقهاء الكوفة ، فتكون هذه الآية مقيِّدة لإطلاق آية المواريث ، وقد علمت ممَّا تقدّم كلّه أنّ في هذه الآيات غموضاً جعلها مرامي لمختلف الأفهام والأقوال . وأيَّامّاً كانت فقد جاء بعدها من القرآن والسنة ما أغنى عن زيادة البسط .وقوله : { إن الله بكل شيء عليم } تذييل هو مؤذن بالتعليل؛ لتقرير أوْلويّة ذوي الأرحام بعضهم ببعض فيما فيه اعتداد بالولاية ، أي إنّما اعتبرت تلك الأولويّة في الولاية ، لأنّ الله قد علم أنّ لآصرة الرحم حقّاً في الولاية هو ثابت ما لم يمانعه مانع معتبر في الشرع ، لأنّ الله بكلّ شيء عليم وهذا الحكم ممّا علم ، الله أنّ إثباته رفق ورأفة بالأمّة .\n\n",
      "translations": [
        {
          "translation": "(And those who afterwards) after the first Emigrants (believed) in Muhammad (pbuh) and in the Qur'an (and left their homes) and migrated from Mecca to Medina (and strove along with you) against the enemy, (they are of you) they are with you in secret and openly; (and those who are akin) those who are related by their lineage, the closer then the one who comes next, etc., (are nearer one to another) in relation to the division of estates (in the ordinance of Allah) in the Guarded Tablet. With this verse, the first verse was abrogated. (Lo! Allah is Knower) He knows the idolaters' breaking of their treaties (of all things) the division of estates, 192 what is good for you as well as other things. And Allah knows best the inner meanings of His Scripture'. And of the surah in which repentance is mentioned, which is Medinan in its entirety-except, it is said, the last two verses which are Meccan-and consists of 129 verses, 2,467 words and 10,000 letters: Surah 9: Repentance (al-Tawbah) And of the surah in which repentance is mentioned, which is Medinan in its entirety — except, it is said, the last two verses which are Meccan — and consists of 129 verses, 2,467 words and 10,000 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { وَٱلَّذِينَ آمَنُواْ مِن بَعْدُ وَهَاجَرُواْ } كما هاجرتم أيها الفائزون الواصلون { وَجَاهَدُواْ مَعَكُمْ } في سبيل الله وترويج دينه وسنته بأنفسهم وأموالهم كما جاهدتم أنتم { فَأُوْلَـٰئِكَ } المجاهدون الباذلون { مِنكُمْ } أي: من جملتكم وعدادكم\n وأجرهم عند الله مثل أجركم\n وهم إخوانكم وأرحامكم في الدين { وَأْوْلُواْ ٱلأَرْحَامِ } وذووا المناسبات والقرابات في الدين والعرفان { بَعْضُهُمْ أَوْلَىٰ بِبَعْضٍ } في الولاية والنصر\n والمصاحبة والمؤاخاة { فِي كِتَابِ ٱللَّهِ } أي: في حضرة علمه ولوح قضائه { إِنَّ ٱللَّهَ } المتجلي على ذرائر الآفاق { بِكُلِّ شَيْءٍ } من رقائق المناسبات ودقائقها { عَلِيمٌ } [الأنفال: 75] بعلمه الحضوري\n لا يعرب عن حضوره شيء\n\n\nخاتمة السورة\n\nعليك أيها المتوجه نحو الفناء\n المهاجر عن ورطة الغفلة والغرور\n أن تقتفي في سلوكك هذا أثر أهل الهجرة والنصرة المرابطين قلوبهم لتوحيد الجق\n الباذلين مهجهم في تقوية من ظهر عليه صلى الله عليه وسلم وترويج دينه سنته\n المتخلقين بأخلاقه\n المتعطشين بزلال مشربه المستظلين بظل روائه\n المستمسكين بعروة ولايته\n ولا يحصل لك هذا إلا بالركون والإعراض التام عن متقضيات القوى البشرية ولوازم الطبيعة مطلقاً\n كهؤلاء الكرام المنخلعين عن جميع ما يشوشهم من لوازم هوياتهم في معاشهم حتى عن الأهل والأوطان\n\n\nلذلك انكشف لهم من الحقائق والمعارف والمكاشفات والمشاهدات إلى حيث اضمحلت عن عيون بصائرهم ما سوى الحق مطلقاً\n وصاروا فانين في الله\n متحققين بمقام\n \" وبي يسمع وبي يبصر وبي يبطش\n\n\n \" \n\n ولك في عزيمتك هذا التشبث بكتاب الله الذي هو المرشد الحقيقي\n وبأحاديث الرسول صلى الله عليه وسلم وبكلمات المشايخ العظام - قدس الله أرواحهم - ولا سيما ذلك الاستمداد من قلوب البدلاء والوالهين\n الحائرين بمطالعة وجه الله الكريم\n إذ هم لاستغراقهم في بحر الشهود انخعلوا عن لوازم هوياتهم\n وما لنا من حالاتهم إلا الحسرة والعبرة إن كنا من أهل الاعتبار والاستبصار\n\n\nربنا اهدنا إليك بأي طريق شئت\n إنك بفضلك وجودك تهدي من تشاء من عبادك وإنك على ما تشاء قدير",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n يقول الحق جل جلاله: { وأولُوا الأرحامِ } من قرابة النسب\n { بعضُهم أوْلى ببعض } في التوارث من الأجانب\n وظاهره: توريث ذوي الأرحام\n كالخال والعمة وسائر ذوي الأرحام\n وبه قال أبو حنيفة\n ومنعه مالك\n ورأى أن الآية منسوخة بآية المواريث التي في النساء\n أو يراد بالأولية: غير الميراث\n كالنصرة وغيرها\n وقوله: { في كتابِ الله } أي: في القرآن\n أو اللوح المحفوظ\n { إن الله بكل شيء عليم } من أمر المواريث وغيرها\n أو عليم بحكمة إناطتها بنسبة الإسلام والمظاهرة أولاً\n بالقربة ثانياً\n والله تعالى أعلم\n الإشارة: الناس ثلاثة: عوام\n وخواص\n وخواص الخواص\n فالعوام: هم الذين لا شيخ لهم يصلح للتربية\n والخواص: هم الذين صحبوا شيخ التربية\n ولم ينهضوا إلى مقام التجريد\n وخواص الخواص: هم الذين صحبوا شيخ التربية وتجردوا ظاهراً وباطناً\n خربوا ظواهرهم\n وعمّوا بواطنهم\n وهم الذين خاضوا بحار التوحيد\n وذاقوا أسرار التفريد\n وهم الذين أشار المجذوب إلى مقاومهم بقوله:\nفأهل التجريد\n كالمهاجرين والأنصار\n وأهل الأسباب من أهل النسبة\n كمن لم يهاجر من الصحابة\n ومن تجرد بعدُ ودخل معهم\n والتحق بهم\n قال تعالى قا ل تعالى { والذين آمنوا من بعد وهاجروا وجاهدوا معكم فأولئك منكم } \n ومن لا نسبة له كمن لا صحبة له\n وبالله التوفيق\n وهو الهادي إلى سواء الطريق\n وصلى الله على سيدنا ومولانا محمد\n وآله\n وصحبه\n وسلم تسليماً\n وآخر دعوانا أن الحمد لله رب العالمين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:110",
      "similarity": 0.6424459808424384
    },
    {
      "verse": "2:218",
      "similarity": 0.6095779811333499
    },
    {
      "verse": "8:72",
      "similarity": 0.530420427542825
    },
    {
      "verse": "8:74",
      "similarity": 0.5169494092110479
    },
    {
      "verse": "33:6",
      "similarity": 0.4531424907106144
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008075.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008075.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:75.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}