{
  "chapter": "الأنفال",
  "text": "ليحق الحق ويبطل البطل ولو كره المجرمون",
  "translations": [
    {
      "translation": "This was so that He might verify the Truth and nullify the false, even though the evildoers hate that.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that Truth may be affirmed and falsehood negated, even though the sinners be averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that He might prove the truth to be true and the false to be false, however averse the evil-doers might be to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that the truth would stand supreme and falsehood would exist no more, even though the criminals dislike it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that He may prove the truth and disprove falsehood, even if the criminals get annoyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He might cause the truth to triumph and bring falsehood to nothing, even though the criminals hate it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may manifest the truth of what was true and show the falsehood of what was false, though the guilty disliked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that He might verify the truth and prove untrue the untrue, though the sinners were averse to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He might cause the Truth to triumph and bring vanity to naught, however much the guilty might oppose;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He might prove the truth to be true and the false to be false, however much the wrongdoers might dislike it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that he might justify the truth and falsify the false even though the guilty ones were averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He may confirm the truth and bring falsehood to naught, though the guilty should be averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He might justify Truth and prove Falsehood false, distasteful though it be to those in guilt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He might cause the truth to triumph and bring falsehood to nothing, even though the Mujrimun (disbelievers, polytheists, sinners, criminals, etc.) hate it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in order that He might verify the truth and annul the falsehood, even though the wrongdoers hated it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order to confirm the truth and nullify falsehood, even though the guilty dislike it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He should establish the truth and abolish falsehood, even if the criminals disliked it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:8] And that He might cause the truth to be realised and annul, efface, falsehood, disbelief, however much the sinners, the idolaters, were averse, to that.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nومعنى { يُحق الحق } : يثبت ما يسمى الحق وهو ضد الباطل يقال : حق الشيء ، إذا ثبت قال تعالى : { أفمن حَق عليه كلمة العذاب } \\[ الزمر : 19 \\].والمراد بالحق . هنا : دين الحق وهو الإسلام ، وقد أطلق عليه اسم الحق في مواضع كثيرة من القرآن كقوله : { حتى جاءهم الحق ورسولٌ مبينٌ } \\[ الزخرف : 29 \\] الآية .وإحقاقه باستيصال معانديه ، فأنتم تريدون نفعاً قليلاً عاجلاً ، وأراد الله نفعاً عظيماً في العاجل والآجل . والله يعلم وأنتم لا تعلمون .وفي قوله : { ليُحق الحَق } جناس الاشتقاق . وفيه دلالة على أن أصل مادة الحق هو فعل حق . وأن أصل مادة الباطل هي فعل بَطل . ونظيره قول النبي صلى الله عليه وسلم للذين قالوا في التشهد السلام على الله فقال لهم النبي صلى الله عليه وسلم أن الله هو السلام .وكلمات الله ما يدل على مراده وعلى كلامه النفسي ، حقيقه من أقوال لفظية يخلقها خلقاً غير متعارف ليفهمها أحد البشر ويبلغها عن الله ، مثل القرآن ، أو مجازاً من أدلة غير لفظية ، مثل ما يخاطب به الملائكة المحكي في قوله تعالى : { حتى إذا فُزّع عن قلوبهم قالوا ماذا قال ربكم قالوا الحق وهو العليّ الكبير } \\[ سبأ : 23 \\] وفسره قول رسول الله صلى الله عليه وسلم « إذا قضى الله الأمر في السماء ضَربت الملائكة بأجنحتها خُضعانا لقوله كأنه سلسلة على صفوان فإذا فُزع عن قلوبهم قالوا ماذا قال ربكم قال للذي قالَ : الحق وهو العلي الكبير »والجمع المعرف بالإضافة يفيد العموم ، فقوله : { بكلماته } يعم أنواع الكلام الذي يوحي به الله الدال على إرادته تثبيت الحق . مثل آيات القرآن المنزلة في قتال الكفار وما أمر به الملائكة من نصرتهم المسلمين يوم بدر .والباء في { بكلماته } للسببية ، وذكر هذا القيد للتنويه بإحقاق هذا الحق وبيان أنه مما أراد الله ويسره وبينه للناس من الأمر ، ليقوم كل فريق من المأمورين بما هو حظه من بعض تلك الأوامر ، وللتنبيه على أن ذلك واقع لا محالة لأن كلمات الله لا تتخلف كما قال تعالى : { يريدون أن يبدلو كلام الله قل لن تتبعونا كذلكم قال الله من قبل } \\[ الفتح : 15 \\] ، ولمدح هذا الإحقاق بأنه حصل بسبب كلمات الله .وقطع دابر الشيء إزالة الشيء كله إزالة تأتي على آخر فرد منه يَكون في مؤخرته من ورائه وتقدم في قوله { فقطع دابر القوم الذين ظلموا } في سورة \\[ الأنعام : 45 \\].والمعنى : أردتم الغنيمة وأراد الله إظهار أمركم وخضذ شوكه عدوكم وإن كان ذلك يَحرمكم الغنى العارض فإن أمنكم واطمئنان بالكم خير لكم وأنتم تحسبون أن لا تستطيعوا هزيمة عدوكم .واللام في قوله : { ليحق الحق ويبطل الباطل } لام التعليل . وهي متعلقة بقوله { ويريد الله أن يحق الحق بكلماته } أي إنما أراد ذلك وكون أسبابه بكلماته لأجل تحقيقه الحق وإبطاله الباطلَ .وإذ قد كان محصول هذا التعليل هو عين محصول المعلل في قوله : { ويريد الله أن يحق الحق بكلماته } وشان العلة أن تكون مخالفة للمعلل ، ولو في الجملة ، إذ فائدة التعليل إظهار الغرض الذي يقصده الفاعل من فعله ، فمقتضى الظاهر أن لا يكون تعليل الفعل بعين ذلك الفعل ، لأن السامع لا يجهل أن الفاعل المختار ما فعل فعلاً إلا وهو مرادٌ له ، فإذا سمعنا من كلام البليغ تعليل الفعل بنفس ذلك الفعل ، كان ذلك كناية عن كونه ما فعل ذلك الفعل إلا لذاتتِ الفعل ، لا لغرض آخر عائد عليه ، فإفادة التعليل حينئذ معنى الحصر حاصلة من مجرد التعليل بنفس المعلّل .والحصر هنا من مستتبعات التركيب ، وليس من دلالة اللفظ ، فافهمه فإنه دقيق وقد وقعت فيه غفلات .ويجوز أن يكون الاختلاف بين المعلل والعلة بالعموم والخصوص أي يريد الله أن يحق الحق في هذه الحادثة لأنه يريد إحقاق الحق عموماً .وأما قوله : { ويبطل الباطل } فهو ضد معنى قوله : { ليُحق الحق } وهو من لوازم معنى ليُحق الحق ، لأنه إذا حصل الحق ذهب الباطل كما قال تعالى : { بل نقذف بالحق على الباطل فيدمغه فإذا هو زاهقٌ } \\[ الأنبياء : 18 \\] ، ولما كان الباطل ضد الحق لزم من ثبوت أحدهما انتفاء الآخر . ومن لطائف عبد الله بن عباس أنه قال لعُمر بن أبي ربيعة : كم سِنّك فقال ابن أبي ربيعة وُلدت يوم مات عمر بن الخطاب ، فقال ابن عباس : «أي حق رُفع وأيّ باطل وضع» أي في ذلك اليوم ، ففائدة قوله : { ويبطل الباطل } التصريح بأن الله لا يرضى بالباطل ، فكان ذكر بعد قوله : { ليحق الحق } بمنزلة التوكيد لقوله { ليحق الحق } لأن ثبوت الشيء قد يُؤكد بنفي ضده كقوله تعالى :{ قد ضلوا وما كانوا مهتدين } \\[ الأنعام : 140 \\].ويجيء في قوله : { ويبطل الباطل } من معنى الكلام ، ومن جناس الاشتقاق ، ما جاء في قوله : { أن يحق الحق } ثم في مقابلة قوله : { ليُحق الحق } بقوله { ويُبطل الباطل } محسن الطباق .{ ولو كره المجرمون } شرط اتصالي . و { لو } اتصالية تدل على المبالغة في الأحوال ، وهو عطف على { يريد الله } ، أو على { ليُحِق الحق } أي يريد ذلك لذلك لا لغيره ، ولا يصد مراده ما للمعاندين من قوة بأن يكرهَه المجرمون وهم المشركون .والكراهة هنا كناية عن لوازمها وهي الاستعداد لمقاومة المراد من تلك الإرادة ، فإن المشركين ، بكثرة عددهم وعُددهم ، يريدون إحقاق الباطل ، وإرادة الله تنفذ بالرغم على كراهة المجرمين ، وأمّا مجرد الكراهة فليس صالحاً أن يكون غاية للمبالغة في أحوال نفوذ مراد الله تعالى إحقاقَ الحق : لأنه إحساس قاصر على صاحبه ، ولكنه إذا بعثه على مدافعة الأمر المكروه كانت أسباب المدافعة هي الغاية لنفوذ الأمر المكروه على الكاره .وتقدم الكلام على { لو } الاتصالية عند قوله تعالى : { ولو افتدى به } في سورة \\[ آل عمران : 91 \\] وقوله تعالى : { أولو كان آباؤهم لا يعقلون شيئاً } في سورة \\[ البقرة : 170 \\].\n\n",
      "translations": [
        {
          "translation": "(That He might cause the Truth) in order to manifest the Religion of Islam in Mecca (to triumph and bring vanity to naught) and destroy idolatry and its adherents, (however much the guilty might oppose) even if the idolaters dislike it; 183\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لِيُحِقَّ ٱلْحَقَّ } أي: الإسلام المحقق المطابق لما عند الله { وَيُبْطِلَ ٱلْبَاطِلَ } المخالف لدين الإسلام { وَلَوْ كَرِهَ ٱلْمُجْرِمُونَ } [الأنفال: 8] المصرون على ما هم عليه قبل نزول الإسلام\n ما أراد الله من تحقيق الحق وتمكينه\n وإبطال الباطل وتخذيله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وإنما فعل ما فعل من سوقكم إلى القتال { ليُحق الحق ويُبطل الباطل } أي: ليُظهر الدين ويبطل الكفر\n قال البيضاوي: وليس بتكرار لأن الأول لبيان المراد\n وما بينه وبين مرادهم من التفاوت\n والثاني لبيان الداعي إلى حمل الرسول صلى الله عليه وسلم على اختيار ذات الشوكة وقصره عليها\n هـ\n وقال ابن جزي: ليس تكرار للأول لأن الأول مفعول يريد\n هذا تعليل لفعل الله تعالى\n ويحتمل أن يريد بالحق الأول الوعد بالنصرة\n وبالحق الثاني الإسلام\n فيكون المعنى: أنه نصرهم ليظهر الإسلام\n ويؤيد هذا قوله: { ويُبطل الباطل } أي: يُبطل الكفر\n { ولو كره المجرمون } ذلك\n فإن الله لا بد أن يظهر دينه على الدين كله\n ولو كره الكافرون\n الإشارة: وعد الله المتوجهين إليه بالوصول إلى سر الخصوصية\n وهي الولاية\n لكن بعد المجاهدة والمحاربة للنفوس لأن الحضرة لا يدخلها إلا أهل التهذيب والتدريب\n وترى كثيراً من الناس يتمنون أن تكون لهم من غير حرب ولا قتال\n ويريد الله أن يحق الحق بكشف الحجب عن القلوب\n حتى لا يشاهدوا إلا الحق\n ويُبطل الباطل\n وهو السَّوي\n ولا يكون في العادة إلا بعد موت النفوس وتهذيبها وتطهيرها بالرياضة على شيخ عارف\n قال الششتري مترجماً عن لسان الحقيقة:\nثم ذكر إمدادهم بالملائكة\n فقال: { إِذْ تَسْتَغِيثُونَ رَبَّكُمْ فَٱسْتَجَابَ لَكُمْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:82",
      "similarity": 0.7042041185948391
    },
    {
      "verse": "43:78",
      "similarity": 0.4832285032472818
    },
    {
      "verse": "10:99",
      "similarity": 0.4593752524484732
    },
    {
      "verse": "9:33",
      "similarity": 0.4554843726565511
    },
    {
      "verse": "61:9",
      "similarity": 0.4554843726565511
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/008008.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/008008.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/8:8.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}