{
  "chapter": "الأنفال",
  "text": "ليحق الحق ويبطل البطل ولو كره المجرمون",
  "translations": [
    {
      "translation": "This was so that He might verify the Truth and nullify the false, even though the evildoers hate that.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that Truth may be affirmed and falsehood negated, even though the sinners be averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that He might prove the truth to be true and the false to be false, however averse the evil-doers might be to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that the truth would stand supreme and falsehood would exist no more, even though the criminals dislike it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that He may prove the truth and disprove falsehood, even if the criminals get annoyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He might cause the truth to triumph and bring falsehood to nothing, even though the criminals hate it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may manifest the truth of what was true and show the falsehood of what was false, though the guilty disliked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that He might verify the truth and prove untrue the untrue, though the sinners were averse to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He might cause the Truth to triumph and bring vanity to naught, however much the guilty might oppose;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He might prove the truth to be true and the false to be false, however much the wrongdoers might dislike it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that he might justify the truth and falsify the false even though the guilty ones were averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He may confirm the truth and bring falsehood to naught, though the guilty should be averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He might justify Truth and prove Falsehood false, distasteful though it be to those in guilt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He might cause the truth to triumph and bring falsehood to nothing, even though the Mujrimun (disbelievers, polytheists, sinners, criminals, etc.) hate it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in order that He might verify the truth and annul the falsehood, even though the wrongdoers hated it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order to confirm the truth and nullify falsehood, even though the guilty dislike it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He should establish the truth and abolish falsehood, even if the criminals disliked it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:8] And that He might cause the truth to be realised and annul, efface, falsehood, disbelief, however much the sinners, the idolaters, were averse, to that.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That He might cause the Truth) in order to manifest the Religion of Islam in Mecca (to triumph and bring vanity to naught) and destroy idolatry and its adherents, (however much the guilty might oppose) even if the idolaters dislike it; 183\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لِيُحِقَّ ٱلْحَقَّ } أي: الإسلام المحقق المطابق لما عند الله { وَيُبْطِلَ ٱلْبَاطِلَ } المخالف لدين الإسلام { وَلَوْ كَرِهَ ٱلْمُجْرِمُونَ } [الأنفال: 8] المصرون على ما هم عليه قبل نزول الإسلام، ما أراد الله من تحقيق الحق وتمكينه، وإبطال الباطل وتخذيله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ومعنى الآية: أنكم تُريدون أن تُصيبوا مالاً ولا تلقوا مكروهاً، والله يريد إعلاء الدين وإظهار الحق، وما يحصل لكم من فوز الدارين، وإنما فعل ما فعل من سوقكم إلى القتال { ليُحق الحق ويُبطل الباطل } أي: ليُظهر الدين ويبطل الكفر\n قال البيضاوي: وليس بتكرار لأن الأول لبيان المراد، وما بينه وبين مرادهم من التفاوت، والثاني لبيان الداعي إلى حمل الرسول صلى الله عليه وسلم على اختيار ذات الشوكة وقصره عليها\n هـ\n وقال ابن جزي: ليس تكرار للأول لأن الأول مفعول يريد، هذا تعليل لفعل الله تعالى، ويحتمل أن يريد بالحق الأول الوعد بالنصرة، وبالحق الثاني الإسلام، فيكون المعنى: أنه نصرهم ليظهر الإسلام، ويؤيد هذا قوله: { ويُبطل الباطل } أي: يُبطل الكفر، { ولو كره المجرمون } ذلك، فإن الله لا بد أن يظهر دينه على الدين كله، ولو كره الكافرون\n الإشارة: وعد الله المتوجهين إليه بالوصول إلى سر الخصوصية، وهي الولاية، لكن بعد المجاهدة والمحاربة للنفوس لأن الحضرة لا يدخلها إلا أهل التهذيب والتدريب، وترى كثيراً من الناس يتمنون أن تكون لهم من غير حرب ولا قتال، ويريد الله أن يحق الحق بكشف الحجب عن القلوب، حتى لا يشاهدوا إلا الحق، ويُبطل الباطل، وهو السَّوي، ولا يكون في العادة إلا بعد موت النفوس وتهذيبها وتطهيرها بالرياضة على شيخ عارف\n قال الششتري مترجماً عن لسان الحقيقة:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:82",
      "similarity": 0.7042041185948391
    },
    {
      "verse": "43:78",
      "similarity": 0.4832285032472818
    },
    {
      "verse": "10:99",
      "similarity": 0.4593752524484732
    },
    {
      "verse": "9:33",
      "similarity": 0.4554843726565511
    },
    {
      "verse": "61:9",
      "similarity": 0.4554843726565511
    }
  ]
}