{
  "chapter": "الأنفال",
  "text": "اذ تستغيثون ربكم فاستجاب لكم انى ممدكم بالف من الملئكة مردفين",
  "translations": [
    {
      "translation": "Remember when you called on your Lord for help and He responded to you: 'I will reinforce you with a thousand angels riding rank after rank.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when you prayed to your Lord for help, He heard you and said: \"I shall send a thousand angels following behind you for your aid.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when you implored your Lord for help and He responded to you: 'I will indeed reinforce you with a thousand angels, coming host after host.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you (believers) begged for assistance from your Lord, He said, \"I am helping you with a thousand angels, all in rows marching one after the other\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you (Prophet Mohammed – peace and blessings be upon him) were seeking the help of your Lord, so He answered your prayers that, “I will help you with a row of thousands of angels.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when you sought help of your Lord and He answered you (saying): \"I will help you with a thousand of the angels Murdifin.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you sought aid from your Lord, so He answered you: I will assist you with a thousand of the angels following one another.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you were calling upon your Lord for succour, and He answered you, 'I shall reinforce you with a thousand angels riding behind you.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When ye sought help of your Lord and He answered you (saying): I will help you with a thousand of the angels, rank on rank.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you prayed to your Lord for help, He answered, \"I am sending to your aid a thousand angels in succession.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time ye implored our Lord and He answered you: verily I am about to succour you with a thousand of angels rank in rank.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you appealed to your Lord for help, He answered you: ‘I will aid you with a thousand angels in a file.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember ye implored the assistance of your Lord, and He answered you: \"I will assist you with a thousand of the angels, ranks on ranks.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when you sought help of your Lord and He answered you (saying): \"I will help you with a thousand of the angels each behind the other (following one another) in succession.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you (Prophet Muhammad) prayed to your Lord for help, He answered: 'I am sending to your aid a thousand angels in succession'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you appealed to your Lord for help, He answered you, “I am reinforcing you with one thousand angels in succession.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Remember] when you asked help of your Lord, and He answered you, \"Indeed, I will reinforce you with a thousand from the angels, following one another.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[8:9] When you sought help from your Lord, asking Him to help you by granting you victory over them, and He answered you [saying]: ‘I shall reinforce you, I shall assist you, with a thousand angels, rank upon rank’,   one rank following after the next: God promised them this [number] at first, but it then became three thousand, and then five thousand, as stated in [sūrat] Āl ‘Imrān [Q. 3:124-125] (a variant reading [of alf, ‘thousand’] has the plural āluf, ‘thousands’, similar [in pattern] to aflus, ‘coins’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When ye sought help of) when you called upon (your Lord) to assist you on the Day of Badr (and He answered you (saying): I will help you with a thousand of the angels, rank on rank) coming one after another to help you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بِأَلْفٍ مِّنَ ٱلْمَلاۤئِكَةِ مُرْدِفِينَ } أي مُتَتَابِعينَ\n ويقالُ وراءُ كُلِّ مَلكٍ ملكٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكروا أيها المؤمنون فضل الله عليكم ورحمته { إِذْ تَسْتَغِيثُونَ رَبَّكُمْ } حين اقتحم العدو وأنتم عزل قلائل، وهم متكثرون ذو عدد وعدد { فَٱسْتَجَابَ لَكُمْ } ربكم مغيثاً قالاً لكم على لسان نبيكم: { أَنِّي } بحولي وقوتي { مُمِدُّكُمْ } أي: معينكم ومغنيكم { بِأَلْفٍ مِّنَ ٱلْمَلاۤئِكَةِ مُرْدِفِينَ } [الأنفال: 9] على عددكم، يضربونهم من ورائهم، وأنتم من قدامهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إذ }: بدل من { إذ يعدكم } أو متعلق بقوله: { ليحق الحق } أو باذكر\n يقول الحق جلاله: واذكروا حين كنتم { تستغيثون ربكم } وتدعون بالغوث والنصر، وذلك أن الصحابة ـ رضي الله عنهم ـ لمّا علموا ألاّ محيص لهم عن القتال أخذوا يقولون: ربنا انصرنا على عدوك، يا غياث المستغيثين أغثنا\n وعن عمر رضي الله عنه: أنه نَظَرَ إلى المُشْرِكِينَ وهُمْ أَلفٌ، وإلى أَصْحَابِهِ وهُمْ ثَلاثُمائةٍ، فاسْتَقْبَلَ القِبْلَةِ ومدَّ يديهِ يدعوه:\n\n \" اللهم أَنْجِزْ لي ما وَعدْتَنِي، اللهُم إن تَهْلِكْ هذه العصابة لم تُعْبَد في الأرْضِ \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "79:7",
      "similarity": 0.6367258496072582
    },
    {
      "verse": "27:72",
      "similarity": 0.6006779807333462
    },
    {
      "verse": "46:17",
      "similarity": 0.33590758046987074
    },
    {
      "verse": "3:124",
      "similarity": 0.2233776978187293
    },
    {
      "verse": "28:15",
      "similarity": 0.22189469020570915
    }
  ]
}