{
  "chapter": "البلد",
  "text": "ثم كان من الذين ءامنوا۟ وتواصوا۟ بالصبر وتواصوا۟ بالمرحمة",
  "translations": [
    {
      "translation": "then to be one of those who have iman and urge each other to steadfastness and urge each other to compassion.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to be of those who believe, and urge upon one another to persevere, and urge upon each other to be kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and, then besides this, he be one of those who believed, and enjoined upon one another steadfastness and enjoined upon one another compassion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the believers who cooperate with others in patience (steadfastness) and kindness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And moreover to be of those who accepted faith, and who urged patience to one another and who urged graciousness to one another.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he became one of those who believed and recommended one another to patience, and recommended one another to compassion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he is of those who believe and charge one another to show patience, and charge one another to show compassion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then that he become of those who believe and counsel each other to be steadfast, and counsel each other to be merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to be of those who believe and exhort one another to perseverance and exhort one another to pity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and to be one of those who believe and urge one another to steadfastness and compassion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he became of those who believed and enjoined on each other steadfastness and enjoined on each other compassion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "while being one of those who have faith and enjoin one another to patience, and enjoin one another to compassion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then will he be of those who believe, and enjoin patience, (constancy, and self-restraint), and enjoin deeds of kindness and compassion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he became one of those who believed, and recommended one another to perseverance and patience, and (also) recommended one another to pity and compassion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that he becomes one of those who believe, charge each other to be patient, and charge each other to be merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he becomes of those who believe, and advise one another to patience, and advise one another to kindness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And then being among those who believed and advised one another to patience and advised one another to compassion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[90:17] while being (thumma kāna is a supplement to iqtahama, ‘he assaulted’; thumma is for the ordering of things to be mentioned) in other words, [what is meant is that] at the point of the assault he was: one of those who believe and enjoin one another to steadfastness, in [pursuing] obedience and in refraining from disobedience, and enjoin one another to compassion (marhama means rahma), towards creatures.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nثُمَّ كَانَ مِنَ الَّذِينَ آَمَنُوا وَتَوَاصَوْا بِالصَّبْرِ وَتَوَاصَوْا بِالْمَرْحَمَةِ (17)فعطفُ { ثم كان من الذين آمنوا } على الجمل المسوقة للتوبيخ والذم يفيد أن هذا الصنف من الناس أو هذا الإِنسان المعين لم يكن من المؤمنين ، وأنه ملوم على ما فَرَّط فيه لانتفاء إيمانه ، وأنه لو فعل شيئاً من هذه الأعمال الحسنة ولم يكن من الذين آمنوا ما نفعه عملُه شيئاً لأنه قد انتفى عنه الحظ الأعظم من الصالحات كما دلت عليه { ثم } من التراخي الرتبي فهو مؤذن بأنه شرط في الاعتداد بالأعمال .وعن عائشة : أنها قالت : «يا رسول الله إن ابن جدعان كان في الجاهلية يصل الرحم ويطعم الطعام ويفك العاني ويعتق الرقاب ويحمل على إبله لله ( أي يريد التقرب ) فهل ينفعه ذلك شيئاً قال : \" لا إنه لم يقل يوماً رب اغفر لي خطيئتي يوم الدين \" . ويفهم من الآية بمفهوم صفة الذين آمنوا أنه لو عمل هذه القرب في الجاهلية وآمن بالله حين جاء الإسلام لكان عمله ذلك محموداً .ومن يجعل { ثُم } مفيدة للتراخي في الزمان يجعل المعنى : لا اقتحم العقبة واتبعها بالإِيمان . أي اقتحم العقبة في الجاهلية وأسلمَ لمّا جاء الاسلام .وقد جاء ذلك صريحاً في حديث حكيم بن حزام في الصحيح : «قال : قلت : يا رسول الله أرأيتَ أشياء كنتُ أتحنث بها في الجاهلية من صدقة أو عتاقة وصلة رحم فهل فيها من أجر فقال لي النبي صلى الله عليه وسلم \" أسلمت على ما سلف من خير \" والتحنّث : التعبد يعني أن دخوله في الإِسلام أفاده إعطاء ثواب على أعماله كأنه عملها في الإِسلام .وقال : { من الذين آمنوا } دون أن يقول : ثم كان مؤمناً ، لأن كونه من الذين آمنوا أدل على ثبوت الإِيمان من الوصف بمؤمن لأن صفة الجماعة أقوى من أجل كثرة الموصوفين بها فإن كثرة الخير خير ، كما تقدم في قوله تعالى : { قال أعوذ باللَّه أن أكون من الجاهلين } في سورة البقرة ( 67 ) ، ثم في هذه الآية تقوية أخرى للوصف ، وهو جعله بالموصول المشعرِ بأنهم عُرفوا بالإِيمان بَيْن الفرق .وحُذِف متعلّق آمنوا } للعلم به أي آمنوا بالله وحده وبرسوله محمد صلى الله عليه وسلم ودين الإِسلام . فجُعل الفعل كالمستغني عن المتعلق .وأيضاً ليتأتى من ذكر الذين آمنوا تخلص إلى الثناء عليهم بقوله : { وتواصوا بالصبر وتواصوا بالمرحمة } ولبشارتهم بأنهم أصحاب الميمنة .وخص بالذكر من أوصاف المؤمنين تواصيهم بالصبر وتواصيهم بالمرحمة لأن ذلك أشرف صفاتهم بعد الإِيمان ، فإن الصبر ملاك الأعمال الصالحة كلها لأنها لا تخلو من كبح الشّهوة النفسانية وذلك من الصبر .والمرحمة ملاك صلاح الجامعة الإسلامية قال تعالى : { رحماء بينهم } \\[ الفتح : 29 \\] .والتواصي بالرحمة فضيلة عظيمة ، وهو أيضاً كناية عن اتصافهم بالمرحمة لأن من يوصي بالمرحمة هو الذي عَرَف قدرَها وفضلها ، فهو يفعلها قبل أن يُوصي بها ، كما تقدم في قوله تعالى : { ولا تحضون على طعام المسكين } \\[ الفجر : 18 \\] .وفيه تعريض بأن أهل الشرك ليسوا من أهل الصبر ولا من أهل المرحمة ، وقد صُرح بذلك في قوله تعالى : { ومن أحسن قولاً ممن دعا إلى اللَّه وعمل صالحاً وقال إنني من المسلمين إلى قوله : { وما يلقاها إلا الذين صبروا } \\[ فصلت : 33 35 \\] وقوله : { بل لا تكرمون اليتيم ولا تحضون على طعام المسكين } \\[ الفجر : 17 ، 18 \\] .\n\n",
      "translations": [
        {
          "translation": "(And to be) in addition to this (of those who believe) in private between themselves and their Lord, in Muhammad (pbuh) and the Qur'an (and exhort one another to perseverance) in fulfilling the obligations (and export one another to pity) towards the poor and needy.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَتَوَاصَوْاْ بِٱلصَّبْرِ } معناه تَحاثوا عليهِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And exhort one another to patience.\" Its meaning is that you should encourage one another to be patient.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وهم منفقون بإقدار الله في سبيل الله { وَ } مع إيمانهم بالله واتصافهم بالأعمال الصالحة المؤكدة لإيمانهم { تَوَاصَوْاْ } بينهم\n أي: أوصى بعضهم بعضاً { بِٱلصَّبْرِ } على مشاق التكاليف الإلهية ومتاعب الطاعات المأمورة لهم { وَ } كذلك { تَوَاصَوْاْ } بينهم { بِٱلْمَرْحَمَةِ } [البلد: 17] والشفقة على عباد الله وتعظيمهم\n والتحنن نحوهم\n والإحسان معهم ولو بكلمة طيبة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "103:3",
      "similarity": 0.8466857824695474
    },
    {
      "verse": "36:50",
      "similarity": 0.6534345141626015
    },
    {
      "verse": "51:53",
      "similarity": 0.6207688273215274
    },
    {
      "verse": "6:153",
      "similarity": 0.5118119220201454
    },
    {
      "verse": "4:131",
      "similarity": 0.4566371580894917
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/090017.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/090017.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/90:17.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}