{
  "chapter": "البلد",
  "text": "وانت حلۢ بهذا البلد",
  "translations": [
    {
      "translation": "and you are resident in this city -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you are free to live upon it, --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "– this city wherein you have been rendered violable–\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in which you are now living\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For you (O dear Prophet Mohammed – peace and blessings be upon him) are in this city.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you are free in this city.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you shall be made free from obligation in this city--\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and thou art a lodger in this land;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou art an indweller of this city -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and you are dwelling in this city --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou shalt be allowed in yonder city -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as you reside in this town;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou art a freeman of this City;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you are free (from sin, to punish the enemies of Islam on the Day of the conquest) in this city (Makkah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and you are a lodger in this country.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you are a resident of this land.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you, [O Muhammad], are free of restriction in this city -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[90:2] and you, O Muhammad (s), have free disposal of, sanction for, this land, in that you will be given permission to fight in it — and indeed God fulfilled this promise to him on the day of the Conquest [of Mecca] (thus this is a parenthetical statement intervening between that by which the oath has been sworn and that which is a supplement thereto).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَأَنْتَ حِلٌّ بِهَذَا الْبَلَدِ (2) وجملة : { وأنت حل بهذا البلد } معترضة بين المتعاطفات المقسم بها والواو اعتراضية . والمقصود من الاعتراض يختلف باختلاف محمل معنى { وأنت حل } فيجوز أن يكون { حل } اسم مصدرِ أحَلّ ، أي أباح ، فالمعنى وقد جعلَك أهلُ مكة حلالاً بهذا البلد الذي يحرم أذى صيده وعَضْدُ شجره ، وهم مع ذلك يُحلون قتلك وإخراجَك ، قال هذا شُرَحْبيل بن سعد فيكون المقصود من هذا الاعتراض التعجيب من مضمون الجملة وعليه فالإِخبار عن ذات الرسول صلى الله عليه وسلم بوصف { حِلّ } يقدر فيه مضاف يعيِّنه ما يصلح للمقام ، أي وأنت حلال منك ما حُرِّم من حقِّ ساكن هذا البلد من الحُرمة والأمن . والمعنى التعريض بالمشركين في عدوانهم وظلمهم الرسول صلى الله عليه وسلم في بلد لا يظلمون فيه أحداً . والمناسبة ابتداء القسم بمكة الذي هو إشعار بحرمتها المقتضية حرمة من يحل بها ، أي فهم يحرِّمون أن يتعرضوا بأذى للدواب ، ويعتدون على رسول جاءهم برسالة من الله .ويجوز أن يكون { حِل } اسماً مشتقاً من الحِلّ وهو ضد المنع ، أي الذي لا تَبعة عليه فيما يفعله . قال مجاهد والسدي ، أي ما صنعت فيه من شيء فأنت في حلّ أو أنت في حِل مِمن قَاتلك أن تقاتله . وقريب منه عن ابن عباس ، أي مهما تمكنتَ من ذلك . فيصدق بالحال والاستقبال . وقال في «الكشاف» : «يعني وأنت حل به في المستقبل ونظيره في الاستقبال قوله عز وجل : { إنك ميت وإنهم ميتون } \\[ الزمر : 30 \\] ، تقول لمن تَعِدُه بالإِكرام والحباء أنت مكرم محبُوّاً اه .فهذا الاعتراض تسلية للرسول صلى الله عليه وسلم قُدمت له قبل ذكر إعراض المشركين عن الإِسلام ، ووعد بأنه سيمكنه منهم .وعلى كلا الوجهين في محمل صفة { حِل } هو خصوصية للنبيء صلى الله عليه وسلم وقد خصصه النبي صلى الله عليه وسلم بيوم الفتح فقال : \" وإنما أحلت لي ساعة من نهار \" الحديث ، وفي «الموطإ» : «قال مالك : ولم يكن رسول الله صلى الله عليه وسلم يومئذ ( أي يوم الفتح ) مُحْرِماً» .ويُثار من هذه الآية على اختلاف المحامل النظرُ في جواز دخول مكة بغير إحرام لغير مريد الحج أو العمرة . قال الباجي في «المنتقى» وابنُ العربي في «الأحكام» : الداخل مكة غيرَ مريد النسك ، لحاجة تتكرر كالحَطّابينَ وأصحاب الفواكهِ والمعاش هؤلاء يجوز دخولهم غيرَ محرمين لأنهم لو كلفوا الإِحرام لَحِقتهم مشقة . وإن كان دخولها لحاجة لا تتكرر فالمشهور عن مالك : أنه لا بد من الإِحرام ، وروي عنه تركُه والصحيح وجوبه ، فإن تركه قال الباجي : فالظاهر من المذهب أنه لا شيء عليه وقد أساء ولم يُفصِّل أهل المذهب بين من كان من أهل داخل الميقاتتِ أو مِن خارجه .والخلاف في ذلك أيضاً بين فقهاء الأمصار فذهب أبو حنيفة أن من كان من أهل داخل المواقيت يجوز له دخول مكة بغير إحرام إن لم يُرِد نسكاً من حج أو عمرة ، وأما من كان مِن أهل خارج المواقيت فالواجب عليه الإِحرام لدخول مكة دون تفصيل بين الاحتياج إلى تكرر الدخول أو عدم الاحتياج . وذهب الشافعي إلى سقوط الإِحرام عن غير قاصد النسك ، ومذهب أحمد موافق مذهب مالك .وحكى ابن عطية عن بعض المتأولين : أن معنى { وأنت حل بهذا البلد } أنه حَال ، أي ساكن بهذا البلد اه . وجعله ابن العربي قولاً ولم يَعزُه إلى قائل ، وحكاه القرطبي والبيضاوي كذلك وهو يقتضي أن تكون جملة { وأنت حلّ } في موضع الحال من ضمير { أقسم } فيكون القسم بالبلد مقيداً باعتبار كونه بلَد محمد صلى الله عليه وسلم وهو تأويل جميل لو ساعد عليه ثبوت استعمال { حِلّ } بمعنى : حَالّ ، أي مقيم في مكاننٍ فإن هذا لم يرد في كتب اللغة : «الصَحاحِ» و«اللسانِ» و«القاموسِ» و«مفرداتتِ الراغب» . ولم يعرج عليه صاحب «الكشاف» ، ولا أحسب إعراضه عنه إلا لعدم ثقته بصحة استعماله ، وقال الخفاجِي : والحِلّ : صفة أو مصدر بمعنى الحَال هنا على هذا الوجه ولا عبرة بمن أنكره لِعدم ثبوته في كتب اللغة» اه وكيف يقال : لا عبرة بعدم ثبوته في كتب اللغة ، وهل المَرجع في إثبات اللغة إلاّ كتب أيمتها .وتكرير لفظ { بهذا البلد } إظهار في مقام الإِضمار لقصد تجديد التعجيب . ولقصد تأكيد فتح ذلك البلد العزيز عليه والشديد على المشركين أن يَخْرُج عن حوزتهم .\n\n",
      "translations": [
        {
          "translation": "(And thou art an indweller of this city) and it is also said that this means: Allah has made lawful for you in 755 this city that which he did not make lawful to anyone before or after you; and it is also said that this means: you are excused regarding that which you do in this city.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة خواصك التي اصطفيناك وميزناك بها عن سائر الناس يا أكمل الرسل هي أنه: { أَنتَ حِلٌّ } يعني: أنت لجمعك وجامعيتك وحيازة مرتبتك عموم المراتب\n مستحل للتعرف خاصة للقتل والأسر في الحرم من بين عموم الناس\n لمزيد فضليتك ومنزلتك عند الله\n وزيادة خصوصيتك { بِهَـٰذَا ٱلْبَلَدِ } [البلد: 2] الذي حرم على عموم العباد\n وإنما أُحل لك أيضاً ساعة من نهار لا أزيد منها\n وبعد ذلك يحرم لك أيضاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n واعترض بين القسم وجوابه بقوله: { وأنت حِلّ بهذا البلد } \n أي: وأنت حالّ ساكن به\n فهو حقيق بأن يُقسم به لحلولك به\n أو: وأنت حِل\n أي: تُستحل حرمتُكَ ويُؤذيك الكفرةُ مع أنَّ مكة لا يَحل فيها قتل صيد ولا بشر\n ولا قطع شجر وعلى هذا قيل: \" لا أٌقسم \" نفي\n أي: لا أقسم بهذا وأنت تلحقك فيه إذاية\n وهذا ضعيف\n أو: وأنت حلال يجوز لك في هذا البلد ما شئت مِن قتل كافر وغير ذلك مما لا يجوز لغيرك\n وهذا هو الأظهر لقوله صلى الله عليه وسلم:\n \" إنَّ هذا البلد حرام\n حرّمه اللهُ يومَ خلق السموات والأرض\n لم يَحِلَّ لأحدٍ قبلي\n ولا يحل لأحد بعدي\n وإنما أُحل لي ساعة من نهارٍ \" \n\n يعني: فتح مكة\n وفيه أَمَرَ صلى الله عليه وسلم بقتل ابن خَطَل\n وهو متعلّق بأستار الكعبة\n فإن قلتَ: السورة مكية\n وفتح مكة كان سنَة ثمان من الهجرة؟ قلتُ: هو وعد بالفتح وبشارة\n انظر ابن جزي\n وكثير من الآيات نزلت بمكة ولم يتحقق مصداقها إلاّ بعد الهجرة\n كقوله تعالى:\n[فصلت:6\n 7] وقوله تعالى:\n[الأحقاف:10] وغير ذلك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "95:3",
      "similarity": 0.8174064179464283
    },
    {
      "verse": "89:8",
      "similarity": 0.7101426783411294
    },
    {
      "verse": "90:1",
      "similarity": 0.6671433808801459
    },
    {
      "verse": "89:11",
      "similarity": 0.6602697416700182
    },
    {
      "verse": "50:11",
      "similarity": 0.638070736387731
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/090002.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/090002.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/90:2.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}