{
  "chapter": "الشمس",
  "text": "والشمس وضحىها",
  "translations": [
    {
      "translation": "By the sun and its morning brightness,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I CALL TO witness the sun and his early morning splendour,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the sun and its heat and brightness,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the sun and its noon-time brightness,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By oath of the sun and its light\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the sun and Duhaha.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I swear by the sun and its brilliance,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the sun and his morning brightness\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the sun and his brightness,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the sun and its rising brightness\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the sun and his morning bright-ness,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the sun and her forenoon splendour,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the Sun and his (glorious) splendour;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And by the sun and its brightness;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the sun and its midmorning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the sun and its radiance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the sun and its brightness\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[91:1] By the sun and her morning light,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (By the sun and his brightness): '(By the sun and his brightness) Allah swears by the sun and its light,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ والشمس } أقسم بشمس الروح وضوئها المنتشرة في البدن الساطع على النفس",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلشَّمْسِ } أي: وحق شمس الذات الأحدية، المتلألئة من سماء عالم الأسماء العماء، وأفق فضاء اللاهوت { وَ } بحق { ضُحَاهَا } [الشمس: 1] المنبسط على مرآة العدم القابلة لانعكاسها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { والشمسِ وضُحاها } أي: وَضوئها إذا أشرقت وقام سلطانها، { والقمرِ إِذا تلاها } تبعها في الضياء والنور وذلك في النصف الأول من الشهر، يخلف القمرُ الشمسَ في النور، { والنهارِ إِذا جلاَّها } أي: جلّى الشمسَ وأظهرها للرائين، وذلك عند افتتاح النهار وانبساطه لأنَّ الشمس تنجلي في ذلك الوقت تمام الانجلاء، وقيل: الضمير للظلمة أو الأرض، وإن لم يجر لها ذكر، كقوله:\n\n[فاطر:45]، { والليلِ إِذا يغشاها } أي: يستر الشمس ويُظْلِمُ الأفاق، والواو الأولى في هذه الأشياء للقسم باتفاق، وكذا الثانية عند البعض وعند الخليل: الثانية للعطف لأنَّ إدخال القسم على القسم قبل تمام الأول لا يجوز، ألا ترى: أنك لو جعلت مرضعها كلمة الفاء أو \" ثم \" لكان المعنى على حاله، وهما حرفا عطف وكذا الواو، ومَن قال: إنها للقسَمَ احتجّ بأنها لو كانت للعطف لكان عطفاً على عاملين، لأنَّ قوله:\n\n[الليل:1] ـ مثلاً ـ مجرور بواو القسم، { إِذا يغشى } منصوب بالفعل المقدّر الذي هو أقسم، فلو جعلت الواو التي في\n\n[الليل:2] للعطف لكان النهار معطوفاً على الليل جرًّا، و { إذا تجلى } معطوفاً على \" يغشى \" نصباً، وكان كقولك: إنَّ في الدار زيداً، والحُجرة عَمْراً، وأجيب بأنّ واو القسم تنزّلت منزلة الباء والفعل، حتى لم يجز إبراز الفعل معها، فصار كأنها العاملة جرًّا ونصباً، وصارت كعاملٍ واحد له معمولان، وكلُّ عامل له عملان يجوز أن يعطف على معموليه بعاطف واحدٍ بالاتفاق، نحو: ضرب زيدٌ عمراً وأبو بكر خالداً، فترفع بالواو وتنصب لقيامها مقام العامل\n { والسماءِ وما بناها } أي: ومَن بناها، وإيثار \" ما \" على \" مَنْ \" لإرادة الوصفيّة تفخيماً، كأنه قيل: والقادر العظيم الذي بناها، وجعلُها مصدرية مخلّ بالنظم الكريم، وكذا في قوله: { والأرضِ وما طحاها } أي: بسطها من كل جانب، كـ \" دحاها \"\n { ونفسٍ وما سوَّاها } أي: والحكيم الباهر الحكمة الذي سوّاها وأتقن صورتها، مستعدة لكمالاتها، والتنكير للتفخيم، على أنَّ المراد نفس آدم عليه السلام أو للتكثير، وهو الأنسب للجواب، أي: ومَن سوّى كلَّ نفس، { فألْهَمَها فجورَها وتقواها } أي: ألهمها طاعتها ومعصيتها، وأفهمها قبح المعصية وحسن الطاعة أو عَرَّفها طرق الفجور والتقوى، وجعل لها قوة يصح معها اكتساب أحد الأمرين، ويحتمل أن تكون الواو بمعنى \" أو \" كقوله:\n\n[الإنسان:3] أي: ألهم مَن أراد شقاوتها فجورها فسعت إليه، وألهم مَن أراد سعادتها تقواها، فسعت إليه\n { قد أفلح مَن زَكَّاها } أي: فاز بكل مطلوب، ونجا مِن كل مكروه مَن طَهَّرَها وأصلحها وجعلها زكيةً بالإيمان والطاعة، { وقد خاب مَن دسَّاها } أغواها، قال عكرمة: \" أفلحت نفس زكّاها اللهُ، وخابت نفس أغواها الله \" ويجوز أن تكون التدسية والتطهير فعل العبد\n\n\nوالتدسية: النفس والإخفاء، أي: خسر مَن نقصها وأخفاها بالفجور وأصل دس‍ّى: دسّس كتقضى وتقضض، فأبدل من الحرف الثالث ياء، قال في الكافية:\n\nوجواب القسم محذوف، والتقدير: ليهلكنّ الله مَن كفر من قريش ويُدمدم عليهم كما دمدم على ثمود، وقيل: \" قد أفلح \" وليس بشيء، وقيل: \" كذبت ثمود \" على إضمار \" قد \" والأول أحسن والله تعالى أعلم\n الإشارة: والشمس شمس العرفان، وابتداء ضُحاها في أول الفناء والقمر قمر الإيمان إذا تلاها بالرجوع للأثر بالتنزُّل لعالم الحكمة كمالاً وتكميلاً، والنهار نهار التمكين إذا جلاّها، أي: ظلمة حس الكائنات، وقلعها مِن أصلها بشهود المكوِّن والليل ليل القطيعة، إذا يغشاها بقهرية الحق اختباراً، هل يضطرب ويفزع فيُردّ عليه، أو يتسلّى فيُسلب أو نهار البسط إذا جلاّها، أي: ظلمة القبض، وليل القبض إذا يغشاها، أي: شمس نهار البسط، أقسم تعالى بتعاقبهما والسماء سماء الأرواح وما بناها رفعها، والأرض أرض الأشباح، وما طحاها أي: بسطها للعبودية ونفسٍ وما سوّاها ألقى صورتها وهيّأها للقُرب والبُعد فألهمها فجورها وتقواها بما أعطاها من نور العقل، قال الورتجبي: سوّاها بتسوية الصِفة ورقمها بنور الآزلية، ثم بيَّن أنه تعالى عرّفها طرق لطيفات الذات، وقهرية الصفات بنفسه بلا واسطة بقوله: { فألهمها فجورها وتقواها } عرّفها أولاَ طريق القهر حتى عرفت المهلكات ثم عرَّفها طريق اللطف حتى عرفت معالجتها من المنجيات والمقصود منها: عرفانها عند الحق بطريق القهر واللطف، حتى تكمل معرفةُ صانعها\n هـ\n  قال القشيري: فألهمها فجورها وتقواها: بأن خَذَلَها ووَفَّقَها، ويقال: فجورها: حركتها في طلب الرزق، وتقواها: سكونها لحُكْم التقدير\n ثم قال: ويُقال: أفلح مَن طهَّرها من الذنوب والعيوب، ثم عن الأطماع في الأَعواض، ثم العبد نفسه عن الاعتراض على الأنام، وعن ارتكاب الحرام، وقد خاب مَن خان نفسه وأهملها عن المراعاة، ودسَّها بالمخالفات، وفي نوادر الأصول ما حاصله: أنَّ دسّاها بمنزلة مَن دسّ شيئاً في كوة، يمنع من دخول الضوء، كذلك الهوى والشهوة سد‍ّ وغلّق على القلب من حصول ضوء القربة والوصلة\n هـ\n ثم ذكر بعض مَن دسَّى نفسه وما آل إليه أمره، فقال: { كَذَّبَتْ ثَمُودُ بِطَغْوَاهَآ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "93:1",
      "similarity": 0.9016976228199464
    },
    {
      "verse": "20:59",
      "similarity": 0.7553519324703274
    },
    {
      "verse": "7:98",
      "similarity": 0.6894057953745952
    },
    {
      "verse": "79:46",
      "similarity": 0.600944949093595
    },
    {
      "verse": "20:119",
      "similarity": 0.43773893924178453
    }
  ]
}