{
  "chapter": "الشمس",
  "text": "فكذبوه فعقروها فدمدم عليهم ربهم بذنۢبهم فسوىها",
  "translations": [
    {
      "translation": "But they denied him and they hamstrung her, so their Lord crushed them for their sin and flattened them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they called him a liar and hamstrung her. So God obliterated them for their crime, and (destroyed) all of them alike.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they rejected his statement as a lie and hamstrung the she-camel. For that crime their Lord rumbled down upon them, utterly razing them to the ground.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, they rejected him and slew her. So their Lord completely destroyed them and their city for their sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In response they belied him, and hamstrung the she camel – so Allah put ruin over them because of their sins and flattened their dwellings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they denied him and they killed it. So their Lord destroyed them because of their sin, Fasawwaha!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they called him a liar and slaughtered her, therefore their Lord crushed them for their sin and levelled them (with the ground).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they cried him lies, and hamstrung her, so their Lord crushed them for their sin, and leveled them:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they denied him, and they hamstrung her, so Allah doomed them for their sin and rased (their dwellings).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they gave him the lie, and hamstrung the she-camel. So their Lord destroyed them for their crime and razed their city to the ground.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they belied him, and they hamstrung her; wherefore their Lord overwhelmed them for their crime, and made it equal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they impugned him and hamstrung her. So their Lord took them unawares by night because of their sin, and levelled it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they rejected him (as a false prophet), and they hamstrung her. So their Lord, on account of their crime, obliterated their traces and made them equal (in destruction, high and low)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they denied him and they killed it. So their Lord destroyed them because of their sin, and made them equal in destruction (i.e. all grades of people, rich and poor, strong and weak, etc.)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they belied him, and hamstrung her. So their Lord crushed them for their sin and leveled it (their village).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they called him a liar, and hamstrung her. So their Lord crushed them for their sin, and leveled it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they denied him and hamstrung her. So their Lord brought down upon them destruction for their sin and made it equal [upon all of them].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[91:14] But they denied him, with regard to his saying this [as being a command] from God — which if they contravened would immediately result in chastisement being sent down on them — then hamstrung her, they slew it in order to appropriate her [share of the] drinking water. So their Lord closed in on them, the chastisement, because of their sin, and meted it equally [among them], that is, the closing in on them, in other words, He subsumed them all by it, so that not one of them escaped.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But they denied him) they denied the message brought by Salih, (and they hamstrung her) they hamstrung 758 the she-camel, (so Allah doomed them for their sin) so Allah destroyed them because of killing the she- camel and disbelieving in Salih (and razed (their dwellings)) killing the old and the young among them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَكَذَّبُوهُ } ولم يقبلوا قول الرسول، واجتمعوا على عقرها { فَعَقَرُوهَا } فخرج الرسول من بينهم؛ خوفاً من حلول عذاب الله وسطوة قهره وجلاله، وبعدما ارتكبوا المحظور المنهي { فَدَمْدَمَ عَلَيْهِمْ رَبُّهُمْ } أي: طبَّق عليهم الصيحة الهائلة، فأهلكهم بها بالمرة { بِذَنبِهِمْ } الذي صدر عنهم، وهو تكذيب الرسول المرشد لهم من قِبل الحق { فَسَوَّاهَا } [الشمس: 14] أي: سوى الدمدمة عليهم، وأعمت بينهم بحيث لا ينجو منهم أحد، وبالجملة: أقدم العاقر اللعين على عقرها، واتفقوا معه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فكذّبوه } فيما حذّرهم به من نزول العذاب بقوله:\n\n[الأعراف:73]، { فعقروها } ، أسند الفعل إليهم، وإن كان العاقر واحداً، لقوله:\n\n[القمر:29] لرضاهم به\n قال قتادة: بلغنا أنه لم يعقرها حتى تابعه صغيرهم وكبيرهم\n وذكرانهم وإناثهم \"\n { فَدَمْدَمَ عليهم ربُّهم } فأطبق عليهم العذاب حتى استأصلهم\n قال الهروي: إذا كررت الإطباق قلت: دمدمت عليه، أي: أدمت عليه الدمدمة وقيل: فدمدم عليهم: عَضِبَ عليهم، { بذنبهم } بسبب ذنبهم، وصّرح به مع دلالة الفاء عليه للإيذان بأنه عاقبة كل ذنب ليعتبر به كل مذنب",
      "translations": []
    }
  ]
}