{
  "chapter": "الشمس",
  "text": "فكذبوه فعقروها فدمدم عليهم ربهم بذنۢبهم فسوىها",
  "translations": [
    {
      "translation": "But they denied him and they hamstrung her, so their Lord crushed them for their sin and flattened them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they called him a liar and hamstrung her. So God obliterated them for their crime, and (destroyed) all of them alike.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they rejected his statement as a lie and hamstrung the she-camel. For that crime their Lord rumbled down upon them, utterly razing them to the ground.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, they rejected him and slew her. So their Lord completely destroyed them and their city for their sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In response they belied him, and hamstrung the she camel – so Allah put ruin over them because of their sins and flattened their dwellings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they denied him and they killed it. So their Lord destroyed them because of their sin, Fasawwaha!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they called him a liar and slaughtered her, therefore their Lord crushed them for their sin and levelled them (with the ground).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they cried him lies, and hamstrung her, so their Lord crushed them for their sin, and leveled them:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they denied him, and they hamstrung her, so Allah doomed them for their sin and rased (their dwellings).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they gave him the lie, and hamstrung the she-camel. So their Lord destroyed them for their crime and razed their city to the ground.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they belied him, and they hamstrung her; wherefore their Lord overwhelmed them for their crime, and made it equal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they impugned him and hamstrung her. So their Lord took them unawares by night because of their sin, and levelled it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they rejected him (as a false prophet), and they hamstrung her. So their Lord, on account of their crime, obliterated their traces and made them equal (in destruction, high and low)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they denied him and they killed it. So their Lord destroyed them because of their sin, and made them equal in destruction (i.e. all grades of people, rich and poor, strong and weak, etc.)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they belied him, and hamstrung her. So their Lord crushed them for their sin and leveled it (their village).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they called him a liar, and hamstrung her. So their Lord crushed them for their sin, and leveled it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they denied him and hamstrung her. So their Lord brought down upon them destruction for their sin and made it equal [upon all of them].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[91:14] But they denied him, with regard to his saying this [as being a command] from God — which if they contravened would immediately result in chastisement being sent down on them — then hamstrung her, they slew it in order to appropriate her [share of the] drinking water. So their Lord closed in on them, the chastisement, because of their sin, and meted it equally [among them], that is, the closing in on them, in other words, He subsumed them all by it, so that not one of them escaped.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَكَذَّبُوهُ فَعَقَرُوهَا فَدَمْدَمَ عَلَيْهِمْ رَبُّهُمْ بِذَنْبِهِمْ فَسَوَّاهَا (14) { دساها \\* كَذَّبَتْ ثَمُودُ بِطَغْوَاهَآ \\* إِذِ انبعث أشقاها \\* فَقَالَ لَهُمْ رَسُولُ الله } { وسقياها \\* فَكَذَّبُوهُ فَعَقَرُوهَا فَدَمْدمَ عَلَيْهِمْ رَبُّهُمْ بِذَنبِهِمْ فَسَوَّاهَا } .إن كانت جملة { قد أفلح من زكاها } \\[ الشمس : 9 \\] الخ معترضة كانت هذه جواباً للقسم باعتبار ما فرع عليها بقوله : { فدمدم عليهم ربهم بذنبهم } أي حقاً لقد كان ذلك لِذلك ، ولام الجواب محذوف تخفيفاً لاستطالة القسم ، وقد مثلوا لحذف اللام بهذه الآية وهو نظير قوله تعالى : { والسماء ذات البروج } إلى قوله : { قتل أصحاب الأخدود } \\[ البروج : 1 4 \\] .والمقصود : التعريض بتهديد المشركين الذين كذّبوا الرسول طغياناً هم يعلمونه من أنفسهم كما كذبت ثمود رسولهم طغياناً ، وذلك هو المحتاج إلى التأكيد بالقَسَم لأن المشركين لم يهتدوا إلى أن ما حل بثمود من الاستئصال كان لأجل تكذيبهم رسول الله إليهم ، فنبههم الله بهذا ليتدبروا أو لتنزيل علم من علم ذلك منهم منزلة الإِنكار لعدم جَرْي أمرهم على موجَب العلم ، فكأنه قيل : أقسم لَيصيبكم عذابٌ كما أصاب ثمود ، ولقد أصاب المشركين عذاب السيف بأيدي الذين عادَوْهم وآذوهم وأخرجوهم ، وذلك أقسى عليهم وأنكى .فمفعول { كذبت } محذوف لدلالة قوله بعده : { فقال لهم رسول الله } والتقدير : كذبوا رسول الله .وتقدم ذكْر ثمود ورسولهم صالح عليه السلام في سورة الأعراف .وباء { بطغواها } للسببية ، أي كانت طغواها سبب تكذيبهم رسول الله إليهم .والطغوى : اسم مصدر يقال : طغا طَغْوا وطُغياناً ، والطغيان : فرط الكِبر ، وقد تقدم عند قوله تعالى : { ويمدهم في طغيانهم يعمهون } في سورة البقرة ( 15 ) ، وفيه تعريض بتنظير مشركي قريش في تكذيبهم بثمود في أن سبب تكذيبهم هو الطغيان والتكبر عن اتباع من لا يرون له فضلاً عليهم : { وقالوا لولا نزّل هذا القرآن على رجل من القريتين عظيم } \\[ الزخرف : 31 \\] .و { إذْ } ظرف للزمن الماضي يتعلق ب { طغواها } لأن وقت انبعاث أشقاها لعقر الناقة هو الوقت الذي بدت فيه شدة طغواها فبعثوا أشقاهم لعقر الناقة التي جُعلت لهم آية وذلك منتهى الجُرأة .و { انبعث } : مطاوع بَعَث ، فالمعنى : إذ بعثوا أشقاهم فانبعث وانتدب لذلك . و { إذ } مضاف إلى جملة : { انبعث أشقاها } .وقدم ذكر هذا الظرف عن موقعه بعد قوله : { فقال لهم رسول الله ناقة الله } لأن انبعاث أشقاها لعقر الناقة جُزئي من جزئيات طغواهم فهو أشد تعلقاً بالتكذيب المسبب عن الطغوى ففي تقديمه قضاء لحق هذا الاتصال ، ولإفادة أن انبعاث أشقاهم لعقر الناقة كان عن إغراء منهم إياه ، ولا يفوت مع ذلك أنه وقع بعد أن قال لهم رسول الله ناقة الله ، ويستفاد أيضاً من قوله : { فعقروها } .و { أشقاها } : أشدها شِقوة ، وعني به رجل منهم سماه المفسرون قُدار ( بضم القاف وتخفيف الدال المهملة ) بن سالف ، وزيادته عليهم في الشقاوة بأنه الذي باشر الجريمة وإن كان عن ملإ منهم وإغراء .والفاء من قوله : { فقال لهم رسول الله } عاطفة على { كذبت } فتفيد الترتيب والتعقيب كما هو الغالب فيها ، ويَكون معنى الكلام : كذبوا رسول الله صلى الله عليه وسلم فتحداهم بآية الناقة وحذَّرهم من التعرض لها بسوء ومِن منعهم شربها في نوبتها من السُّقيا ، وعطف على { فكذبوه } ، أي فيما أنذرهم به فعقروها بالتكذيب المذكور أول مرة غير التكذيب المذكور ثانياً . وهذا يقتضي أن آية الناقة أرسلت لهم بعد أن كذبوا وهو الشأن في آيات الرسل ، وهو ظاهر ما جاء في سورة هود .ويجوز أن تكون الفاء للترتيب الذكري المجرد وهي تفيد عطف مفصل على مجمل مثل قوله تعالى : { فأزلهما الشيطان عنها فأخرجهما مما كانا فيه } \\[ البقرة : 36 \\] فإن إزلالهما إبعادهما وهو يحصل بعد الإِخراج لا قبله . وقوله : { وكم من قرية أهلكناها فجاءها بأسنا } \\[ الأعراف : 4 \\] ، فيكون المعنى : كذبت ثمود بطغواها إذ انبعث أشقاها . ثم فُصل ذلك بقوله : { فقال لهم رسول اللَّه } إلى قوله : { فعقروها } ، والعقر عند انبعاث أشقاها ، وعليه فلا ضرورة إلى اعتبار الظرف وهو : { إذ انبعث أشقاها } مقدَّماً من تأخير .وأعيدت عليهم ضمائر الجمع باعتبار أنهم جمع وإن كانت الضمائر قبله مراعىً فيها أن ثمود اسم قبيلة .وانتصب { ناقة اللَّه } على التحذير ، والتقدير : احذروا ناقة الله . والمراد : التحذير من أن يؤذوها ، فالكلام من تعليق الحكم بالذوات ، والمرادُ : أحوالها .وإضافة { ناقة } إلى اسم الجلالة لأنها آية جعلها الله على صدق رسالة صالح عليه السلام ولأن خروجها لهم كان خارقاً للعادة .والسقيا : اسم مصدر سَقى ، وهو معطوف على التحذير ، أي احذروا سقيها ، أي احذروا غصب سقيها ، فالكلام على حذف مضاف ، أو أطلق السقيا على الماء الذي تسقى منه إطلاقاً للمصدر على المفعول فيرجع إلى إضافة الحكم إلى الذات . والمراد : حالة تعرف من المقام ، فإن مادة سقيا تؤذن بأن المراد التحذير من أن يسقوا إبلهم من الماء الذي في يوم نوبتها .والتكذيب المعقب به تحذيره إياهم بقوله : { ناقة اللَّه } ، تكذيب ثاننٍ وهو تكذيبهم بما اقتضاه التحذير من الوعيد . والإِنذار بالعذاب إن لم يحذروا الاعتداء على تلك الناقة ، وهو المصرح به في آية سورة الأعراف ( 73 ) في قوله : { ولا تمسوها بسوء فيأخذكم عذاب أليم . } وبهذا الاعتبار استقام التعبير عن مقابلة التحذير بالتكذيب مع أن التحذير إنشاء ، فالتكذيب إنما يتوجه إلى ما في التحذير من الإِنذار بالعذاب .والعَقْر : جرح البعير في يديه ليبرك على الأرض من الألم فينحَر في لبته ، فالعقر كناية مشهورة عن النحر لتلازمهما .\n\n",
      "translations": [
        {
          "translation": "(But they denied him) they denied the message brought by Salih, (and they hamstrung her) they hamstrung 758 the she-camel, (so Allah doomed them for their sin) so Allah destroyed them because of killing the she- camel and disbelieving in Salih (and razed (their dwellings)) killing the old and the young among them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَكَذَّبُوهُ } ولم يقبلوا قول الرسول\n واجتمعوا على عقرها { فَعَقَرُوهَا } فخرج الرسول من بينهم\n خوفاً من حلول عذاب الله وسطوة قهره وجلاله\n وبعدما ارتكبوا المحظور المنهي { فَدَمْدَمَ عَلَيْهِمْ رَبُّهُمْ } أي: طبَّق عليهم الصيحة الهائلة\n فأهلكهم بها بالمرة { بِذَنبِهِمْ } الذي صدر عنهم\n وهو تكذيب الرسول المرشد لهم من قِبل الحق { فَسَوَّاهَا } [الشمس: 14] أي: سوى الدمدمة عليهم\n وأعمت بينهم بحيث لا ينجو منهم أحد\n وبالجملة: أقدم العاقر اللعين على عقرها\n واتفقوا معه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فكذّبوه } فيما حذّرهم به من نزول العذاب بقوله:\n[الأعراف:73]\n { فعقروها } \n أسند الفعل إليهم\n وإن كان العاقر واحداً\n لقوله:\n[القمر:29] لرضاهم به\n قال قتادة: بلغنا أنه لم يعقرها حتى تابعه صغيرهم وكبيرهم\n وذكرانهم وإناثهم \"\n { فَدَمْدَمَ عليهم ربُّهم } فأطبق عليهم العذاب حتى استأصلهم\n قال الهروي: إذا كررت الإطباق قلت: دمدمت عليه\n أي: أدمت عليه الدمدمة وقيل: فدمدم عليهم: عَضِبَ عليهم\n { بذنبهم } بسبب ذنبهم\n وصّرح به مع دلالة الفاء عليه للإيذان بأنه عاقبة كل ذنب ليعتبر به كل مذنب\n { فسوَّاها } أي: الدمدمةّ بينهم\n لم يفلت منهم أحد من صغيرهم وكبيرهم\n أو فسوّى ثمود بالأرض بتسوية بنائها وهدمه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:65",
      "similarity": 0.18606693110094824
    },
    {
      "verse": "54:29",
      "similarity": 0.17778085316911502
    },
    {
      "verse": "26:157",
      "similarity": 0.1715172936955659
    },
    {
      "verse": "3:40",
      "similarity": 0.1704434982379104
    },
    {
      "verse": "19:5",
      "similarity": 0.16990204488606522
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/091014.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/091014.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/91:14.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}