{
  "chapter": "الليل",
  "text": "فانذرتكم نارا تلظى",
  "translations": [
    {
      "translation": "I have warned you of a Fire which rages,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, I warn you of the blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have now warned you of a Blazing Fire,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have warned you about the fierce blazing fire\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I therefore warn you of the fire that is ablaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore I have warned you of a Fire Talazza.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore I warn you of the fire that flames:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now I have warned you of a Fire that flames,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefor have I warned you of the flaming Fire\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have warned you then about a raging Fire:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore have warned you of Fire flaming,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So I warn you of a blazing fire,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore do I warn you of a Fire blazing fiercely;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore I have warned you of a Fire blazing fiercely (Hell);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have now warned you of the Blazing Fire,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have warned you of a Fierce Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So I have warned you of a Fire which is blazing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[92:14] So I have warned you of, I have threatened you, O people of Mecca, [with], a raging fire (talazzā, ‘raging’: one of the two original tā’ letters [of tatalazzā] has been omitted; a variant reading retains it, tatalazzā, that is, ‘one that is flaming’),\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therefore have I warned you) of people of Mecca by means of the Qur'an (of the flaming Fire\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَأَنذَرْتُكُمْ نَاراً تَلَظَّىٰ } [الليل: 14] تتوقد وتتلهب من شدة سورتها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فَأّنْذَرتكم } خوَّفتكم { ناراً تلضى } تتلهب، { لا يَصْلاها إِلاّ الأشقى } لا يدخلها للخلود فيها إلاّ مَن سبق له الشقاء، { الذي كذَّب وتَوَلَّى } أي: الكافر الذي كذّب الرسولَ صلى الله عليه وسلم، وتَوَلى عن الإيمان، { وسَيُجنبها } وسيبعِّدها { الأتقى } المؤمن المبالغ في اتقاء الكفر والمعاصي، فلا يحوم حولها، فضلاً عن دخولها، وأمّا مَن دونه ممن يتقي الكفر دون المعاصي فلا يبعد هذا البُعد، وذلك لا يستلزم صليها بالمعنى المذكور، فلا يُنافي الحصر المذكور\n { الذي يُؤتى مالَه } للفقراء { يتزكَّى } أي: يطلب أن يكون عند الله زاكياً، لا يُريد به رياءً ولا سمعةً، من: الزكا، وهو الزيادة، أو: تفعّل من الزكاة، أو: يتطهر من الذنوب والعيوب، وهو حال من ضمير \" يؤتى \"\n { وما لأحدٍ عنده من نعمةٍ تُجزى } أي: ليس لأحدٍ عنده نعمة من شأنها تجزى وتكافأ، { إِلاَّ ابتغاءَ وجه ربه }: استثناء منقطع، أي: لكن يفعل ذلك ابتغاء وجه ربه { الأعلى } أي: الرفيع بسلطانه، المنيع في شأنه وبرهانه\n والآية نزلت في أبي بكر الصدّيق رضي الله عنه حين اشترى بلالاً في جماعة كان المشركون يؤذونهم، فأعتقهم\n ولذلك قالوا: المراد بالأشقى: أبو جهل وأمية بن خلف\n وعن ابن عباس رضي الله عنه: عذَّب المشركون بلالاً، وبلالٌ يقول: أَحَدٌ أَحَدٌ، فمرّ به النبيُّ صلى الله عليه وسلم فقال: \" ينجيك أحد أحد \" ثم أخبر النبيُّ صلى الله عليه وسلم أبا بكر، وقال له: \" إنَّ بلالاً يُعذَّب في الله \" فعرف مراده فاشتراه برطل من ذهب، وقيل: اشتراه بعبدٍ كان عنده اسمه \" نسطاس \" وكان له عشرة آلاف دينار وغلمان وجواري، وكان مشركاً، فقال له الصدِّيق: أسْلِم ولك جميع مالك، فأبى، فدفعه لأمية بن خلف، وأخذ بلالاً، فأعتقه، فقال المشركون: ما أعتقه إلا ليدٍ كانت له عنده، فنزلت\n\n\nرُوي أنه اشتراه، وهو مدفون بالحجارة، يُعَذَّب على الإسلام، قال عروة: أَعتق أبو بكر سبعة، كلهم يُعذب في الله، بلال وعامر بن فهيرة، والنجدية وبنتها، وزِنِّيرة، وبيرة، وأم عُبيس، وأمة بني المؤمِّل\n قال: وأسْلَم وله أربعون ألفاً، فأنفقها كلها في سبيل الله\n وقال ابن الزبير: كان أبو بكر يشتري الضعفة فيعتقهم، فقال له أبوه: لو كنت تبتاع مَن يمنع ظهرك، فقال: مَنْعَ ظهري أريد، فنزلت فيه: { وَسَيُجَنَّبُهَا ٱلأَتْقَى } [الليل:17] الآية\n واسمه: عبد الله بن عثمان، وكان اسمه في الجاهلية عبد الكعبة، فسمّاه الرسولُ صلى الله عليه وسلم عبد الله\n وقوله تعالى: { ولسوف يرضى } جواب قسم مضمر، أي: والله لسوف نُجازيه فيرضى، وهو وعد كريم لنيل جميع ما يبتغيه على أفضل الوجوه وأكملها، إذ به يتحقق رضاه وهو كقوله لنبيه صلى الله عليه وسلم:\n\n[الضحى:5]\n الإشارة: إنّ علينا لبيان الطريق لِمن طلب الوصول إلى عين التحقيق، فإنا أنزلنا كتاباً ما فرطنا فيه من شيء، وبعثنا رسولاً يهدي إلى الرشد، وجعلنا له خلفاء في كل زمان، يهدون بأمرنا إلى حضرة قدسنا، وإنَّ لنا للآخرةَ لِمن طلبها، والأوُلى لِمن طلبها، وأظهرنا أسرار ذاتِنا لمَن طلبها، فأنذرتكم ناراً تلظى، وهي نار البُعد لا يصلاها إلاّ الأشقى الذي سبق له البُعد منا\n { الذي كذَّب وتولَّى } ، قال القشيري: أي كذَّب الحق في مظاهر الأولياء والمشايخ وأرباب السلوك، وأعْرَض عن قبول إرشادهم ونصائحهم، وعن استماع معارفهم ومواجيدهم الكشفية الشهودية، وسيُجنبها الأتقى، أي: يُجنب طريق البُعد ونار الحجاب مَن اتقى السِّوى، الذي يؤتى ماله تقرُّباً إلى الله ليتزكّى من العيوب والأنانية، { وما لأحدٍ عنده من نعمة تُجزى } أي: ليس إحسانه في مقابلة حرف { إلاّ ابتغاء وجه ربه الأعلى } أي: إلاّ طلب معرفة ذاته العلية، { ولَسَوف يَرضى } بدوام شهود الذات الأقدس\n وصلّى الله على سيدنا محمد وآله وصحبه وسلّم\n\n",
      "translations": []
    }
  ]
}