{
  "chapter": "الضحى",
  "text": "واما بنعمة ربك فحدث",
  "translations": [
    {
      "translation": "And as for the blessing of your Lord, speak out!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And keep recounting the favours of your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and proclaim the bounty of your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and proclaim the bounties of your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And abundantly proclaim the favours of your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And proclaim the grace of your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the favor of your Lord, do announce (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and as for thy Lord's blessing, declare it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefor of the bounty of thy Lord be thy discourse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but proclaim the blessings of your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as to the favour of thine Lord discourse thou thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and as for your Lord’s blessing, proclaim it!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the bounty of the Lord - rehearse and proclaim!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And proclaim the Grace of your Lord (i.e. the Prophethood and all other Graces).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But tell of the favors of your Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But proclaim the blessings of your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for the favor of your Lord, report [it].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[93:11] and as for your Lord’s grace, to you, by way of prophethood and otherwise, proclaim [it], make it known. The omission in certain instances of the [suffixed] pronoun referring to the Prophet (s) from the end of the verbs is intended to sustain the end-rhyme of the verses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therefore of the bounty of thy Lord) through prophethood and Islam (be thy discourse) speak to people and let them know about it'. And of the surah in which \"Have We not caused your bosom to dilate\" is mentioned, which is all Meccan and consists of 8 verses, 27 words and 103 letters: Surah 94: Solace (al-Sharh) And of the surah in which \"Have We not caused your bosom to dilate\" is mentioned, which is all Meccan and consists of 8 verses, 27 words and 103 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَمَّا بِنِعْمَةِ رَبِّكَ } وهدايته وإرشاده { فَحَدِّثْ } [الضحى: 11] يا أكمل الرسل مع المسترشدين المستكملين، فإن حديثك من سرائر الدين وأسرار المعرفة واليقين مع المؤمنين المسترشدين والطالبين، المستوجبين الشكر منك لنعم الله وأداء لحقوق كرمه واستجلاب لمزيد إنعامه وإفضاله\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها المحمدي المزم لتعديد نعم الحق على نفسك أن تداوم وتواظب على أداء حقوقه ما وصل إليك من النعم العظام والكرم الجسام، فلك أن تحدث في عموم أوقاتك وحالاتك عن كرم مولاك، وتشكره على ما أولاك من الاَلاء والنعماء في أُولاك ووعد لك في أخراك\n\n\n\n\nوبالجملة: كن من الشاكرين لنِعَم الله، المحدِّثين بحقوق كرمه، ولا تكن من الغافلين في حال من الأحوال، وسبَّح بحمد ربك بالغدو والآصال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأمَّا بنعمةِ ربك فحدِّث } بشكرها وإشاعتها وإظهار آثارها يرد ما أفاضه الله تعالى عليه من فنون النعم، التي من جملتها المعدودة والموعودة والنبوة التي آتاه الله تأتي على جميع النِعم، ويَدخل في النِعم تعلُّم العلم والقرآن، وفي الحديث عنه صلى الله عليه وسلم:\n\n \" التحدُّث بالنِعَم شكر \" \n\nولذلك كان بعض السلف يقول: لقد أعطاني الله كذا، ولقد صلَّيتُ البارحة كذا، وهذا إنما يجوز إذا ذكره على وجه الشكر، أو ليُقتدى به، فأمّا على وجه الفخر والرياء فلا يجوز\n هـ\n انظر كيف ذكر الله في هذه السورة ثلاث نعم، ثم ذكر في مقابلتها ثلاث وصايا، فقال في قوله: { ألم يجدك يتيماً } بقوله: { فأمّا اليتيم فلا تَقْهَر } وقابل قولَه: { ووجدك ضالاً } بقوله: { وأمّا السائل فلا تَنْهَر } على مَن قال: إنه طالب العلم، وقابل بقوله: { وأمّا بنعمة ربك فَحَدِّث } على القول الآخر وقابل قوله: { ووجدك عائلاً فأَغْنَى } بقوله: { وأمّا السائل فلا تَنْهر } على القول الأظهر، وقابله بقوله: { وأمَّا بنعمة ربك فحدِّث } على القول الآخر هـ\n من ابن جزي\n ولمَّا قرأ صلى الله عليه وسلم سورة الضحى كبّر في آخرها، فسُنَّ التكبير آخرها، وورد الأمر به خاتمتها وخاتمة كل سورة بعدها في رواية البزي\n الإشارة: ألم يجدك يتيماً فرداً من العلائق، مجرداً مما سوى الله، فآواك إليه، وهي طريقة كل متوجه، لا يأويه الحق إليه حتى يكون يتيماً من الهوى، بل بقلبٍ مُفرد، فيه توحيد مجرد\n\n\nقال القشيري: ويُقال فآواك إلى بساط القربة، بحيث انفردْتَ بمقامِك، فلم يُشاركك فيه أحد\n هـ\n { ووجدك ضالاًّ } قيل: متردداً في معاني غوامض المحبة، فهداك بلطفه لها، أو: وجدك مُتحيراً عن إدراك حقيقتنا، فكملناك بأنوار ربوبيتنا حتى أدركتنا بنا، وفي هذا ملاءمة لمعنى الافتتاح\n قال القشيري: ويُقال: ضالاًّ عن محبتي لكن فعرَّفْتُك أني أُحبك، ويقال: جاهلاً شرفَك فعرَّفْتُك قَدْرَكَ\n هـ\n ووجدك عائلاً فقيراً مما سواه، فأغناك به عن كل شيء، إلاّ طلب الزيادة في العلوم والعرفان، فلا قناعة من ذلك،\n\n[طه:114]\n وفي القوت: إنما أغناه بوصفه، لا بالأسباب وهو أعز على الله من أن يجعل غناه من الدنيا أو يرضاها له\n هـ\n وكما أنَّ الله تعالى غَنِيّ بذاته، لا بالأعراض والأسباب، فالرسول صلى الله عليه وسلم غَنِيّ بربه لا بالأعراض\n قاله في الحاشية\n قلت: وكذلك الأولياء ـ رضي الله عنهم ـ سَرَى فيهم اسمه تعالى \" الغَنيِّ \" فصاروا أغنياء بلا سبب، وما وصّى به الحقٌّ تعالى نبيه صلى الله عليه وسلم يُوصَّى به خلفاؤه من قوله: { فأمّا اليتيم فلا تقهر\n\n\n } الخ\n وبالله التوفيق\n وصلّى الله على سيدنا محمد وآله وصحبه وسلّم\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:50",
      "similarity": 0.6138088115969109
    },
    {
      "verse": "52:34",
      "similarity": 0.555527019997271
    },
    {
      "verse": "20:9",
      "similarity": 0.5270574664576679
    },
    {
      "verse": "79:15",
      "similarity": 0.5239791942762072
    },
    {
      "verse": "99:4",
      "similarity": 0.5046907395938458
    }
  ]
}