{
  "chapter": "الضحى",
  "text": "وللءاخرة خير لك من الاولى",
  "translations": [
    {
      "translation": "The Last will be better for you than the First.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What is to come is better for you than what has gone before;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed what is to come will be better for you than what has gone by.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The reward in the next life will certainly be better for you than worldly gains.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed the latter is better for you than the former.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed the Hereafter is better for you than the present.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely what comes after is better for you than that which has gone before.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the Last shall be better for thee than the First.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily the latter portion will be better for thee than the former,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the Hereafter will indeed be better for you than the present life;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Hereafter is indeed better Unto thee than the life present.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the Hereafter shall be better for you than the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily the Hereafter will be better for thee than the present.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed the Hereafter is better for you than the present (life of this world).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Last shall be better for you than the First.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hereafter is better for you than the First.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Hereafter is better for you than the first [life].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[93:4] And verily the Hereafter shall be better for you, by virtue of the honours awaiting you thereat, than the first [life], this world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَلَلْآَخِرَةُ خَيْرٌ لَكَ مِنَ الْأُولَى (4)عطف على جملة : { والضحى } \\[ الضحى : 1 \\] فهو كلام مبتدأ به ، والجملة معطوفة على الجمل الابتدائية وليست معطوفة على جملة جواب القسم بل هي ابتدائية فلما نُفي القِلى بشّر بأن آخرته خير من أولاه ، وأن عاقبته أحسن من بدأته ، وأن الله خاتم له بأفضل مما قد أعطاه في الدنيا وفي الآخرة .وما في تعريف «الآخرة» و { الأولى } من التعميم يجعل معنى هذه الجملة في معنى التذييل الشامل لاستمرار الوحي وغير ذلك من الخير .والآخرة : مؤنث الآخرِ ، و { الأولى } : مؤنث الأوَّل ، وغلب لفظ الآخرة في اصطلاح القرآن على الحياة الآخرة وعلى الدار الآخرة كما غلب لفظ الأولى على حياة الناس التي قبل انخرام هذا العالم ، فيجوز أن يكون المراد هنا من كلا اللفظين كِلا معنييه فيفيد أن الحياة الآخرة خير له من هذه الحياة العاجلة تبشيراً له بالخيرات الأبدية ، ويفيد أن حالاته تجري على الانتقال من حالة إلى أحسن منها ، فيكون تأنيث الوصفين جارياً على حالتي التغليب وحالتي التوصيف ، ويكون التأنيث في هذا المعنى الثاني لمراعاة معنى الحالة .ويومىء ذلك إلى أن عودة نزول الوحي عليه هذه المرة خير من العودة التي سبقت ، أي تكفل الله بأن لا ينقطع عنه نزول الوحي من بعد .فاللام في «الآخرة» و { الأولى } لام الجنس ، أي كُلّ آجل أمره هو خير من عاجله في هذه الدنيا وفي الأخرى .واللام في قوله : { لك } لام الاختصاص ، أي خير مختص بك وهو شامل لكل ما له تعلق بنفس النبي صلى الله عليه وسلم في ذاته وفي دِينه وفي أمته ، فهذا وعد من الله بأن ينشر دين الإِسلام وأن يمكِّن أمته من الخيرات التي يأملها النبي صلى الله عليه وسلم لهم . وقد روى الطبراني والبيهقي في «دلائل النبوءة» عن ابن عباس قال : \" قال رسول الله صلى الله عليه وسلم عُرض عليّ ما هو مفتوح لأمتي بعدي فسرني فأنزل الله تعالى : { وللآخرة خير لك من الأولى } \"\n\n",
      "translations": [
        {
          "translation": "(And verily the latter portion will be better for thee than the former) He says: the reward of the Hereafter is better for you than the reward of the life of the world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وللآخرة } أي: وللحالة الآخرة التي هي التجلي بعد الاحتجاب واشتداد الشوق { خير لك من } الحالة { الأولى } لأمنك في الحالة الثانية عن التلوين بوجود البقية ظهور الأنائية { ولسوف يعطيك ربّك } الوجود الحقاني لهداية الخلق والدعوة إلى الحق بعد هذا الفناء الصرف { فترضى } به حيث ما رضيت بالوجود البشري والرضا لا يكون إلا حال الوجود\n { ألم يجدك يتيماً } منفرداً محجوباً بصفات النفس عن نور أبيك الحقيقي الذي هو روح القدس منقطعاً عنه ضائعاً { فآوى } أي: فآواك إلى جنابه وربّاك في حجر تربيته وتأديبه وكفلك أباك ليعلمك ويزكيك { ووجدك ضالاً } عن التوحيد الذاتي عند كونك في عالم أبيك محتجباً بالصفات عن الذات فهداك بنفسه إلى عين الذات { ووجدك عائلاً } فقيراً عديماً فانياً فيه بالفقر الذي هو سواد الوجه في الدارين الذي هو الفناء المحض بعد الفقر الذي هو فخره أي: فناء الصفات كما قال: \" الفقر فخري \" فأغناك بما أعطاك من الوجود الموهوب الموصوف بصفات الكمال الحقانيّ المتخلق بالأخلاق الربانية\n فإذا تم كمالك فتخلق بأخلاقي وافعل بعبادي ما فعلت بك لتكون عبداً شكوراً أي: قائماً بشكر نعمتي\n { فأما اليتيم } أي: المنفرد المنكسر القلب\n المنقطع عن نور القدس\n المحتجب بحجاب النفس { فلا تقهر } والطف به بالمداراة والرفق وآوه إلى نفسك بالدعو بالحكمة والموعظة الحسنة كما آوتيك { وأمّا السائل } أي: المستعدّ المحجوب الضالّ عن طريق مقصده الطالب إياه { فلا تنهر } ولا تمنعه عن السؤال واهده كما هديتكم { وأما بنعمة ربّك } من العلم والحكمة الفائض عليك في مقام البقاء { فحدّث } بتعليم الناس وإغنائهم بالخير الحقيقي كما أغنيتك\n والله تعالى أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَلآخِرَةُ } التي هي نشأة لاهوتك { خَيْرٌ لَّكَ } وأليق بحالك { مِنَ } نشأتك { ٱلأُولَىٰ } [الضحى: 4] التي هي نشأة ناستوك\n\n\nوكيف لا تكون الآخرة خيراً لك من الدنيا\n إذ هي باقية ببقاء الله\n دائمة بدوامه\n وهذه محدثة فانية\n بل باطلة زاهية\n زائلة بزهوق التعينات وبطلان الأوضاع والإضافات التي هي حاصلة منها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "92:13",
      "similarity": 0.8037031417019657
    },
    {
      "verse": "53:25",
      "similarity": 0.7922720571402914
    },
    {
      "verse": "56:49",
      "similarity": 0.7737481265309647
    },
    {
      "verse": "26:137",
      "similarity": 0.4550026590101734
    },
    {
      "verse": "37:126",
      "similarity": 0.448731656659053
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/093004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/093004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/93:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}