{
  "chapter": "الضحى",
  "text": "ووجدك ضالا فهدى",
  "translations": [
    {
      "translation": "Did He not find you wandering and guide you?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did He not find you perplexed, and show you the way?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did He not find you unaware of the Right Way, and then directed you to it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did He not find you wandering about and give you guidance?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And found you deeply engrossed in His love, so directed you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He found you unaware and guided you\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And find you lost (that is, unrecognized by men) and guide (them to you)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did He not find thee erring, and guide thee?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did He not find thee wandering and direct (thee)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did He not find you wandering, and give you guidance?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He found thee wandering, so He guided thee,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did He not find you astray, and guide you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He found thee wandering, and He gave thee guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He found you unaware (of the Quran, its legal laws, and Prophethood, etc.) and guided you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did He not find you a wanderer so He guided you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And found you wandering, and guided you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He found you lost and guided [you],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[93:7] And did He not find you erring, from the [revealed] Law which you [now] follow, and guided you?, that is, and then guided you to it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Gabriel then said: (Did He not find thee) O Muhammad (wandering) among people in error (and direct (thee)) and guided you by means of prophethood? The Prophet (pbuh) said: \"Yes, O Gabriel!\" 761\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَوَجَدَكَ ضَآلاًّ فَهَدَىٰ } معناه كُنتَ من قَومٍ ضَلالٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَوَجَدَكَ ضَآلاًّ } خالياً عن الحِكم والأحكام، منهمكاً في لوازم الإمكان { فَهَدَىٰ } [الضحى: 7] أي: هداك وأرشدك إلى الإسلام، وأوصلك إلى زلال التوحيد والعرفان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وَوَجَدَك ضالا } غافلاً عن الشرائع التي لا تهتدي إليها العقول، { فَهَدَى } فهداك إليها، كقوله:\n\n[الشورى:52]\n وقال القشيري: أي: ضالاًّ عن تفصيل الشرائع فهديناك إليها، وعَرَّفناك تفصيلَها\n هـ\n أو: ضالاً عما أنت عليه اليوم من معالم النبوة، ولم يقل أحد من المفسرين: ضالاًّ عن الإيمان\n قاله عياض: وقيل: ضلّ في صباه في بعض شِعاب مكة، فردّه أبو جهل إلى عبد المطلب، وقيل: ضلّ مرة أخرى، وطلبوه فلم يجدوه، فطاف عبد المطلب بالكعبة سبعاً، وتضرّع إلى الله، فسمعوا هاتفاً يُنادي من السماء: يا معشر الناس، لا تضجُّوا، فإنَّ لمحمدٍ ربَّا لا يخذله ولا يُضيّعه\n وأنَّ محمداً بوادي تهامة عند شجرة السمر، فسار عبد المطلب وورقة بن نوفل، فإذا النبي صلى الله عليه وسلم قائم تحت شجرة، يلعب بالإغصان والأوراق\n وقيل: أضلته مرضعته حليمة عند باب الكعبة حين فطمته، وجاءت به لترده على عبد المطلب، وقيل: ضلّ في طريق الشام حين خرج به أبو طالب، يُروى أن إبليس أخذ بزمام ناقته في ليل ظلماء فعدل به عن الطريق، فجاء جبريلُ عليه السلام، فنفخ إبليسَ نفخة وقع منها إلى أرض الهند، وردّه إلى القافلة\n وقوله تعالى: { فَهَدَى } أي: فهداك إلى منهاج الشرائع المنطوية في تضاعيف ما يُوحى إليك من الكتاب المبين، وعلَّمك ما لم تكن تعلم",
      "translations": []
    }
  ]
}