{
  "chapter": "الشرح",
  "text": "الم نشرح لك صدرك",
  "translations": [
    {
      "translation": "Did We not expand your breast for you",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "HAVE WE NOT opened up your breast\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), Did We not lay open your breast\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), have We not comforted your heart,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did We not widen your bosom?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We not opened your breast for you\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We not expanded for you your breast,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did We not expand thy breast for thee\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We not caused thy bosom to dilate,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We not lifted up your heart,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We not opened forth for thee thy breast?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did We not open your breast for you\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We not expanded thee thy breast?-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We not opened your breast for you (O Muhammad (Peace be upon him))?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We not expanded your chest for you (Prophet Muhammad),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did We not soothe your heart?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did We not expand for you, [O Muhammad], your breast?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[94:1] Did We not expand (an interrogative meant as an affirmative, in other words, ‘We did [indeed] expand’) your breast for you, O Muhammad (s), by means of prophethood and otherwise,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said concerning the interpretation of Allah's saying (Have We not caused thy bosom to dilate): '(Have We not caused thy bosom to dilate) this is in conjunction with His saying (Did He not find thee destitute and enrich (thee)?), and so Allah says: did We not open your heart for Islam? i.e. did We not soften your heart on the Day of the Covenant through knowledge, understanding, help, reason and certainty, as well as with other things? It is also said this means: did We not expand your heart through prophethood? And the Prophet (pbuh) said: \"Yes, indeed!\"\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ } [الشرح: 1] يا أكمل الرسل من اجتبينا، واصطفينا للنيابة والرسالة، ولم نفسح ونوسع خلدك لقول الآيات الواردة عليك منَّا، والامتثال بالأحكام الموردة من لدنا، مع كونك أمياً، عارياً، خالياً عنها وعمَّا يترتب عليها؟\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلاّ جلاله: { ألم نشرحْ لك صدرك } أي: ألم نوسعه ونفسحه حتى حوى عالَم الغيب والشهادة، وجمع بين ملَكتي الاستفادة والإفادة، فما صدتك الملابسة بالعلائق الجسمانية عن اقتباس أنوار الملِكات الروحانية، وما عاقك التعلُّق بمصالح الخلق عن الاستغراق في شهود الحق، وقيل: المراد شرح جبريل صدرَه في حال صباه، حين شقّه وأخرج منه علقة سوداء، أو ليلة المعراج فملأه إيماناً وحكمة\n والتعبير عن الشرح بالاستفهام الإنكاري للإيذان بأن ثبوته من الظهور بحيث لا يقدر أحد أن يُجِيب عنه بغير \" بلى \"\n وزيادة \" لك \" وتوسُّطه بين الفعل ومفعوله للإيذان بأنَّ الشرح من منافعة صلى الله عليه وسلم ومصالحة، مسارعة إلى إدخال المسرة في قلبه صلى الله عليه وسلم وتشويقاً إلى ما يعقبه، ليتمكن عنده وقتَ وروده فضل تمكُّن\n وقال في الوجيز: هو استفهام معناه التقرير، أي: ألم نفتح ونُوسِّع لك قلبك بالإيمان والنبوة والعلم والحكمة\n قال في الحاشية الفاسية: والظاهر أنه إيثار بما طلبه موسى عليه السلام بقوله:\n\n[طه:25]، وأنه بادَاه به من غير طلب، وهو قَدْر زائد على مطلق الرسالة، متضمن حمل ثقل تبليغها لكونه في ذلك بربه ويناسبه ما بعده من وضع الوزر، وهو لغة: الحمل الثقيل، كما في الوجيز، وشرح الصدر: بسطه بنور إلهي\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:25",
      "similarity": 0.9845630559952503
    },
    {
      "verse": "16:106",
      "similarity": 0.6880623859827042
    },
    {
      "verse": "39:22",
      "similarity": 0.6591960160384032
    },
    {
      "verse": "6:125",
      "similarity": 0.48189354085574393
    },
    {
      "verse": "35:38",
      "similarity": 0.163607077774714
    }
  ]
}