{
  "chapter": "الشرح",
  "text": "الم نشرح لك صدرك",
  "translations": [
    {
      "translation": "Did We not expand your breast for you",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "HAVE WE NOT opened up your breast\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), Did We not lay open your breast\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), have We not comforted your heart,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did We not widen your bosom?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We not opened your breast for you\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We not expanded for you your breast,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did We not expand thy breast for thee\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We not caused thy bosom to dilate,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We not lifted up your heart,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We not opened forth for thee thy breast?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did We not open your breast for you\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We not expanded thee thy breast?-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We not opened your breast for you (O Muhammad (Peace be upon him))?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We not expanded your chest for you (Prophet Muhammad),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did We not soothe your heart?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did We not expand for you, [O Muhammad], your breast?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[94:1] Did We not expand (an interrogative meant as an affirmative, in other words, ‘We did [indeed] expand’) your breast for you, O Muhammad (s), by means of prophethood and otherwise,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said concerning the interpretation of Allah's saying (Have We not caused thy bosom to dilate): '(Have We not caused thy bosom to dilate) this is in conjunction with His saying (Did He not find thee destitute and enrich (thee)?), and so Allah says: did We not open your heart for Islam? i.e. did We not soften your heart on the Day of the Covenant through knowledge, understanding, help, reason and certainty, as well as with other things? It is also said this means: did We not expand your heart through prophethood? And the Prophet (pbuh) said: \"Yes, indeed!\"\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ألم نشرح لك صدرك } استفهام بمعنى إنكار انتفاء الشرح ليفيد ثبوته\n أي: شرحنا لك صدرك وذلك لأن الموحد في مقام الفناء محجوب بالحق عن الخلق لفنائه وضيق الفاني عن كل شيء إذ العدم لا يقبل الوجود كما كان قبل الفناء محجوباً بالخلق عن الحق لضيق وعائه الوجودي وامتناع قبول وجود التجلي الذاتي الإلهي\n فإذا ردّ إلى الخلق بالوجود الحقاني الموهوب ورجع إلى التفصيل وسع صدره الحق والخلق لكونه وجوداً حقياً وذلك انشراح الصدر أي: شرحناه بنورنا للدعوة والقيام بحقائق الأنباء والوزر الذي يحمل ظهره على النقيض وهو صوت الكسر\n أي: يكسره بثقله هو وزر النبوّة والقيام بأعبائها لأنه في مقام الشهود لم يجد للخلق وجوداً فضلاً عن الفعل ولم يفرق بين فعل وفعل لشهوده لأفعاله تعالى\n فكيف يثبت خيراً وشرّاً ويأمر وينهى وهو لا يرى إلا الحق وحده فإذا ردّ إلى مقام النبوة عن مقام الولاية وحجب بحجاب القلب ثقل ذلك عليه وكاد أن يقصم ظهره لاحتجابه عن الشهود الذاتي حينئذ\n فوهب التمكين في مقام البقاء حتى لم يحتجب بالكثرة عن الوحدة وشاهد الجمع في عين التفصيل\n ولم يغب عن شوده بالدعوة وذلك هو شرح الصدر وهو بعينه وضع الوزر المذكور ورفع الذكر لأن الفاني في الجمع لا يكون شيئاً فضلاً عن أن يكون مذكوراً\n ولو بقى في عين الجمع لما صح محمد رسول الله صلى الله عليه وسلم بعد قولنا: لا إله إلا الله لفنائه ولما تمّ الإسلام لصحته بهما\n { فإنّ مع العسر } أي: الاحتجاب الأول بالخلق عن الحق { يسراً } وأيّ يسر هو كشف الذات ومقام الولاية { إنّ مع العسر } أي: الاحتجاب الثاني بالحق عن الخلق { يسراً } وأيّ يسر هو شرح الصدر بالوجود الموهوب الحقاني ومقام النبوة\n { فإذا فرغت } عن السير بالله وفي الله وعن الله { فانصب } في طريق الاستقامة والسير إلى الله واجتهد في دعوة الخلق { فارغب } إليه خاصة في الدعوة إليه\n أي: لا ترغب إلا إلى ذاته دون ثواب أو غرض آخر لتكون دعوتك وهدايتك به إليه وإلا لما كنت قائماً به مستقيماً إليه به بل زائغاً عنه قائماً بالنفس\n والله تعالى أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ } [الشرح: 1] يا أكمل الرسل من اجتبينا\n واصطفينا للنيابة والرسالة\n ولم نفسح ونوسع خلدك لقول الآيات الواردة عليك منَّا\n والامتثال بالأحكام الموردة من لدنا\n مع كونك أمياً\n عارياً\n خالياً عنها وعمَّا يترتب عليها؟\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلاّ جلاله: { ألم نشرحْ لك صدرك } أي: ألم نوسعه ونفسحه حتى حوى عالَم الغيب والشهادة\n وجمع بين ملَكتي الاستفادة والإفادة\n فما صدتك الملابسة بالعلائق الجسمانية عن اقتباس أنوار الملِكات الروحانية\n وما عاقك التعلُّق بمصالح الخلق عن الاستغراق في شهود الحق\n وقيل: المراد شرح جبريل صدرَه في حال صباه\n حين شقّه وأخرج منه علقة سوداء\n أو ليلة المعراج فملأه إيماناً وحكمة\n والتعبير عن الشرح بالاستفهام الإنكاري للإيذان بأن ثبوته من الظهور بحيث لا يقدر أحد أن يُجِيب عنه بغير \" بلى \"\n وزيادة \" لك \" وتوسُّطه بين الفعل ومفعوله للإيذان بأنَّ الشرح من منافعة صلى الله عليه وسلم ومصالحة\n مسارعة إلى إدخال المسرة في قلبه صلى الله عليه وسلم وتشويقاً إلى ما يعقبه\n ليتمكن عنده وقتَ وروده فضل تمكُّن\n وقال في الوجيز: هو استفهام معناه التقرير\n أي: ألم نفتح ونُوسِّع لك قلبك بالإيمان والنبوة والعلم والحكمة\n قال في الحاشية الفاسية: والظاهر أنه إيثار بما طلبه موسى عليه السلام بقوله:\n[طه:25]\n وأنه بادَاه به من غير طلب\n وهو قَدْر زائد على مطلق الرسالة\n متضمن حمل ثقل تبليغها لكونه في ذلك بربه ويناسبه ما بعده من وضع الوزر\n وهو لغة: الحمل الثقيل\n كما في الوجيز\n وشرح الصدر: بسطه بنور إلهي\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:25",
      "similarity": 0.9845630559952503
    },
    {
      "verse": "16:106",
      "similarity": 0.6880623859827042
    },
    {
      "verse": "39:22",
      "similarity": 0.6591960160384032
    },
    {
      "verse": "6:125",
      "similarity": 0.48189354085574393
    },
    {
      "verse": "35:38",
      "similarity": 0.163607077774714
    }
  ]
}