{
  "chapter": "العلق",
  "text": "كلا لا تطعه واسجد واقترب",
  "translations": [
    {
      "translation": "No indeed! Do not obey him, but prostrate and draw near,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beware! Do not obey him, but bow in adoration and draw near (to your Lord).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No, not at all. Never obey him. But prostrate yourself and become nigh (to your Lord).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), never yield to him! Prostrate yourself and try to come closer to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes indeed; do not listen to him – and prostrate, and become close to Us. (Command of Prostration # 14)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! Do not obey him. Fall prostrate and draw near (to Allah)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! obey him not, and make obeisance and draw nigh (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No indeed; do thou not obey him, and bow thyself, and draw nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, Obey not thou him. But prostrate thyself, and draw near (unto Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No indeed! Do not obey him, but prostrate yourself and come closer to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By no means! Obey not thou him. Continue to adore, and continue to draw nigh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No indeed! Do not obey him, but prostrate and draw near [to Allah]!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, heed him not: But bow down in adoration, and bring thyself the closer (to Allah)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! (O Muhammad (Peace be upon him))! Do not obey him (Abu Jahl). Fall prostrate and draw near to Allah!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No, indeed; do not obey him! Prostrate and come nearer (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No, do not obey him; but kneel down, and come near.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No! Do not obey him. But prostrate and draw near [to Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[96:19] No indeed! — a repudiation of him — Do not obey him, O Muhammad (s) and abandon prayer, and prostrate yourself, perform prayer to God, and draw near, to Him through obedience to Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nكَلَّا لَا تُطِعْهُ وَاسْجُدْ وَاقْتَرِبْ (19){ خَاطِئَةٍ \\* فَلْيَدْعُ نَادِيَهُ \\* سَنَدْعُ الزبانية } { الزبانية } .تفريع على الوعد . ومناسبة ذلك ما رواه الترمذي والنسائي عن ابن عباس قال : «كان رسول الله صلى الله عليه وسلم يصلي عند المقام فمر به أبو جهل فقال : يا محمد ألم أنهك عن هذا ، وتوعَّده ، فأغلظ له رسول الله ، فقال أبو جهل : يا محمد بأي شيء تهددني؟ أما والله إني لأكثر أهل هذا الوادي نادياً ، فأنزل الله تعالى : { فليدع ناديه سندع الزبانية } يعني أن أبا جهل أراد بقوله ذلك تهديدَ النبي صلى الله عليه وسلم بأنه يغري عليه أهل نادِيه .والنادي : اسم للمكان الذي يَجتمع فيه القوم . يقال : ندَا القومُ نَدْواً ، إذ اجتَمعوا . والنَّدوة ( بفتح النون ) الجماعة ، ويقال : نَادٍ ونَدِيّ ، ولا يطلق هذا الاسمُ على المكان إلا إذا كان القوم مجتمعين فيه فإذا تفرقوا عنه فليس بنادٍ ، ويقال النادي لمجلس القوم نهاراً ، فأما مجلسهم في الليل فيسمى المسامر قال تعالى : { سامراً تهجرون } \\[ المؤمنون : 67 \\] .واتخذ قُصي لندوة قريش داراً تسمى دار الندوة حَوْل المسجد الحرام وجعلها لتشاورهم ومهماتهم وفيها يُعقد على الأزواج ، وفيها تدَرَّع الجواري ، أي يلبسونهن الدروع ، أي الأقمصة إعلاناً بأنهن قاربْن سِن البلوغ ، وهذه الدار كانت اشترتها الخيزران زوجة المنصور أبي جعفر وأدخلتْها في ساحة المسجد الحرام ، وأُدخل بعضها في المسجد الحرام في زيادة عبد الملك بن مروان وبعضها في زيادة أبي جعفر المنصور ، فبقيت بقيتُها بيتاً مستقلاً ونزل به المهدي سنة 160 في مدة خلافة المعتضد بالله العباسي لما زاد في المسجد الحرام جعل مكان دار الندوة مسجداً متصلاً بالمسجد الحرام فاستمر كذلك ثم هدم وأدخلت مساحته في مساحة المسجد الحرام في الزيادة التي زادها الملك سعود بن عبد العزيز ملك الحجاز ونجد سنة 1379 .ويطلق النادي على الذين ينتدون فيه وهو معنى قول أبي جهل : إني لأكثر أهل هذا الوادي نَادياً ، أي نَاساً يجلسون إليَّ يريد أنه رئيس يصمد إليه ، وهو المعني هنا .وإطلاق النادي على أهله نظير إطلاق القرية على أهلها في قوله تعالى : { واسأل القرية } \\[ يوسف : 82 \\] ونظير إطلاق المجلس على أهله في قول ذي الرمة: ... لهم مجلسٌ صُهْب السِّبال أذلةٌسَوَاسة أحرارُها وعبيدُها ... وإطلاق المقامة على أهلها في قول زهير: ... وفيهم مقامات حسان وجوههموأندية ينتابها القول والفعل ... أي أصحاب مقامات حسان وجوههم .وإطلاق المجمع على أهله في قول لبيد: ... إنَّا إذا ألتقَت المجامع لم يزلمنَّا لِزاز عظيمة جسامها ... الأبيات الأربعة .ولام الأمر في { فليدع ناديه } للتعجيز لأن أبا جهل هدّد النبي صلى الله عليه وسلم بكثرة أنصاره وهم أهل ناديه فردّ الله عليه بأن أمره بدعوة ناديه فإنه إن دعاهم ليسطُوا على النبي صلى الله عليه وسلم دعا الله ملائكة فأهلكوه .وهذه الآية معجزة خاصة من معجزات القرآن فإنه تحدى أبا جهل بهذا وقد سمع أبو جهل القرآن وسمعه أنصاره فلم يقدم أحد منهم على السطو على الرسول صلى الله عليه وسلم مع أن الكلام يلهب حميته .وإضافة النادي إلى ضميره لأنه رئيسهم ويجتمعون إليه قالت أعرابية : «سيدُ ناديه ، وَثِمَالُ عافيهْ» .وقوله : { سندع الزبانية } جواب الأمر التعجيزي ، أي فإن دعا ناديَه دعوْنا لهم الزبانية ففعل { سندع } مجزوم في جواب الأمر ، ولذلك كتب في المصحف بدون واو وحرف الاستقبال لتأكيد الفعل .والزبانية : بفتح الزاي وتخفيف التحتية جمع زباني بفتح الزاي وبتحتية مشددة ، أو جمع زِبْنيَة بكسر الزاي فموحدة ساكنة فنون مكسورة فتحتية مخففة ، أو جمع زِبْنِيّ بكسر فسكون فتحتية مشددة . وقيل : هو اسم جمع لا واحد له من لفظه مثل أبابيل وعَبَاديد . وهذا الاسم مشتق من الزبن وهو الدفع بشِدة يقال : ناقة زَبُون إذا كانت تركُل من يحلبُها ، وحرب زبون يدفع بعضها بعضاً بتكرر القتال .فالزبانية الذين يزبنون الناس ، أي يدفعونهم بشدة . والمراد بهم ملائكة العذاب ويطلق الزبانية على أعوان الشُّرطة .و { كَلاّ } ردع لإِبطال ما تضمنه قوله : { فليدع ناديه } ، أي وليس بفاعل ، وهذا تأكيد للتحدّي والتعجيز .وكتب { سندع } في المصحف بدون واو بعد العين مراعاة لحالة الوصل ، لأنها ليست محل وقف ولا فاصلة .{ كَلاَّ لاَ تُطِعْهُ واسجد } .هذا فذلكة للكلام المتقدم من قوله : { أرأيت الذي ينهى عبداً إذا صلى } \\[ العلق : 9 ، 10 \\] ، أي لا تترك صلاتك في المسجد الحرام ولا تخش منه .وأطلقت الطاعة على الحذر الباعث على الطاعة على طريق المجاز المرسل ، والمعنى : لا تخفه ولا تحذره فإنه لا يَضرك .وأكد قوله : { لا تطعه } بجملة { واسجد } اهتماماً بالصلاة .وعطف عليه { واقترب } للتنويه بما في الصلاة من مرضاة الله تعالى بحيث جعل المصلّي مقترباً من الله تعالى .والاقتراب : افتعال من القرب ، عبر بصيغة الافتعال لما فيها من معنى التكلف والتطلب ، أي اجتهد في القرب إلى الله بالصلاة .\n\n",
      "translations": [
        {
          "translation": "(Nay) truly, Muhammad! (Obey not thou him) i.e. obey not Abu Jahl when he wants you not to pray to your Lord. (But prostrate thyself) to your Lord, (and draw near (unto Allah)) through prostration. And of the surah in which Power is mentioned, which is all Meccan and consists of 5 verses, 30 words and 121 letters: 765 Surah 97: Power (al-Qadr) And of the surah in which Power is mentioned, which is all Meccan and consists of 5 verses, 30 words and 121 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ كرر سبحانه { كَلاَّ } تأكيداً لردعه وتشديداً عليه\n ثمَّ نهى سبحانه حبيبه صلى الله عليه وسلم عن إطاعة ذلك الباغي والإصغاء إلى قوله\n والمؤانسة معه والالتفات إليه بقوله: { لاَ تُطِعْهُ } أي: دُمْ يا أكمل الرسل على صلاتك وأثبت عليها\n ولا تلتفت إلى هذياناته الباطلة { وَٱسْجُدْ } لربك على وجه الخضوع والخشوع { وَٱقْتَرِب } [العلق: 19] إليه وتقرَّب نحوه بإطراح لوازم ناسوتك\n محرماً على نفسك حظوظك من دنياك\n مسقطاً مقتضيات بشريتك ولواحق مادتك مطلقاً\n\nوفي الحديث:\n \" أقرب ما يكون العبد إلى ربه إذا سجد \" \n[الحجر: 98-99]\n\n\nخاتمة السورة\n\nعليك أيها الطالب للتقرب نحو الحق والوصول إلى فضاء اللاهوت - أعانك الله في مطلبك هذا وطلبك - أن تداوم على الطاعات والعبادات على وجه الإخلاص والتذلل التام والانكسار المفرط\n إذ ما يتقرب العبد إلى ربه إلاَّ بالاستكانة والضراغة\n والإفناء على لوازم نشأة الناسوت\n والاتصاف بالموت الإرادي المورث للحياة الأبدية والبقاء السرمدي\n\n\nجعلنا الله من المتصفين به بمنِّه وجوده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:54",
      "similarity": 0.6131547785729744
    },
    {
      "verse": "80:11",
      "similarity": 0.6131547785729744
    },
    {
      "verse": "70:39",
      "similarity": 0.5939198528759219
    },
    {
      "verse": "74:16",
      "similarity": 0.5857492059486992
    },
    {
      "verse": "78:4",
      "similarity": 0.578821920255744
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/096019.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/096019.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/96:19.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}