{
  "chapter": "العلق",
  "text": "اقرا باسم ربك الذى خلق",
  "translations": [
    {
      "translation": "READ IN THE name of your Lord who created,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite in the name of your Lord Who created,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), read in the name of your Lord who created (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read with the name of your Lord Who created,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read! In the Name of your Lord Who created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read in the name of your Lord Who created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite: In the Name of thy Lord who created,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read: In the name of thy Lord Who createth,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read! In the name of your Lord, who created:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite thou in the name of thy Lord Who hath created -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read in the Name of your Lord who created;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim! (or read!) in the name of thy Lord and Cherisher, Who created-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read! In the Name of your Lord, Who has created (all that exists),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read (Prophet Muhammad) in the Name of your Lord who created,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read: In the Name of your Lord who created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite in the name of your Lord who created -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[96:1] (Meccan, consisting of 19 verses; from the beginning of it up to [the verse] what he did not know, was the first of the Qur’ān to be revealed, in the cave at Hirā’, as reported by al-Bukhārī.) Recite, bring recitation into existence, beginning with: In the Name of your Lord Who created, all creatures;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Read): '(Read) He says: Read, Muhammad, the Qur'an; this is the first revelation that Gabriel brought down: (In the name of thy Lord) by the command of your Lord (Who createth) the created beings,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱقْرَأْ } يا أكمل الرسل وتذكر بعدما أدركتك العناية، وأحاطت عليك الكرامة الإلهية { بِٱسْمِ رَبِّكَ } أي: داوم على تذكر عموم أسماء مربيك { ٱلَّذِي خَلَقَ } [العلق: 1] كل شيء، وأظهره من كتم العدم حسب أسمائه وصفاته، وربَّاه بأنواع اللطف والكرم وأباح عليه من جلائل النعم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله لنبيه صلى الله عليه وسلم، في أول الوحي: { اقرأ باسم ربك } أي: اقرأ هذا القرآن مفتتحاً باسم ربك، أو مستعيناً به، فالجار في محل الحال\n ويحتمل أن يكون المقروء الذي أمر بقراءته هو باسم ربك، كأنه قيل له: اقرأ هذا اللفظ\n والتعرُّض لعنوان الربوبية المنبئة عن التربية والتبليغ إلى الكمال اللائق شيئاً فشيئاً مع الإضافة إلى ضميره صلى الله عليه وسلم للإشعار بتبليغه عليه السلام إلى الغاية القاصية من الكمالات البشرية والروحانية بإنزال الوحي المشتمل على نهاية العلوم والحكم\n وقوله تعالى: { الذي خلقَ } صفة للرب، ولم يذكر له مفعولاً لأنَّ المعنى: الذي حصل منه الخلق، واستأثر به، لا خالق سواه، أو تقديره: خلق كلَّ شيء، فتناول كلَّ مخلوق لأنه مطلق، فليس بعض المخلوقات بتقديره أولى من البعض",
      "translations": []
    }
  ]
}