{
  "chapter": "العلق",
  "text": "اقرا باسم ربك الذى خلق",
  "translations": [
    {
      "translation": "Recite: In the Name of your Lord who created,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "READ IN THE name of your Lord who created,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite in the name of your Lord Who created,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), read in the name of your Lord who created (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read with the name of your Lord Who created,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read! In the Name of your Lord Who created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read in the name of your Lord Who created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite: In the Name of thy Lord who created,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read: In the name of thy Lord Who createth,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read! In the name of your Lord, who created:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite thou in the name of thy Lord Who hath created -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read in the Name of your Lord who created;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim! (or read!) in the name of thy Lord and Cherisher, Who created-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read! In the Name of your Lord, Who has created (all that exists),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read (Prophet Muhammad) in the Name of your Lord who created,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read: In the Name of your Lord who created.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite in the name of your Lord who created -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[96:1] (Meccan, consisting of 19 verses; from the beginning of it up to [the verse] what he did not know, was the first of the Qur’ān to be revealed, in the cave at Hirā’, as reported by al-Bukhārī.) Recite, bring recitation into existence, beginning with: In the Name of your Lord Who created, all creatures;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ (1) { عَلَقٍ } .هذا أول ما أوحي به من القرآن إلى محمد صلى الله عليه وسلم لِما ثبت عن عائشة عن النبي صلى الله عليه وسلم مما سيأتي قريباً .وافتتاح السورة بكلمة { اقرأ } إيذان بأن رسول الله صلى الله عليه وسلم سيكون قارئاً ، أي تالياً كتاباً بعد أن لم يكن قد تلا كتاباً قال تعالى : { وما كنت تتلوا من قبله من كتاب } \\[ العنكبوت : 48 \\] ، أي من قبل نزول القرآن ، ولهذا قال النبي صلى الله عليه وسلم لجبريل حين قال له اقرأ : \" ما أنا بقارىء \" .وفي هذا الافتتاح براعة استهلال للقرآن .وقوله تعالى : { اقرأ } أمر بالقراءة ، والقراءة نطق بكلام معيَّن مكتوببٍ أو محفوظٍ على ظهر قلب .وتقدم في قوله تعالى : { فإذا قرأت القرآن فاستعذ باللَّه من الشيطان الرجيم } في سورة النحل ( 98 ) .والأمر بالقراءة مستعمل في حقيقته من الطلب لتحصيل فعل في الحال أو الاستقبال ، فالمطلوب بقوله : { اقرأ } أن يفعل القراءة في الحال أو المستقبل القريب من الحال ، أي أن يقول مَا سَيُمْلَى عليه ، والقرينة على أنه أمر بقراءة في المستقبل القريب أنه لم يتقدم إملاء كلام عليه محفوظ فتطلب منه قراءته ، ولا سُلمت إليه صحيفة فتطلب منه قراءتها ، فهو كما يقول المُعلم للتلميذ : اكتب ، فيتأهب لكتابة ما سيمليه عليه .وفي حديث «الصحيحين» عن عائشة رضي الله عنها قولها فيه : « حتى جاءه الحق وهو في غار حراء فجاءه الملك فقال : اقرأ . قال : فقلت : ما أنا بقارىء فأخذني فغطني حتى بلغ مني الجَهْد ثم أرْسَلَني فقال : اقرأ . فقلت : ما أنا بقارىء فأخذني فغطّني الثانيةَ حتى بلغ مني الجَهد ثم أرسلني فقال : اقرأ فقلت : ما أنا بقارىء فأخذني فغطني الثالثة حتى بلغ مني الجَهد ، ثم أرسلني فقال : { اقرأ باسم ربك الذي خلق } إلى { ما لم يعلم } .فهذا الحديث روته عائشة عن رسول الله صلى الله عليه وسلم لقولها قال : \" فقلت : ما أنا بقارىء \" . وجميع ما ذكرته فيه مما روته عنه لا محالة وقد قالت فيه : «فرجع بها رسول الله صلى الله عليه وسلم يرجف فُؤاده» أي فرجع بالآيات التي أُمليَتْ عليه ، أي رجع متلبساً بها ، أي بوعيها .وهو يدل على أن رسول الله صلى الله عليه وسلم تلقى ما أوحي إليه . وقرأه حينئذٍ ويزيد ذلك إيضاحاً قولها في الحديث : «فانطلقت به خديجة إلى ورقة بن نوفل فقالت له خديجة : يا ابن عم اسمع من ابن أخيك» ، أي اسمع القول الذي أوحي إليه وهذا ينبىء بأن رسول الله صلى الله عليه وسلم عندما قيل له بعد الفطة الثالثة : { اقرأ باسم ربك } الآيات الخمس قد قرأها ساعتئذٍ كما أمره الله ورجع من غار حراء إلى بيته يقرؤها وعلى هذا الوجه يكون قول المَلك له في المرات الثلاث { اقرأ } إعادة للفّظ المنزل من الله إعادة تكرير للاستئناس بالقراءة التي لم يتعلمها من قبل .ولم يُذكر لِفعل { اقرأ } مفعول ، إما لأنه نزل منزلة اللازم وأن المقصود أوجد القراءة ، وإما لظهور المقروء من المقام ، وتقديره : اقرأ ما سنلقيه إليك من القرآن .وقوله { باسم ربك } فيه وجوه :أولها : أن يكون افتتاح كلام بعد جملة { اقرأ } وهو أول المقروء ، أي قل : باسم الله ، فتكون الباء للاستعانة فيجوز تعلقه بمحذوف تقديره : ابتدىء ويجوز أن يتعلق ب { اقرأ } الثاني فيكون تقديمه على معموله للاهتمام بشأن اسم الله . ومعنى الاستعانة باسم الله ذكر اسمه عند هذه القراءة ، وإقحامُ كلمة ( اسم ) لأن الاستعانة بذكر اسمه تعالى لا بذاته كما تقدم في الكلام على البسملة ، وهذا الوجه يقتضي أن النبي صلى الله عليه وسلم قال : { باسم الله } حين تلقَّى هذه الجملة .الثاني : أن تكون الباء للمصاحبة ويكون المجرور في موضع الحال من ضمير { اقرأ } الثاني مقدَّماً على عامله للاختصاص ، أي اقرأ ما سيوحَى إليك مصاحباً قراءتَك ( اسمَ ربك ) . فالمصاحبة مصاحبة الفهم والملاحظة لجلاله ، ويكون هذا إثباتاً لوحدانية الله بالإلهية وإبطالاً للنداء باسم الأصنام الذي كان يفعله المشركون يقولون : باسم اللاتتِ ، باسم العزى ، كما تقدم في البسملة . فهذا أول ما جاء من قواعد الإسلام قد افتتح به أول الوَحي .الثالث : أن تكون الباء بمعنى ( على ) كقوله تعالى : { من إن تأمنه بقنطار } \\[ آل عمران : 75 \\] ، أي على قنطار . والمعنى : اقرأ على اسم ربك ، أي على إذنه ، أي أن المَلَك جاءك على اسم ربك ، أي مرسلاً من ربك ، فذكر ( اسْم ) على هذا متعين .وعدل عن اسم الله العَلم إلى صفة { ربك } لما يؤذن وصف الرب من الرأفة بالمربوب والعناية به ، مع ما يتأتى بذكره من إضافته إلى ضمير النبي صلى الله عليه وسلم إضافة مؤذنة بأنه المنفرد بربوبيته عنده رداً على الذين جعلوا لأنفسهم أرباباً من دون الله فكانت هذه الآية أصلاً للتوحيد في الإسلام .وجيء في وصف الربّ بطريق الموصول { الذي خلق } ولأن في ذلك استدلالاً على انفراد الله بالإلهية لأن هذا القرآن سيُتلى على المشركين لما تفيده الموصولية من الإيماء إى علة الخبر ، وإذا كانت علة الإقبال على ذكر اسم الرب هي أنه خالق دل ذلك على بطلان الإقبال على ذكر غيره الذي ليس بخالق ، فالمشركون كانوا يقبلون على اسم اللات واسم العزى ، وكونُ الله هو الخالق يعترفون به قال تعالى : { ولئن سألتهم من خلق السموات والأرض ليقولن الله } \\[ لقمان : 25 \\] فلما كان المقام مقام ابتداء كتاب الإسلام دين التوحيد كان مقتضياً لذكر أدلّ الأوصاف على وحدانيته . 6وجملة { خلق الإنسان من علق } يجوز أن تكون بدلاً من جملة { الذي خلق } بدل مفصَّل من مُجْمل إن لم يقدر له مفعول ، أو بدل بعض إن قُدِّر له مفعول عام ، وسُلك طريق الإبدال لما فيه من الإجمال ابتداءً لإقامة الاستدلال على افتقار المخلوقات كلها إليه تعالى لأن المقام مقام الشروع في تأسيس ملة الإسلام .ففي الإجمال إحضار للدليل مع الاختصار مع ما فيه من إفادة التعميم ثم يكون التفصيل بعد ذلك لزيادة تقرير الدليل .\n\n",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Read): '(Read) He says: Read, Muhammad, the Qur'an; this is the first revelation that Gabriel brought down: (In the name of thy Lord) by the command of your Lord (Who createth) the created beings,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ اقرأ باسم ربّك } نزلت في أول رتبة ردّه عليه السلام عن الجمع إلى التفصيل ولهذا قيل: هي أول سورة نزلت من القرآن\n ومعنى الباء في باسم: الاستعانة كما في قوله: كتبت بالقلم\n لأنه إذا رجع إلى الخلق عن الحق كان موجوداً بالوجود الحقاني بعد الفناء عن وجوده موصوفاً بصفاته\n فكان اسماً من أسمائه لأن الاسم هو الذات مع الصفة\n أي: اقرأ بالوجود الذاتي الذي هو اسمه الأعظم فهو الآمر باعتبار الجمع والمأمور باعتبار التفصيل ولهذا وصف الربّ بـ { الذي خلق } أي: احتجب بصورة الخلق\n يعني ظهرت بصورتك فقم بي في صورة الخلق وارجع عن الحقية إلى الخلقية وكن خلقاً بالحق",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱقْرَأْ } يا أكمل الرسل وتذكر بعدما أدركتك العناية\n وأحاطت عليك الكرامة الإلهية { بِٱسْمِ رَبِّكَ } أي: داوم على تذكر عموم أسماء مربيك { ٱلَّذِي خَلَقَ } [العلق: 1] كل شيء\n وأظهره من كتم العدم حسب أسمائه وصفاته\n وربَّاه بأنواع اللطف والكرم وأباح عليه من جلائل النعم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله لنبيه صلى الله عليه وسلم\n في أول الوحي: { اقرأ باسم ربك } أي: اقرأ هذا القرآن مفتتحاً باسم ربك\n أو مستعيناً به\n فالجار في محل الحال\n ويحتمل أن يكون المقروء الذي أمر بقراءته هو باسم ربك\n كأنه قيل له: اقرأ هذا اللفظ\n والتعرُّض لعنوان الربوبية المنبئة عن التربية والتبليغ إلى الكمال اللائق شيئاً فشيئاً مع الإضافة إلى ضميره صلى الله عليه وسلم للإشعار بتبليغه عليه السلام إلى الغاية القاصية من الكمالات البشرية والروحانية بإنزال الوحي المشتمل على نهاية العلوم والحكم\n وقوله تعالى: { الذي خلقَ } صفة للرب\n ولم يذكر له مفعولاً لأنَّ المعنى: الذي حصل منه الخلق\n واستأثر به\n لا خالق سواه\n أو تقديره: خلق كلَّ شيء\n فتناول كلَّ مخلوق لأنه مطلق\n فليس بعض المخلوقات بتقديره أولى من البعض",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "55:2",
      "similarity": 0.6871824065877522
    },
    {
      "verse": "26:199",
      "similarity": 0.6619151694481246
    },
    {
      "verse": "76:23",
      "similarity": 0.6216594780021141
    },
    {
      "verse": "36:2",
      "similarity": 0.6177771586191763
    },
    {
      "verse": "75:18",
      "similarity": 0.5696464564254148
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/096001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/096001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/96:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}