{
  "chapter": "العلق",
  "text": "اقرا وربك الاكرم",
  "translations": [
    {
      "translation": "Recite: And your Lord is the Most Generous,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read, for your Lord is most beneficent,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite: and your Lord is Most Generous,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite! Your Lord is the most Honorable One,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read, and your Lord only is the Most Beneficent,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read! And your Lord is the Most Generous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read and your Lord is Most Honorable,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite: And thy Lord is the Most Generous,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read: And thy Lord is the Most Bounteous,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read! Your Lord is the Most Bountiful One\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite thou: And thy Lord is the Most Bounteous,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read, and your Lord is the most generous,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim! And thy Lord is Most Bountiful,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read! And your Lord is the Most Generous,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read! Your Lord is the Most Generous,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Read: And your Lord is the Most Generous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite, and your Lord is the most Generous -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[96:3] Recite: (reiterating the first one) and your Lord is the Most Generous, having no counterpart in terms of His generosity (wa-rabbuka’l-akram is a circumstantial qualifier referring to the subject [of the verb] iqra’, ‘recite’),\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "He said to him: (Read) the Qur'an, Muhammad: (And thy Lord is the Most Bounteous) and your Lord is Clement and forgives the ignorance of the servants,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما أمر سبحانه حبيبه صلى الله عليه وسلم بالقراءة، وتعديد الأسماء وإحصاءها، أمره بالقراءة ثانياً؛ للتأمل والتدبر في معانيها، والاستكشاف عن فحاويها ومرموزاتها فقال: { ٱقْرَأْ } قراءة تدبر وتعمق واستكشاف على ما في مطاويها من البدائع والغرائب المودعة فيها، ولا تنظر إلى كونك أمياً لست من أهل الإملاء { وَرَبُّكَ ٱلأَكْرَمُ } [العلق: 3] الكامل الكرامة والهداية لأرباب العناية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم كرّر الأمر بالقراءة بقوله: { اقرأْ } أي: افعل ما أُمرتَ به، تأكيداً للإيجاب وتمهيداً لقوله: { وربُّك الأكرمُ } فإنه كلام مستأنف، وارد لإزاحة ما أظهر عليه السلام من العُذر بقوله: \" ما أنا بقارىء \" يريد أنّ القراءة من شأن مَن يكتب ويقرأ، وأنا أمي، فقيل له: { وربك } الذي أمرك بالقراءة مستعيناً باسمه هو { الأكرم } أي: مِن كل كريم يُنعم على عباده بغاية النعم، ويحلم عنهم إذا عصوه، فلا يعاجلهم بالنقم فليس وراء التكرُّم بهذه الفوائد العظيمة تكرُّم\n { الذي عَلَّم } الكتابة { بالقلم عَلَّم الإِنسانَ ما لم يعلم } فدلّ على كمال كرمه بأنه علَّم عباده ما لم يعلموا، ونقلهم من ظلمة الجهل إلى نور العلم\n ونبّه على فضل علم الكتابة لِما فيه من المنافع العظيمة، وما دُوّنت العلوم ولا قُيّدت الحِكم ولا ضُبِطت أخبار الأولين، ولا كُتب الله المنزّلة، إلاَّ بالكتابة ولولا هي لما استقامت أمور الدين والدنيا، ولو لم يكن على دقيق حكمة الله تعالى دليل إلاّ أمر القلم والخطّ لكفى به وفي ذلك يقول ابن عاشر الفاسي:\n\n\n\nالإشارة: اقرأ بربك لتكون به في جميع أمورك الذي أظهر الأشياء ليُعرف بها، وأظهر المظهر الأكبر ـ وهو الإنسان ـ من علقة مهينة، ثم رفعه بالعلم إلى أعلى عليين، فرفعه من حضيض النطفة الخبيثة إلى ارتفاع العلم والمعرفة، ولذلكم قال: اقرأ وربك الأكرم الذي تكرَّم عليك وعلّمك ما لم تكن تعلم، الذي علَّم بالقلم، علَّم الإنسان ما لم يكن يعلم\n والله تعالى أعلم\n ولمّا لم يشكر الإنسان هذه النعم، زجره تعالى بقوله: { كَلاَّ إِنَّ ٱلإِنسَانَ لَيَطْغَىٰ }\n\n",
      "translations": []
    }
  ]
}