{
  "chapter": "القدر",
  "text": "انا انزلنه فى ليلة القدر",
  "translations": [
    {
      "translation": "Truly We sent it down on the Night of Power.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "TRULY WE REVEALED it on the Night of Determination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, We revealed this (Qur'an) on the Night of Power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We revealed the Quran on the Night of Destiny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed sent down the Qur’an in the Night of Destiny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have sent it down in the Night of Al-Qadr.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We revealed it on the grand night.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, We sent it down on the Night of Power;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We revealed it on the Night of Predestination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent it [Quran] down on the Night of Destiny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! We have sent it down on the night of Power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We sent it down on the Night of Ordainment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed revealed this (Message) in the Night of Power:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! We have sent it (this Quran) down in the night of Al-Qadr (Decree)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent this (the Holy Koran) down on the Night of Honor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent it down on the Night of Decree.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We sent the Qur'an down during the Night of Decree.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[97:1]   Lo! We revealed it, that is, the Qur’ān, in its entirety, [sending it down] from the Preserved Tablet to the heaven of this world, on the Night of Ordainment, that is, [the Night] of great eminence.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ (1)اشتملت هذه الآية على تنويه عظيم بالقرآن فافتتحت بحرف ( إنَّ ) وبالإِخبار عنها بالجملة الفعلية ، وكلاهما من طرق التأكيد والتقوّي .ويفيد هذا التقديم قصراً وهو قصر قلب للرد على المشركين الذي نفوا أن يكون القرآن منزلاً من الله تعالى .وفي ضمير العظمة وإسناد الإِنزال إليه تشريف عظيم للقرآن .وفي الإِتيان بضمير القرآن دون الاسم الظاهر إيماء إلى أنه حاضر في أذهان المسلمين لشدة إقبالهم عليه فكون الضمير دون سبق معاد إيماء إلى شهرته بينهم .فيجوز أن يراد به القرآنُ كلُّه فيكون فعل : «أنزلنا» مستعملاً في ابتداء الإِنزال لأن الذي أُنزل في تلك الليلة خمس الآيات الأول من سورة العلق ثم فتر الوحي ثم عاد إنزاله منجماً ولم يكمل إنزال القرآن إلا بعد نيف وعشرين سنة ، ولكن لما كان جميع القرآن مقرراً في علم الله تعالى مقدارُه وأنه ينزل على النبي صلى الله عليه وسلم منجَّماً حتى يتم ، كان إنزاله بإنزال الآيات الأُول منه لأن ما ألحق بالشيء يعد بمنزلة أوله فقد قال النبي صلى الله عليه وسلم \" صلاة في مسجدي هذا أفضل من ألف صلاة فيما سواه \" الحديث فاتفق العلماء على أن الصلاة فيما أُلْحق بالمسجد النبوي لها ذلك الفضل ، وأن الطواف في زيادات المسجد الحرام يصحّ كلما اتّسع المسجد .ومن تسديد ترتيب المصحف أن وضعت سورة القدر عقب سورة العلق مع أنها أقلّ عدَد آياتتٍ من سورة البينة وسُورٍ بعدها ، كأنه إماء إلى أن الضمير في { أنزلناه } يعود إلى القرآن الذي ابتدىء نزوله بسورة العلق .ويجوز أن يكون الضمير عائداً على المقدار الذي أنزل في تلك الليلة وهو الآياتُ الخمسُ من سورة العلق فإن كل جزء من القرآن يسمى قرآناً ، وعلى كلا الوجهين فالتعبير بالمضي في فعل { أنزلناه } لا مجاز فيه . وقيل : أطلق ضمير القرآن على بعضه مجازاً بعلاقة البعضية .والآية صريحة في أن الآيات الأوَل من القرآن نزلت ليلاً وهو الذي يقتضيه حديث بَدْء الوحي في «الصحيحين» لقول عائشة فيه : «فكان يتحنث في غار حراء اللياليَ ذواتتِ العَدَد» فكان تعبده ليلاً ، ويظهر أن يكون الملك قد نزل عليه أثر فراغه من تعبده ، وأما قول عائشة : «فرجع بها رسول الله يرجف فُؤاده» فمعناه أنه خرج من غار حراء إثر الفجر بعد انقضاء تلقينه الآيات الخمس إذ يكون نزولها عليه في آخر تلك الليلة وذلك أفضل أوقات الليل كما قال تعالى : { والمستغفرين بالأسحار } \\[ آل عمران : 17 \\] .وليلة القدر : اسم جعله الله للَّيلة التي ابتدىء فيها نزول القرآن . ويظهر أن أول تسميتها بهذا الاسم كان في هذه الآية ولم تكن معروفة عند المسلمين وبذلك يكون ذكرها بهذا الاسم تشويقاً لمعرفتها ولذلك عقب بقوله :{ وما أدراك ما ليلة القدر } \\[ القدر : 2 \\] .والقَدْر الذي عُرفت الليلة بالإضافة إليه هو بمعنى الشرففِ والفضل كما قال تعالى في سورة الدخان ( 3 ) : { إنا أنزلناه في ليلة مباركة } أي ليلة القدر والشرف عند الله تعالى مما أعطاها من البركة فتلك ليلة جعل الله لها شرفاً فجعلها مظهراً لما سبق به علمه فجعلها مبدأ الوحي إلى النبي .والتعريف في القدر } تعريف الجنس . ولم يقل : في ليلةِ قدرٍ ، بالتنكير لأنه قُصد جعل هذا المركب بمنزلة العلَم لتلك الليلة كالعلَم بالغلبة ، لأن تعريف المضاف إليه باللام مع تعريف المضاف بالإِضافة أوْغَلُ في جعل ذلك المركب لَقَباً لاجتماع تعريفين فيه .وقد ثبت أن ابتداء نزول القرآن كان في شهر رمضان قال تعالى : { شهر رمضان الذي أنزل فيه القرآن هدى للناس وبينات من الهدى والفرقان } \\[ البقرة : 185 \\] . ولا شك أن المسلمين كانوا يعلمون ذلك إذ كان نزول هذه السورة قبل نزول سورة البقرة بسنين إن كانت السورة مكية أو بمُدة أقل من ذلك إن كانت السورة مدنية ، فليلة القدر المرادة هنا كانت في رمضان وتأيد ذلك بالأخبار الصحيحة من كونها من ليالي رمضان في كل سنة .وأكثر الروايات أن الليلة التي أنزل فيها القرآن على النبي صلى الله عليه وسلم كانت ليلةَ سَبْع عشرة من رمضان . وسيأتي في تفسير الآيات عقب هذه الكلامُ في هل ليلة ذات عدد متماثل في جميع الأعوام أو تختلف في السنين؟ وفي هل تقع في واحدة من جميع ليالي رمضان أو لا تخرج عن العشر الأواخر منه؟ وهل هي مخصوصة بليلة وترٍ كما كانت أول مرّة أوْ لا تختص بذلك؟والمقصود من تشريف الليلة التي كان ابتداء إنزال القرآن فيها تشريف آخر للقرآن بتشريف زمان ظهوره ، تنبيهاً على أنه تعالى اختار لابتداء إنزاله وقتاً شريفاً مباركاً لأن عظم قدر الفعل يقتضي أن يُختار لإِيقاعه فَضْل الأوقات والأمكنة ، فاختيار فضللِ الأوقات لابتداء إنزاله ينبىء عن علوّ قدره عند الله تعالى كقوله : { لا يمسه إلا المطهرون } \\[ الواقعة : 79 \\] على الوجهين في المراد من المطهرين .\n\n",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Lo! We revealed it): '(Lo! We revealed it) He says: We sent Gabriel with the entire Qur'an to the scribes of the nether heaven (on the Night of Power) on the night of judgement and decree; it is also said this means: on a night blessed with forgiveness and mercy, and then it was revealed to the Prophet (pbuh) in instalments.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nعن أبي خالد عن زيد بن عليهما السّلام في قولهِ تعالى: { إِنَّا أَنزَلْنَاهُ فِي لَيْلَةِ ٱلْقَدْرِ } معناه في ليلةِ الحُكمِ\n\n",
      "translations": [
        {
          "translation": "\n\nThis refers to the verse in the Quran where it says \"We have sent it down on the Night of Power.\" The Night of Power refers to the night when judgement is passed.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّا أنزلناه في ليلة القدر } ليلة القدر هي البنية المحمدية حال احتجابه عليه السلام في مقام القلب بعد الشهود الذاتي لان الإنزال لا يمكن إلا في هذه البنية في هذه الحالة\n والقدر هو خطره عليه السلام وشرفه إذ لا يظهر قدره ولا يعرفه هو إلا فيها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّا } من مقام عظيم لطفنا وجودنا لعموم عبادنا { أَنزَلْنَاهُ } أي: القرآن المبيِّن لهم طريق النجاة من نيران الجهالات { فِي لَيْلَةِ ٱلْقَدْرِ } [القدر: 1] الغيبي التي لا إطلاع لأحد عليها إلاَّ لعلام الغيوب\n\n\nلذلك أبهم سبحانه على حبيبه صلى الله عليه وسلم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِنَّا أنزلناه في ليلة القدر } \n نوّه بشأن القرآن\n حيث أسند إنزاله إليه بإسناده إلى نون العظمة\n المنبىء عن كمال العناية به\n وجاء بضميره دون اسمه الظاهر للإيذان بغاية ظهوره\n كأنه حاضر في جميع الأذهان\n وقيل: يعود على المقروء المأمور به في قوله:\n[العلق:1] فتتصل السورة بما قبلها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "97:2",
      "similarity": 0.500541741477815
    },
    {
      "verse": "73:2",
      "similarity": 0.4542143521283477
    },
    {
      "verse": "77:22",
      "similarity": 0.44475125383974096
    },
    {
      "verse": "71:5",
      "similarity": 0.44409681825415276
    },
    {
      "verse": "87:3",
      "similarity": 0.4186770626462631
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/097001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/097001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/97:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}