{
  "chapter": "القدر",
  "text": "تنزل الملئكة والروح فيها باذن ربهم من كل امر",
  "translations": [
    {
      "translation": "In it the angels and the Ruh descend by their Lord's authority with every ordinance.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On (this night) the angels and grace descend by the dispensation of their Lord, for settling all affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels along with the Spirit descend in it by the permission of their Lord with all kinds of decrees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On this Night, the angels and the spirit descend by the permission of their Lord with His decree (to determine everyone's destiny).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In it descend the angels and Jibreel, by the command of their Lord – for all works.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein descend the angels and the Ruh by their Lord's permission with every matter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and Jibreel descend in it by the permission of their Lord for every affair,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in it the angels and the Spirit descend, by the leave of their Lord, upon every command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and the Spirit descend therein, by the permission of their Lord, with all decrees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on that night, the angels and the Spirit come down by the permission of their Lord with His decrees for all matters;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and the spirit descend therein by the command of their Lord with His decrees for every affair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In it the angels and the Spirit descend, by the leave of their Lord, with every command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein come down the angels and the Spirit by Allah's permission, on every errand:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein descend the angels and the Ruh [Jibrael (Gabriel)] by Allah's Permission with all Decrees,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in it the angels and the Spirit (Gabriel) descend by the permission of their Lord upon every command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In it descend the angels and the Spirit, by the leave of their Lord, with every command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and the Spirit descend therein by permission of their Lord for every matter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[97:4] The angels and the Spirit, namely, Gabriel, descend (tanazzalu: one of the two original tā’ letters [of tatanazzalu] has been omitted) in it, on that night, by the leave of their Lord, by His command, with every command, that God has decreed from that year to the following one (min is causative functioning as bi, ‘with’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The angels and the Spirit) Gabriel with them (descend therein) at the beginning of the Night of Power, (by the permission of their Lord) by the command of their Lord, (with all decrees.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تَنَزَّلُ ٱلْمَلاَئِكَةُ وَٱلرُّوحُ فِيهَا } معناه جبريلُ عليهِ السّلامُ\n\n\n\n\nوقوله تعالى: { مِّن كُلِّ أَمْرٍ سَلاَمٌ } معناه يَسلم من كُلِّ أمرٍ\n معناه من كُلِّ مَلكٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"The angels and the Spirit descend in it,\" means that Gabriel, peace be upon him, descends in it.\n\n\nAnd His saying, \"There is peace in every matter,\" means that He is free from every matter.\n The meaning of every kingdom",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nوالألف هو العدد التام الذي لا كثرة فوقه إلا بالتكرار والإضافة\n فيكنى به عن الكل\n أي: هذا الشخص وحده خير من كل الأنواع\n ثم بيّن وجه تفضيله وسبب خيريته فقال: { تنزّل الملائكة والروح فيها بإذن ربّهم } أي: القوة الروحانية والنفسانية بل الملكوت السماوية والأرضية والروح { من كل أمر } أي: من جهة كل أمر هو معرفة جميع الأشياء ووجوداتها وذواتها وصفاتها وخواصها وأحكامها وأحوالها وتدبيرها وتسخيرها\n { سلام هي } سلام عن جميع النقائص والعيوب { حتى } وقت طلوع فجر الشمس الطالعة من مغربها وقرب الموت\n فحيئنذ لا تكون سلامة أي سالمة أو سلام في نفسها لكثرة السلام عليها من الله والملائكة والناس أجمعين",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { تَنَزَّلُ ٱلْمَلاَئِكَةُ } أي: سكان سواد الأعظم اللاهوتي { وَٱلرُّوحُ } الأمين\n المدبِّر لأمور أشباح عالم الناسوت { فِيهَا } أي: من تلك الليلة\n ونزولهم فيها إنما هو { بِإِذْنِ رَبِّهِم } يأمرهم بالنزول فيها\n ومع كل منهم { مِّن كُلِّ أَمْرٍ } [القدر: 4] من الأمور الجارية في عالم الشهاة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { تَنزَّلُ الملائكةُ والروحُ فيها } \n والروح إمّا جبريل عليه السلام\n أو خلق من الملائكة لا تراهم الملائكة إلاّ تلك الليلة\n أو الرحمة\n والمراد بتنزلهم: نزولهم إلى الأرض يُسلمون على الناس ويؤمِّنون على دعائهم\n كما في الأثر\n\nوقيل: إلى سماء الدنيا\n وقوله: { بإِذنِ ربهم } يتعلق بـ \" تنزلُ \" \n أو بمحذوف هو حال من فاعله\n أي: ملتبسين بأمر ربهم\n أو: ينزلون بإذنه\n { من كل أمرٍ } أي: من أجل كل أمر قضاه الله تعالى لتلك السنة إلى قابل\n رُوي أنَّ الله تعالى يُعْلِم الملائكة بكل ما يكون في ذلك العام كله\n وقيل: يَبرز ذلك مِن علم الغيب ليلة النصف من شعبان\n ويُعْطَى الملائكةً ليلة القدر\n فلما كان أهم نزولهم هذا الأمر جعل نزولهم لأجله\n فلا ينافي كون نزولهم للتسليم على الناس والتأمين\n كما قال تعالى: { سلامٌ هيَ } أي: ما هي إلاَّ سلام على المؤمنين\n جعلها نفس السلام لكثرة ما يُسلِّمون على الناس\n فقد رُوي أنهم يُسلِّمومن على كل قائم وقاعد وقارىء ومُصَلِّ\n أو: ما هي إلاِّ سلامة\n أي: لا يُقَدِّر الله تعالى فيها إلاّ السلامة والخير\n وأمّا في غيرها فيقضي سلامةً وبلاء وقال ابن عباس: قوله: هي إشارة إلى أنها ليلة سبع وعشرين لأنّ هذه الكلمة هي السابعة والعشرون من كلمات السورة\n ثم ذكر غايتها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:193",
      "similarity": 0.6350221326291233
    },
    {
      "verse": "16:2",
      "similarity": 0.6253955499008514
    },
    {
      "verse": "17:85",
      "similarity": 0.4825479245964684
    },
    {
      "verse": "56:89",
      "similarity": 0.4711780789430497
    },
    {
      "verse": "84:2",
      "similarity": 0.3747183994353217
    }
  ]
}