{
  "chapter": "القدر",
  "text": "تنزل الملئكة والروح فيها باذن ربهم من كل امر",
  "translations": [
    {
      "translation": "In it the angels and the Ruh descend by their Lord's authority with every ordinance.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On (this night) the angels and grace descend by the dispensation of their Lord, for settling all affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels along with the Spirit descend in it by the permission of their Lord with all kinds of decrees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On this Night, the angels and the spirit descend by the permission of their Lord with His decree (to determine everyone's destiny).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In it descend the angels and Jibreel, by the command of their Lord – for all works.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein descend the angels and the Ruh by their Lord's permission with every matter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and Jibreel descend in it by the permission of their Lord for every affair,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in it the angels and the Spirit descend, by the leave of their Lord, upon every command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and the Spirit descend therein, by the permission of their Lord, with all decrees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on that night, the angels and the Spirit come down by the permission of their Lord with His decrees for all matters;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and the spirit descend therein by the command of their Lord with His decrees for every affair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In it the angels and the Spirit descend, by the leave of their Lord, with every command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein come down the angels and the Spirit by Allah's permission, on every errand:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein descend the angels and the Ruh [Jibrael (Gabriel)] by Allah's Permission with all Decrees,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in it the angels and the Spirit (Gabriel) descend by the permission of their Lord upon every command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In it descend the angels and the Spirit, by the leave of their Lord, with every command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and the Spirit descend therein by permission of their Lord for every matter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[97:4] The angels and the Spirit, namely, Gabriel, descend (tanazzalu: one of the two original tā’ letters [of tatanazzalu] has been omitted) in it, on that night, by the leave of their Lord, by His command, with every command, that God has decreed from that year to the following one (min is causative functioning as bi, ‘with’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِمْ مِنْ كُلِّ أَمْرٍ (4) إذا ضُم هذا البيان الثاني لما في قوله : { وما أدراك ما ليلة القدر } \\[ القدر : 2 \\] من الإِبهام التفخيمي حصل منهما ما يدل دلالةً بيّنة على أن الله جعل مثل هذه الفضيلة لكل ليلة من ليالي الأعوام تقع في مثل الليلة من شهر نزول القرآن كرامةً للقرآن ، ولمن أنزل عليه ، وللدِّين الذي نزل فيه ، وللأمة التي تتبعه ، ألا ترى أن معظم السورة كان لذكر فضائل ليلة القدر فما هو إلا للتحريض على تطلب العمل الصالح فيها ، فإن كونها خيراً من ألف شهر أومأ إلى ذلك وبينته الأخبار الصحيحة . والتعبير بالفعل المضارع في قوله : { تنزل الملائكة } مؤذن بأن هذا التنزل متكرر في المستقبل بعد نزول هذه السورة .وذِكر نهايتها بطلوع الفجر لا أثرَ له في بيان فضلها فتعين أنه إدماج للتعريف بمنتهاهَا ليحرص الناسُ على كثرة العمل فيها قبل انتهائها .لا جرم أن ليلة القدر التي ابتدىء فيها نزول القرآن قد انقضت قبل أن يشعر بها أحد عدا محمد صلى الله عليه وسلم إذْ كان قد تحنث فيها ، وأنزل عليه أول القرآن آخرها ، وانقلب إلى أهله في صبيحتها ، فلولا إرادة التعريف بفضل الليالي الموافقة لها في كل السنوات لاقتُصر على بيان فضل تلك الليلة الأولى ولما كانت حاجة إلى تَنزّل الملائكة فيها ، ولا إلى تعيين منتهاها .وهذا تعليم للمسلمين أن يَعظموا أيام فضلهم الديني وأيام نَعم الله عليهم ، وهو مماثل لما شرع الله لموسى من تفضيل بعض أيام السنين التي توافق أياماً حصلت فيها نعم عظمى من الله على موسى قال تعالى : { وذكرهم بأيام اللَّه } \\[ إبراهيم : 5 \\] فينبغي أن تعد ليلة القدر عيد نزول القرآن .وحكمة إخفاء تعيينها إرادةُ أن يكرر المسلمون حسناتهم في ليال كثيرة توخياً لمصادفة ليلة القدر كما أخفيت ساعةُ الإِجابة يوم الجمعة .هذا محصّل ما أفاده القرآن في فضل ليلة القدر من كل عام ولم يبين أنها أيَّةُ ليلة ، ولا من أي شهر ، وقد قال تعالى : { شهر رمضان الذي أنزل فيه القرآن } \\[ البقرة : 185 \\] فتبين أن ليلة القدر الأولى هي من ليالي شهر رمضان لا محالة ، فبنا أن نتطلب تعيين ليلة القدر الأولى التي ابتدِىء إنزال القرآن فيها لنطلب تعيين ما يماثلها من ليالي رمضان في جميع السّنين ، وتعيين صفة المماثلة ، والمماثلةُ تكون في صفات مختلفة فلا جائز أن تُماثلها في اسم يومها نحو الثلاثاء أو الأربعاء ، ولا في الفصل من شتاءٍ أو صيف أو نحو ذلك مما ليس من الأحوال المعتبرة في الدين ، فعلينا أن نتطلب جهة من جهات المماثلة لها في اعتبار الدين وما يرضي الله . وقد اختُلف في تعيين المماثلة اختلافاً كثيراً وأصح ما يعتمد في ذلك : أنها من ليالي شهر رمضان من كل سنة وأنها من ليالي الوتر كما دل عليه الحديث الصحيح :« تحروا ليلة القدر في الوتر في العشر الأواخر من رمضان » .والوتر : أفضل الأعداد عند الله كما دل عليه حديث : « إن الله وِتر يحب الوتر » .وأنّها ليست ليلة معينة مطّردة في كل السنين بل هي متنقلة في الأعوام ، وأنها في رمضان وإلى هذا ذهب مالك والشافعي وأحمد وأكثر أهل العلم قال ابن رشيد : وهو أصح الأقاويل وأوْلاها بالصواب . وعلَى أنها متنقلة في الأعوام فأكثر أهل العلم على أنها لا تخرج عن شهر رمضان . والجمهور على أنها لا تخرج عن العشر الأواخر منه ، وقال جماعة : لا تخرج عن العَشْر الأوَاسط ، والعَشْر الأواخر .وتأوّلوا ما ورد من الآثار ضبطها على إرادة الغالب أو إرادة عام بعينه .ولم يرد في تعيينها شيء صريح يُروى عن النبي صلى الله عليه وسلم لأن ما ورد في ذلك من الأخبار محتمل لأن يكون أراد به تعيينها في خصوص السنة التي أخبر عنها وذلك مبسوط في كتب السنة فلا نطيل به ، وقد أتى ابن كثير منه بكثير .وحفظت عن الشيخ محي الدين بن العربي أنه ضبط تعيينها باختلاف السنين بأبيات ذكر في البيت الأخير منها قوله: ... وضابطها بالقول ليلة جمعةٍتوافيك بعد النصفْ في ليلة وتر ... حفظناها عن بعض مُعلمينا ولم أقف عليها . وجربنا علامة ضوء الشمس في صبيحتها فلم تتخلف .وأصل { تنزل } تتنزل فحذفت إحدى التاءَيْن اختصاراً . وظاهر أن تنزل الملائكة إلى الأرض .ونزول الملائكة إلى الأرض لأجل البركات التي تحفهم .و { الروح } : هو جبريل ، أي ينزل جبريل في الملائكة .ومعنى { بإذن ربهم } أن هذا التنزل كرامة أكْرم الله بها المسلمين بأن أنزل لهم في تلك الليلة جماعات من ملائكته وفيهم أشرفهم وكان نزول جبريل في تلك الليلة ليعود عليها من الفضل مثل الذي حصل في مماثلتها الأولى ليلة نزوله بالوحي في غار حِراء .وفي هذا أصل لإِقامة المواكب لإِحياء ذكرى أيام مجد الإِسلام وفضله وأن من كان له عمل في أصل تلك الذكرى ينبغي أن لا يخلو عنه موكب البهجة بتذكارها .وقوله : { بإذن ربهم } متعلق ب { تنزل } إما بمعنى السببية ، أي يتنزلون بسبب إذن ربهم لهم في النزول فالإِذن بمعنى المصدر ، وإما بمعنى المصاحبة ، أي مصاحبين لما أذِن به ربهم ، فالإِذن بمعنى المأذون به من إطلاق المصدر على المفعول نحو : { هذا خَلْق الله } \\[ لقمان : 11 \\] .و { مِن } في قوله { من كل أمر } يجوز أن تكون بيانية تبين الإِذن من قوله : { بإذن ربهم } ، أي بإذن ربهم الذي هو في كل أمر .ويجوز أن تكون بمعنى الباء ، أي تتنزل بكل أمر مِثل ما في قوله تعالى : { يحفظونه من أمر اللَّه }\\[ الرعد : 11 \\] أي بأمر الله ، وهذا إذا جعلت باء { بإذن ربهم } سببية ، ويجوز أن تكون للتعليل ، أي من أجل كل أمر أراد الله قضاءه بتسخيرهم .و { كل } مستعملة في معنى الكثرة للأهمية ، أي في أمور كثيرة عظيمة كقوله تعالى : { ولو جاءتهم كل آية } \\[ يونس : 97 \\] وقوله : { يأتوك رجالاً وعلى كل ضامر } \\[ الحج : 27 \\] وقوله : { واضربوا منهم كل بنان } \\[ الأنفال : 12 \\] . وقول النابغة: ... بها كلَّ ذيَّال وخنساءَ تَرْعويإلى كل رَجَّاف من الرمل فارد ... وقد بينا ذلك عند قوله تعالى : { وعلى كل ضامر } في سورة الحج ( 27 ) .وتنوين أمر } للتعظيم ، أي بأنواع الثواب على الأعمال في تلك الليلة . وهذا الأمر غير الأمر الذي في قوله تعالى : { فيها يفرق كل أمر حكيم } \\[ الدخان : 4 \\] مع أن { أمراً من عندنا } في سورة الدخان ( 5 ) متحدة مع اختلاف شؤونها ، فإن لها شؤوناً عديدة .ويجوز أن يكون هو الأمر المذكور هنا فيكون هنا مطلقاً وفي آية الدخان مقيداً .واعلم أن موقع قوله : تنزل الملائكة والروح فيها } إلى قوله : { من كل أمر } ، من جملة : { ليلة القدر خير من ألف شهر } \\[ القدر : 3 \\] موقع الاستئناف البياني أو موقع بدل الاشتمال فلمراعاة هذا الموقع فصلت الجملة عن التي قبلها ولم تعطف عليها مع أنهما مشتركتان في كون كل واحدة منهما تفيد بياناً لجملة : { وما أدراك ما ليلة القدر } \\[ القدر : 2 \\] ، فأوثرت مراعاةُ موقعها الاستئنافي أو البدلي على مراعاة اشتراكهما في كونها بياناً لجملة : { وما أدراك ما ليلة القدر } لأن هذا البيان لا يفوت السامع عند إيرادها في صورة البيان أو البدل بخلاف ما لو عطفت على التي قبلها بالواو لفوات الإِشارة إلى أن تنزل الملائكة فيها من أحوال خيريتها .\n\n",
      "translations": [
        {
          "translation": "(The angels and the Spirit) Gabriel with them (descend therein) at the beginning of the Night of Power, (by the permission of their Lord) by the command of their Lord, (with all decrees.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تَنَزَّلُ ٱلْمَلاَئِكَةُ وَٱلرُّوحُ فِيهَا } معناه جبريلُ عليهِ السّلامُ\n\n\n\n\nوقوله تعالى: { مِّن كُلِّ أَمْرٍ سَلاَمٌ } معناه يَسلم من كُلِّ أمرٍ\n معناه من كُلِّ مَلكٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"The angels and the Spirit descend in it,\" means that Gabriel, peace be upon him, descends in it.\n\n\nAnd His saying, \"There is peace in every matter,\" means that He is free from every matter.\n The meaning of every kingdom",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nوالألف هو العدد التام الذي لا كثرة فوقه إلا بالتكرار والإضافة\n فيكنى به عن الكل\n أي: هذا الشخص وحده خير من كل الأنواع\n ثم بيّن وجه تفضيله وسبب خيريته فقال: { تنزّل الملائكة والروح فيها بإذن ربّهم } أي: القوة الروحانية والنفسانية بل الملكوت السماوية والأرضية والروح { من كل أمر } أي: من جهة كل أمر هو معرفة جميع الأشياء ووجوداتها وذواتها وصفاتها وخواصها وأحكامها وأحوالها وتدبيرها وتسخيرها\n { سلام هي } سلام عن جميع النقائص والعيوب { حتى } وقت طلوع فجر الشمس الطالعة من مغربها وقرب الموت\n فحيئنذ لا تكون سلامة أي سالمة أو سلام في نفسها لكثرة السلام عليها من الله والملائكة والناس أجمعين",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { تَنَزَّلُ ٱلْمَلاَئِكَةُ } أي: سكان سواد الأعظم اللاهوتي { وَٱلرُّوحُ } الأمين\n المدبِّر لأمور أشباح عالم الناسوت { فِيهَا } أي: من تلك الليلة\n ونزولهم فيها إنما هو { بِإِذْنِ رَبِّهِم } يأمرهم بالنزول فيها\n ومع كل منهم { مِّن كُلِّ أَمْرٍ } [القدر: 4] من الأمور الجارية في عالم الشهاة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { تَنزَّلُ الملائكةُ والروحُ فيها } \n والروح إمّا جبريل عليه السلام\n أو خلق من الملائكة لا تراهم الملائكة إلاّ تلك الليلة\n أو الرحمة\n والمراد بتنزلهم: نزولهم إلى الأرض يُسلمون على الناس ويؤمِّنون على دعائهم\n كما في الأثر\n\nوقيل: إلى سماء الدنيا\n وقوله: { بإِذنِ ربهم } يتعلق بـ \" تنزلُ \" \n أو بمحذوف هو حال من فاعله\n أي: ملتبسين بأمر ربهم\n أو: ينزلون بإذنه\n { من كل أمرٍ } أي: من أجل كل أمر قضاه الله تعالى لتلك السنة إلى قابل\n رُوي أنَّ الله تعالى يُعْلِم الملائكة بكل ما يكون في ذلك العام كله\n وقيل: يَبرز ذلك مِن علم الغيب ليلة النصف من شعبان\n ويُعْطَى الملائكةً ليلة القدر\n فلما كان أهم نزولهم هذا الأمر جعل نزولهم لأجله\n فلا ينافي كون نزولهم للتسليم على الناس والتأمين\n كما قال تعالى: { سلامٌ هيَ } أي: ما هي إلاَّ سلام على المؤمنين\n جعلها نفس السلام لكثرة ما يُسلِّمون على الناس\n فقد رُوي أنهم يُسلِّمومن على كل قائم وقاعد وقارىء ومُصَلِّ\n أو: ما هي إلاِّ سلامة\n أي: لا يُقَدِّر الله تعالى فيها إلاّ السلامة والخير\n وأمّا في غيرها فيقضي سلامةً وبلاء وقال ابن عباس: قوله: هي إشارة إلى أنها ليلة سبع وعشرين لأنّ هذه الكلمة هي السابعة والعشرون من كلمات السورة\n ثم ذكر غايتها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:193",
      "similarity": 0.6350221326291233
    },
    {
      "verse": "16:2",
      "similarity": 0.6253955499008514
    },
    {
      "verse": "17:85",
      "similarity": 0.4825479245964684
    },
    {
      "verse": "56:89",
      "similarity": 0.4711780789430497
    },
    {
      "verse": "84:2",
      "similarity": 0.3747183994353217
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/097004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/097004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/97:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}