{
  "chapter": "البينة",
  "text": "لم يكن الذين كفروا۟ من اهل الكتب والمشركين منفكين حتى تاتيهم البينة",
  "translations": [
    {
      "translation": "The People of the Book who are kafir and the mushrikun would not be cut off until the Clear Sign came to them:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "THOSE AMONG THE people of the Book who disbelieve, and the idolaters, would not have been freed (from false beliefs) until the clear proof came to them --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved – be they from the People of the Book or from those who associated others with Allah in His Divinity – will not desist from unbelief until the Clear Proof should come to them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The disbelievers among the People of the Book and the pagans disbelieved (in Islam) only after receiving divine testimony:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The disbelieving People of the Book(s) and the polytheists would not have left their religion until the clear proof came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve from among the People of the Scripture and the idolators, were not going to leave until there came to them the Bayyinah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved from among the followers of the Book and the polytheists could not have separated (from the faithful) until there had come to them the clear evidence:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers of the People of the Book and the idolaters would never leave off; till the Clear Sign came to them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve among the People of the Scripture and the idolaters could not have left off (erring) till the clear proof came unto them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The deniers of truth from among the People of the Book and the polytheists would not desist from disbelief until they received clear evidence --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved from among the People of the Book and the associaters could not break off, until there had come Unto them the evidence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithless from among the People of the Book and the polytheists were not set apart [from the community of the faithful] until the proof had come to them:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject (Truth), among the People of the Book and among the Polytheists, were not going to depart (from their ways) until there should come to them Clear Evidence,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve from among the people of the Scripture (Jews and Christians) and among Al-Mushrikun, were not going to leave (their disbelief) until there came to them clear evidence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers among the People of the Book and the idolaters would never desist until the Clear Proof came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved among the People of the Scripture, and the Polytheists, were not apart, until the Clear Evidence came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved among the People of the Scripture and the polytheists were not to be parted [from misbelief] until there came to them clear evidence -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[98:1] The disbelievers from among (min: explicative) the People of the Scripture and the idolaters, that is, the idol-worshippers (wa’l-mushrikīna is a supplement to ahl, ‘the People of’) were not going to leave off (munfakkīna is the predicate of yakun, ‘were’), that is to say, they were not going to abandon their ways, until the clear proof, namely, Muhammad (s), should come to them, that is, [until] it came to them;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Those who disbelieve among the People of the Scripture): '(Those who disbelieve among the People of the Scripture) i.e. the Jews and Christians (and the idolaters) the Arab idolaters (could not have left off (erring)) could not have remained in their denial of Muhammad (pbuh) the Qur'an and Islam (till the clear proof came unto them) until clarification of what is in their Scriptures, the Scriptures of the Jews and Christians, came to them. There is another way of understanding the above: those who disbelieve among the people of the Scripture, before the advent Muhammad (pbuh) such as 'Abdullah Ibn Salam and his followers, and those who ascribed partners to Allah before the advent of Muhammad (pbuh) such as Abu Bakr and his fellow Arabs, would not have desisted from their disbelief and idolatry until the clear proof came to them, i.e. until Muhammad (pbuh) came to them. 766\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nعن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { مُنفَكِّينَ } معناه زائلونَ عما هُم عَليهِ مُنتهونَ عَنهُ\n\n",
      "translations": [
        {
          "translation": "\n\nThis is a saying of Abu Khalid, from Zayd ibn Ali, peace be upon them, concerning the words of the Almighty {those who are driven out}: meaning those who are driven away from what they are holding onto.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ لم يكن الذين كفروا } أي حجبوا إما عن الدين وطريق الوصول إلى الحق كأهل الكتاب وإما عن الحق أيضاً كالمشركين { منفكين } عما هم فيه من الضلالة { حتى تأتيهم البينة } أي: الحجة الواضحة الموصلة إلى المطلوب وذلك أن الفرق المختلفة المحتجبة بأهوائهم وضلالاتهم من اليهود والنصارى والمشركين كانوا يتخاصمون ويتعاندون ويدعي كل حزب حقية ما عليه ويدعو صاحبه إليه وينسب دينه إلى الباطل، ثم يتفقون على أنّا لا ننفك عما نحن فيه حتى يخرج النبي الموعود في الكتابين المأمور باتباعه فيهما فنتبعه ونتفق على الحق على كلمة واحدة كما عليه الآن بعينه حال هؤلاء المتعصبين من أهل المذاهب المتفرّقة وانتظارهم خروج المهدي في آخر الزمان ووعدهم على اتباعه متفقين على كلمة واحدة. ولا أحسب حالهم إلا مثل حال أولئك إذا خرج، أعاذنا الله من ذلك، فحكى الله قولهم وبين أنهم ما تفرّقوا تفرّقاً قوياً وما اشتدّ اختلافهم وتعاندهم إلا من بعدما جاءتهم البينة بخروجه لأن كل فرقة، بل كل شخص، توهم أنه يوافق هواه ويصوّب رأيه لاحتجابه بدينه، فلما ظهر خلاف ذلك ازداد كفره وعناده واشتدّت شكيمته وضغينته.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَمْ يَكُنِ ٱلَّذِينَ كَفَرُواْ مِنْ أَهْلِ ٱلْكِتَابِ } يعني: اليهود والنصارى { وَٱلْمُشْرِكِينَ } أي: عبدة الأوثان { مُنفَكِّينَ } أي: لم يكونوا زائلين منفصلين في حين من الأحيان عن الإيمان والاعتقاد بنبوة محمد صلى الله عليه وسلم\n إذ أهل الكتاب آمنوا بنبوته بمقتضى ما وجدوا في كتبهم\n والمشركون سمعوا من أسلافهم وصفه ونبوته واعتقدوا بعثته\n فآمنوا له\n ولم يزالوا على هذا الاعتقاد { حَتَّىٰ تَأْتِيَهُمُ ٱلْبَيِّنَةُ } [البينة: 1] على مقتضى سنة الله\n فظهرت الحجة الواضحة والبينة الموضحة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { لم يكن الذين كفروا } أي: بالرسول وبما أنزل عليه { من أهل الكتاب } اليهود والنصارى\n { والمشركين } عبَدة الأصنام { منفكِّين } منفصلين عن الكفر\n وحذف لأنَّ صلة \" الذين \" يدل عليه\n { حتى تأتِيَهم البَيِّنَةُ } الحجة الواضحة\n وهو النبيُّ صلى الله عليه وسلم\n يقول: لم يتركوا كفرهم حتى بُعث محمد صلى الله عليه وسلم\n فلمّا بُعِثَ أسلم بعض وثبت على الكفر بعض\n أو: لم يكونوا منفكين\n أي: زائلين عن دينهم حتى تأتيَهم البَينة ببطلان ما هم عليه\n فتقوم الحجة عليهم\n أو: لم يكونوا لينفصلوا عن الدنيا حتى بَعَثَ اللهُ محمداً فقامت عليهم الحجة\n وإلاّ لقالوا:\n[طه:134] الآية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "90:13",
      "similarity": 0.9190101998285983
    },
    {
      "verse": "98:6",
      "similarity": 0.06858831035339069
    },
    {
      "verse": "3:64",
      "similarity": 0.06626700619225191
    },
    {
      "verse": "59:11",
      "similarity": 0.05415136452761878
    },
    {
      "verse": "24:27",
      "similarity": 0.05282594152793835
    }
  ]
}