{
  "chapter": "البينة",
  "text": "وما تفرق الذين اوتوا۟ الكتب الا منۢ بعد ما جاءتهم البينة",
  "translations": [
    {
      "translation": "Those who were given the Book did not divide into sects until after the Clear Sign came to them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of the Book were not divided among themselves till after the clear proof had come to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor did those to whom the Book had been given split up until after the Proof (of the Right Way) had come to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor did the People of the Book disagreed among themselves until after receiving the ancient divine testaments.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor did the People of the Book(s) get divided until after the clear proof came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the People of the Scripture differed not until after there came to them the Bayyinah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who were given the Book did not become divided except after clear evidence had come to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they scattered not, those that were given the Book, excepting after the Clear Sign came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor were the People of the Scripture divided until after the clear proof came unto them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were given the Book did not become divided except after clear evidence was given to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who are vouchsafed the Book divided not save after there had come Unto them the evidence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were given the Book did not divide except after the proof had come to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor did the People of the Book make schisms, until after there came to them Clear Evidence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of the Scripture (Jews and Christians) differed not until after there came to them clear evidence. (i.e. Prophet Muhammad (Peace be upon him) and whatever was revealed to him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom the Book was given did not divide themselves until the Clear Proof came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were given the Scripture did not splinter, except after the Clear Evidence came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor did those who were given the Scripture become divided until after there had come to them clear evidence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[98:4] And those who were given the Scripture did not become divided, regarding belief in him [the Prophet] (s), except after the clear proof had come to them, namely, the Prophet (s) — or the Qur’ān which he brought as his miracle. Before his (s) arrival they had all agreed to believe in him when he would come; then those who disbelieved in him from among them became envious of him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nor were the People of the Scripture divided) those who were given the Torah, i.e. Ka'b Ibn al-Ashraf and his host, did not differ about Muhammad (pbuh) the Qur'an and Islam (until after the clear proof came unto them) until the clarification of what is in their Scripture regarding the traits and description of Muhammad (pbuh) came to them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { وَمَا تَفَرَّقَ } واختلف في الإنكار والاعتقاد، والإيمان والكفر { ٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ إِلاَّ مِن بَعْدِ مَا جَآءَتْهُمُ ٱلْبَيِّنَةُ } [البينة: 4] يعني: ما تفرقت تلك الأمم عما هم عليه من تصديق النبي الموعود إلاَّ من بعد ما ظهر الرسول الموعود، ولاحت البيِّنة الواضحة، الدالة على صدقه في نبوته ودعوته، ألاَ وهو القرآن المعجز المبيِّن لشعائر الإسلام\n\n\n\n\nوبالجملة: اختلفوا في نشأته صلى الله عليه وسلم وبعد بعثته، فمنهم من آمن له على مقتضى ما وجده في كتابه، ومنهم من كفر وأنكر عليه عناداً ومكابرةً؛ ولهذا حرَّف أوصافه المذكورة في الكتب السالفة مع أنهم لم يجدوا في دينه وكتابه ما يخالف أحكام كتبهم وأديانهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما تَفَرَّقَ الذين أُوتوا الكتاب إِلاَّ مِن بعد ما جاءتهم البينةٌ } أي: وما اختلفوا في نبوة محمد صلى الله عليه وسلم إلاَّ مِن بعد ما عَلِموا أنه حق، فمنهم مَن أنكر حسداً، ومنهم مَن آمن\n وإنّما أفرد أهل الكتاب بعدما جمع إولاً بينهم وبين المشركين لأنهم كانوا على علمٍ به لوجوده في كتبهم، فإذا وُصفوا بالتفرُّق عنه كان مَن لا كتاب له أدخل في هذا\n وقيل: المعنى: لم يكن الذين كفروا من أهل الكتاب والمشركين منفكين، أي: منفصلين عن معرفة نبوة محمد ـ عليه الصلاة والسلام ـ حتى بعثه الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:105",
      "similarity": 0.6247812913528525
    },
    {
      "verse": "77:4",
      "similarity": 0.603485410222287
    },
    {
      "verse": "3:100",
      "similarity": 0.5412857531200652
    },
    {
      "verse": "2:53",
      "similarity": 0.5369543119675453
    },
    {
      "verse": "24:47",
      "similarity": 0.5270403555297424
    }
  ]
}