{
  "chapter": "البينة",
  "text": "وما تفرق الذين اوتوا۟ الكتب الا منۢ بعد ما جاءتهم البينة",
  "translations": [
    {
      "translation": "Those who were given the Book did not divide into sects until after the Clear Sign came to them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of the Book were not divided among themselves till after the clear proof had come to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor did those to whom the Book had been given split up until after the Proof (of the Right Way) had come to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor did the People of the Book disagreed among themselves until after receiving the ancient divine testaments.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor did the People of the Book(s) get divided until after the clear proof came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the People of the Scripture differed not until after there came to them the Bayyinah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who were given the Book did not become divided except after clear evidence had come to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they scattered not, those that were given the Book, excepting after the Clear Sign came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor were the People of the Scripture divided until after the clear proof came unto them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were given the Book did not become divided except after clear evidence was given to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who are vouchsafed the Book divided not save after there had come Unto them the evidence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were given the Book did not divide except after the proof had come to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor did the People of the Book make schisms, until after there came to them Clear Evidence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of the Scripture (Jews and Christians) differed not until after there came to them clear evidence. (i.e. Prophet Muhammad (Peace be upon him) and whatever was revealed to him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom the Book was given did not divide themselves until the Clear Proof came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were given the Scripture did not splinter, except after the Clear Evidence came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor did those who were given the Scripture become divided until after there had come to them clear evidence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[98:4] And those who were given the Scripture did not become divided, regarding belief in him [the Prophet] (s), except after the clear proof had come to them, namely, the Prophet (s) — or the Qur’ān which he brought as his miracle. Before his (s) arrival they had all agreed to believe in him when he would come; then those who disbelieved in him from among them became envious of him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمَا تَفَرَّقَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِنْ بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَةُ (4)ارتقاء في الإِبطال وهو إبطال ثان لدعواهم بطريق النقض الجدلي المسمى بالمعارضة وهو تسليم الدليل والاستدلالُ لما ينافي ثبوت المدلول ، وهذا إبطال خاص بأهل الكتاب اليهود والنصارى ، ولذلك أظهر فاعل { تفرق } ولم يقل : وما تفرقوا إلا من بعد ما جاءتهم البينة ، إذ لو أضمر لتوُهِّمَت إرادة المشركين من جملة معاد الضمير ، بعد أن أبطل زعمهم بقوله : { رسول من الله يتلوا صحفاً مطهرة } \\[ البينة : 2 \\] ارتقى إلى إبطال مزاعمهم إبطالاً مشوباً بالتكذيب وبشهادة ما حصل في الأزمان الماضية .فيجوز أن تكون الواو للعطف عاطفة إبطالاً على إبطال ، ويجوز أن تكون واو الحال .والمعنى : كيف يزعمون أن تمسكهم بما هم عليه من الدين مغيّاً بوقت أن تأتيهم البينة والحال أنهم جاءتهم بينة من قبل ظهور الإِسلام وهي بينة عيسى عليه السلام فتفرقوا في الإِيمان به فنشأ من تفرقهم حدوث مِلتين اليهودية والنصرانية .والمراد بهذه البينة الثانية مجيء عيسى عليه السلام فإن الله أرسله كما وعدهم أنبياؤهم أمثالُ إلياسَ واليسع وأشعياء . وقد أجمع اليهود على النبي الموعود به تجديد الدين الحق وكانوا منتظرين المخلص ، فلما جاءهم عيسى كذبوه ، أي فلا يطمع في صدقهم فيما زعموا من انتظار البينة بعد عيسى وهم قد كذبوا ببينة عيسى ، فتبين أن الجحود والعناد شنشنة فيهم معروفة .والمراد بالتفرق : تفرق بني إسرائيل بين مكذّب لعيسى ومؤمن به وما آمن به إلا نفر قليل من اليهود .وجُعل التفرق كناية عن إنكار البينة لأن تفرقهم كان اختلافاً في تصديق بينة عيسى عليه السلام ، فاستعمل التفرق في صريحه وكنايته لقصد إدماج مَذَمتهم بالاختلاف بعد ظهور الحق كقوله : { وما اختلف الذين أوتوا الكتاب إلا من بعد ما جاءهم العلم بغياً بينهم } \\[ آل عمران : 19 \\] .فالتعريف في { البينة } المذكورة ثانياً يجوز أن يكون للعهد الذهني ، أو للمعهود بَيْن المتحدَّث عنهم ، وهي بينة أخرى غير الأولى وإعادتُها من إعادة النكرة نكرة مثلها إذ المعرف بلام العهد الذهني بمنزلة النكرة ، أو من إعادة المعرفة المعهودة معرفةً مثلها ، وعلى كلا الوجهين لا تكون المعادة عين التي قبلها .وقد أطبقت كلمات المفسرين على أن معنى قوله تعالى : { وما تفرق الذين أوتوا الكتاب إلا من بعد ما جاءتهم البينة } أنهم ما تفرقوا عن اتباع الإِسلام ، أي تباعدوا عنه إلا من بعد ما جاء محمد صلى الله عليه وسلم وهذا تأويل للفظ التفرق وهو صرف عن ظاهره بعيد فأشكل عليهم وجه تخصيص أهل الكتاب بالذكر مع أن التباعد عن الإِسلام حاصل منهم ومن المشركين ، وجعلوا المراد ب { البينة } الثانية عين المراد بالأولى وهي بينة محمد صلى الله عليه وسلم سوى أن الفخر ذكر كلمات تنبىء عن مخالفة المفسرين في محمل تفرق الذين أوتوا الكتاب فإنه بعد أن قرر المعنى بما يوافق كلام بقية المفسرين أتى بما يقتضي حمل التفرق على حقيقته ، وحمل البينة الثانية على معنى مغاير لمحمل { البينة } الأولى ، إذ قال : «المقصود من هذه الآية تسلية محمد صلى الله عليه وسلم أي لا يغمنّك تفرقهم فليس ذلك لقصور في الحجة بل لعنادهم فسلفهم هكذا كانوا لم يتفرقوا في السبب وعبادة العجل إلا بعد ما جاءتهم البينة ، فهي عادة قديمة لهم» ، وهو معارض لأول كلامه ، ولعله بدا له هذا الوجه وشغله عن تحريره شاغل وهذا مما تركه الفخر في المسودة .\n\n",
      "translations": [
        {
          "translation": "(Nor were the People of the Scripture divided) those who were given the Torah, i.e. Ka'b Ibn al-Ashraf and his host, did not differ about Muhammad (pbuh) the Qur'an and Islam (until after the clear proof came unto them) until the clarification of what is in their Scripture regarding the traits and description of Muhammad (pbuh) came to them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { وَمَا تَفَرَّقَ } واختلف في الإنكار والاعتقاد\n والإيمان والكفر { ٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ إِلاَّ مِن بَعْدِ مَا جَآءَتْهُمُ ٱلْبَيِّنَةُ } [البينة: 4] يعني: ما تفرقت تلك الأمم عما هم عليه من تصديق النبي الموعود إلاَّ من بعد ما ظهر الرسول الموعود\n ولاحت البيِّنة الواضحة\n الدالة على صدقه في نبوته ودعوته\n ألاَ وهو القرآن المعجز المبيِّن لشعائر الإسلام\n\n\nوبالجملة: اختلفوا في نشأته صلى الله عليه وسلم وبعد بعثته\n فمنهم من آمن له على مقتضى ما وجده في كتابه\n ومنهم من كفر وأنكر عليه عناداً ومكابرةً\n ولهذا حرَّف أوصافه المذكورة في الكتب السالفة مع أنهم لم يجدوا في دينه وكتابه ما يخالف أحكام كتبهم وأديانهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما تَفَرَّقَ الذين أُوتوا الكتاب إِلاَّ مِن بعد ما جاءتهم البينةٌ } أي: وما اختلفوا في نبوة محمد صلى الله عليه وسلم إلاَّ مِن بعد ما عَلِموا أنه حق\n فمنهم مَن أنكر حسداً\n ومنهم مَن آمن\n وإنّما أفرد أهل الكتاب بعدما جمع إولاً بينهم وبين المشركين لأنهم كانوا على علمٍ به لوجوده في كتبهم\n فإذا وُصفوا بالتفرُّق عنه كان مَن لا كتاب له أدخل في هذا\n وقيل: المعنى: لم يكن الذين كفروا من أهل الكتاب والمشركين منفكين\n أي: منفصلين عن معرفة نبوة محمد ـ عليه الصلاة والسلام ـ حتى بعثه الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:105",
      "similarity": 0.6247812913528525
    },
    {
      "verse": "77:4",
      "similarity": 0.603485410222287
    },
    {
      "verse": "3:100",
      "similarity": 0.5412857531200652
    },
    {
      "verse": "2:53",
      "similarity": 0.5369543119675453
    },
    {
      "verse": "24:47",
      "similarity": 0.5270403555297424
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/098004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/098004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/98:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}