{
  "chapter": "البينة",
  "text": "وما امروا۟ الا ليعبدوا۟ الله مخلصين له الدين حنفاء ويقيموا۟ الصلوة ويؤتوا۟ الزكوة وذلك دين القيمة",
  "translations": [
    {
      "translation": "They were only ordered to worship Allah, making their deen sincerely His as people of pure natural belief, and to establish salat and pay zakat - that is the deen of the correct.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were commanded only to serve God with all-exclusive faith in Him, to be upright, and to fulfil their devotional obligations, and to give zakat; for this is the even way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet all that they had been commanded was that they serve Allah, with utter sincerity, devoting themselves exclusively to Him, and that they establish Prayer and pay Zakah. That is the Right Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were only commanded to worship God, be uprightly devoted to His religion, steadfast in prayer and pay the zakat. This is truly the eternal religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they were ordered only to worship Allah, believing purely in Him – devoted solely (to Him), and to establish the prayer and to pay the obligatory charity – and this is the straight religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they were commanded not, but that they should worship Allah, making religion purely for Him alone, Hunafa', and that they perform Salah and give Zakah, and that is the right religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they were not enjoined anything except that they should serve Allah, being sincere to Him in obedience, upright, and keep up prayer and pay the poor-rate, and that is the right religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were commanded only to serve God, making the religion His sincerely, men of pure faith, and to perform the prayer, and pay the alms -- that is the religion of the True.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they are ordered naught else than to serve Allah, keeping religion pure for Him, as men by nature upright, and to establish worship and to pay the poor-due. That is true religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were commanded only to worship God, offering Him sincere devotion, to be sincere in their faith, to pray regularly; and to give alms, for that is the right religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they were commanded not but that they should worship Allah, keeping religion pure for him, as upright men, and that they should establish prayer and give the poor-rate, And that is the right religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Though they were not commanded except to worship Allah, dedicating their faith to Him as men of pure faith, and to maintain the prayer and pay the zakat. That is the upright religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have been commanded no more than this: To worship Allah, offering Him sincere devotion, being true (in faith); to establish regular prayer; and to practise regular charity; and that is the Religion Right and Straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they were commanded not, but that they should worship Allah, and worship none but Him Alone (abstaining from ascribing partners to Him), and perform As-Salat (Iqamat-as-Salat) and give Zakat: and that is the right religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they were ordered to worship Allah alone, making the Religion His sincerely, upright, and to establish their prayers and to pay the obligatory charity. That is indeed the Religion of Straightness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were commanded only to worship God, devoting their faith to Him alone, and to practice regular prayer, and to give alms. That is the upright religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they were not commanded except to worship Allah, [being] sincere to Him in religion, inclining to truth, and to establish prayer and to give zakah. And that is the correct religion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[98:5] And they were only commanded, in their Scripture, the Torah and the Gospel, to worship God (illā li-ya‘budū   means illā an ya‘budū, an having been omitted and the lām added) devoting religion purely to Him, [free] of any idolatry, as hanīfs, upright in [following] the religion of Abraham and the religion of Muhammad (s), when he would come — so how is it that they disbelieved in him?, and to establish prayer and pay the alms. That is the upright religion, the upright creed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they are ordered) in all the Scriptures (naught else than to serve Allah) nothing else but to profess Allah's divine Oneness, (keeping religion pure for Him) through the profession of Allah's divine Oneness, (as men by nature upright) as ones surrendered unto Him, (and to establish worship) and perform the five daily prayers after declaring their profession in Allah's divine Oneness (and to pay the poor-due) from their wealth after that. Allah then mentioned belief in Allah's divine Oneness, saying: (That) i.e. belief in Allah's divine Oneness (is true religion) the religion of truth, straight without any crookedness; it is also said that this means: that, i.e. belief in Allah's divine Oneness, is the religion of the angels; and it is also said this means: it is the religion of those who are by nature upright; and it is also said this means: the religion of Abraham.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَآ أُمِرُوۤاْ إِلاَّ لِيَعْبُدُواْ ٱللَّهَ مُخْلِصِينَ لَهُ ٱلدِّينَ حُنَفَآءَ } معناه مُسلمونَ\n ويقال: مُتَّبعون\n ويقال: حجاجٌ\n\n",
      "translations": [
        {
          "translation": " And His saying, {And they were not commanded except to worship Allah, being sincere to Him in religion}, its meaning is Muslims\n They are said to be followers.\n\n\nIt is said: \"The Hajj pilgrims.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } الحال أنهم { مَآ أُمِرُوۤاْ } في كتبهم { إِلاَّ لِيَعْبُدُواْ ٱللَّهَ } الواحد الأحد الصمد الحقيق بالحقيَّة والألوهية { مُخْلِصِينَ } مخصصين { لَهُ ٱلدِّينَ } والانقياد بلا اشتراك وإلحاد { حُنَفَآءَ } مائلين عن مطلق الأديان الباطلة { وَيُقِيمُواْ ٱلصَّلاَةَ } المكتوبة لهم في أوقاتها الموعودة المحفوظة { وَيُؤْتُواْ ٱلزَّكَاةَ } المصفية لأموالهم على وجهها { وَذَلِكَ } الذي أُمروا به في كتبهم هو { دِينُ ٱلقَيِّمَةِ } [البينة: 5] والملة المستقيمة التي ظهر عليه محمد صلى الله عليه وسلم\n بلا تغيير وانحراف فيه واختلاف\n وهم بالجملة: ما كفروا وأنكروا نبوته ورسالته صلى الله عليه وسلم إلاَّ عناداً ومكابرةً\n بلا مستند صحيح لا عقلي ولا نقلي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما أُمروا إِلاَّ ليعبدوا اللهَ } أي: ما أُمروا في التوراة والإنجيل إلاّ لأجل أن يعبدوا الله وحده من غير شرك ولا نفاق\n ولكنهم حرّفوا وبدّلوا\n وقيل: اللام بمعنى \" أن \" أي: إلاّ بأن يعبدوا الله { مخلصين له الدينَ } أي: جاعلين دينَهم خالصاً له تعالى\n أو: جاعلين أنفسهم خالصة له في الدين\n قال ابن جُزي: استدل المالكية بهذا على وجوب النية في الوضوء\n وهو بعيد لأنَّ الإخلاص هنا يُراد به التوحيد وترك الشرك\n أو ترك الرياء\n انظر كلامه\n وسيأتي بعضه في الإشارة\n { حنفاءَ } مائلين عن جميع العقائد الزائغة إلى الإسلام\n { ويُقيموا الصلاةَ ويُؤتوا الزكاةَ } إن أريد بهما ما في شريعتهم من الصلاة والزكاة\n فالأمر ظاهر\n وإن أريد ما في شريعتنا فمعنى أمرهم بهما في الكتابين أمرهم بالدخول في شريعتنا\n { وذلك دِينُ القيِّمة } أي: الملة المستقيمة\n\nوالإشارة إلى ما ذكر من عبادة الله وحده وإقام الصلاة وإيتاء الزكاة\n وما فيه من معنى البُعد للإشعار بعُلو رتبته وبُعد منزلته\n الإشارة: لم يكن الذين جحدوا وجودَ أهل الخصوصية من العلماء والجهّال منفكين عن ذلك حتى جاءتهم الحُجة القائمة عليهم\n وهو ظهور شيخ التربية خليفة الرسول\n يتلو كتابَ الله العزيز على ما ينبغي وما تَفَرَّقوا في التصديق إلاّ بعد ظهوره\n وما أُمروا إلاّ بالإخلاص وتطهير سرائرهم\n وهو لا يتأتى إلاّ بصُحبته\n وتكلم ابنُ جزي هنا على الإخلاص\n فقال: اعلم أنَّ الأعمال على ثلاثة أنواع: مأمورات ومنهيات ومباحات فأمّا المأمورات فالإخلاص فيها عبارة عن: خلوص النية لوجه الله\n بحيث لا يشوبها أُخرى\n فإن كانت كذلك فالعمل خالص\n وإن كانت لغير وجه الله من طلب منفعة دنيوية أو مدح أو غير ذلك\n فالعمل رياء محض مردود\n وإن كانت النية مشتركة ففي ذلك تفصيل\n فيه نظر واحتمال\n قلت: وقد تقدّم كلام الغزالي في سورة البقرة عند قوله:\n[البقرة:198]\n وحاصله: أنَّ الحكم للغالب وقوة الباعث\n انظر لفظه\n ثم قال ابن جزي: وأمَّا المنهيات فإنْ تَرَكها دون نية خرج عن عهدتها ولم يكن له أجر في تركها\n وإن تركها بنية وجه الله خرج عن عهدتها وأُجر\n وأمَّا المباحات\n كلأكل والشرب\n والنوم والجماع وغير ذلك\n فإن فَعَلَها بغير نية لم يكن له فيها أجر\n وإن فَعَلَها بنية وجه الله فله فيها أجر\n فإنَّ كُلَّ مباح يمكن أن يصير قُربة إذا قصد به وجه الله\n مثل أن يقصد بالأكل القوة على العبادة\n ويقصد بالجِمَاع التعفُّف عن الحرام\n وشبه ذلك\n هـ\n ودرجات الإخلاص ثلاث: الأولى: أن يعبد الله لطلب غرض دنيوي أو أخروي من غير ملاحظة أحد من الخلق\n والثانية: أن يعبد الله لطلب الآخرة فقط\n والثالثة: أن يعبد الله عبودية ومحبة\n ثم بَيّن حال الفريقين في الآخرة بعد بيان حالهم في الدنيا ـ يعني أهل الكتاب والمشركين ـ فقال: { إِنَّ ٱلَّذِينَ كَفَرُواْ مِنْ أَهْلِ ٱلْكِتَابِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:105",
      "similarity": 0.6472757125074642
    },
    {
      "verse": "30:30",
      "similarity": 0.5064566659951198
    },
    {
      "verse": "6:161",
      "similarity": 0.5028184039135892
    },
    {
      "verse": "6:79",
      "similarity": 0.49954616119417594
    },
    {
      "verse": "3:67",
      "similarity": 0.4952189470060217
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/98:5.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/98:5.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/98:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}