{
  "chapter": "البينة",
  "text": "ان الذين كفروا۟ من اهل الكتب والمشركين فى نار جهنم خلدين فيها او۟لئك هم شر البرية",
  "translations": [
    {
      "translation": "The People of the Book who are kafir and the idolaters will be in the Fire of Hell, remaining in it timelessly, for ever. They are the worst of creatures.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the unbelievers among the people of the Book and the idolaters, will abide in the fire of Hell. They are the worst of creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved – be they from among the People of the Book or among those who associated others with Allah in His Divinity– shall be in the Fire, and will abide in it. They are the worst of creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The disbelievers among the People of the Book and the pagans will dwell forever in hell; they are the worst of all creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed all disbelievers, the People of the Book(s) and the polytheists, are in the fire of hell – they will remain in it for ever; it is they who are the worst among the creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieve from among the People of the Scripture and idolators, will abide in the fire of Hell. They are the worst of creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who disbelieve from among the followers of the Book and the polytheists shall be in the fire of hell, abiding therein; they are the worst of men.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers of the People of the Book and the idolaters shall be in the Fire of Gehenna, therein dwelling forever; those are the worst of creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who disbelieve, among the People of the Scripture and the idolaters, will abide in fire of hell. They are the worst of created beings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of the deniers of truth among the People of the Book and the polytheists will dwell forever in Hell-fire. They are the worst of creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who disbelieve from among the people of the Book and the associaters shall be cast into the Hell-fire, as abiders therein. These! they are the worst of the creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the faithless from among the People of the Book and the polytheists will be in the fire of hell, to remain in it [forever]. It is they who are the worst of creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject (Truth), among the People of the Book and among the Polytheists, will be in Hell-Fire, to dwell therein (for aye). They are the worst of creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieve (in the religion of Islam, the Quran and Prophet Muhammad (Peace be upon him)) from among the people of the Scripture (Jews and Christians) and Al-Mushrikun will abide in the Fire of Hell. They are the worst of creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers among the People of the Book and the idolaters shall be for ever in the Fire of Gehenna (Hell). They are the worst of all creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve among the People of the Scripture, and the Polytheists, will be in the Fire of Hell, where they will abide forever. These are the worst of creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, they who disbelieved among the People of the Scripture and the polytheists will be in the fire of Hell, abiding eternally therein. Those are the worst of creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[98:6] Truly the disbelievers from among the People of the Scripture and the idolaters shall be in the fire of Hell, to abide therein (khālidīna: an implied circumstantial qualifier, in other words, it will be decreed for them by God, exalted be He, to abide therein) — those are the worst of creatures.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ فِي نَارِ جَهَنَّمَ خَالِدِينَ فِيهَا أُولَئِكَ هُمْ شَرُّ الْبَرِيَّةِ (6)بعد أن أنحى على أهل الكتاب والمشركين معاً ثم خَصَّ أهل الكتاب بالطعن في تعللاتهم والإِبطال لشبهاتهم التي يتابعهم المشركون عليها . أعقبه بوعيد الفريقين جمعاً بينهما كما ابتدأ الجمع بينهما في أول السورة لأن ما سبق من الموعظة والدلالة كاف في تدليل أنفسهم للموعظة .فالجملة استئناف ابتدائي ، وقدم أهل الكتاب على المشركين في الوعيد استتباعاً لتقديمهم عليهم في سببه كما تقدم في أول السورة ، ولأن معظم الرد كان موجهاً إلى أحوالهم من قوله : { وما تفرق الذين أوتوا الكتاب } إلى قوله : { دين القيمة } \\[ البينة : 4 ، 5 \\] ، ولأنه لو آمن أهل الكتاب لقامت الحجة على أهل الشرك .و { مِن } بيانية مثل التي في قوله : { لم يكن الذين كفروا من أهل الكتاب والمشركين } \\[ البينة : 1 \\] .وتأكيد الخبر ب { إنّ } للرد على أهل الكتاب الذين يزعمون أنهم لا تمسهم النار إلا أياماً معدودة ، فإن الظرفية التي اقتضتها { في } تفيد أنهم غير خارجين منها ، وتأكد ذلك بقوله : { خالدين فيها } ، وأما المشركون فقد أنكروا الجزاء رأساً .والإِخبارُ عنهم بالكون في نار جهنم إخبار بما يحصل في المستقبل بقرينة مقام الوعيد فإن الوعيد كالوعد يتعلق بالمستقبل وإن كان شأن الجملة الاسمية غير المقيدة بما يعين زمان وقوعها أن تفيد حصول مضمونها في الحال كما تقول : زيد في نعمة .وجملة : { أولئك هم شر البريئة } كالنتيجة لكونهم في نار جهنم خالدين فيها فلذلك فصلت عن الجملة التي قبلها وهو إخبار بسوء عاقبتهم في الآخرة وأريد بالبريئة هنا البريئة المشهورة في الاستعمال وهم البشر ، فلا اعتبار للشياطين في هذا الاسم وهذا يشبه الاستغراق العرفي .والبريئة : فعيلة من بَرأ الله الخلق ، أي صورهم .ومعنى كونهم { شر البريئة } أنهم أشد الناس شراً ، ف { شر } هنا أفعل تفضيل أصله أشر مثل خير الذي هو بمعنى أخير ، فإضافة { شر } إلى { البريئة } على نية { مِن } التفضيلية .وإنما كانوا كذلك لأنهم ضلوا بعد تلبسهم بأسباب الهدى ، فأما أهل الكتاب فلأن لديهم كتاباً فيه هدى ونور فعدلوا عنه ، وأما المشركون فلأنهم كانوا على الحنيفية فأدخلوا فيها عبادة الأصنام ثم إنهم أصرّوا على دينهم بعدما شاهدوا من دلائل صدق محمد صلى الله عليه وسلم وما جاء به القرآن من الإِعجاز والإِنباء بما في كتب أهل الكتاب ، وذلك مما لم يشاركهم فيه غيرهم فقد اجتنوا لأنفسهم الشر من حيث كانوا أهلاً لنوال الخير فحسرتهم على أنفسهم يوم القيامة أشد من حسرة من عداهم فكان الفريقان شراً من الوثنيين والزنادقة في استحقاق العقاب لا فيما يرجى منهم من الاقتراب .وأقحم اسم الإِشارة بين اسم { إنَّ } وخبرها للتنبيه على أنهم أحرياء بالحكم الوارد بعد اسم الإِشارة من أجل الأوصاف التي قبل اسم الإِشارة كما في قوله :{ أولئك على هدى من ربهم } \\[ البقرة : 5 \\] . وتوسيط ضمير الفصل لإِفادة اختصاصهم بكونهم شر البريئة لا يشاركهم في ذلك غيرهم من فرق أهل الكفر لما علمت آنفاً . ولا يرد أن الشياطين أشد شراً منهم لما علمت أن اسم البريئة اعتبر إطلاقه على البشر .و { البريئة } قرأه نافع وحده وابنُ ذكوان عن ابن عامر بهمز بعد الياء فعيلة من برأ اللَّهُ ، إذا خلق .وقرأه بقية العشرة بياء تحتية مشددة دون همز على تسهيل الهمزة بعد الكسرة ياء وإدغام الياء الأولى في الياء الثانية تخفيفاً .وإثبات الهمزة لغة أهل الحجاز ، والتخفيف لغة بقية العرب ، كما تركوا الهمز في الدَّرِيَّة والنبيّ . قال سيبويه : ليس أحد من العرب إلا ويقول : تنبأ مسيلمة بالهمز غير أنهم تركوا الهمز في النبيّ كما تركوه في : الدَّرِيَّة والبَرِيَّة إلا أهل مكة فإنهم يهمزونها ويخالفون العرب في ذلك .\n\n",
      "translations": [
        {
          "translation": "(Lo! those who disbelieve) in Muhammad (pbuh) and the Qur'an, (among the People of the Scripture and the idolaters) i.e. the idolaters among the people of Mecca, (will abide in fire of hell) never to die therein or leave it. (They are the worst of created beings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوْلَـٰئِكَ هُمْ شَرُّ ٱلْبَرِيَّةِ } معناه الخَلقُ الذين بَرأَهُم الله تعالى معناه خَلَقَهم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"Those are the worst of creatures,\" means those whom Allah has rejected, meaning He has created them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { إِنَّ } الكافرين المعاندين { ٱلَّذِينَ كَفَرُواْ } بنبوة محمد صلى الله عليه وسلم { مِنْ أَهْلِ ٱلْكِتَابِ وَ } من { ٱلْمُشْرِكِينَ } داخلون { فِي نَارِ جَهَنَّمَ } الطرد والحرمان { خَالِدِينَ فِيهَآ } لا يتحولون عنها أصلاً\n إلاَّ إلى عذاب فوق العذاب\n وأشد منه\n وبالجملة: { أَوْلَـٰئِكَ } الأشقياء\n المردودون\n المطرودون عن ساحة عز القبول { هُمْ شَرُّ ٱلْبَرِيَّةِ } [البينة: 6] الخليقة\n وأردؤهم\n كأنهم مقصورون على الشرارة والرداءة مجسمون منها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِنّ الذين كفروا من أهل الكتاب والمشركين } المتقدمين في أول السورة\n { في نار جهنم خالدين فيها أولئك هم شَرُّ البريَّةِ } أي: الخليقة لأنّ الله بَراهم\n أي: أوجدهم\n قُرىء بالهمزة\n وهو الأصل ويعدمه مع الإدغام\n وهو الأكثر\n { إِنَّ الذين آمنوا وعملوا الصالحات أولئك هم خيرُ البريَّةِ } لا غيرهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:1",
      "similarity": 0.44155979198919776
    },
    {
      "verse": "10:41",
      "similarity": 0.4323439627495915
    },
    {
      "verse": "98:7",
      "similarity": 0.43050898339727134
    },
    {
      "verse": "25:34",
      "similarity": 0.4294008652652823
    },
    {
      "verse": "113:2",
      "similarity": 0.41310206861304155
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/098006.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/098006.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/98:6.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}