{
  "chapter": "البينة",
  "text": "جزاؤهم عند ربهم جنت عدن تجرى من تحتها الانهر خلدين فيها ابدا رضى الله عنهم ورضوا۟ عنه ذلك لمن خشى ربه",
  "translations": [
    {
      "translation": "Their reward is with their Lord: Gardens of Eden with rivers flowing under them, remaining in them timelessly, for ever and ever. Allah is pleased with them and they are pleased with Him. That is for those who fear their Lord.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whose reward is with their Lord -- gardens of Eden with rivers flowing by, where they will abide for ever, God pleased with their service, they with obedience to Him. This (awaits) him who stands in awe of his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their recompense lies with their Lord: Gardens of eternity beneath which rivers flow; therein they shall dwell, forever and ever. Allah is well-pleased with them, and they are well-pleased with Him. All this is for him who fears his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their reward from their Lord will be the gardens of Eden wherein streams flow and wherein they will live forever. God will be pleased with them and they will be pleased with Him. This (reward) is for those who fear their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their reward is – with their Lord – everlasting Gardens of Eden beneath which rivers flow, in which they will abide for ever and ever; Allah is pleased with them and they are pleased with Him; this is for one who fears his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their reward with their Lord is Eternal Gardens, underneath which rivers flow. They will abide therein forever, Allah will be pleased with them, and they well-pleased with Him. That is for him who fears his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their reward with their Lord is gardens of perpetuity beneath which rivers flow, abiding therein for ever; Allah is well pleased with them and they are well pleased with Him; that is for him who fears his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "their recompense is with their Lord-Gardens of Eden, underneath which rivers flow, therein dwelling for ever and ever. God is well-pleased with them, and they are well-pleased with Him; that is for him who fears his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their reward is with their Lord: Gardens of Eden underneath which rivers flow, wherein they dwell for ever. Allah hath pleasure in them and they have pleasure in Him. This is (in store) for him who feareth his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has a reward in store for them: Gardens of eternity, through which rivers flow; they will dwell therein forever. God is well pleased with them and they are well pleased with Him. Thus shall the God-fearing be rewarded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their recompense with their Lord shall be Gardens Everlasting, whereunder rivers flow - as abiders therein for evermore. Well-pleases will be Allah with them and well-pleased will be they with Him, That is for him who feareth his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their reward, near their Lord, is the Gardens of Eden, with streams running in them, to remain in them forever. Allah is pleased with them, and they are pleased with Him. That is for those who fear their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their reward is with Allah: Gardens of Eternity, beneath which rivers flow; they will dwell therein for ever; Allah well pleased with them, and they with Him: all this for such as fear their Lord and Cherisher.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their reward with their Lord is 'Adn (Eden) Paradise (Gardens of Eternity), underneath which rivers flow, they will abide therein forever, Allah Well-Pleased with them, and they with Him. That is for him who fears his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their recompense is with their Lord; Gardens of Eden, underneath which rivers flow, where they shall live for ever. Allah is wellpleased with them, and theyare wellpleased with Him. That is for he who fears his Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their reward is with their Lord: Gardens of Eternity beneath which rivers flow, where they will abide forever. God is pleased with them, and they are pleased with Him. That is for whoever fears His Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their reward with Allah will be gardens of perpetual residence beneath which rivers flow, wherein they will abide forever, Allah being pleased with them and they with Him. That is for whoever has feared his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[98:8] Their reward with their Lord will be Gardens of Eden, as a residence, underneath which rivers flow, wherein they shall abide forever. God is pleased with them, because of [their] obedience of Him, and they are pleased with Him, because of His reward. That is [the reward] for him who fears his Lord, [for him] who fears His punishment and hence desists from disobeying Him, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Their reward is with their Lord: Gardens of Eden) the chamber of the Beneficent, the source of the prophets and those near to Him (beneath which) beneath whose trees, habitations and rooms (rivers flow) rivers of wine, water, honey and milk, (wherein they dwell forever) they remain in Paradise for ever never to die or leave it. (Allah hath pleasure in them) i.e. in their faith and works (and they have pleasure in Him) in His reward and bestowal of honour upon Him. (This) i.e. the Gardens and good pleasure (is (in store) for him who feareth his Lord) is for him who believes in Allah's divine Oneness such as Abu Bakr al-Siddiq and his companions and 'Abdullah Ibn Salam and his followers'. And of the surah in which the Earthquake is mentioned, which is all Meccan and consists of 9 verses, 35 words and 100 letters. Surah 99: The Earthquake (al-Zalzalah) 767 And of the surah in which the Earthquake is mentioned, which is all Meccan and consists of 9 verses, 35 words and 100 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ذَلِكَ لِمَنْ خَشِيَ رَبَّهُ } معناه خَافَ رَبَّهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"That is for him who fears his Lord,\" means he fears his Lord.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ جَزَآؤُهُمْ } الذي استحقوها بإيمانهم وأعمالهم { عِندَ رَبِّهِمْ جَنَّاتُ عَدْنٍ } منتزهات علم وعين وحق { تَجْرِى مِنْ تَحْتِهَا ٱلأَنْهَارُ } أي: جداول المعارف والحقائق المتجددة\n المرشحة من بحر الحقيقة { خَالِدِينَ فِيهَآ أَبَداً } دائمين فيها سرمداً\n وبالجملة: { رِّضِىَ ٱللَّهُ } المفضل المنعم العليم الحكيم { عَنْهُمْ } وعن أعمالهم ونياتهم وأخلاقهم فيها { وَرَضُواْ } أيضاً { عَنْهُ } سبحانه بما قسَّم الله لهم\n وأفاض عليهم بمقتضى استعداداتهم وقابلياتهم\n وبالجملة: { ذَلِكَ } الأجر الجزيل والرضا الجميل { لِمَنْ خَشِيَ رَبَّهُ } [البينة: 8] وخاف من سخطه وغضبه\n فامتثل بأوامره واجتنب عن نواهيه\n واتصف بالتقوى عن مطلق محارمه ومحظوراته\n\n\nجعلنا الله من زمرتهم\n\n\nخاتمة السورة\n\nعليك أيها الراجي لقبول الحق والرضاء أن تصفي سرك عن مطلق الرعونات المنافية للرضا عما جرى عليه القضاء\n وتخلي ضميرك عن الميل إلى مطلق البدع والأهواء المبعدة عن التقرب نحو المولى\n فلك التسليم والرضا\n والتبتل نحو الحق في السراء والضراء\n والتوكل عليه في الخصب والرخاء\n فإنه لا تحرك في ملكه إلاَّ ما يشاء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { جزاؤُهم عند ربهم جناتُ عدنٍ } إقامة\n { تجري من تحتها الأنهارُ خالدين فيها أبداً رضي الله عنهم ورَضُوا عنه } حيث بلغوا من الأماني قاصيها وملكوا من المآرب ناصيتها\n وأتيح لهم ما لا عين رأت ولا أُذن سمعت\n ولا خطر على قلب بشر\n { ذلك لِمَنْ خَشِيَ ربَّه } \n فإنَّ الخشية التي هي مِن خصائص العلماء به مناطاة بجميع الكمالات العلمية والعملية\n المستتبعة للسعادة الدينية والدنيوية\n والتعرُّض لعنوان الربوبية\n المعربة عن المالكية والتربية للإشعار بعلو الخشية والتحذير من الاغترار بالتربية\n قاله ابو السعود\n وقوله: { خير البرية } يدل على فضل المؤمنين من البشر على الملائكة\n وفيه تفصيل تقدّم ذكره في النساء\n قال القشيري: قوله تعالى: { خير البرية } يدل على أنهم أفضل من الملائكة\n هـ\n قال في الحاشية: أي: في الجملة\n ثم ذكر حكاية الرجل الذي أحياه الله بعد موته بدعوة عيسى\n فقال: إنه كان في الجنة\n وأنه مرّ بملأ من الملائكة\n وهم يقولون: إنَّ من بني آدم لَمَنْ هو أكرم على الله من الملائكة\n ثم ذكر عن نوادر الأصول: أنَّ المؤمن أكرم على الله من الملائكة المقربين\n فانظره\n وقال بعضهم: الملائكة عقل بلا شهوة\n والبهائم شهوة بلا عقل\n والآدمي فيه عقل وشهوة\n فمَن غلب عقلُه على شهوته كان كالملائكة أو أفضل\n ومَن غلبت شهوتُه على عقله كان كالبهائم أو أضلّ\n هـ\n الإشارة: مَن كفر بأهل الخصوصية مِن أهل العلم وغيرهم لهم نار الحجاب والقطيعة\n ومَن آمن بهم\n ودخل تحت تربيتهم له جنات المعارف خالداً فيها\n رضي الله عنهم حيث قرَّبهم إليه\n ورَضُوا عنه حيث سلّموا الأمر إليه\n وخشوا بعُده وطرده\n قال الإمام الفخر: اعلم أنَّ العبد مُركَّب من جسد وروح\n فجَنّة الجسد هي الموصوفة في القرآن\n وجنة الروح هي رضا الرب\n والأُولى مبدأ أمره\n والثانية منتهى أمره\n وقال الورتجبي: عن الواسطي: الرضا والسخط نعتان قديمان\n يجريان على الأبد بما جرى في الأزل\n يظهران الوسْم على المقبولين والمطرودين\n فقد بانت شواهد المقبولين بضيائها عليهم\n كما بانت شواهد المطرودين بظلمتها عليهم\n ثم قال عن سهل: الخشية سر والخشوع ظاهر\n هـ\n فالخشية محلها البواطن\n والخشوع ظهور أثر الخشية في الظاهر\n وبالله التوفيق\n وصلّى الله على سيدنا محمد وآله وصحبه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:76",
      "similarity": 0.7614295035313051
    },
    {
      "verse": "16:31",
      "similarity": 0.7251700078538839
    },
    {
      "verse": "9:72",
      "similarity": 0.6616706494773278
    },
    {
      "verse": "61:12",
      "similarity": 0.5574946946380742
    },
    {
      "verse": "5:119",
      "similarity": 0.5332526323742386
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/98:8.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/98:8.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/98:8.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}