{
  "chapter": "الزلزلة",
  "text": "ومن يعمل مثقال ذرة شرا يره",
  "translations": [
    {
      "translation": "Whoever does an atom's weight of evil will see it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever has done even an atom's weight of evil will behold that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and whoever does an atom's weight of evil shall see it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "will see it and whoever has done an atom's weight of evil, will also see it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does an evil deed equal to the weight of the minutest particle, will see it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever does evil equal to the weight of a speck of dust shall see it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he who has done an atom's weight of evil shall see it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and whoso has done an atom's weight of evil shall see it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoso doeth ill an atom's weight will see it then.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "while whoever has done the smallest particle of evil will see it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever hath worked ill Of an atom's weight shall behold it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and whoever does an atom’s weight of evil will see it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And anyone who has done an atom's weight of evil, shall see it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever does evil equal to the weight of an atom (or a small ant), shall see it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and whosoever has done an atom's weight of evil shall see it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever has done an atom's weight of evil will see it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does an atom's weight of evil will see it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[99:8] and whoever does an atom’s weight of evil shall see it: he shall see its requital.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And whoso doeth ill an atom's weight) the weight of a small atom (will see it then) is written in his register and will displease him; and it is also said: the believer sees it in the life of the world while the disbeliever sees it in the Hereafter'. And of the surah in which the Courses are mentioned, which is all Meccan and consists of 11 verses, 40 words and 163 letters: Surah 100: The Courses (al-'Adiyat) And of the surah in which the Courses are mentioned, which is all Meccan and consists of 1 1 verses, 40 words and 163 letters: 768\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مِثْقَالَ ذَرَّةٍ } معناه وزنُهُ ذَرة\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {the weight of a mustard seed}, means its weight is that of a mustard seed.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَن يَعْـمَلْ مِثْقَالَ ذَرَّةٍ شَرّاً يَرَهُ } [الزلزلة: 8] أي: جاءها في النار\n\n\nوهذه الآية أحكم آية وأقسطها\n من الآيات الدالة على كمال العدل الإلهي وأشملها حكماً\n لذلك قال صلى الله عليه وسلم:\n \" { إِذَا زُلْزِلَتِ } تعدل نصف القرآن\n و: { قُلْ هُوَ ٱللَّهُ أَحَدٌ } تعدل ثلث القرآن\n و: { قُلْ يٰأَيُّهَا ٱلْكَافِرُونَ } تعدل ربع القرآن \"\n \n \nخاتمة السورة\n\nعليك أيها المتوجه نحو الحق أن تأتي وتتصف بصوالح الأعمال\n وتجتنب عن فواسدها\n لترى أحسن الجزاء\n وتزيد عليها على مقتضى إخلاصك فيها وخشوعك في إتيانها\n فلك أن تجعل مضمون هذه الآية نصب عينيك في عموم أحوالك وأعمالك\n لتكون على ذكر تام وفطنة كاملة\n مما يترتب على أعمالك من الجزاء\n\n\nجعلنا الله من زمرة المتذكرين الممتثلين بمقتضى هذه الآية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و \" خيراً \": تمييز، { ومن يعمل مثقالَ ذرةٍ شراً يَرَهُ } قيل: هذا في الكافر، والأُولى في المؤمنين\n وقال ابن عباس رضي الله عنه: ليس مؤمن ولا كافر، عَمِلَ خيراً ولا شرًّا في الدنيا إلاّ يراه في الآخرة، فأمّا المؤمن فيرى حسناته وسيئاته، فيغفر اللهُ سيئاته ويُثيبه بحسناته، وأمّا الكافر فيَرُدُّ اللهُ حسناته ويُعذبه بسيئاته\n وقال محمد بن كعب: الكافر يرى ثوابه في الدنيا، في أهله وماله وولده، حتى يخرج من الدنيا وليس له عند الله خير، والمؤمن يرى عقوبته في الدنيا، في نفسه وأهله وماله، حتى يخرج من الدنيا وليس له عند الله شر\n\n\nوفي الحديث:\n\n \" إذا تاب العبدُ عن ذنبه أَنْسَى الله الحفظةَ ذنوبه، وأنسى ذلك جوارحه ومعالمه من الأرض، حتى يلقى الله وليس عليه شاهد بذنب \"\n \n\nقال ابن جُزي: هو على عمومه في الكافر، وأمّا المؤمنون فلا يُجْزَون بذنوبهم إلاَّ بستة شروط أن تكون ذنوبهم كِبار، وأن يموتوا قبل التوبة منها، وألاَّ يكون لهم حسنات أرجح في الميزان منها وألاّ يُشفع فيهم، وألاّ يكونوا ممن استحق المغفرة بعملٍ، كأهل بدر، وإلاّ يعفو الله عنهم، فإنّ المؤمن العاصي في مشيئة الله، إن شاء عذَّبه، وإن شاء غفر له\n هـ\n الإشارة: إذا زُلزلت أرضُ النفوس زلزالها اللائق بها، وحُركت بالواردات والأحوال وتحققت الغيبة عنها بالكلية، أشرقت شمس العرفان، فغطّت وجودَ الأكوان، كما قال الشيخ أبو العباس رضي الله عنه مُنشِداً:\n\nوأخرجت حينئذ ما فيها من العلوم يومئذ تُحَدِّث أخبارها: أخبار الأسرار الكامنة فيها، بأنّ ربك أوحى لها إلهاماً\n يومئذ يَصْدُر الناسُ من الفناء إلى البقاء، أشتاتاً، فمنهم الغالب حقيقته، ومنهم الغالب شريعته، ومنهم المعتدل\n أو: فمنهم الغالب عليه القبض والقوة، ومنهم الغالب عليه البسط والليونة، وهذا أعم نفعاً\n والله أعلم\n وذلك لِيُروا أعمال مجاهدتهم بالتنعُّم في مشاهدتهم، فمَن يعمل مثقال ذرة خيراً ـ بأن ينقص من نفسه عادةً في سيره ـ يرَ جزاء ذلك، ومَن يعمل مثقال ذرة شرًّا ـ بأن يزيد من الحس شيئاً في الظاهر ـ يره، فإنه ينقص من معناه في الباطن، إلاّ إذا تمكّن من الشهود\n وبالله التوفيق وصلّى الله على سيدنا محمد وآله\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "99:7",
      "similarity": 0.7869252479842994
    },
    {
      "verse": "99:2",
      "similarity": 0.5013463706790171
    },
    {
      "verse": "73:5",
      "similarity": 0.47098058085701894
    },
    {
      "verse": "4:40",
      "similarity": 0.46675860196023405
    },
    {
      "verse": "34:22",
      "similarity": 0.4638710897739553
    }
  ]
}