{
  "chapter": "التوبة",
  "text": "براءة من الله ورسوله الى الذين عهدتم من المشركين",
  "translations": [
    {
      "translation": "An announcement to those mushrikun you have a general treaty with that Allah and His Messenger are free of them:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "IMMUNITY is granted those idolaters by God and his Apostle with whom you have a treaty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a declaration of disavowal by Allah and His Messenger to those who associate others with Allah in His Divinity and with whom you have made treaties:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God and His Messenger declare the abrogation of the peace treaty that existed between them and the pagans.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Severance of ties is proclaimed by Allah and on behalf of His Noble Messenger, towards the polytheists with whom you had a treaty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Freedom from (all) obligations (is declared) from Allah and His Messenger () to those of the Mushrikin (idolaters), with whom you made a treaty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This is a declaration of) immunity by Allah and His Apostle towards those of the idolaters with whom you made an agreement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An acquittal, from God and His Messenger, unto the idolaters with whom you made covenant:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Freedom from obligation (is proclaimed) from Allah and His messenger toward those of the idolaters with whom ye made a treaty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a declaration of immunity from God and His Messenger to the polytheists, with whom you had made agreements.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Quittance is this from Allah and His aposle unto the associators with whom ye had covenanted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[This is] a [declaration of] repudiation by Allah and His Apostle [addressed] to the polytheists with whom you had made a treaty:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A (declaration) of immunity from Allah and His Messenger, to those of the Pagans with whom ye have contracted mutual alliances:-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Freedom from (all) obligations (is declared) from Allah and His Messenger (SAW) to those of the Mushrikun (polytheists, pagans, idolaters, disbelievers in the Oneness of Allah), with whom you made a treaty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An acquittal from Allah and His Messenger to the idolaters with whom you have made agreements;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A declaration of immunity from God and His Messenger to the polytheists with whom you had made a treaty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[This is a declaration of] disassociation, from Allah and His Messenger, to those with whom you had made a treaty among the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:1]   This is: A declaration of immunity from God and His Messenger to, reach, the idolaters with whom you made a pact, a pact for an indefinite period of time, or one for [a period of] less than, or more than, four months; the annulment of the pact shall be as God mentions in His saying:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas who said regarding Allah's saying: (Freedom from obligation): '(Freedom from obligation) this is freedom from obligation (from Allah and His messenger towards those of the idolaters with whom ye made a treaty) but then they broke that treaty; freedom from obligation is the breaking of treaties. Allah says: whosoever has a treaty with the Messenger of Allah (pbuh) let him know that it is broken. Some of them had a treaty lasting four months, and some of more nine months, while others had treaties for longer or shorter periods. Others had no treaty with Allah's Messenger at all. All these treaties were broken except for the treaty with the Banu Kinanah which was for nine months. Whoever had a treaty for more or less than four months, their treaties were ratified to last four month beginning from the day of immolation; and whoever had a treaty of four months, that treaty was ratified to last four months beginning from the day of immolation. Those who had a treaty of nine months, their treaties were left as they were, while those who did not sign any treaty, were granted one of 50 days beginning from the day of immolation until the departure of the person who was in a state of ritual consecration:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ بَرَاءَة من الله ورَسوله } الآية، لما لم يتمكن الرسول في الاستقامة لمكان تلوينه بظهور صفاته تارة وبوجود البقية تارة أخرى، على ما دلّ عليه القرآن في مواضع العتاب والتثبيت كقوله:\n\n[عبس، الآية: 1]، وقوله:\n\n[الإسراء، الآية: 74]،\n\n[التوبة، الآية: 43]،\n\n[الأنفال، الآية: 67]، فلم يصل أصحابه من المؤمنين إلى مقام الوحدة الذاتية لاحتجابهم تارة بالأفعال وتارة بالصفات كان بينهم وبين المشركين مناسبة وقرابة جنسية وآل فبتلك الجنسية عاهدوهم لوجود الاتصال بينهم\n ثم لما امتثل النبيّ عليه الصلاة والسلام والمؤمنون قوله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لمَّا كان المشركون المصرون على شركهم من أعدى الأعادي، وأشدهم غيظاً مع الله ورسوله، وكان عهودهم ومواثيقهم غير معول عليها في علم الله، تبرأ سبحانه منهم وأمر رسوله أيضاً بالتبري عنهم وعن عهودهم ومواثيقهم، فقال: { بَرَآءَةٌ } المطلع على مخايل أهل الشرك أصالة { وَ } من { رَسُولِهِ } لتنبذوا وتطرحوا عهودكم ومواثيقكم { إِلَى ٱلَّذِينَ عَاهَدْتُمْ مِّنَ ٱلْمُشْرِكِينَ } أي: هذه براءة ونقض عهد وإسقاط ذمة، ورفع أمان كان بينكم أيها المؤمنون وبين المشركين، نزلت إليكم { مِّنَ ٱللَّهِ } [التوبة: 1]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: براءة: خبر عن مضمر، أي: هذه براءة و مِنَ: ابتدائية، متعلقة بمحذوف، أي: واصلة من الله، و إلى الذين: متعلقة به أيضاً، أ و مبتدأ لتخصيصها بالصفة، و إلى الذين: خبر\n يقول الحق جل جلاله: هذه { براءة } أي: تبرئة { من الله ورسوله } واصلة { إلى الذين عاهدتم من المشركين } ، فقد تبرأ الله ورسوله من كل عهد كان بين المشركين والمسلمين، لأنهم نكثوا أولاً، إلا أناساً منهم لم ينكثوا، وهم بنو ضمرة وبنو كنانة، وسيأتي استثناؤهم\n قال البيضاوي: وإنما علقت البراءة بالله وبرسوله، والمعاهدة بالمسلمين للدلالة على أنه يجب عليهم نبذ عهود المشركين إليهم، وإن كانت صادرة بإذن الله واتفاق الرسول فإنهما برئا منها\n هـ\n وقال ابن جزي: وإنما أسند العهد إلى المسلمين لأن فعل الرسول صلى الله عليه وسلم لازم للمسلمين، وكأنهم هم الذين عاهدوا المشركين، وكان النبي صلى الله عليه وسلم قد عقد العهد مع المشركين إلى آجال محدودة، فمنهم من وفّى، فأمر الله أن يتم عهده إلى مدته، ومنهم من نقص أو قارب النقض، وجعل له أجل أربعة أشهر، وبعدها لا يكون له عهد\n هـ\n وإلى ذلك أشار بقوله: { فسيحوا في الأرض أربعةَ أشهرٍ } آمنين لا يتعرض لكم أحد، وبعدها لا عهد بيني وبينكم\n وذكر الطبري: أنهم أسلموا كلهم في هذه المدة ولم يسح أحد\n هـ\n  وهذه الأربعة الأشهر: شوال، وذو القعدة، وذو الحجة، والمحرم، لأنها نزلت في شوال، وقيل: هي عشرون من ذي الحجة، والمحرم، وصفر، وربيع الأول، وعشر من الآخر، لأن التبليغ كان يوم النحر لما روي أنها لَمّا نزلت أرسل رسولُ الله صلى الله عليه وسلم علياً رضي الله عنه راكبِاً العَضْبَاءَ ليَقْرأَهَا عَلى أهل المَوْسِم، وكان قد بعث أبا بكرٍ رضي الله عنه أميراً على الموسم، فقيل: لو بَعَثْتَ بها إِلى أَبَي بكرٍ؟ فقال: \" لا يُؤَدِّي عَنَّي إلا رَجُلٌ مِنِّي \" فَلَمَّا دَنَا عَليٌّ رضي الله عنه، سَمِعَ أَبُو بَكرٍ الرُّغاءَ، فوقف وَقَال: هذا رُغاء ناقَةِ رَسُولِ اللَّه صلى الله عليه وسلم، فوقف، فلمَّا لَحِقَهُ قال: أَمير أو مَأمُورٌ؟ قال: مَأمُورٌ، فلما كان قبل الترْويَة خَطَبَ أبو بكر رضي الله عنه، وحَدَّثَهُمْ عَنْ مَنَاسِكَهِم، وقَامَ عليٌّ ـ كرم الله وجهه ـ يومَ النَّحر، عند جَمْرَةِ العَقَبَةِ، فقال: يا أَيُّها النّاس، إني رَسُولُ رَسولِ اللَّهِ إليكم، فقالوا: بماذا؟ فَقَرأَ عليهمْ ثلاثين أوْ أرْبعين آيةً من أول السورة، ثم قال: أمرْتُ بأربَعٍ: أَلا يَقْرب البَيْتَ بعد هذا مُشركٌ، ولا يَطُوف بالبيت عُريَانٌ، ولا يَدخُلُ الجَنَّةَ إلا نَفْسٌ مُؤْمِنَةٍ، وأن يَتِمَّ كُلّ ذِي عَهْدٍ عَهْدُهُ\n ولعل قوله صلى الله عليه وسلم:\n\n\n\n \" ولا يؤدي عني إلا رجل مني \" \n\nخاص بنقض العهود، لأنه قد بعث كثيراً من الصحابة ليؤدوا عنه، وكانت عادة العرب ألاّ يتولى العهد ونقضه على القبيلة إلا رجل منها\n قاله البيضاوي مختصراً\n ثم قال تعالى لأهل الشرك: { واعلموا أنكم غير مُعجزي الله } أي: لا تفوتونه، وإن أمهلكم، { وأن الله مُخزي الكافرين } في القتل والأسر في الدنيا، والعذاب المهين في الآخرة\n الإشارة: وقد وقع التبرؤ من أهل الشرك مطلقاً، أما الشرك الجلي فقد تبرأ منه الإسلام والإيمان، وأما الشرك الخفي فقد تبرأ منه مقام الإحسان، ولا يدخل أحدٌ مقام الإحسان حتى لا يعتمد على شيء، ولا يستند إلى شيء، إلا على من بيده ملكوت كل شيء، فيطرح الأسباب وينبذ الأرباب، ويرفض النظر إلى العشائر والأصحاب، حتى لا يبقى في نظره إلا الكريم الوهاب، فمن أصرَّ على شوكه الجلي أو الخفي فإن الله يمهل ولا يهمل، فلا بد أن يلحقه وباله: إما خزي في الدنيا، أو عذاب في الآخرة، كل على ما يليق به\n  وقال القشيري: إنْ قَطَعَ عنهم الوصلة فقد ضَرَبَ لهم مدةً على وجه المُهْلَةِ، فأَمَّنهُم في الحَالِ ليتأهبوا لتَحمُّل مقاساةِ البراءةِ فيما يستقبلونه في المآلِ\n والإشارةُ فيه: أنهم إنْ أقلعوا في هذه المهلة عن الغَيِّ والضلال، وجدوا في المآل ما فقدوا من الوصال\n وإنْ أبَوْا إلا التمادي في تَرْكِ الخدمة والحرمة، انقطع ما بينه وبينهم من الوصلة\n هـ\n والله تعالى أعلم\n ثم أمر بإظهار تلك البراءة للناس، فقال: { وَأَذَانٌ مِّنَ ٱللَّهِ وَرَسُولِهِ إِلَى ٱلنَّاسِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:41",
      "similarity": 0.592828639405654
    },
    {
      "verse": "98:7",
      "similarity": 0.5639630175162544
    },
    {
      "verse": "12:53",
      "similarity": 0.5154992296520371
    },
    {
      "verse": "43:26",
      "similarity": 0.48561177412759227
    },
    {
      "verse": "26:216",
      "similarity": 0.48354417916547565
    }
  ]
}