{
  "chapter": "التوبة",
  "text": "وءاخرون مرجون لامر الله اما يعذبهم واما يتوب عليهم والله عليم حكيم",
  "translations": [
    {
      "translation": "And others are left awaiting Allah's command as to whether He will punish them or turn to them. Allah is All-Knowing, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are still some others whose affairs await the dispensation of God. He may punish or pardon them, for God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are others in whose regard Allah's decree is awaited: whether He will chastise them or relent towards them. Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Besides those who have confessed their sins, there are others who have no good deeds for which they may receive any reward or sins for which they may be punished. Their fate will be in the hands of God.\" God is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some are kept waiting for Allah’s command – He may punish them or accept their repentance; and Allah is All Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And others are made to await for Allah's Decree, whether He will punish them or will forgive them. And Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And others are made to await Allah's command, whether He chastise them or whether He turn to them (mercifully), and Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And others are deferred to God's commandment, whether He chastises them, or turns towards them; God is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (there are) others who await Allah's decree, whether He will punish them or will forgive them. Allah is Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[There are yet] others whose cases are deferred until it is God's will to judge them. He will either punish them, or turn in mercy to them; God is all knowing and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And others are awaiting the decree of Allah, whether He shall torment them or whether He will relent toward them; and Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[There are] others waiting Allah’s edict: either He shall punish them, or turn to them clemently, and Allah is all-knowing, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are (yet) others, held in suspense for the command of Allah, whether He will punish them, or turn in mercy to them: and Allah is All-Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And others await Allah's Decree, whether He will punish them or will forgive them. And Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are others who must wait for the Commandment of Allah. He will either punish or turn towards them. And Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Others are held in suspense, awaiting God’s decree, as to whether He will punish them, or accept their repentance. God is Aware and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [there are] others deferred until the command of Allah - whether He will punish them or whether He will forgive them. And Allah is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:106] And [there are] others, from among those who stayed behind, who are deferred (read murja’ūna or murjawna), whose repentance is delayed, to God’s command, concerning them, according to His will, whether He chastises them, by causing them to die without [their having made any] repentance, or relents to them; and God is Knower, of His creatures, Wise, in what He does with them. These [others mentioned] are the three, who will be mentioned afterwards: Murāra b. al-Rabī‘, Ka‘b b. Mālik and Hilāl b. Umayya. They stayed behind out of laziness and their inclination for peace and quiet, not out of hypocrisy. Unlike the others, however, they did not excuse themselves before the Prophet (s), and so the matter regarding them was suspended for fifty days, during which time people avoided them, until it was later revealed that God had relented to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (there are) others) there are other people of Medina: Ka'b Ibn Malik, Murarah Ibn al-Rabi' and Hilal Ibn Umayyah (who await Allah's decree) their matter awaits Allah's command, (whether He will punish them) because of their staying behind and not taking part in the Battle of Tabuk (or will forgive them) for so doing. (Allah is Knower) of their repentance and also of their staying behind, (Wise) in that which ordained concerning them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَآخَرُونَ مُرْجَوْنَ } معناهُ مُؤخَّرونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {And others are waiting}, means those who are yet to come.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَآخَرُونَ } من المتخلفين بعدما تبهوا بقبح صينعهم { مُرْجَوْنَ } مؤخرون\n منتظرون { لأَمْرِ ٱللَّهِ } وحكمه\n وصاروا مترددين بين الخوف والرجاء فيما فعل الله معهم { إِمَّا يُعَذِّبُهُمْ } أخذاً على ما صدر عنهم بمقتضى عدله { وَإِمَّا يَتُوبُ عَلَيْهِمْ } ويوفقهم على التوبة يمقتضى فضله وسعة رحمته\n وجوده { وَٱللَّهُ } المطلع لخفيات صدورهم { عَلِيمٌ } بإخلاصهم ونيَّاتهم { حَكِيمٌ } [التوبة: 106] في فعله بهم بعد علمه بحالهم\n\n\n{ وَ } من أشدهم كفراً ونافقاً\n وأغلظهم بغضاً وشقاقاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: الإرجاء هو التأخر، يقال: أرجاه ـ بالهمز وتركه ـ: أَخره. يقول الحق جل جلاله: { وآخرون } من المتخلفين، تخلفوا من غير عُذر، ولم يعتذروا بشيء، { مُرْجَوْنَ } أي: مؤخرون { لأمرِ الله } في شأنهم { إما } أن { يُعَذِّبهم } على تخلفهم عن الجهاد مع رسوله، { وإما } أن { يتوب عليهم } حيث تابوا وندموا، والترديد باعتبار العباد، وفيه دليل على أن كلا الأمرين بإرادته تعالى، { والله عليم } بأحوالهم، { حكيم } فيما فعل بهم. والمراد بهؤلاء الثلاثة: كَعْب بن مالك، وهِلال بن أمية، ومُرَارَة بن الربيع، أمر رسول الله صلى الله عليه وسلم الناس ألا يُسلموا عليهم ولا يكلموهم، فلما رأوا ذلك أخلصوا نياتهم، وفوضوا أمرهم إلى الله، فرحمهم، وسيأتي تمام قصتهم وتوبة الله عليهم بعدُ، إو شاء الله. الإشارة: وآخرون مؤخرون عن صحبة المشايخ العارفين، حتى ماتوا مفروقين، إما أن يعذبهم على ما أصروا من المساوئ والذنوب، وإما أن يتوب عليهم بفضله وكرمه، إنه عليم لا يخفى عليه ما أسروا، حكيم فيما قضى عليهم من أمر الحجاب بعدله وقضائه. ثم ذكر أهل مسجد الضرار، فقال: { وَٱلَّذِينَ ٱتَّخَذُواْ مَسْجِداً ضِرَاراً }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:28",
      "similarity": 0.6723608313477979
    },
    {
      "verse": "23:93",
      "similarity": 0.5803998554564448
    },
    {
      "verse": "7:115",
      "similarity": 0.5760042482581258
    },
    {
      "verse": "76:3",
      "similarity": 0.5596614445068506
    },
    {
      "verse": "20:65",
      "similarity": 0.5542456698138146
    }
  ]
}