{
  "chapter": "التوبة",
  "text": "وممن حولكم من الاعراب منفقون ومن اهل المدينة مردوا۟ على النفاق لا تعلمهم نحن نعلمهم سنعذبهم مرتين ثم يردون الى عذاب عظيم",
  "translations": [
    {
      "translation": "Some of the desert Arabs around you are hypocrites and some of the people of Madina are obdurate in their hypocrisy. You do not know them but We know them. We will punish them twice over and then they will be returned to a terrible punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of the Arabs of the desert around you are hypocrites, and some of the people of Madina are stubborn in hypocrisy. You are not aware of them; We know them, and will punish them twice, and they will be sent to a harrowing doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the bedouin Arabs around you, some are hypocrites; and so are some of the people of Madinah who have become inured to hypocrisy. You do not know them, but We know them. We will inflict double chastisement on them, and then they shall be returned to an awesome suffering.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of the desert dwelling Arabs around you are hypocrites as are some of the inhabitants of Medina. They are persisting in their hypocrisies. You do not know them but We know them well and will punish them twice over. Then they will be brought to the great torment (on the Day of Judgment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some of the illiterates around you are hypocrites; and some of the people of Medinah; hypocrisy has become ingrained in them; you do not know them*; We know them; We shall soon punish them twice** – they will then be consigned towards the terrible punishment.*** (*Until now or as well as We do. ** In life and in the grave *** of hell.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the bedouins around you, some are hypocrites, and so are some among the people of Al-Madinah who persist in hypocrisy; you know them not, We know them. We shall punish them twice, and thereafter they shall be brought back to a great (horrible) torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from among those who are round about you of the dwellers of the desert there are hypocrites, and from among the people of Medina (also); they are stubborn in hypocrisy; you do not know them; We know them; We will chastise them twice then shall they be turned back to a grievous chastisement\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some of the Bedouins who dwell around you are hypocrites; and some of the people of the City are grown bold in hypocrisy. Thou knowest them not; but We know them, and We shall chastise them twice, then they will be returned to a mighty chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among those around you of the wandering Arabs there are hypocrites, and among the townspeople of Al-Madinah (there are some who) persist in hypocrisy whom thou (O Muhammad) knowest not. We, We know them, and We shall chastise them twice; then they will be relegated to a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of the desert Arabs around you are hypocrites as are some of the people of Madinah -- they are obdurate in their hypocrisy. You do not know them, but We know them. We shall cause them to suffer doubly and then they will be subjected to a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the dwellers of the desert around you some are hypocrites, and so are some of the people of Madinah; they have become inured to hypocrisy thou knowest them not, We know them. We will torment them twice, and thereafter they shall be brought back to a torment terrible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are hypocrites among the Bedouins around you and among the townspeople of Madinah, steeped in hypocrisy. You do not know them; We know them, and We will punish them twice, then they shall be consigned to a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certain of the desert Arabs round about you are hypocrites, as well as (desert Arabs) among the Medina folk: they are obstinate in hypocrisy: thou knowest them not: We know them: twice shall We punish them: and in addition shall they be sent to a grievous penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the bedouins round about you, some are hypocrites, and so are some among the people of Al-Madinah, they exaggerate and persist in hypocrisy, you (O Muhammad SAW) know them not, We know them. We shall punish them twice, and thereafter they shall be brought back to a great (horrible) torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of the Bedouin Arabs around you are hypocrites, and so are some of the people of Madinah who are well versed in hypocrisy. You do not know them, but We do. Twice We will punish them then they shall return to a mighty punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the Desert-Arabs around you there are some hypocrites, and among the inhabitants of Medina too. They have become adamant in hypocrisy. You do not know them, but We know them. We will punish them twice; then they will be returned to a severe torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among those around you of the bedouins are hypocrites, and [also] from the people of Madinah. They have become accustomed to hypocrisy. You, [O Muhammad], do not know them, [but] We know them. We will punish them twice [in this world]; then they will be returned to a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:101] And among those around you, O inhabitants of Medina, of the Bedouins there are hypocrites, such as [the tribes of] Aslam, Ashja‘ and Ghifār, and among the townspeople of Medina, there are also hypocrites, who are obstinate in hypocrisy, engrossed in it and persisting [in it]. You do not know them — an address to the Prophet (s) — but We know them, and We shall chastise them twice, by disgracing them or having them killed in this world, and by way of punishment in the grave, then they will be returned, in the Hereafter, to a terrible chastisement, namely, the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And among those around you of the wandering Arabs) the tribes of Asad and Ghatafan (there are hypocrites, and among the townspeople of Medina) 'Abdullah Ibn Ubayy and his host ((there are some who) persist in hypocrisy whom thou (0 Muhammad) knowest not) whose hypocrisy you do not know. (We, We know them) We know their hypocrisy, (and We shall chastise them twice) once upon taking away their souls and another time in the grave; (then they will be relegated to a painful doom) to the chastisement of hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَرَدُواْ عَلَى ٱلنِّفَاقِ } معناهُ عَتَوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِمَّنْ حَوْلَكُمْ } أيها المؤمنون { مِّنَ ٱلأَعْرَابِ } الساكنين في البوادي قوم، هم { مُنَٰفِقُونَ } معكم، وإن إظهروا المؤدة والإخاء، والإيمان على طرف اللسان، لا تبالوا بإيمانهم، ولا تغفلوا عن خدعهم { وَمِنْ أَهْلِ ٱلْمَدِينَةِ } أيضاً قوم { مَرَدُواْ } أي: رسخوا { عَلَى ٱلنِّفَاقِ } ومن شدة نفاقهم وتمرنهم عليه صاروا بحيث { لاَ تَعْلَمُهُمْ } أيها المتصف بالفراسة الكاملة من غاية تلبيسهم وإخفائهم، بل { نَحْنُ نَعْلَمُهُمْ } ونعلم ما في ضمائرهم من الخيالات الفاسدة { سَنُعَذِّبُهُم } في الدنيا { مَّرَّتَيْنِ } مرة بتفضيحهم وإظهار ما في قلوبهم من الأكنة والشقاق، ومرة بقتلهم وسبيهم وإجلائهم { ثُمَّ يُرَدُّونَ } بعد انقضاء النشأة الأولى { إِلَىٰ عَذَابٍ عَظِيمٍ } [التوبة: 101] هو حرمانهم وانحطاطهم عن المرتبة الكاملة الإنسانية التي هي مرتبة الخلافة والنيابة الجامعة لجميع المراتب الكونية والكيانية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وممن حولكم } ، يا أهل المدينة، { من الأعراب منافقون } ساكنون حولكم، وهم: جُهينة، ومُزينة، وأسلم، وغفار، وأشجع، كانوا نازلين حول المدينة، أما أسلم وغفار فتابوا، ودعا لهم ـ عليه الصلاة والسلام ـ فقال:\n\n \" أسلم سالمها الله، وغفار غفر الله لها \" \n",
      "translations": []
    }
  ]
}