{
  "chapter": "التوبة",
  "text": "والسبقون الاولون من المهجرين والانصار والذين اتبعوهم باحسن رضى الله عنهم ورضوا۟ عنه واعد لهم جنت تجرى تحتها الانهر خلدين فيها ابدا ذلك الفوز العظيم",
  "translations": [
    {
      "translation": "The forerunners - the first of the Muhajirun and the Ansar - and those who have followed them in doing good: Allah is pleased with them and they are pleased with Him. He has prepared Gardens for them with rivers flowing under them, remaining in them timelessly, for ever and ever. That is the great victory.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those among the migrants (from Makkah) and helpers (in Madina) who were the first to believe, and those who followed them in goodness, have been accepted by God and they follow His way. For them He has gardens with streams of running water where they will abide for ever; and that is happiness supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of those who led the way - the first of the Emigrants (Muhajirun) and the Helpers (Ansar), and those who followed them in the best possible manner - Allah is well-pleased with them and they are well-pleased with Allah. He has prepared for them Gardens beneath which rivers flow; therein they will abide forever. That is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is well pleased with the foremost ones of those who left their homes for the cause of God, those who helped them after their arrival in Medina and those who nobly followed these two groups. He has prepared gardens for them wherein streams flow and wherein they will live forever. This, certainly is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And leading everyone, the first are the Muhajirs* and the Ansar**, and those who followed them with virtue – Allah is pleased with them and they are pleased with Him, and He has kept ready for them Gardens beneath which rivers flow, to abide in it for ever and ever; this is the greatest success. (* The immigrants. **Those who helped the immigrants.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the foremost to embrace Islam of the Muhajirin and the Ansar and also those who followed them exactly (in faith). Allah is well-pleased with them as they are well-pleased with Him. He has prepared for them Gardens under which rivers flow (Paradise), to dwell therein forever. That is the supreme success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) the foremost, the first of the Muhajirs and the Ansars, and those who followed them in goodness, Allah is well pleased with them and they are well pleased with Him, and He has prepared for them gardens beneath which rivers flow, to abide in them for ever; that is the mighty achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Outstrippers, the first of the Emigrants and the Helpers, and those who followed them in good-doing -- God will be well-pleased with them and they are well-pleased with Him; and He has prepared for them gardens underneath which rivers flow, therein to dwell forever and ever; that is the mighty triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the first to lead the way, of the Muhajirin and the Ansar, and those who followed them in goodness - Allah is well pleased with them and they are well pleased with Him, and He hath made ready for them Gardens underneath which rivers flow, wherein they will abide for ever. That is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who led the way, the first of the emigrants and the supporters, as well as those who nobly followed them, God is well pleased with them, and they are well pleased with Him; He has prepared for them Gardens through which rivers flow, where they shall dwell forever. That is the supreme achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Muhajirs and Ansar, the leaders and the first ones and those who followed them in well-doing, --well-pleased is Allah with them, and well pleased are they with Him, and He hath gotten ready for them Gardens where under the rivers flow, as abiders therein forever. That is the achievement supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The early vanguard of the Emigrants and the Helpers and those who followed them in virtue—Allah is pleased with them and they are pleased with Him, and He has prepared for them gardens with streams running in them, to remain in them forever. That is the great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The vanguard (of Islam)- the first of those who forsook (their homes) and of those who gave them aid, and (also) those who follow them in (all) good deeds,- well-pleased is Allah with them, as are they with Him: for them hath He prepared gardens under which rivers flow, to dwell therein for ever: that is the supreme felicity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the first to embrace Islam of the Muhajirun (those who migrated from Makkah to Al-Madinah) and the Ansar (the citizens of Al-Madinah who helped and gave aid to the Muhajirun) and also those who followed them exactly (in Faith). Allah is well-pleased with them as they are well-pleased with Him. He has prepared for them Gardens under which rivers flow (Paradise), to dwell therein forever. That is the supreme success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the first outstrippers among the migrants and supporters and those who followed them in doing good, Allah is pleased with them and they are pleased with Him. He has prepared for them gardens underneath which rivers flow, where they shall live for ever. That is the greatest winning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Pioneers—The first of the Migrants and the Supporters, and those who followed them in righteousness. God is pleased with them, and they are pleased with Him. He has prepared for them Gardens beneath which rivers flow, where they will abide forever. That is the sublime triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the first forerunners [in the faith] among the Muhajireen and the Ansar and those who followed them with good conduct - Allah is pleased with them and they are pleased with Him, and He has prepared for them gardens beneath which rivers flow, wherein they will abide forever. That is the great attainment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:100] And the first to lead the way, of the Emigrants and the Helpers, namely, those who were present at [the battle of] Badr, or [it means] all the Companions, and those who follow them, up to the Day of Resurrection, by being virtuous, in deeds, God will be pleased with them, for their obedience of Him, and they will be pleased with Him, for His reward [to them]; and He has prepared for them Gardens — with rivers flowing beneath them (a variant reading adds min [min tahtihā, ‘beneath which’]) — to abide therein forever: that is   the supreme triumph.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the first to lead the way) through faith: those who had prayed towards the two Qiblahs and fought at Badr, (of the Muhajirun and the Ansar, and those who followed them in goodness) through fulfilling the obligations and shunning transgression, this being applicable until the Day of Judgement (Allah is well pleased with them) because of their goodness (and they are well pleased with Him) owing to His reward and the honour He bestowed upon them (and He hath made ready for them Gardens underneath which) beneath its trees and habitations (rivers) rivers of water, wine, honey and milk (flow, wherein they will abide for ever) they will dwell in Paradise, never to die or be taken out of it. (That is the Supreme Triumph) Allah's good pleasure and Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ والسابقون الأوّلون } أي: الذين سبقوا إلى الوحدة من أهل الصف الأول { من المهاجرين } الذين هاجروا مواطن النفس { والأنصار } الذين نصروا القلب بالعلوم الحقيقية على النفس { الذين اتبعوهم } في الاتصاف بصفات الحق { بإحْسَان } أي: بمشاهدة من مشاهدات الجمال والجلال { رضي الله عنهم } لاشتراكهم في كشف الصفات والوصول إلى مقام الرضا الذي هو باب الله الأعظم { وأعدّ لهم جنات } من جنات الأفعال والصفات { تجْرِي تحتها } أنهار علوم التوكل والرضا وما يناسبهما وذلك لا ينافي وجود جنة أخرى للسابقين هي جنة الذات واختصاصهم بها لاشتراك الكل في هذه\n { وآخرون اعْتَرَفوا بذُنُوبهم } الاعتراف بالذنب هو إبقاء نور الاستعداد ولين الشكيمة وعدم رسوخ ملكة الذنب فيه لأنه ملك الرجوع والتوبة ودليل رؤية قبح الذنب التي لا تكون إلا بنور البصيرة وانفتاح عين القلب إذ لو ارتكمت الظلمة ورسخت الرذيلة ما استقبحه ولم يره ذنباً بل رآه فعلاً حسناً لمناسبته لحاله فإذا عرف أنه ذنب ففيه خير { خلطوا عملاً صالحاً وآخر سيئاً } أي: كانوا في رتبة النفس اللوّامة التي لم يصر اتصالها بالقلب وتنوّرها بنوره ملكة ولم يتذلل بعد في طاعتها للقلب\n فتارة يستولي عليها القلب فتتذلل وتنقاد وتتنوّر بنوره وتعمل أعمالاً صالحة\n وتارة تظهر بصفاتها الحاجبة لنور القلب عنها وتحتجب بظلمتها فتفعل أفعالاً سيئة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلسَّابِقُونَ } في الإيمان\n المبادرون إلى التصديق وقبول الأحكام { ٱلأَوَّلُونَ } الأقدمون بمتابعة الرسول { مِنَ ٱلْمُهَاجِرِينَ } الذين هاجروا من مألوفات نفوسهم ومتشهيات طباعهم إلى الفناء في الله { وَٱلأَنْصَارِ } الأبرار الذين سلكوا نحو الحق بالرياضات المجاهدات الشاقة المزيحة لدرن التعلقات ورين الإضافات\n المانعة من التوجه الحقيقي\n\n\n{ وَٱلَّذِينَ ٱتَّبَعُوهُم } واقتفوا أثرهم من أهل الطلب والإرادة { بِإِحْسَانٍ } أي: بلا تمايل إلى الرياء والسمعة والعجب\n أولئك المبرورون\n المقبولون { رَّضِيَ ٱللَّهُ عَنْهُمْ } لتحققهم بمرتبة الإخلاص والتسليم { وَرَضُواْ عَنْهُ } لإصالهم إلى مقر التوحيد وفضاء الفناء المثمر للبقاء الأبدي والحياة السرمدية { وَأَعَدَّ لَهُمْ } سبحانه في حوزة حمايته وروضة بقائه { جَنَّاتٍ } منتزهات { تَجْرِي تَحْتَهَا ٱلأَنْهَارُ } من العلوم والمعارف { خَالِدِينَ فِيهَآ أَبَداً } لا يتحولون عنها أصلاً { ذٰلِكَ ٱلْفَوْزُ ٱلْعَظِيمُ } [التوبة: 100] واللطف الجسيم لأهل العناية من أرباب الولاية والمحبة\n المنخلعين عن جلباب ناسوتهم مطلقاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: السابقون: مبتدأ، والذين اتبعوهم: عطف عليه، وجملة رضي الله عنهم: خبر.  يقول الحق جل جلاله: { والسابقُون الأولون } إلى الإسلام { من المهاجرين } وهم الذين صلوا إلى القبلتين، أو الذين شهدوا بدراً، أو الذين أسلموا قبل الهجرة، { و } من { الأنصار } وهم أهل بيعة العقبة الأولى، وكانوا سبعة، أو أهل العقبة الثانية، وكانوا سبعين، أو الذين أسلموا حين قدم عليهم مُصعب بن عُمير. { والذين اتبعوهم بإحسان } اللاحقين بالسابقين من الفريقين، أو من الذين اتبعوهم بالإيمان والطاعة إلى يوم القيامة، { رَضِيَ اللهُ عنهم } بقبول طاعتهم وارتضاء أعمالهم، { ورَضُوا عنه } بما نالوا من نِعَمه الدينية والدنيوية، { وأعَدَّ لهم جنات تجري من تَحْتَها الأنهار } وقرأ ابن كثير: \" من تحتها \" ، كما هي في مصحف أهل مكة. { خالدين فيها أبداً ذلك الفوز العظيم } أي: الفلاح الدائم الكبير.  الإشارة: لكل زمان سابقون، قد شمروا عن ساق الجد والاجتهاد، ورفضوا كل ما يقطعهم عن محبوبهم من العشائر والأولاد، قد خرقوا عوائد أنفسهم، فأبدلوا العز بالذل، والجاة بالخمول، والغنى بالفقر، والرفعة بالتواضع، والرغبة بالزهد، وشغل الظاهر بالتفرغ ليتفرغ بذلك الباطن. وسافروا في طلب محبوبهم، وصحبوا المشايخ، وخدموا الإخوان، حتى ارتفعت عنهم الحجب والأستار، وتمتعوا بمشاهدة الكريم الغفار فتهيؤوا لتذكير العباد، وحبت بهم الأقطار والبلاد. وفي مثلهم يقول الشاعر:\n{ فلا تعلم نفس ما أخفي لهم من قرة أعين جزاء بما كانوا يعلمون }. ثم ذكر بقية المنافقين، فقال: { وَمِمَّنْ حَوْلَكُمْ مِّنَ ٱلأَعْرَابِ مُنَافِقُونَ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:119",
      "similarity": 0.6906538647958519
    },
    {
      "verse": "9:89",
      "similarity": 0.6370446440648376
    },
    {
      "verse": "48:5",
      "similarity": 0.5415249519726556
    },
    {
      "verse": "4:13",
      "similarity": 0.4815264249181155
    },
    {
      "verse": "4:122",
      "similarity": 0.472162709166541
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009100.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009100.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:100.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}