{
  "chapter": "التوبة",
  "text": "لا تقم فيه ابدا لمسجد اسس على التقوى من اول يوم احق ان تقوم فيه فيه رجال يحبون ان يتطهروا۟ والله يحب المطهرين",
  "translations": [
    {
      "translation": "Do not ever stand in it. A mosque founded on taqwa from the first day has a greater right for you to stand in it. In it there are men who love to purify themselves. Allah loves those who purify themselves.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never set foot in that place. Only a mosque whose foundations have been laid from the very first on godliness is worthy of your visiting it. There you will find men who wish to be purified; and God loves those who are pure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never stand therein. Surely a mosque founded from the first day on piety is more worthy that you should stand in it for Prayer. In it are people who love to purify themselves, and Allah loves those that purify themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), never stay in that mosque. The mosque which was established for a pious purpose and before all other mosques is more virtuous for your prayer. In this mosque, there are people who love to be purified. God loves those who purify themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never stand (for worship) in that mosque*; indeed the mosque** that has been founded on piety from the very first day deserves that you should stand in it; in it are the people who wish to thoroughly cleanse themselves; and Allah loves the clean. (*The mosque built by the hypocrites. ** The mosque at Quba, built by the Holy Prophet and his companions. The merit of praying 2 Raka’ Nawafil in it is equal to the reward of an Umrah.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never stand you therein. Verily, the Masjid whose foundation was laid from the first day on Taqwa is more worthy that you stand therein (to pray). In it are men who love to clean and purify themselves. And Allah loves those who make themselves clean and pure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never stand in it; certainly a masjid founded on piety from the very first day is more deserving that you should stand in it; in it are men who love that they should be purified; and Allah loves those who purify themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Stand there never. A mosque that was founded upon godfearing from the first day is worthier for thee to stand in; therein are men who love to cleanse themselves; and God loves those who cleanse themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never stand (to pray) there. A place of worship which was found upon duty (to Allah) from the first day is more worthy that thou shouldst stand (to pray) therein, wherein are men who love to purify themselves. Allah loveth the purifiers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not set foot in it. Only a house of worship, founded from the very first day upon piety, is worthy of your setting foot therein. In it are men who love to be purified and God loves those who purify themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou Shalt never stand therein. Surely a mosque founded from the first day on piety is wortheir that thou shouldst stand therein. In it are men who love to cleanse themselves: and Allah approveth the clean.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not stand in it ever! A mosque founded on Godwariness from the [very] first day is worthier that you stand in it [for prayer]. Therein are men who love to keep pure, and Allah loves those who keep pure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never stand thou forth therein. There is a mosque whose foundation was laid from the first day on piety; it is more worthy of the standing forth (for prayer) therein. In it are men who love to be purified; and Allah loveth those who make themselves pure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never stand you therein. Verily, the mosque whose foundation was laid from the first day on piety is more worthy that you stand therein (to pray). In it are men who love to clean and to purify themselves. And Allah loves those who make themselves clean and pure (i.e. who clean their private parts with dust [i.e. to be considered as soap) and water from urine and stools, after answering the call of nature].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall never stand there. A mosque founded upon piety from the first day is worthier for you to stand in. In it are men who love to purify themselves. Allah loves those who purify themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not stand in it, ever. A mosque founded upon piety from the first day is worthier of your standing in it. In it are men who love to be purified. God loves those who purify themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not stand [for prayer] within it - ever. A mosque founded on righteousness from the first day is more worthy for you to stand in. Within it are men who love to purify themselves; and Allah loves those who purify themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:108] Never stand, [never] perform prayer, there: and so he sent a group of men to destroy and burn it, and in its place they left a refuse pit where decaying cadavers would be dumped. A mosque which was founded, one whose foundations were built, upon piety from the first day, constructed the day you arrived in Medina (dār al-hijra) — this was the mosque of Qubā’, as mentioned in Bukhārī — is worthier, than that [other one], for you to stand, to perform prayer, therein; in it are men, namely, the Ansār, who love to purify themselves; and God loves those who purify themselves (muttahhirīn: the original tā’ [of mutatahhirūn] has been assimilated with the tā’) that is, He will reward them. Ibn Khuzayma reported in his Sahīh [by way of an isnād] from [‘Uwaym] b. Sā‘ida that: ‘The Prophet (s) came to them at the mosque of Qubā’ and said, “God, exalted be He, has praised handsomely the way you purify yourselves in the story about your mosque, so what is this purification which you perform?” They said, “By God, O Messenger of God, all that we know is that we used to have Jews in our vicinity and they used to wash their behinds after defecation, and so we began to wash in the way they did”’. According to one hadīth reported by al-Bazzār [they said]: ‘We use stones [to scrape off remnants] and follow this with water’; to which he [the Prophet] said, ‘That is the way [for proper purification]. Let this be your way’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Never stand (to pray) there) never pray in the mosque of opposition. (A place of worship) i.e. the mosque of Quba' (which was founded upon duty (to Allah)) which was founded upon obedience and remembrance of Allah (from the first day) the Prophet (pbuh) entered Medina; it is also said this means: the first mosque ever built in Medina (is more worthy) is more right (that thou shouldst stand (to pray) therein) in the mosque of Quba', (wherein are men who love to purify themselves) men who wash their behinds with water\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ لمسجد أُسسَ على التقوى } لما كان عالم الملك تحت قهر عالم الملكوت وتسخيره لزم أن يكون لنيات النفوس وهيئاتها تأثير فيما يباشرها من الأعمال فكل ما فعل بنية صادقة لله تعالى عن هيئة نورانية صحبته بركة ويمن وجمعية وصفا\n وكل ما فعل بنية فاسدة شيطانية عن هيئة مظلمة صحبته تفرقة وكدورة ومحق وشؤم\n ألا ترى الكعبة كيف شرفت وعظمت وجُعِلَت متبركة لكونها مبنية على يدي نبيّ من أنبياء الله بنيّة صادقة ونفس شريفة صافية عن كمال إخلاص لله تعالى\n ونحن نشاهد أثر ذلك في أعمال الناس ونجد أثر الصفاء والجمعية في بعض المواضع والبقاع\n والكدورة والتفرقة في بعضها وما هو إلا لذلك\n فلهذا قال: { لمسجد أُسس على التقوى } \n { من أول يوم أحق أن تقوم فيه } لأن الهيئات الجسمانية مؤثرة في النفوس كما أن الهيئات النفسانية مؤثرة في الأجسام\n فإذا كان موضع القيام مبنياً على التقوى وصفاء النفس تأثرت النفس باجتماع الهم وصفاء الوقت وطيب الحال وذوق الوجدان\n وإذا كان مبنياً على الرياء والضرار تأثرت بالكدورة والتفرقة والقبض { فيه رجال يحبون أن يتطهروا } أي: أهل إرادة وسعي في التطهر عن الذنوب نبّه على أن صحبة الصالحين من أهل الإرادة لها أثر عظيم يجب أن تختار وتؤثر على غيرها\n كما أن المقام له أثر يجب أن يراعى ويتعاهد ولهذا ورد في اصطلاح القوم: يجب مراعاة الزمان والمكان والإخوان في حصول الجمعية وجعلوها شرطاً لها وفيه إشعار بأن زكاء نفس الباني وصدق نيته مؤثر في البناء وإن تبرّك المكان وكونه مبنياً على الخير يقتضي أن يكون فيه أهل الخير والصلاح ممن يناسب حاله حال بانيه\n وإن محبة الله واجبة لأهل الإرادة والطهارة لقوله: { والله يحب المتطهرين } كيف ولولا محبة الله إياهم لما أحبوا التطهر",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وسوء قصدهم وفعالهم { لاَ تَقُمْ فِيهِ أَبَداً } للتوجه والصلاة\n لكونه مبنياً على الخداع والتزوير { لَّمَسْجِدٌ أُسِّسَ } وبني { عَلَى ٱلتَّقْوَىٰ } عن محارم الله وخالصاً لرضاه { مِنْ أَوَّلِ يَوْمٍ } بني\n وهو مسجد قباء { أَحَقُّ } أي: أليق وأولى { أَن تَقُومَ فِيهِ } للصلاة والميل نحو الحق\n إذ { فِيهِ رِجَالٌ } مؤمنون كاملون في الإيمان { يُحِبُّونَ } دائماً { أَن يَتَطَهَّرُواْ } عن المعاصي والآثام\n ويتوجهوا نحو الحق برفض الشواغل ونقض العوائق العلائق { وَٱللَّهُ } المطلع بنياتهم { يُحِبُّ ٱلْمُطَّهِّرِينَ } [التوبة: 108] القاصدين تظهير ذواتهم عن التوجه إلى ما سوى الحق المطلق\n بل عن هوياتهم وتعيناتهم الباطلة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  ثم نهاه عن الصلاة فيه فقال: { لا تَقُم فيه أبداً } للصلاة إسعافاً لهم\n { لمسجدٌ أُسسَ على التقوى من أول يوم } من أيام وجوده\n { أحقٌ أن تقوم فيه } أي: أولى بأن تصلى فيه\n وهو مسجد قباء\n أسسه رسول الله صلى الله عليه وسلم في أيام مُقامه بقباء\n حين هاجر من مكة\n من الاثنين إلى الجمعة\n وهذا أوفق للقصة\n\nوقيل: مسجد الرسول صلى الله عليه وسلم لقول أبي سعيد: سألت رسول الله صلى الله عليه وسلم عنه؟ فقال:\n \" مسْجدُكم هذا\n مَسجِدُ المَدِينَةِ \" \n{ فيه رجال يُحبون أن يتطهروا } \n كانوا يستنجون بالماء\n ويجمعون بين الماء والحجر\n أو يتطهرون من المعاصي والخصال المذمومة\n طلباً لمرضات الله تعالى\n أو من الجنابة\n فلا ينامون عليها\n { والله يُحبُ المُطَّهرِين } يرضى عنهم\n ويُدنيهم من جنابه إدْناء المحب لحبيبه\n وقيل: لما نَزلت مشى رسول الله صلى الله عليه وسلم\n ومعه المُهاجرون\n حتى وقف على باب مسجد قُباء\n فإذا الأنصار جُلوس\n فقال:\n \" أَمؤمِنونَ أَنتُم \" \nفَسَكَتُوا\n فأعادَها\n فقال عمر: إنهم مؤمنون وَأَنا مَعَهم\n فقال عليه الصلاة والسلام:\n \" أَتَرضَونَ بالقَضاء \" \nفقالوا: نعم\n قال:\n \" أَتَصبِرون على البلاء \" \nقالوا: نعم\n قال:\n \" أَتشْكرونَ في الرَّخاء \" \nقالوا: نعم\n فقال عليه الصلاة والسلام:\n \" مؤمِنُونَ وَرَبِّ الكَعبَةِ \" \nفَجَلَسَ\n ثم قال:\n \" يا مَعشَرَ الأنْصَار\n إنَّ الله عزَّ وجلَّ قد أَثنى عَلَيكم\n فما الذي تَصنَعُون عند الوضوء وعِندَ الغائط \" \nفقالوا: يا رسول الله\n نُتبع الغائط الأحجارَ الثلاثةَ\n ثم نُتبعُ الأحجار المَاء\n فقال: { رِجَالٌ يُحِبُون أن يتَطَّهَروا } \"",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:109",
      "similarity": 0.27445725550657374
    },
    {
      "verse": "4:57",
      "similarity": 0.178590504335506
    },
    {
      "verse": "27:56",
      "similarity": 0.12801452177911077
    },
    {
      "verse": "33:53",
      "similarity": 0.11939724715753543
    },
    {
      "verse": "22:26",
      "similarity": 0.11842448633758455
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009108.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009108.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:108.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}