{
  "chapter": "التوبة",
  "text": "وءاخرون اعترفوا۟ بذنوبهم خلطوا۟ عملا صلحا وءاخر سيئا عسى الله ان يتوب عليهم ان الله غفور رحيم",
  "translations": [
    {
      "translation": "But others have acknowledged their wrong actions and mixed a right action with another which is wrong. It may well be that Allah will turn towards them. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But there are others who admit their sins of mixing good deeds with evil. It may be that God will accept their repentance, for God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are others who have confessed their faults. They intermixed their good deeds with evil. It is likely that Allah will turn to them in mercy, for Allah is All- Forgiving, Ever Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them have already confessed their sins and have mixed virtuous deeds with sinful ones. Perhaps God will forgive them. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are others who have acknowledged their sins and mixed a good deed with another that was bad; it is likely that Allah will accept their repentance; indeed Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (there are) others who have acknowledged their sins, they have mixed a deed that was righteous with another that was evil. Perhaps Allah will turn unto them in forgiveness. Surely, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And others have confessed their faults, they have mingled a good deed and an evil one; may be Allah will turn to them (mercifully); surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And other have confessed their sins; they have mixed a righteous deed with another evil. It may be that God will turn towards them; God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (there are) others who have acknowledged their faults. They mixed a righteous action with another that was bad. It may be that Allah will relent toward them. Lo! Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are others who have confessed their wrongdoing, who have done some good deeds and some bad ones. It is likely that God will turn to them in mercy. Surely, God is most forgiving, merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And others have confessed their faults; they have mixed up a righteous work with anot her vicious. Bellike Allah will relent toward them; verily Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[There are] others who have confessed to their sins, having mixed up righteous conduct with other that was evil. Maybe Allah will accept their repentance. Indeed Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Others (there are who) have acknowledged their wrong-doings: they have mixed an act that was good with another that was evil. Perhaps Allah will turn unto them (in Mercy): for Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (there are) others who have acknowledged their sins, they have mixed a deed that was righteous with another that was evil. Perhaps Allah will turn unto them in forgiveness. Surely, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are others who have confessed their sins; they intermixed good deeds with another evil. It may be that Allah will turn towards them in mercy. Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Others have confessed their sins, having mixed good deeds with bad deeds. Perhaps God will redeem them. God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [there are] others who have acknowledged their sins. They had mixed a righteous deed with another that was bad. Perhaps Allah will turn to them in forgiveness. Indeed, Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:102] And [there are] others (ākharūn is the subject), [another] folk, who have confessed their sins, for having stayed behind (i‘tarafū bi-dhunūbihim is an adjectival qualification of it [the subject] and the predicate is [the following, khalatū ‘amalan sālihan]) they have mixed a righteous deed, that is, their former [participation in the] struggle, or the their confession of their sins, or otherwise, with another that was bad, which is their having stayed behind. It may be that God will relent to them. Truly God is Forgiving, Merciful: this was revealed regarding Abū Lubāba and a group of men who tied themselves to the walls of the mosque after they heard what had been revealed regarding those who stayed behind; they swore that only the Prophet (s) would untie them, which he did when this [verse] was revealed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (there are) others) and of the people of Medina, there are other people: Wadi'ah Ibn Judham al-Ansari, Abu Lubabah Ibn 'Abd al-Mundhir al-Ansari and Abu Tha'labah (who have acknowledged their faults) by not joining in the Battle of Tabuk. (They mixed a righteous action) they went forth with the Prophet (pbuh) once (with another that was bad) and stayed behind once. (It may be) 'may be' ['asa] when used in connection with Allah denotes a requisite (that Allah will relent towards them) forgive them. (Lo! Allah is Relenting) towards those who repent among them, (Merciful) towards he who dies in a state of repentance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من أهل المدينة قوم { آخَرُونَ } ليسوا من المصرين على النفاق، المتمرنين فيه، بل { ٱعْتَرَفُواْ بِذُنُوبِهِمْ } التي صدرت عنهم من المخالفة والبغض والطعن والاستخفاف، والغيبة حين خلوا مع المنافقين المتمرنين، وهم وإن صدر عنهم الإيمان والإخلاص، لكنهم { خَلَطُواْ عَمَلاً صَالِحاً } من الإخلاص والرضاء، والتسليم { وَ } عملاً { آخَرَ سَيِّئاً } وهو اتفاقهم مع المنافقين في خوضهم وطعنهم، بذلك انحطوا عن رتبة المخلصين في جميع حالاتهم { إِنَّ ٱللَّهَ } أي: يوفقهم على التوبة والندامة، ويقبل منهم توبتهم بعدما أخلصوا فيها { عَسَى ٱللَّهُ أَن يَتُوبَ عَلَيْهِمْ } المصلح لأحوال عباده { غَفُورٌ } لمن تاب وندم عن ظهر القلب { رَّحِيمٌ } [التوبة: 102] يقبل توبتهم إن أفرطوا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { و } قوم { آخرون اعترفوا بذُنوبهم } وهو التخلف عن الجهاد، ولم يعتذروا عن تخلفهم بالأعذار الكاذبة، وهم طائفة من المتخلفين لما بلغهم ما نزل في المتخلفين أوثقوا أنفسَهم على سواري المسجد، وقالوا: لا نحل أنفسنا حتى يحلنا رسول الله صلى الله عليه وسلم فلما قدم رسول الله صلى الله عليه وسلم دخل المسجد، فصلى فيه ركعتين، على عادته، فرآهم وسأل عنهم، فذُكر له سببهم، فنزلت الآية فأطلقهم\n { خلطوا عملاً صالحاً } بعمل سيء { وآخر سيئاً } بعمل صالح، خلطوا العمل الصالح الذي هو إظهار الندم والاعتراف بالذنب، بآخر سيئ وهو التخلف وموافقة أهل النفاق، أو خلطوا عملاً صالحاً، وهو ما سبق لهم من الجهاد مع الرسول، وغيره من الأعمال، بآخر سيئ، وهو تخلفهم عن تبوك\n { عَسَى اللهُ أن يتوبَ عليهم } أي: يقبل توبتهم المدلول عليها بقوله: { اعترفوا بذنوبهم } ، والرجاء في حقه تعالى واجب\n { إن الله غفور رحيمٌ } يتجاوز عن التائب ويتفضل عليهم\n قال بعضهم: ما في القرآن آية أرجى لهذة الأمة من هذه الآية\n وقال القشيري: قوله: { وآخر سيئاً } بعد قوله: { عملاً صالحاً } دليل على أن الزَّلَّةَ لا تحبط ثوابَ الطاعة إذ لو أحبطته لم يكن العملُ صالحاً، وهو كذلك\n انتهى\n قُلْتُ: وما ذكره من عدم الإحباط هو مذهب أهل السنة، خلافاً للمعتزلة، ولا يعارضه حديث مسلم:\n\n \" أًنَّ رَجُلاً قال: واللَّهِ لا يَغفِرُ الله لفُلانِ، وإنَّ اللَّهَ قالَ: مَن الذي يَتَأَلّى عَلَيَّ أَلاَّ أَغفِرَ لفُلانِ، وإنّي غَفَرتُ لَه، وأحبطَتُ عَمَلك \" \n\nأو كما قال لأن هذا الرجل كان من بني إسرائيل، ولعل شرعهم مخالف لشرعنا لأن هذه الأمة المحمدية قد وضع الله عنها أثقال بني إسرائيل، فهي ملة سمحة، ولعل هذا الرجل أيضاً كان قانطاً من رحمة الله ومكذباً بها، فهو كافر\n انظر الحاشية الفاسية\n الإشارة: الناس ثلاثة: سابقون ومخلطون ومنهمكون\n فالسابقون فائزون، والمخلطون راجون، والمنهمكون هالكون، إلا من تاب وعمل صالحاً، فالسابقون هم الذين غلب إحسانهم على إساءتهم، وصفاؤهم على كدرهم، إن هفوا رجعوا قريباً، فقد تمر عليهم السنين الطويلة، ولا يكتب عليهم ملك الشمال شيئاً وذلك ليقظتهم، لا لعصمتهم، والمخلطون هم الذين يكثر سقوطهم ورجوعهم، عسى الله أن يتوب عليهم\n والمنهمكون هم المصرون على الفواحش، فإن سبقت لهم عناية رجعوا، وإن لم تسبق لهم عناية فهم مُعرِّضون لنقمة الله وحلمه، والله تعالى أعلم\n\n\n \" ولما تاب اللهُ على المتخلفين، وأطلقهم رسول الله صلى الله عليه وسلم من الوثائق، قالوا: يا رسول الله، هذه أَمْوَالُنا التي خلفْتَنا خُذْها فَتَصَدَّقْ بِهَا وطَهِّرْنَا، فقال عليه الصلاة والسلام: \" أما أُمِرتُ أَنْ آخُذَ مِنْ أَمْوالِكُمْ شَيْئاً \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:220",
      "similarity": 0.4456236638455437
    },
    {
      "verse": "28:67",
      "similarity": 0.3034177543039406
    },
    {
      "verse": "38:24",
      "similarity": 0.2671227320415023
    },
    {
      "verse": "60:7",
      "similarity": 0.22979651010025906
    },
    {
      "verse": "4:99",
      "similarity": 0.2297156056591058
    }
  ]
}