{
  "chapter": "التوبة",
  "text": "خذ من امولهم صدقة تطهرهم وتزكيهم بها وصل عليهم ان صلوتك سكن لهم والله سميع عليم",
  "translations": [
    {
      "translation": "Take zakat from their wealth to purify and cleanse them and pray for them. Your prayers bring relief to them. Allah is All-Hearing, All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Accept the offerings they make from their wealth in order to cleanse and purify them for progress, and invoke blessings upon them. Your blessings will surely bring them peace, for God hears all and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet)! \"Take alms out of their riches and thereby cleanse them and bring about their growth (in righteousness), and pray for them. Indeed your prayer is a source of tranquillity for them.\" Allah is All-Hearing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Collect religious tax (zakat) from them to purify and cleanse them and pray for them; your prayers give them comfort. God is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O dear Prophet (Mohammed – peace and blessings be upon him) take the obligatory charity from their wealth, by which you may cleanse them and make them pure, and pray in their favour; indeed your prayer is the contentment of their hearts; and Allah is All Hearing, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take Sadaqah from their wealth in order to purify them and sanctify them with it, and Salli for them. Verily, your Salat are a Sakan for them; and Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take alms out of their property, you would cleanse them and purify them thereby, and pray for them; surely your prayer is a relief to them; and Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take of their wealth a freewill offering, to purify them and to cleanse them thereby, and pray for them; thy prayers are a comfort for them; God is All-hearing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take alms of their wealth, wherewith thou mayst purify them and mayst make them grow, and pray for them. Lo! thy prayer is an assuagement for them. Allah is Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take alms out of their wealth to cleanse them and purify them, and pray for them; your prayer will be a comfort to them. God is all hearing, all knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take thou alms out of their riches; thereby thou wilt cleanse them and purify them; and pray thou for them. Verily thy prayer is a repose for them; and Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take charity from their possessions to cleanse them and purify them thereby, and bless them. Indeed your blessing is a comfort to them, and Allah is all-hearing, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of their goods, take alms, that so thou mightest purify and sanctify them; and pray on their behalf. Verily thy prayers are a source of security for them: And Allah is One Who heareth and knoweth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take Sadaqah (alms) from their wealth in order to purify them and sanctify them with it, and invoke Allah for them. Verily! Your invocations are a source of security for them, and Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take charity from their wealth, in order that they are thereby cleansed and purified, and pray for them; for your prayer is a comforting mercy for them. Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Receive contributions from their wealth, to purify them and sanctify them with it; and pray for them. Your prayer is comfort for them. God is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take, [O, Muhammad], from their wealth a charity by which you purify them and cause them increase, and invoke [Allah 's blessings] upon them. Indeed, your invocations are reassurance for them. And Allah is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:103] Take of their wealth some alms, to purify them and to cleanse them thereby, of their sins; he thus took a third of their wealth and gave it away as charity; and pray for them, that is, supplicate for them; truly your prayers are a comfort, a mercy, for them: it is also said [to mean] reassurance [for them], that their repentance has been accepted. And God is Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then explained to the Prophet (pbuh) what he should take of their wealth because they had asked him to take some of it because they had stayed behind and not taken part in the Battle of Tabuk. But the Prophet (pbuh) initially refused to take anything from them until, that is, Allah explained the matter to him, saying: (Take alms) a third (of their wealth) the wealth of those who stayed behind, wherewith thou mayst purify them) from their sins (and mayst make them grow) and reform them with it, (and pray for them) ask forgiveness for them and make supplication for them. (Lo! Your prayer) your asking for their forgiveness and your supplications (is an assuagement for them) tranquillity for their hearts that their repentance will be accepted. (Allah is Hearer) of what they say, i.e. their saying: take our wealth, (Knower) of their repentance and intention. 207\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّ صَلَٰوتَك سَكَنٌ لَّهُمْ } معناه دُعاؤُكَ سَكَنٌ لَهُمْ وتَثبيتٌ\n ويقالُ: رَحمةٌ\n ويقالُ: قُربةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nولما وفقوا للقسم الأول ببركة صحبة الرسول وتزكيته إياهم وتربيته لهم قال: { خُذْ من أمْوَالهم صَدَقة } إذ المال هو سبب ظهور النفس وغلبة صفاتها ومدد قواها ومادة هواها كما قال عليه الصلاة والسلام:\n\n \" المال مادة الشهوات \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ خُذْ } يا أكمل الرسل { مِنْ أَمْوَالِهِمْ } أي: من أموال هؤلاء المذنبين التائبين، النادمين عمَّا صدر عنهم من المخالفة حين أذنوا لك أن تخرج منها { صَدَقَةً تُطَهِّرُهُمْ } عن أدناس الطبيعة المولعة لحب المال والحرص في جمعها ونمائها { وَتُزَكِّيهِمْ بِهَا } أي: تصفي بواطنهم عن الشواغل العائقة عن اللذات الروحانية { وَصَلِّ عَلَيْهِمْ } واستغفر لذنوبهم، وادع لهم بالدعاء الخير { إِنَّ صَلَٰوتَك } والتفاتك بحالهم { سَكَنٌ لَّهُمْ } أي: سكينة لقلوبهم ووقار وطمأنينة، وسبب لتقررهم وتثبتهم على جادة التوحيد والإيمان { وَٱللَّهُ } المراقب عليهم في حالاتهم { سَمِيعٌ } لإخلاصهم ومناجاتهم { عَلِيمٌ } [التوبة: 103] بنيَّاتهم وحاجاتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: لنبيه ـ عليه الصلاة والسلام: { خُذْ من أموالهم } التي عرضوها عليك { صدقة } ، وهو الثلث، فأخذ عليه الصلاة والسلام من أموالهم الثلث، وترك لهم الثلثين، أو: خذ من أموالهم صدقة، وهي الزكاة المفروضة، والضمير لجميع المسلمين\n من صفة تلك الصدقة: { تُطهّرهُم } أنت يا محمد بها من الذنوب، أو حب المال المؤدي بهم إلى البخل، الذي هو أقبح الذنوب\n وقرئ بالجزم جواب الأمر\n { وتُزكِّيهم } أي: تنمي بها حسناتهم، أو ترفعهم { بها } إلى درجات المخلصين، { وَصَلِّ عليهم } أي: ترحم عليهم، وادع لهم بالرحمة، فكان عليه الصلاة والسلام يقول لمن أتاه بصدقته:\n\n \" اللهُم صَل عَلى آلِ فُلان \"\n \n\nفأتى أبو أوفى بصدقته فقال:\n\n \" اللهم صلِّ على آل أَبي أَوفَى \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:79",
      "similarity": 0.437766439963896
    },
    {
      "verse": "80:14",
      "similarity": 0.4049223515531359
    },
    {
      "verse": "92:18",
      "similarity": 0.40410559157393017
    },
    {
      "verse": "74:4",
      "similarity": 0.38750852873950314
    },
    {
      "verse": "58:12",
      "similarity": 0.373433183156514
    }
  ]
}