{
  "chapter": "التوبة",
  "text": "الم يعلموا۟ ان الله هو يقبل التوبة عن عباده وياخذ الصدقت وان الله هو التواب الرحيم",
  "translations": [
    {
      "translation": "Do they not know that Allah accepts tawba from His slaves and acknowledges their zakat, and that Allah is the Ever-Returning, the Most Merciful?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that God accepts the repentance of His creatures and receives what they offer in charity, and that He is forgiving and kind?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they not aware that it is Allah Who accepts the repentance of His servants and accepts their alms, and that it is Allah Who is Oft-Relenting, Ever Merciful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that it is God who accepts the repentance of His servants and receives the welfare funds and that it is God who is All-forgiving and All-merciful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that Allah only accepts repentance of His bondmen and He takes the charity* and that Allah only is the Most Acceptor of Repentance, the Most Merciful? (* into His control.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know they not that Allah accepts repentance from His servants and accepts the Sadaqat, and that Allah alone is the One Who forgives and accepts repentance, Most Merciful\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that Allah accepts repentance from His servants and takes the alms, and that Allah is the Oft-returning (to mercy), the Merciful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that God is He who accepts repentance from His servants, and takes the freewill offerings, and that God -- He turns, and is All-compassionate?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know they not that Allah is He Who accepteth repentance from His bondmen and taketh the alms, and that Allah is He Who is the Relenting, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that God accepts the repentance of His servants and receives their alms, and that God is the Forgiving, the Merciful One?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know they not that it is Allah who accepteth the repentance of His bondmen and taketh the alms, and that it is Allah who is the Relenting, the Merciful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that it is Allah who accepts the repentance of His servants and receives the charities, and that it is Allah who is the All-clement, the All-merciful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know they not that Allah doth accept repentance from His votaries and receives their gifts of charity, and that Allah is verily He, the Oft-Returning, Most Merciful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know they not that Allah accepts repentance from His slaves and takes the Sadaqat (alms, charities) and that Allah Alone is the One Who forgives and accepts repentance, Most Merciful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that Allah accepts the repentance of His worshipers and takes their charity, and that Allah is the Forgiving, the Merciful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that God accepts the repentance of His servants, and that He receives the contributions, and that God is the Acceptor of Repentance, the Merciful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that it is Allah who accepts repentance from His servants and receives charities and that it is Allah who is the Accepting of repentance, the Merciful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:104] Do they not know that God is He Who accepts repentance from His servants and takes, accepts, the voluntary alms, and that God is He Who is the Relenting, to His servants, by accepting their repentance, and the Merciful?, to them (the interrogative is intended as an affirmative [statement] and is meant to incite them to [offer] repentance and charity).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Know they not that Allah is He Who accepteth repentance from His bondmen and taketh the alms) and accepts the alms, (and that Allah is He Who is the Relenting) the Forgiving, (the Merciful) towards he who repents.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ يَعْلَمُوۤاْ } أولئك التائبون\n النادمون المخلصون\n المتضرعون نحو الحق على عفو زلاتهم وتقصيراتهم { أَنَّ ٱللَّهَ } المصلح لأحوالهم { هُوَ } بلطفه وفضله { يَقْبَلُ ٱلتَّوْبَةَ عَنْ عِبَادِهِ } بعدما وفقتهم عليها\n ويتجاوز عن سيئاتهم { وَيَأْخُذُ ٱلصَّدَقَاتِ } من أموالهم\n أي: يقبلها منهم تطهيراً لقلوبهم عمَّا يشوشهم من رذائل هوياتهم وتعيناتهم\n ليتشمروا نحو الحق مخفين { وَ } لم يعلموا { أَنَّ ٱللَّهَ } المتفضل لعباده { هُوَ ٱلتَّوَّابُ } الرجاع لهم عن مقتضيات نفوسهم نحو جنابة { ٱلرَّحِيمُ } [التوبة: 104] عليهم يوصلهم إلى بابه إن أخلصوا في سلوكهم وتوجههم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { إلمْ يعلموا أن الله هو يقبلُ التوبةَ عن عباده } إذا صحت\n والضمير إما للتوب عليهم\n والمراد أن يُمكن في قلوبهم قبول توبتهم والاعتذار بصدقتهم\n أو لغيرهم\n والمراد به التحضيض على التوبه\n { و } أنه هو الذي { يأخذُ الصدقات } يقبلها قبول من يأخذ شيئاً ليؤدي بدله\n { وأن الله هو التوابُ الرحيم } أي: من شأنه قبول توبة التائبين\n والمتفضل عليهم بجوده وإحسانه\n الإشارة: أخذ المشايخ من أموال الفقراء سبب في غناهم\n واتساع حالهم حساً ومعنى\n وقد قالوا: إذا أراد اللهُ أن يغني فقيراً سلط عليه ولياً يأخذ ماله\n أو أمره شيخه بإعطاء ماله\n فإن ذلك عنوان على غناه\n وقد ذكر ذلك شيخ أشياخنا سيدي علي الجمل العراني في كتابه\n وقد رأيت في مناقب شرفاء وزان: أن الشيخ مولاي التهامي أرسل إلى أخيه مولاي الطيب\n وكان من خواص تلامذته\n أن يدفع إليه جميع ماله ليصنع به كسرة للمرابطين\n فأرسل له جميع ما يملك\n حتى كسوة الدار وأثاث البيت\n فكان ذلك سبباً في فيضان ماله\n فلا تجد مدينة ولا قبيلة إلا وفيها مِلكٌ من أملاك مولاي الطيب\n حتى إلى بلاد الجزائر وما والاها\n وذلك بسبب تجارة شيخه له\n والله تعالى أعلم\n ثم هدد أهل التخطيط\n فقال: { وَقُلِ ٱعْمَلُواْ فَسَيَرَى ٱللَّهُ عَمَلَكُمْ وَرَسُولُهُ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:34",
      "similarity": 0.5467483711626012
    },
    {
      "verse": "5:74",
      "similarity": 0.5430663399395392
    },
    {
      "verse": "2:160",
      "similarity": 0.46298119122226256
    },
    {
      "verse": "33:24",
      "similarity": 0.45873535289302303
    },
    {
      "verse": "9:27",
      "similarity": 0.44216875048213444
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009104.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009104.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:104.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}