{
  "chapter": "التوبة",
  "text": "ان الله له ملك السموت والارض يحى ويميت وما لكم من دون الله من ولى ولا نصير",
  "translations": [
    {
      "translation": "Allah is He to whom the kingdom of the heavens and earth belongs. He gives life and causes to die. You have no protector or helper besides Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily God's is the kingdom of the heavens and the earth. He alone is the giver of life and death; and none do you have besides God as friend and helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah's is the Kingdom of the heavens and the earth. He it is Who confers life and causes death. You have no protector or helper apart from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the Kingdom of the heavens and the earth. He grants life and causes death. God is your only Guardian and Helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed for Allah only is the kingship of the heavens and the earth; He gives life and He gives death; and other than Allah, you have neither a Protector nor any Supporter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed to Allah belongs the dominion of the heavens and the earth, He gives life and He causes death. And besides Allah you have neither any protector nor any helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah's is the kingdom of the heavens and the earth; He brings to life and causes to die; and there is not for you besides Allah any Guardian or Helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely to God belongs the kingdom of the heavens and of the earth; He gives life, and makes to die; and you have not, apart from God, either protector or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah! Unto Him belongeth the Sovereignty of the heavens and the earth. He quickeneth and He giveth death. And ye have, instead of Allah, no protecting friend nor helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "surely to God belongs the kingdom of the heavens and of the earth. He gives life and death. You have none besides God to protect or help you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah! His is the dominion of the heavens and the earth. He giveth life and He causeth to die; and for you there is, besides Allah, no protector or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed to Allah belongs the kingdom of the heavens and the earth. He gives life and brings death. And besides Allah you do not have any guardian or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Allah belongeth the dominion of the heavens and the earth. He giveth life and He taketh it. Except for Him ye have no protector nor helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah! Unto Him belongs the dominion of the heavens and the earth, He gives life and He causes death. And besides Allah you have neither any Wali (protector or guardian) nor any helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, to Allah belong the kingdom of the heavens and the earth; He gives life and causes death. Other than Allah, you have neither a guardian nor a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the dominion of the heavens and the earth. He gives life, and He causes death. And besides God, you have neither protector, nor supporter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, to Allah belongs the dominion of the heavens and the earth; He gives life and causes death. And you have not besides Allah any protector or any helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:116] Surely to God belongs the kingdom of the heavens and of the earth. He gives life and He makes to die; and you do not have, O mankind, besides God, that is, other than Him, any protector, to preserve you from Him, or helper, to defend you against His hurt.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Allah! Unto Him belongeth the sovereignty of the heavens) the stores of the heavens: the sun, the moon, etc., (and the earth) the stores of the earth such as the trees, beasts, mountains, seas, etc. (He quickeneth) for the resurrection (and He giveth death) in the life of this world. (And ye have, instead of Allah) against the punishment of Allah, (no protecting friend) to benefit you (nor helper) to save you from His punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ ٱللَّهَ } المستقل بالألوهية والوجود { لَهُ مُلْكُ ٱلسَّمَٰوَٰتِ } وما فيها من الكواكب والنجوم { وَٱلأَرْضِ } وما عليها\n وكذا ما بينهما { يُحْيِـي } ويظهر بلطفه متى تعلق إرادته { وَيُمِيتُ } يعدم ويخفي بقهره متى شاء { وَمَا لَكُمْ } أيها المؤمنون الموقنون بتوحيد الله { مِّن دُونِ اللَّهِ } الواحد\n الأحد\n الصمد الذي ليس معه شيء\n ولا دونه حي { مِن وَلِيٍّ } يولي أموركم { وَلاَ نَصِيرٍ } [التوبة: 116] ينصركم عليها\n\n\n{ لَقَدْ تَابَ الله عَلَىٰ ٱلنَّبِيِّ } أي: وفقه على التوبة بعدما صار عنه إذن المخالفين\n المستأذنين المعتذرين بالأعذار الكاذبة\n تعزيراً له وتلبيساً عليه\n مع عدم علمه بحالهم { وَ } تاب أيضاً على { ٱلْمُهَاجِرِينَ وَٱلأَنصَارِ ٱلَّذِينَ ٱتَّبَعُوهُ } نحو تبوك حين خرج إليها { فِي سَاعَةِ ٱلْعُسْرَةِ } وأيام القحط\n إذ ليس لهم في تلك السفر زاد ولا راحلة ولا ماء\n حيث يتعاقب عشرة على بعير\n وقسيم تمر بين اثنين في يوم\n وشرب الفظ والفرث من شدة العطش",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إن الله له ملكُ السمواتِ والأرضِ } \n يتصرف فيهما وفي ساكنهما كيف يشاء\n { يُحيي } من يريد إبرازه لعالم الشهادة\n { ويميت } من يريد رده لعالم الغيب\n أو يحيي قلوباً بالإيمان والمعرفة\n ويميت قلوباً بالكفر والغفلة\n { وما لكم من دون الله من وليِّ ولا نصير }\n  قال البيضاوي: لمَّا منعهم من الاستغفار للمشركين\n ولو كانوا أولي قربى\n وتضمن ذلك وجوب التبري منهم رأساً\n بيَّن لهم أن الله تعالى مالك كل موجود\n ومتولي أمره والغالب عليه\n ولا يتأتى لهم ولاية ولا نصرة إلا منه\n ليتوجهوا إليه ويتبرؤوا مما عداه\n حتى لا يبقى لهم مقصود فيما يأتون ويذرون سواه\n هـ\n  الإشارة: وما كان الله ليضل قوماً عن السير إلى حضرته\n أو الترقي في العلوم والمعارف بعد الوصول\n حتى يُبين لهم ما يتقون من سوء الأدب على لسان الشارع أو المشايخ\n فإذا تبين لهم ذلك ثم ارتكبوه وأصروا عليه\n أضلهم\n وأتلفهم عن الوصول إلى حضرة قدسه\n فإنَّ كل طاعة وحسن أدب يقرب من الحضرة\n وكل معصية وسوء أدب يُبعد عن الحضرة\n وقد قالوا: من أساء الأدب على البساط\n طُرد إلى الباب\n ومن أساء الأدب في الباب\n طُرد إلى سياسة الدواب\n وبالله التوفيق\n ثم ذكر توبته على الثلاثة المُرجوْن\n فقال: { لَقَدْ تَابَ الله عَلَىٰ ٱلنَّبِيِّ وَٱلْمُهَاجِرِينَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:107",
      "similarity": 0.7546392307539214
    },
    {
      "verse": "57:2",
      "similarity": 0.5719173151762487
    },
    {
      "verse": "42:9",
      "similarity": 0.5306934074941847
    },
    {
      "verse": "42:46",
      "similarity": 0.5276563262798394
    },
    {
      "verse": "29:22",
      "similarity": 0.47788293464258186
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/9:116.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/9:116.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:116.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}