{
  "chapter": "التوبة",
  "text": "يايها الذين ءامنوا۟ اتقوا۟ الله وكونوا۟ مع الصدقين",
  "translations": [
    {
      "translation": "You who have iman! have taqwa of Allah and be with the truly sincere.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, do not stray from the path of God, and be with those who are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Have fear of Allah and stand with those that are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, have fear of God and always be friends with the truthful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Fear Allah, and be with the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Have Taqwa of Allah, and be with those who are true (in words and deeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! be careful of (your duty to) Allah and be with the true ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, fear God, and be with the truthful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Be careful of your duty to Allah, and be with the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, fear God and stand with the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! fear Allah, and be with the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Be wary of Allah, and be with the Truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Fear Allah and be with those who are true (in word and deed).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Be afraid of Allah, and be with those who are true (in words and deeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, fear Allah and stand with the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Be conscious of God, and be with the sincere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, fear Allah and be with those who are true.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:119] O you who believe, fear God, by refraining from [acts of] disobedience to Him, and be with those who are truthful, in [their] faith and covenants, by adhering to sincerity.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe!) 'Abdullah Ibn Salam and his followers as well as all other believers (Be careful of your duty to Allah) obey Allah in that which He has commanded you, (and be with the Truthful) with Abu Bakr, 'Umar and their companions when they stay behind and when they participate in jihad.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يا أيها الذين آمنُوا اتّقوا الله } في جميع الرذائل بالاجتناب عنها خاصة رذيلة الكذب، وذلك معنى قوله: { وكونوا مع الصادقين } فإن الكذب أسوأ الرذائل وأقبحها لكونه ينافي المروءة لقوله صلى الله عليه وسلم:\n\n \" لا مروءة لكذوب \" \n\nإذ المراد من الكلام الذي يتميز به الإنسان عن سائر الحيوان إخبار الغير عما لا يعلم، فإذا كان الخبر غير مطابق لم تحصل فائدة النطق وحصل منه اعتقاد غير مطابق وذلك من خواص الشيطنة، فالكاذب شيطان\n وكما أن الكذب أقبح الرذائل، فالصدق أحسن الفضائل\n وأصل كل حسنة ومادة كل خصلة محمودة وملاك كل خير وسعادة به يحصل كل كمال ويحصل كل حال وأصله الصدق في عهد الله تعالى الذي هو نتيجة الوفاء بميثاق الفطرة أو نفسه كما قال تعالى:\n\n[الأحزاب، الآية: 23] في عقد العزيمة ووعد الخليقة، كما قال تعالى في إسماعيل عليه السلام:\n\n[مريم، 54] وإذا روعي في المواطن كلها حتى الخاطر والفكر والنية والقول والعمل صدقت المنامات والواردات والأحوال والمقامات والمواهب والمشاهدات كأنه أصل شجرة الكمال وبذر ثمرة الأحوال\n { فلولا نفر من كل فرقة منهم طائفة } أي: يجب على كل مستعد من جماعة سلوك طريق طلب العلم إذ لا يمكن لجميعهم، أما ظاهراً فلفوات المصالح، وأما باطناً فلعدم الاستعداد\n والتفقه في الدين هو من علوم القلب لا من علوم الكسب إذ ليس كل من يكتسب العلم يتفقه كما قال تعالى:\n\n[الأنعام، الآية: 25] والأكنة: هي الغشاوات الطبيعية والحجب النفسانية فمن أراد التفّقه فلينفر في سبيل الله وليسلك طريق التزكية والتصفية حتى يظهر العلم من قلبه على لسانه كما نزل على بعض أنبياء بني إسرائيل: \" يا بني إسرائيل، لا تقولوا العلم في السماء من ينزل به، ولا في تخوم الأرض من يصعد به، ولا من وراء البحر من يعبر ويأتي به، العلم مجعول في قلوبكم تأدّبوا بين يديّ بآداب الروحانيين، وتخلقوا بأخلاق الصديقين، أظهر العلم من قلوبكم حتى يغمركم ويغطيكم \"\n فالمراد من التفقه علم راسخ في القلب، ضارب بعروقه في النفس، ظاهر أثره على الجوارح بحيث لا يمكن صاحبه ارتكاب ما يخالف ذلك العلم وإلا لم يكن عالماً\n ألا ترى كيف سلب الله الفقه عمن لم تكن رهبة الله أغلب عليه من رهبة الناس بقوله تعالى:\n\n[الحشر، الآية: 13] لكون رهبة الله لازمة للعلم، كما قال تعالى:\n\n[فاطر، الآية: 28] وسلب العلم عمن لم يعمل به في قوله تعالى:\n\n\n\n[الزمر، الآية: 9]\n وإذا تفقهوا وظهر علمهم على جوارحهم أثر في غيرهم وتأثروا منه لارتوائهم به وترشحهم منه كما كان حال رسول الله صلى الله عليه وسلم، فلزم الإنذار الذي هو غايته كما قال: { ولينذروا قومهم إذا رجعوا إليهم لعلهم يحذرون } ومن لازم التفقه الجهاد الأكبر ثم الأصغر فلذلك قال بعده: { قاتلوا الذين يلونكم } من كفار قوى نفوسكم التي هي أعدى عدوكم { وليجدوا فيكم غِلظَة } أي: قهراً وشدة حتى تبلغوا درجة التقوى فينزل عليكم النصر من عند الله كما قال: { واعلموا أن الله مع المتقين }\n { أو لا يرون أنهم يفتنون } الآية، البلاء قائد من الله تعالى يقود الناس إليه\n وقد ورد في الحديث:\n\n \" البلاء سوط من سياط الله تعالى، يسوق به عباده إليه \" \n\nفإن كل مرض وفقر وسوء حال يحل بأحد يكسر ثورة نفسه وقواها ويقمع صفاتها وهواها، فيلين القلب ويبرز من حجابها وينزعج من الركون إلى الدنيا ولذاتها وينقبض منها ويشمئز، فيتوجه إلى الله تعالى\n وأقلّ درجاته أنه إذا اطلع على أن لا مفرّ منه إلا إليه، ولم يجد مهرباً ومحيصاً من البلاء سواه، تضرّع إليه وتذلّل بين يديه، كما قال تعالى:\n\n[لقمان، الآية: 32]،\n\n[يونس، الآية: 12]، وبالجملة يوجب رقة الحجاب أو ارتفاعه فليغتنم وقته وليتعوذ وليتخذ ملكة يعود إليها أبداً حتى يستقرّ التيقظ والتذكر وتتسهل التوبة والحضور فلا يتعود الغفلة عند الخلاص وتتقوى النفس عند الأمان فتغلب وينسبل الحجاب أغلظ مما كان كما قال:\n\n[العنكبوت، الآية: 65]،\n\n[يونس، الآية: 12]\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَـٰأيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم التقوى عن محارم الله { ٱتَّقُواْ ٱللَّهَ } عن مخالفة أمره { وَكُونُواْ } في السراء والضراء { مَعَ ٱلصَّادِقِينَ } [التوبة: 119] المصدقين لرسوله، المتابعين له في جميع أموره\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { يا أيها الذين آمنوا اتقوا الله } بالمحافظة على ما أمركم به، والانكفاف عما نهاكم عنه، { وكونوا مع الصادقين } في إيمانهم وأقوالهم وأفعالهم وعهودهم\n قال ابن جزي: ويحتمل أن يريد به صدق اللسان إذ كان هؤلاء قد صدقوا ولم يعتذروا بالكذب، فنفعهم الله بذلك، ويحتمل أن يريد أعم من صدق اللسان وهو الصدق في الأقوال والأعمال والمقاصد والعزائم، والمراد بالصادقين: المهاجرين، لقوله في الحشر:\n\n\n\n إلى قوله:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:33",
      "similarity": 0.5388274119868186
    },
    {
      "verse": "16:128",
      "similarity": 0.5207713084092969
    },
    {
      "verse": "7:106",
      "similarity": 0.42097772863823923
    },
    {
      "verse": "10:63",
      "similarity": 0.4176108550429299
    },
    {
      "verse": "3:102",
      "similarity": 0.40610999410443666
    }
  ]
}