{
  "chapter": "التوبة",
  "text": "التئبون العبدون الحمدون السئحون الركعون السجدون الءامرون بالمعروف والناهون عن المنكر والحفظون لحدود الله وبشر المؤمنين",
  "translations": [
    {
      "translation": "Those who make tawba, those who worship, those who praise, those who fast, those who bow, those who prostrate, those who command the right, those who forbid the wrong, those who preserve the limits of Allah: give good news to the muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To those who repent and pay homage, give praise and are devout, who kneel in prayer and bow in supplication, who enjoin good deeds and prohibit the bad, and keep to the limits set by God, announce the news of rejoicing to the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who constantly turn to Allah in repentance, who constantly worship Him, who celebrate His praise, who go about the world to serve His cause, who bow down to Him, who prostrate themselves before Him, who enjoin what is good and forbid what is evil, and who keep the limits set by Allah. Announce glad tidings to such believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The believers) who repent for their sins, worship God, praise Him, travel through the land (for pious purposes), kneel down and prostrate themselves in obedience to God, make others do good and prevent them from sins and abide by the laws of God, will receive a great reward. Let this be glad news for the believer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who repent, those who worship, those who praise, those who fast, those who bow, those who prostrate, those who show right and forbid wrong and those who keep the limits of Allah in sight; and give glad tidings to the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who repent, who worship (Him), who praise (Him), who fast, who bow down, who prostrate themselves, who enjoin good and forbid evil, and who observe the limits set by Allah. And give glad tidings to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They who turn (to Allah), who serve (Him), who praise (Him), who fast, who bow down, who prostrate themselves, who enjoin what is good and forbid what is evil, and who keep the limits of Allah; and give good news to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who repent, those who serve, those who pray, those whojourney, those who bow, those who prostrate themselves, those who bid to honour and forbid dishonour, those who keep God's hounds -- and give thou good tidings to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Triumphant) are those who turn repentant (to Allah), those who serve (Him), those who praise (Him), those who fast, those who bow down, those who fall prostrate (in worship), those who enjoin the right and who forbid the wrong and those who keep the limits (ordained) of Allah - And give glad tidings to believers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[The believers are] those who turn to God in repentance; who worship and praise Him; who go about in the land serving His cause, who bow down, who prostrate themselves, who enjoin good and forbid evil, and who observe the limits set by God. Give good news to the believers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those who repent, who worship who praise, who fast constantly, woo bow down, who prostrate themselves, who command the reputable and restrain from the disreputable and who keep the ordinances of Allah; and bear thou glad tidings to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[The faithful are] penitent, devout, celebrators of Allah’s praise, wayfarers, who bow [and] prostrate [in prayer], bid what is right and forbid what is wrong, and keep Allah’s bounds—and give good news to the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those that turn (to Allah) in repentance; that serve Him, and praise Him; that wander in devotion to the cause of Allah,: that bow down and prostrate themselves in prayer; that enjoin good and forbid evil; and observe the limit set by Allah;- (These do rejoice). So proclaim the glad tidings to the Believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The believers whose lives Allah has purchased are) those who repent to Allah (from polytheism and hypocrisy, etc.), who worship Him, who praise Him, who fast (or go out in Allah's Cause), who bow down (in prayer), who prostrate themselves (in prayer), who enjoin (people) for Al-Ma'ruf (i.e. Islamic Monotheism and all what Islam has ordained) and forbid (people) from Al-Munkar (i.e. disbelief, polytheism of all kinds and all that Islam has forbidden), and who observe the limits set by Allah (do all that Allah has ordained and abstain from all kinds of sins and evil deeds which Allah has forbidden). And give glad tidings to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who repent, those who worship Allah and praise (Him); those who journey, those who bow, those who prostrate themselves; those who order righteousness and forbid evil, and those who observe the limits of Allah give glad tidings to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who repent, those who worship, those who praise, those who journey, those who kneel, those who bow down, those who advocate righteousness and forbid evil, and those who keep God’s limits—give good news to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Such believers are] the repentant, the worshippers, the praisers [of Allah], the travelers [for His cause], those who bow and prostrate [in prayer], those who enjoin what is right and forbid what is wrong, and those who observe the limits [set by] Allah. And give good tidings to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:112] Those who repent (al-tā’ibūna is in the nominative as a laudative, the subject being implicit), from idolatry and hypocrisy, those who worship, who devote their worship sincerely to God, those who give praise, to Him in every state, those who fast, those who bow, those who prostrate themselves, that is, those who perform prayers, those who enjoin decency and forbid to indecency, those who maintain God’s bounds, His rulings, by implementing them, and give good tidings to the believers, of Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then explained who they were, saying: ((Triumphant) are those who turn repentant (to Allah)) those who repent of sins, (those who serve (Him)) the obedient, (those who praise (Him)) the thankful, (those who fast, these who bow down, those who fall prostrate (in worship)) in the five daily prayers, (those who enjoin the right) the confession of Allah's divine Oneness and goodness (and who forbid the wrong) disbelief and all that which is not known in the Sacred Law or the Prophetic Practice (and those who keep the limits (ordained) of Allah) those who observe the obligations of Allah (And give glad tidings to believers) that they shall have Paradise!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱلسَّائِحُونَ } معناهُ الصَّائمونَ\n\n",
      "translations": [
        {
          "translation": " The meaning of the verse is \"those who fast.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوهم { ٱلتَّائِبُونَ } النادمون على ما جرى عليهم من المعاصي، المحافظون عليها بلا مراجعة أصلاً { ٱلْعَابِدُونَ } بالعزائم الصحيحة والإخلاص التام { ٱلْحَامِدُونَ } الشاكرون، الصارفون ما أعطاهم الحق من النعم إلى ما أمرهم من المصارف { ٱلسَّائِحُونَ } السائرون، السالكون في سبيل الحق؛ لازدياد المعارف والحقائق { ٱلرَّاكِعُونَ } المتوضعون، المنكسرون لجميع مظاهر الحق؛ تعظيماً لشأنه { ٱلسَّاجِدونَ } المتذللون، الواضعون جباههم على تراب المذلة؛ خضوعاً وانقياداً، ميلاً ودعاءً { ٱلآمِرُونَ بِٱلْمَعْرُوفِ } المستحسن عقلاً وشرعاً واللسان، وجميع الجوارح { وَٱلنَّاهُونَ عَنِ ٱلْمُنكَرِ } المستقبح عقلاً وشرعاً لجميع ما ورد النهي به { وَ } بالجملة: هم { ٱلْحَافِظُونَ لِحُدُودِ ٱللَّهِ } الموضوعة بين أرباب التكليف القابلين، المستعدين لسلوك طريق التوحيد { وَبَشِّرِ } يا أكمل الرسل { ٱلْمُؤْمِنِينَ } [التوبة: 112] الموصوفين بهذه الصفات الجميلة باللذات التي لا يمكن وصفها بلسان التعبير من لدن حكيم خبير\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: التائبون: خبر، أي: هم التائبون، أو مبتدأ حُذف خبره، أي: التائبون في الجنة وإن لم يجاهدوا، لقوله تعالى:\n\n[النساء:95]، أو خبره ما بعده، أي: التائبون عن الكفر، على الحقيقة، وهم الجامعون لهذه الخصال\n يقول الحق جل جلاله: في وصف البائعين أنفسهم وأموالهم: هم { التائبُون } عن الكفر والمعاصي والهفوات والغفلات، { العابدون } لله، مخلصين له الدين، { الحامدون } لله في السراء والضراء وعلى كل حال، { السائحون } أي: الصائمون، لقوله عليه الصلاة والسلام:\n\n \" سِيَاحَةُ أُمتي الصوم \" \n\nشبه بها من حيث إنه يعوق عن الشهوات، أو لأنه رياضة نفسانية يتوصل بها إلى الاطلاع على خفايا الملكوت والجبروت\n أو السائحون للجهاد، أو لطلب العلم، أو لزيادة المشايخ والإخوان\n  { الراكعون الساجدُون } في الصلاة، { الآمرون بالمعروف } أي: بكل ما هو معروف محمود، كالإيمان والطاعة، { والناهُون عن المنكر } أي: كل ما هو منكر في الشرع، كالكفر والمعاصي، { والحافظون لحدود الله } أي: لكل ما حده الشارع وعينه من الحقائق والشرائع\n قال البيضاوي: وعطف قوله: { والناهون عن المنكر } دون ما قبله للدلالة على أنه بما عطف عليه في حكم خصلة واحدة، كأنه قال: الجامعون بين الوصفين، وعطف أيضاً قوله: { والحافظون لحدود الله } للتنبيه على أن ما قبله مفصل الفضائل، وهذا مجملها، وقيل: للإيذان بأن التعداد قد تم بالسابع، من حيث إن السبعة هو العدد التام، والثامن ابتداء لعدد آخر معطوف عليه، ولذلك سمى واو الثمانية\n هـ\n بالمعنى\n { وبشر المؤمنين } الموصوفين بهذه الفضائل، ووضع المؤمنين موضع ضميرهم للتنبيه على أن إيمانهم دعاهم إلى ذلك، وأن المؤمن الكامل من كان كذلك، وحذف المبشر به للتعظيم، كأنه قيل: وبشرهم بما يجل عن إحاطة الأفهام وتعبير الكلام\n قاله البيضاوي\n الإشارة: قد جمعت هذه الآية معارج الترقي من البداية إلى النهاية، فأول المقامات: التوبة، فإذا تابت النفس ورجعت عن هواها قصدت السير إلى حضرة مولاها، فاشتغلت بالعبادة الظاهرة، التي هي عمل الشريعة، فإذا ظهر عليها أمارات التوفيق، ولاحت لها أنوار التحقيق، حمدت الله وشكرته تقييداً لتلك النعمة، ثم تسيح فكرتها في ميادين الغيوب من الملكوت إلى الجبروت، ثم ترد إلى مراسم الشريعة، إذ منتهى الكمال: التزام الشرائع، فتركع وتسجد البشرية، أدباً في عالم الأشباح، ويركع القلب ويسجد في مسجد الحضرة في عالم الأرواح، فحينئذٍ تصلح للوعظ والتذكير، فتأمر بالمعروف وتنهى عن المنكر الظاهريْن لأهل التشريع، والباطنيْن لأهل التحقيق، فالأول يسمى وعظاً وتذكيراً، والثاني يسمى تربية وترقية، ولا يقبل ذلك إلا ممن وقف مع الحدود، ووفى بالعهود، فيبشر حينئذٍ بالسعادة العظمى والمقام الأسنا\n قال القشيري: لقوله تعالى: { السائحون } أي: الصائمون، ولكن عن شهود غير الله، المُمْتنعون عن خدمة غير الله، المكتفون من الله بالله، ويقال: السائحون الذين يسيحون في الأرض على جهة الأعتبار طلباً للاستبصار، ويسيحون بقلوبهم في مشارق الأرض ومغربها بالتفكر في جوانبها ومناكبها، والاستبدال بتغيُّرها على مُنْشِئتها، والتحقق بحِكَم خالقها بما يَرَوْنَ من الآيات التي فيها، ويسيحون بأسراهم في الملكوت، فيجدون رَوْحَ الوصال، ويعيشون بنسيم الأنْسِ بالتحقيق بشهود الحق\n\n\nانتهى وانظر الورتجبي فقد جعل وصف الإيمان يحمل على التوبة، ثم التوبة الصادقة تستدعي العبادات والمجاهدات المؤدية للعبودية، فإذا تمت له نعمة للعبودية اقتضت حمد الله تعالى، فيحمده تعالى معترفاً بعجزه عن القيام بحمده كما في حديث:\n\n \" أنتَ كَمَا أثنَيتَ عَلى نَفسِك \" \n\nثم الحمد والذكر يقتضي حبس النفس عن مألوفاتها حين عاين حِمَى هلال جماله في سماء الإيقان\n ألا ترى كيف قال عليه الصلاة والسلام:\n\n \" صُومُوا لِرؤْيِتِهِ \" \n\nولا يكون فطره إلا على حلاوة مشاهدته لقوله:\n\n \" وأفطِرُوا لرُؤْيَتِهِ \" \n\nفالسائحون طيارون بقلوبهم في أقطار الغيب، وذلك يقتضي الخضوع بنعت الفناء عند مشاهدة العظمة، فيركع شوقاً لجماله، وخضوعاً لجلاله، وعند ركوعه وخضوعه تحيط به أنوار الصفات، فيسجد لكل الجهات\n\n[البقرة: 115]\n وهذا السجود يقتضي الغربة، والغربة تقتضي المشاهدة، والمشاهدةُ تصير شاهدها متصفاً بصفاتها، فمن وقع في نور أسماء الله وصفاته صار متصفاً بوصف الربوبية، متمكناً في العبودية، فيحكم بحكم الله، ويعدل بعدل الله، فيصفهم الله بهذه النعوت، قال: الآمرون بالمعروف الداعون الخلق إلى الحق، والناهون لهم عن متابعة الشهواتِ، والحافظون لحدود الله، القائمون في مقام العبودية بعد كشف صفات الربوبية لهم، فلا يتجاوزون عن حد العبودية، وإن ذاقوا طعم حلاوة الربوبية لأنهم في محل التمكين على أسوة مراتب النبي صلى الله عليه وسلم، مع كماله، قال:\n\n \" أنا العبد لا إله إلا الله \"\n \n\nانتهى\n ثم نهى نبيه عن الاستغفار للمشركين، وينخرط فيهم من تخلف عن تبوك من المنافقين، فقال: { مَا كَانَ لِلنَّبِيِّ وَٱلَّذِينَ آمَنُوۤاْ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:2",
      "similarity": 0.5712620836188648
    },
    {
      "verse": "66:5",
      "similarity": 0.3083806248076664
    },
    {
      "verse": "22:77",
      "similarity": 0.29243131285783935
    },
    {
      "verse": "77:48",
      "similarity": 0.27275112708846116
    },
    {
      "verse": "5:55",
      "similarity": 0.26345445772510107
    }
  ]
}