{
  "chapter": "التوبة",
  "text": "لا يزال بنينهم الذى بنوا۟ ريبة فى قلوبهم الا ان تقطع قلوبهم والله عليم حكيم",
  "translations": [
    {
      "translation": "The buildings they have built will not cease to be a bone of contention in their hearts, until their hearts are cut to shreds. Allah is All-Knowing, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The edifice they have built will always fill their minds with perturbation (which will not cease) till their hearts are rent to pieces, for God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the structure which they have erected will ever inspire their hearts with doubts unless it be that their very hearts are cut into pieces. Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The building (mosque) which they have built always motivates mischief in their hearts until their hearts are cut into pieces. God is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The building which they erected will constantly keep disturbing their hearts unless their hearts are torn to pieces; and Allah is All Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The building which they built will never cease to be a cause of hypocrisy and doubt in their hearts unless their hearts are cut to pieces. And Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The building which they have built will ever continue to be a source of disquiet in their hearts, except that their hearts get cut into pieces; and Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The buildings they have built will not cease to be a point of doubt within their hearts, unless it be that their hearts are cut into pieces; God is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The building which they built will never cease to be a misgiving in their hearts unless their hearts be torn to pieces. Allah is Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the building which they have built will never cease to be a source of deep disquiet in their hearts, until their hearts are cut to pieces. God is all knowing and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their building which they have builded will not cease to be a cause of doubt in their hearts unless it be that their hearts are cut asunder; and Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The building they have built will never cease to be [a source of] disquiet in their hearts until their hearts are cut into pieces, and Allah is all-knowing, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The foundation of those who so build is never free from suspicion and shakiness in their hearts, until their hearts are cut to pieces. And Allah is All-Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The building which they built will never cease to be a cause of hypocrisy and doubt in their hearts, unless their hearts are cut to pieces. (i.e. till they die). And Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The buildings they have built will always cause doubt in their hearts, unless their hearts are torn into pieces. Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The structure which they built will remain questionable in their hearts, until their hearts are stopped. God is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their building which they built will not cease to be a [cause of] skepticism in their hearts until their hearts are stopped. And Allah is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:110] The buildings which they have built will never cease to be a misgiving, a point of doubt, in their hearts unless their hearts are cut, torn, to pieces, such that they die; and God is Knower, of His creatures, Wise, in what He does with them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "208 (The building which they built will never cease to be) after its destruction (a misgiving) a distress and a regret (in their hearts unless their hearts be torn to pieces) unless they die. (Allah is Knower) of their building of a mosque of opposition as well as of their intentions, (Wise) when He ordained the destruction and burning of this mosque. After returning from the Battle of Tabuk, the Prophet (pbuh) sent 'Amir Ibn Qays and Wahshiyy, the client of Mut'am Ibn 'Adiyy, who destroyed and burnt this mosque of opposition.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ يَزَالُ بُنْيَانُهُمُ ٱلَّذِي بَنَوْاْ رِيبَةً فِي قُلُوبِهِمْ إِلاَّ أَن تَقَطَّعَ قُلُوبُهُمْ } والرَّيبةُ: الشَّكُ\n وإِلاَّ أَنْ تَقَطعَ قُلوبُهُم: معناهُ إِلاَّ أَنْ يَموتُوا\n\n",
      "translations": [
        {
          "translation": " The { building they built remains unstable in their hearts unless their hearts are cut off } and the instability: the doubt.\n Unless their hearts are cut off: meaning unless they die",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتفتتت وتلاشت بأهوال العذاب إلى حيث لا يتأتى منها الإدراك { وَٱللَّهُ عَلِيمٌ } بمخايلهم الكامنة في صدورهم { حَكِيمٌ } [التوبة: 110] في جزائها وانتقامها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لا يزالُ بُنيانُهم } أي: مبنيهم\n مصدر بمعنى المفعول\n { الذي بَنوا ريبةً } أي: شكاً ونفاقاً { في قلوبهم } \n والمعنى: أن بناءهم هذا لا يزال سبب شكهم وتزايد نفاقهم\n فإنه حملهم على ذلك\n ثم لما هدمه الرسول صلى الله عليه وسلم رسخ ذلك في قلوبهم وازداد\n بحيث لا يزول رسمه من قلوبهم\n { إلا أن تقطع } بالموت\n بحيث لا يبقى لها قابلية الإدراك\n أو لا يزال بنيانهم ريبة\n أي: شكاً في الإسلام بسبب بنيانه\n لاعتقادهم صواب فعلهم\n أو غيظاً بسبب هدمه\n { والله عليمٌ } بنياتهم\n { حكيم } فيما أمر من هدم بنيانهم\n\nالإشارة: من أراد أن يؤسس بنيان أعماله وأحواله على التقوى والرضوان\n فليؤسسه على الإخلاص والنية الحسنة\n ومتابعة السنة المحمدية\n فإنها لا تنهدم أبداً\n ومن أراد أن يؤسسها على شفا جرف هارٍ فليؤسسها على الرياء والسمعة\n وقصد الكرامات وطلب الأعواض\n فإنها تنهدم سريعاً ولا تدوم\n فما كان لله دام واتصل\n وما كان لغير الله انقطع وانفصل\n وبالله التوفيق\n ثم ذكر كرامة أهل الإخلاص\n فقال: { إِنَّ ٱللَّهَ ٱشْتَرَىٰ مِنَ ٱلْمُؤْمِنِينَ أَنفُسَهُمْ وَأَمْوَالَهُمْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:118",
      "similarity": 0.6094007433558002
    },
    {
      "verse": "10:28",
      "similarity": 0.5321453481708851
    },
    {
      "verse": "40:34",
      "similarity": 0.4739289440123132
    },
    {
      "verse": "2:217",
      "similarity": 0.3262237683397847
    },
    {
      "verse": "9:45",
      "similarity": 0.29421879075404545
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/9:110.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/9:110.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/9:110.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}