{
  "chapter": "التوبة",
  "text": "فان تابوا۟ واقاموا۟ الصلوة وءاتوا۟ الزكوة فاخونكم فى الدين ونفصل الءايت لقوم يعلمون",
  "translations": [
    {
      "translation": "But if they make tawba and establish salat and pay zakat, they are your brothers in the deen. We make the Signs clear for people who have knowledge.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they repent and are firm in devotion and pay the zakat, then they are your brothers in faith. We explain Our commands distinctly for those who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they repent and establish Prayer and give Zakah they are your brothers in faith. Thus do We expound Our revelations to those who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they repent, perform their prayers, pay religious tax, they would be your brothers in the religion. We explain Our revelations to people of knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if they repent and keep the prayer established and pay the charity, they are your brothers in religion; and we explain Our verses in detail for the people of knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they repent, perform the Salah and give the Zakah, then they are your brethren in religion. (In this way) We explain the Ayat in detail for a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they repent and keep up prayer and pay the poor-rate, they are your brethren in faith; and We make the communications clear for a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet if they repent, and perform the prayer, and pay the alms, then they are your brothers in religion; and We distinguish the signs for a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they repent and establish worship and pay the poor-due, then are they your brethren in religion. We detail Our revelations for a people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they repent and keep up their prayers and pay the alms, then they are your brethren in faith. We make Our messages clear for people who are willing to learn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they repent and establish prayer and give the poor- rate, then they are your brethren-in-faith. And we detail the revelations unto a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet if they repent and maintain the prayer and give the zakat, then they are your brethren in faith. We elaborate the signs for a people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But (even so), if they repent, establish regular prayers, and practise regular charity,- they are your brethren in Faith: (thus) do We explain the Signs in detail, for those who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they repent, perform As-Salat (Iqamat-as-Salat) and give Zakat, then they are your brethren in religion. (In this way) We explain the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) in detail for a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they repent and establish the prayer and pay the obligatory charity, they shall become your brothers in the religion. So We make plain Our verses for a nation that knows.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they repent, and perform the prayers, and give the obligatory charity, then they are your brethren in faith. We detail the revelations for a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they repent, establish prayer, and give zakah, then they are your brothers in religion; and We detail the verses for a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:11] Yet if they repent and establish prayer and pay the alms, then they are your brothers in religion; and We detail, We explain, the signs for a people who know, [who] reflect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But if they repent) from idolatry and believe in Allah (and establish worship) acknowledge the prayers (and pay the poor-due) and acknowledge the poor-due, (then are they your brethren in religion) in Islam. (We detail Our revelations) We explain the Qur'an by means of expositing the commands and prohibitions (for a people who have knowledge) and believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِن تَابُواْ } ورجعوا إلى الإيمان بعدما بالغوا في العناد والاستكبار { وَ } بعد رجوعهم { أَقَامُواْ ٱلصَّلَٰوةَ } المصفية لبواطنهم عن الميل إلى غير الحق { وَءَاتَوُاْ ٱلزَّكَٰوةَ } المطهرة لظواهرهم عمَّا يشغلهم عن الحق { فَإِخْوَٰنُكُمْ فِي ٱلدِّينِ } أنتم وهم سواء في سلوك طريق الحق والرجوع إليه { وَ } إنما { نُفَصِّلُ } ونوضح { ٱلأيَـٰتِ } الدالة على توحيدنا { لِقَوْمٍ يَعْلَمُونَ } [التوبة: 11] ويصلون إلى مرتبة اليقين العلمي\n ويريدون الترقي منها إلى اليقين العيني والحقي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإن تابوا } عن الكفر\n { وأقاموا الصلاة وآتوا الزكاة فإخوانكم في الدين } لهم ما لكم وعليهم ما عليكم\n { ونفصّلُ الآيات لقوم يعلمون } \n حث على تأمل ما فصل من أحكام المعاهدين وخصال التائبين\n قاله البيضاوي\n الإشارة: لا ينبغي للخواص أن يثقوا بمحبة العوام\n ولا يغتروا بما يسمعون من عهودهم\n فإن محبتهم على الحروف\n مهما رأوا خلاف ما أملوا من حروفهم\n وأطماعهم\n نكثوا وأدبروا\n فللعارف غِنّى بالله عنهم\n وفي ذلك يقول سيدنا علي ـ كرم الله وجهه ـ:\nثم ذكر حكم من نقض العهد\n فقال: { وَلَوْ أَنَّهُمْ رَضُوْاْ مَآ آتَاهُمُ ٱللَّهُ وَرَسُولُهُ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:56",
      "similarity": 0.42579532034229395
    },
    {
      "verse": "86:13",
      "similarity": 0.39148887620119815
    },
    {
      "verse": "77:13",
      "similarity": 0.3832515439917948
    },
    {
      "verse": "27:3",
      "similarity": 0.37899072806561535
    },
    {
      "verse": "31:4",
      "similarity": 0.37899072806561535
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/9:11.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/9:11.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:11.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}