{
  "chapter": "التوبة",
  "text": "وعلى الثلثة الذين خلفوا۟ حتى اذا ضاقت عليهم الارض بما رحبت وضاقت عليهم انفسهم وظنوا۟ ان لا ملجا من الله الا اليه ثم تاب عليهم ليتوبوا۟ ان الله هو التواب الرحيم",
  "translations": [
    {
      "translation": "and also towards the three who were left behind,* so that when the earth became narrow for them, for all its great breadth, and their own selves became constricted for them and they realised that there was no refuge from Allah except in Him, He turned to them so that they might turn to Him. Allah is the Ever-Returning, the Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has relented towards the three also (who had refused to go to the battle of the Ditch) whose case was left undecided, and even the earth with all its expanse had become narrow for them, and their lives were confined, and they came to realise there was no refuge for them except in God. So He softened towards them that they may repent; for God surely accepts repentance and is merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He also relented towards the three whose cases had been deferred. When the earth, for all its spaciousness, became constrained to them, and their own beings became a burden to them, and they realized that there was no refuge for them from Allah except in Him; He relented towards them that they may turn back to Him. Surely, it is Allah Who is Much Forgiving, Ever Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God also forgave the three people who lagged behind. Grief made them feel as though there was no place in the whole vast earth to hide them or in their souls to conceal their sorrow. They began to believe that no one could save them from (the wrath of God) except He Himself. God pardoned them so that they would also repent for their sins. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And also upon the three who were kept in waiting; when the earth, vast as it is, was restricted for them, and they became weary of their own lives and became certain that there is no refuge from Allah except with Him; He then accepted their repentance in order that they remain repentant; indeed Allah is the Most Acceptor of Repentance, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (Allah has forgiven) the three who stayed behind, until for them the earth, vast as it is, was straitened and their souls were straitened to them, and they perceived that there is no fleeing from Allah, and no refuge but with Him. Then, He forgave them, that they might beg for His pardon. Verily, Allah is the One Who forgives and accepts repentance, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to the three who were left behind, until the earth became strait to them notwithstanding its spaciousness and their souls were also straitened to them; and they knew it for certain that there was no refuge from Allah but in Him; then He turned to them (mercifully) that they might turn (to Him); surely Allah is the Oft-returning (to mercy), the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to the three who were left behind, until, when the earth became strait for them, for all its breadth, and their souls became strait for them, and they thought that there was no shelter from God except in Him, then He turned towards them, that they might also turn; surely God turns, and is All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to the three also (did He turn in mercy) who were left behind, when the earth, vast as it is, was straitened for them, and their own souls were straitened for them till they bethought them that there is no refuge from Allah save toward Him. Then turned He unto them in mercy that they (too) might turn (repentant unto Him). Lo! Allah! He is the Relenting, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has turned with mercy to the three whose case was deferred, when the earth, for all its spaciousness, closed in upon them, and their own souls seemed straitened to them and they realised that there was no refuge from God except in Him. He turned to them so that they might turn to Him. God is the Ever Forgiving, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And also He relented toward the three who were left behind until when the earth, vast as it is, became straitened unto them and their own lives became straitened unto them and they imagined that there was no refuge from Allah except unto Him. Thereafter He relented toward them, so that they might repent. Verily Allah! He is the Relenting, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—and to the three who were left behind. When the earth became narrow for them with [all] its expanse, and their own souls weighed heavily on them, and they knew that there was no refuge from Allah except in Him, then He turned clemently toward them so that they might be penitent. Indeed Allah is the All-clement, the All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He turned in mercy also) to the three who were left behind; (they felt guilty) to such a degree that the earth seemed constrained to them, for all its spaciousness, and their (very) souls seemed straitened to them,- and they perceived that there is no fleeing from Allah (and no refuge) but to Himself. Then He turned to them, that they might repent: for Allah is Oft-Returning, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (He did forgive also) the three [who did not join the Tabuk expedition (whom the Prophet SAW)] left (i.e. he did not give his judgement in their case, and their case was suspended for Allah's Decision) till for them the earth, vast as it is, was straitened and their ownselves were straitened to them, and they perceived that there is no fleeing from Allah, and no refuge but with Him. Then, He accepted their repentance, that they might repent (unto Him). Verily, Allah is the One Who accepts repentance, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to the three who were left behind (at the Battle of Tabuk), until the earth became narrow with all its vastness, and their souls became narrow for them, they knew there was no shelter from Allah except in Him. Then He turned to them (in mercy) so that they might also turn (in repentance). Allah is the Turner, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also towards the three who were left behind. Then, when the earth, as vast as it is, closed in on them, and their very souls closed in on them, and they realized that there was no refuge from God, except in Him, He redeemed them, so that they may repent. God is the Redeemer, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [He also forgave] the three who were left behind [and regretted their error] to the point that the earth closed in on them in spite of its vastness and their souls confined them and they were certain that there is no refuge from Allah except in Him. Then He turned to them so they could repent. Indeed, Allah is the Accepting of repentance, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:118] And, He relented, to the three who were left behind, [formerly denied] His relenting to them, for the same reason [as those mentioned above], when the earth was straitened for them, for all its breadth, that is, despite its vastness, so they could find no place wherein to feel secure, and their souls, that is, their hearts, were straitened for them, because of the anxiety and their [sense of] alienation resulting from the delay of God’s relenting to them [with mercy], such that they [their souls] could not find happiness or solace; until   they thought, they were certain, that (read the softened an) there is no refuge from God except in Him. Then He turned [relenting] to them, He made them successful in finding repentance, that they might also turn [in repentance]. Truly God is the Relenting, the Merciful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ وعلى الثلاثة } معطوف { على النبي } \\[ التوبة : 117 \\] بإعادة حرف الجر لبُعد المعطوف عليه ، أي وتاب على الثلاثة الذين خلفوا . وهؤلاء فريق له حالة خاصة من بين الذين تخلفوا عن غزوة تبوك غير الذين ذكروا في قوله : { فرح المخلفون بمقعدهم } \\[ التوبة : 81 \\] الآية ، والذين ذكروا في قوله : { وجاء المعذرون } \\[ التوبة : 90 \\] الآية .والتعريف في { الثلاثة } تعريف العهد فإنهم كانوا معروفين بين الناس ، وهم : كَعب بن مالك من بني سَلِمَة ، ومُرارة بن الربيع العَمْري من بني عَمرو بن عَوْف ، وهلال بن أمية الواقفي من بني واقف ، كلهم من الأنصار تخلفوا عن غزوة تبوك بدون عذر . ولما رجع النبي صلى الله عليه وسلم من غزوة تبوك سألهم عن تخلفهم فلم يكذبوه بالعذر ولكنهم اعترفوا بذنبهم وحزنوا . ونهى رسول الله صلى الله عليه وسلم الناس عن كلامهم ، وأمرهم بأن يعتزلوا نساءهم . ثم عفا الله عنهم بعد خمسين ليلة . وحديث كعب بن مالك في قصته هذه مع الآخرين في «صحيح البخاري» و«صحيح مسلم» طويل أغر وقد ذكره البغوي في «تفسيره» .و { خلفوا } بتشديد اللام مضاعف خَلَف المخفف الذي هو فعل قاصر ، معناه أنه وراء غيره ، مشتق من الخلف بسكون اللام وهو الوراء . والمقصود بَقي وراء غيره . يقال : خَلَف عن أصحابه إذا تخلف عنهم في المشيء يَخْلُف بضم اللام في المضارع ، فمعنى { خُلِّفوا } خَلّفهم مُخَلِّف ، أي تركهم وراءه وهم لم يخلفهم أحد وإنما تخلفوا بفعل أنفسهم . فيجوز أن يكون { خلفوا } بمعنى خلَّفوا أنفسهم على طريقة التجريد . ويجوز أن يكون تخليفهم تخليفاً مجازياً استعير لتأخير البت في شأنهم ، أي الذين خُلفوا عن القضاء في شأنهم فلم يعذرهم رسول الله صلى الله عليه وسلم ولا آيسهم من التوبة كما آيس المنافقين . فالتخليف هنا بمعنى الإرجاء . وبهذا التفسير فَسره كعب بن مالك في حديثه المروي في «الصحيح» فقال : وليس الذي ذكر الله مما خُلفنا عن الغزو وإنما تخليفُه إياناً وإرجاؤه أمرنا عَمَّن حَلَف له واعتذر إليه فقُبل منه . اه .يعني ليس المعنى أنهم خَلَّفوا أنفسهم عن الغزو وإنما المعنى خلَّفهم أحد ، أي جعلهم خَلْفاً وهو تخليف مجازي ، أي لم يُقض فيهم . وفاعل التخليف يجوز أن يراد به النبي صلى الله عليه وسلم أو الله تعالى .وبناء فعل { خلفوا } للنائب على ظاهره ، فليس المراد أنهم خلفوا أنفسهم .وتعليق التخليف بضمير { الثلاثة } من باب تعليق الحكم باسم الذات . والمراد : تعليقه بحاللٍ من أحوالها يعلم من السياق ، مثلُ { حُرمت عليكم الميتة } \\[ المائدة : 3 \\].وهذا الذي فَسَّر كعب به هو المناسب للغاية بقوله : { حتى إذا ضاقت عليهم الأرض بما رحُبت } لأن تخيل ضيق الأرض عليهم وضيققِ أنفسهم هو غاية لإرجاء أمرهم انتهى عندها التخليف ، وليس غايةً لتخلفهم عن الغزو ، لأن تخلفهم لا انتهاء له .وضيق الأرض : استعارة ، أي حتى كانت الأرض كالضَّيقة عليهم ، أي عندهم . وذلك التشبيه كناية عن غمهم وتنكر المسلمين لهم . فالمعنى أنهم تخيلوا الأرض في أعينهم كالضيقة كما قال الطرماح :مَلأتُ عليه الأرض حتى كأنها ... من الضيق في عينيه كِفَّة حَابلوقوله : { بما رحبت } حال من { الأرض }. والباء للملابسة ، أي الأرض الملابسة لسعتها المعروفة . و { ما } مصدرية .{ ورحُبت } اتسعت ، أي تخيلوا الأرض ضيقة وهي الأرض الموصوفة بسعتها المعروفة .وضيق أنفسهم : استعارة للغم والحزن لأن الغم يكون في النفس بمنزلة الضيق . ولذلك يقال للمحزون : ضاق صدره ، وللمسرور : شُرح صدره .والظن مستعمل في اليقين والجَزممِ ، وهو من معانيه الحقيقية . وقد تقدم عند قوله تعالى : { الذين يظنون أنهم ملاقوا ربهم وأنهم إليه راجعون } في سورة البقرة ( 46 ) وعند قوله تعالى : { وإنّا لنظنك من الكاذبين } في سورة الأعراف ( 66 ) ، أي وأيقنوا أن أمر التوبة عليهم موكول إلى الله دون غيره بما يُوحي به إلى رسوله ، أي التجأوا إلى الله دون غيره . وهذا كناية عن أنهم تابوا إلى الله وانتظروا عفوه .وقوله : ثم تاب عليهم } عطف على ضاقت عليهم الأرض وما بعده ، أي حتى وقع ذلك كله ثم تاب عليهم بعده .و { ثُم } هنا للمهلة والتراخي الزمَني وليست للتراخي الرتبي ، لأن ما بعدها ليس أرفع درجة مما قبلها بقرينة السياق ، وهو مغن عن جواب ( إذا ) لأنه يفيد معناه ، فهو باعتبار العطف تنهية للغاية ، وباعتبار المعطوف دال على الجواب .واللام في { ليتوبوا } للتعليل ، أي تاب عليهم لأجل أن يكفوا عن المخالفة ويتنزهوا عن الذنب ، أي ليدوموا على التوبة ، فالفعل مستعمل في معنى الدوام على التلبس بالمصدر لا على إحداث المصدر .وليس المراد ليذنبوا فيتوبوا ، إذ لا يناسب مقام التنويه بتوبته عليهم . وجملة { إن الله هو التواب الرحيم } تذييل مفيد للامتنان .\n\n",
      "translations": [
        {
          "translation": "(And to the three also (did He turn in mercy) who were left behind) He also turned in mercy to the three who stayed behind: Ka'b Ibn Malik and his two Companions: (when the earth, vast as it is, was straitened for them, and their own souls were straitened for them) their hearts became straitened because of the delay in the acceptance of their repentance (till they bethought) until they knew and became certain (them that there is no refuge from Allah) that there is no safety from Allah (save towards Him) save in repenting to Him for failing to join in the Battle of Tabuk. (Then turned He unto them in mercy) He pardoned and forgave them (that they (too) might turn (repentant unto Him)) for failing to join in the Battle of Tabuk. (Lo! Allah! He is the Relenting) the Forgiving, (the Merciful) towards he who repents.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ضَاقَتْ عَلَيْهِمُ ٱلأَرْضُ بِمَا رَحُبَتْ } معناهُ اتَّسَعتْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {the earth has become constricted to them} means that it has become spacious.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً تاب سبحانه { عَلَى ٱلثَّلاَثَةِ ٱلَّذِينَ خُلِّفُواْ } عن عزوة تبوك بلا عذر\n هو كعب بن مالك\n وهلال بن أمية\n ومرارة بن الربيع\n وصاروا من عدم التفات رسول الله والمؤمنين إليهم بعدما أمرهم الرسول ألا يتكلموا معهم خمسين ليلة { حَتَّىٰ إِذَا ضَاقَتْ عَلَيْهِمُ ٱلأَرْضُ بِمَا رَحُبَتْ } أي: مع وسعتها وفسحتها { وَ } صاروا من الأعراف إلى أن { ضَاقَتْ عَلَيْهِمْ أَنفُسُهُمْ } واشتد عليهم الأمر\n وانسد أبواب التدابير مطلقاً\n فاضطروا في أمرهم\n والتجأوا نحو الحق مخلصين { وَظَنُّوۤاْ } بل كوشفوا { أَن لاَّ مَلْجَأَ } ولا مفر { مِنَ ٱللَّهِ } أي: غضبه وسخطه { إِلاَّ إِلَيْهِ } إذ ليس بغيره وجود حتىى يلجأ إليه\n لذلك قال صلى الله عليه وسلم في أمثال هذه المضائق:\n \" أعوذ بك منك \"\n \n \n{ ثُمَّ } بعدما أخلصوا في الإنابة الرجوع وفوضوا أمروهم إليه سبحانه { تَابَ } الله { عَلَيْهِمْ } أي: أقدرهم ووفقهم على التوبة { لِيَتُوبُوۤاْ } ويرجعوا إلى الله نادمين على ما صدر عنهم من المخالفة\n فيغفر لهم ويعفو عن زلاتهم { إِنَّ ٱللَّهَ } المصلح الموفق { هُوَ ٱلتَّوَّابُ } الرجاع لعباده نحو جنابه حين صدر عنهم المعاصي { ٱلرَّحِيمُ } [التوبة: 118] لهم يرحمهم\n ويقبل توبتهم عند رجوعهم متضرعين مخلصين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال: { وعلى الثلاثة الذين خُلفوا } \n فذكر من لم يذنب ليؤنس من قد أذنب\n فلو قال أولاً: لقد تاب على الثلاثة لتفطرت أكبادهم\n هـ\n  ثم وصفهم بقوله: { الذين اتبعوه في ساعة العُسرةِ } \n يعني: حين محاولة غزوة تبوك\n والساعة هنا بمعنى الحين والوقت\n والعسرة: الشدة والضيق\n أي: الذين خرجوا معه وقت العسرة والضيق\n فقد كانوا في عسرة الظهر\n يعتقب العشرة على بعير واحد\n وفي عسرة الزاد حتى قيل: إن الرجلين كانا يقتسمان تمرة واحدة\n { من بعد ما كاد يزيغ قلوب فريق منهم } عن الثبات على الإيمان\n أو عن اتباع الرسول صلى الله عليه وسلم\n لما رأوا من الشدة والضيق وشدة الحر\n { ثم تاب عليهم } كرره للتأكيد\n وللتنبيه على أنه تاب عليهم لأجل ما كابدوا من العسر\n { إنه بهم رؤوف رحيم } حيث قَبَلهم\n وتاب عليهم\n وتاب على الثلاثة: وهم كعب بن مالك\n وهلال بن أمية\n ومُرارة بن الربيع\n تخلفوا عن غزوة تبوك من غير عذر ولا نفاق\n ولا قصد للمخالفة\n فلما رجع رسول الله صلى الله عليه وسلم عتب عليهم\n وأمر الناس ألا يكلمهم\n وأن يعتزلوا نساءهم\n فقبلوا على ذلك خمسين ليلة\n ثم أنزل الله توبتهم\n وقد وقع حديثهم في البخاري ومسلم وكتب السير\n ومعنى قوله: { الذين خلفوا } أي: تخلفوا عن الغزو\n وقال كعب بن مالك: خلفوا عن قبول العذر\n وليس بالتخلف عن الغزو\n ويقوي ذلك كونه جعل: { حتى إذا ضاقت عليهم الأرض } غاية للتخلف\n أي: خلفوا عن قبول العذر\n وأخروا { حتى إذا ضاقت عليهم الأرض بما رحبت } أي: برحبها وسعتها\n وذلك لإعراض الناس عنهم بالكلية\n وهو مثل لشدة الحيرة\n { وضاقت عليهم أنفسهم } من فرط الوحشة والغم\n { وظنوا } أي: علموا { أن لا ملجأ من الله } أي: من سخطه { إلا إليه } أي: إلا إلى استغفاره والرجوع إليه\n { ثم تاب عليهم } بالتوفيق بالتوبة\n { ليتوبوا } يإظهارها والدوام عليها\n وليعدوا من التوابين\n { إن الله هو التواب } لمن تاب\n ولو عادوا في اليوم سبعين مرة\n { الرحيم } متفضل عليهم بالنعم التي لا تحصى\n\nقال الورتجبي: التوبة توبتان: توبة العبد\n وتوبة الله\n توبة العبد: الرجوع من الزلات إلى الطاعات\n وتوبة الله: رجوعه إلى العبد بنعت الوصال\n وفتح باب المآب\n وكشف النقاب عن الاحتجاب\n وطلب العتاب\n\nانظر لطف الله بنبيه وأصحابه\n كيف تاب لأجلهم مكان توبتهم\n رجع إليهم قبل رجوعهم إليه\n ليسهل عليهم طريق الرجوع إليه\n فرجوعه إلى نبيه بكشف المشاهدة\n ورجوعه إليهم بكشف القربة\n فتوبته للنبي صلى الله عليه وسلم من غيبته عن المشاهدة باشتغاله بأداء الرسالة\n وتوبة القوم من غيبتهم عن ملاحظة الحضرة\n فلما ذاقوا الجنايات\n واحتجبوا عن المشاهدات أدركهم فيض الوصال\n وانكشف لهم أنوار الجمال\n وهكذا سنة الله في الأنبياء والأولياء\n إذا ذابوا في مقام الامتحان\n وبقوا في الحجاب عن مشاهدة الرحمن\n تمطر عليهم وبل سحاب الكرم\n ويلمع لأبصار أسرارهم نور شرف القدم\n فيؤنسهم بعد إياسهم\n ويواصلهم بعد قنوطهم\n قال تعالى:\n[الشورى:28]\n وقال تعالى:\n[يوسف: 110] الآية\n ثم قال عن بعضهم: توبة الأنبياء في مشاهدة الخلق في وقت الإبلاغ إذ الأنبياء لا يغيبون عن الحضرة\n بل لا يحضرون في مواضع الغيبة لأنهم في عين الجمع أبداً\n هـ\n  قال المحشي: وحاصلة: توبة الله المذكورة وَهبيةٌ\n وهي في كل أحد على حسب ما يليق بمقامه\n وإنما يليق بمقام الرسل ترقيته عن مقام إلى أعلى\n أو من شعور بخلق لأجل الإبلاغ\n إلى الغيبة عن ذلك\n وكذلك أبداً كأهل الجنة\n هـ\n ثم حضَّ على الصدق\n فقال: { يَـۤأَيُّهَا ٱلَّذِينَ آمَنُواْ ٱتَّقُواْ ٱللَّهَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:47",
      "similarity": 0.5650191751417517
    },
    {
      "verse": "38:60",
      "similarity": 0.45847808158038944
    },
    {
      "verse": "38:59",
      "similarity": 0.2827767216892173
    },
    {
      "verse": "9:57",
      "similarity": 0.28014140576234825
    },
    {
      "verse": "9:25",
      "similarity": 0.2117888440149453
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009118.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009118.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:118.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}