{
  "chapter": "التوبة",
  "text": "ما كان للنبى والذين ءامنوا۟ ان يستغفروا۟ للمشركين ولو كانوا۟ او۟لى قربى منۢ بعد ما تبين لهم انهم اصحب الجحيم",
  "translations": [
    {
      "translation": "It is not right for the Prophet and those who have iman to ask forgiveness for the idolaters - even if they are close relatives - after it has become clear to them that they are the Companions of the Blazing Fire.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not worthy of the Prophet and those who believe to seek forgiveness for those who are idolaters, even though they may be their relatives, after they have come to know that they are destined for Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After it has become clear that they are condemned to the Flaming Fire, it is not for the Prophet and those who believe to ask for the forgiveness of those who associate others with Allah in His Divinity even if they be near of kin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After it was made clear that the pagans are to be the dwellers of hell, the Prophet and the believers should not have sought forgiveness from God for them even though they may have been relatives.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It does not befit the Prophet and those who believe, to pray for the forgiveness of polytheists even if they may be their relatives, after it has become clear to them that they are the people of hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not (proper) for the Prophet and those who believe to ask Allah's forgiveness for the Mushrikin, even though they be of kin, after it has become clear to them that they are the dwellers of the Fire (because they died in a state of disbelief).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not (fit) for the Prophet and those who believe that they should ask forgiveness for the polytheists, even though they should be near relatives, after it has become clear to them that they are inmates of the flaming fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the Prophet and the believers to ask pardon for the idolaters, even though they be near kinsmen, after that it has become clear to them that they will be the inhabitants of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the Prophet, and those who believe, to pray for the forgiveness of idolaters even though they may be near of kin (to them) after it hath become clear that they are people of hell-fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not proper for the Prophet and those who believe to seek forgiveness for polytheists, even though they are close relatives, after it has become clear to them that they have earned the punishment of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the Prophet and those who believe to ask for the forgiveness of the associators, although they be of kin after it hath become manifest unto them that they are the fellows of the Flaming Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet and the faithful may not plead for the forgiveness of the polytheists, even if they should be [their] relatives, after it has become clear to them that they will be the inmates of hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not fitting, for the Prophet and those who believe, that they should pray for forgiveness for Pagans, even though they be of kin, after it is clear to them that they are companions of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not (proper) for the Prophet and those who believe to ask Allah's Forgiveness for the Mushrikun (polytheists, idolaters, pagans, disbelievers in the Oneness of Allah) even though they be of kin, after it has become clear to them that they are the dwellers of the Fire (because they died in a state of disbelief).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the Prophet or the believers to ask forgiveness for idolaters, even though they are near kindred, after it has become clear that they are the inhabitants of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the Prophet and those who believe to ask forgiveness for the polytheists, even if they are near relatives, after it has become clear to them that they are people of Hellfire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the Prophet and those who have believed to ask forgiveness for the polytheists, even if they were relatives, after it has become clear to them that they are companions of Hellfire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:113] The following was revealed regarding the Prophet (s) asking forgiveness for his uncle Abū Tālib, and some of the Companions asking forgiveness for their idolatrous parents: It is not for the Prophet, and those who believe, to ask forgiveness for the idolaters, even though they be kinsmen, relatives, after it has become clear to them that they are inhabitants of the Hell-fire, for having died as disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It is not for the Prophet) it is not permissible for Muhammad (pbuh) (and those who believe) in Muhammad (pbuh) and in the Qur'an, (to pray for the forgiveness of idolaters even though they may be near of kin (to them) after it hath become clear that they are people of hellfire) i.e. that they have died in a state of disbelief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سحبانه على طريق النهي عموماً: { مَا كَانَ } أي: ما صحّ وجاز { لِلنَّبِيِّ } الأمي الهاشمي { وَٱلَّذِينَ آمَنُوۤاْ } معه، وأخلصوا فيه { أَن يَسْتَغْفِرُواْ } ويشفعوا { لِلْمُشْرِكِينَ } بتخفيف العذاب ودخول الجنة { وَلَوْ كَانُوۤاْ أُوْلِي قُرْبَىٰ } من النسب؛ إذ لا عبرة لقرابة النسب، بل القرابة المعتبرة هي قرابة الحسب والإيمان، سيما { مِن بَعْدِ مَا تَبَيَّنَ لَهُمْ } موتهم على الكفر والجاهلية { أَنَّهُمْ أَصْحَابُ ٱلْجَحِيمِ } [التوبة: 113] أي: ملازموها وملاصقوها، لا نجاة لهم منها؛ لإصرارهم على موجبها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ما كان } ينبغي { للنّبي والذين آمنوا أن يستغفروا للمشركين } الذين ماتوا على الشرك، { ولو كانوا أولي قُرْبَى } أي: من قرابتهم، { من بعد ما تبيّنَ لهم أنهم أصحابُ الجحيم } لموتهم على الشرك\n رُوي أنه عليه الصلاة والسلام قال لأبي طالب، لما حضرته الوفاة: \" قُل:\n\n \" لا إله إلا الله، كلمة أُحَاجُّ لَكَ بِهَا عند اللَّهِ \"\n \n\nفأبى، فقال:\n\n \" واللَّهِ لأستَغفِرَنَّ لَكَ مَا لَم أُنهَ عنك \" \n\nفكان يستغفر له حتى نزلت الآية\n وقيل: إن النبي صلى الله عليه وسلم استأذن ربه أن يستغفر لأمه، فنزلت، وقيل: إن المسلمين أرادوا أن يستغفروا لآبائهم، فنزلت، وفيه دليل على جواز الاستغفار لأحيائهم إذ لم يتحقق أنهم أصحاب الجحيم، فإنه طلب توفيقهم للإيمان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:10",
      "similarity": 0.6202440723460989
    },
    {
      "verse": "5:86",
      "similarity": 0.6202440723460989
    },
    {
      "verse": "2:119",
      "similarity": 0.5278937393838464
    },
    {
      "verse": "102:6",
      "similarity": 0.5152307373492692
    },
    {
      "verse": "57:19",
      "similarity": 0.5109413490800264
    }
  ]
}