{
  "chapter": "التوبة",
  "text": "وما كان الله ليضل قومۢا بعد اذ هدىهم حتى يبين لهم ما يتقون ان الله بكل شىء عليم",
  "translations": [
    {
      "translation": "Allah would never misguide a people after guiding them until He had made it clear to them how to have taqwa. Allah has knowledge of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God never leads men astray after guiding them, until He makes quite clear to them what they should avoid, for God indeed knows each and everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not Allah's way to cause people to stray in error after He has guided them until He has made clear to them what they should guard against. Surely Allah knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not misguide a nation after having given them guidance until the means of piety are made known to them. God knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it does not befit Allah’s Majesty to send a nation astray after He has guided them until He has made clear to them what they should avoid; indeed Allah knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah will never lead a people astray after He has guided them until He makes clear to them what they should avoid. Verily, Allah is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not (attributable to) Allah that He should lead a people astray after He has guided them; He even makes clear to them what they should guard against; surely Allah knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God would never lead a people astray after that He has guided them, until He makes clear to them as to what they should be godfearing; surely God knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was never Allah's (part) that He should send a folk astray after He had guided them until He had made clear unto them what they should avoid. Lo! Allah is Aware of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God would never lead a people astray after He has guided them and until He has made clear to them what they should guard against. God has knowledge of all things;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is not one to leed a people astray after He hath guided them until He hath made manifest unto them that which they should guard against. Verily Allah is of everything the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not lead any people astray after He has guided them until He has made clear to them what they should beware of. Indeed Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah will not mislead a people after He hath guided them, in order that He may make clear to them what to fear (and avoid)- for Allah hath knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah will never lead a people astray after He has guided them until He makes clear to them as to what they should avoid. Verily, Allah is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor will Allah lead a nation astray after He has given them guidance until He has made clear to them all that they should guard against. Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God would never lead a people astray, after He had guided them, until He makes clear to them what they should guard against. God has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah would not let a people stray after He has guided them until He makes clear to them what they should avoid. Indeed, Allah is Knowing of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:115] And God would never send a people astray after He had guided them, to Islam, until He had made clear to them that which they should be wary of, in the way of deeds, but when they are not wary of it, then they deserve to be sent astray. Surely God is Knower of all things, including who deserves to be sent astray, or to be guided.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It was never Allah's (part) that he should send a folk astray) that he should leave a folk in error; it is also said this means: Allah will never thwart the works of a folk (after He had guided them) to faith (until He had made clear unto them what they should avoid) that which has been abrogated by means of that which has abrogated it. (Lo! Allah is Aware of all things) the abrogated and the abrogating.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وما كان الله } ليضلّهم عن طريق التسليم والانقياد لأمره والرضا بحكمه { بعد إذ هداهم } إلى التوحيد العلمي ورؤية وقوع كل شيء بقضائه وقدره { حتى يبين لهم } كل ما يجب عليهم اتقاؤه في كل مقام من مقامات سلوكهم ومرتبة من مراتب وصولهم\n فإن أقدموا في بعض مقاماتهم على ما تبين لهم وجوب اتقائه فهو يضلهم لكونهم مقدمين على ما هو ذنب حالهم وهو فسق في دينهم والعياذ بالله من الضلال بعد الهدى\n { إنّ الله بكل شيء عليم } يعلم دقائق ذنوب أحوالهم وإن لم يتفطن لها أحد فيؤاخذ بها أهل الهداية من أوليائه كما ورد في الحديث الرباني:\n \" وأنذر الصدّيقين بأني غيور \"\n ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلموا أيها المؤمنون { مَا كَانَ ٱللَّهُ } المصلح لأحوال عباده { لِيُضِلَّ قَوْماً } ويسميهم ضلالاً وفساقاً { بَعْدَ إِذْ هَدَاهُمْ } للإيمان والإسلام { حَتَّىٰ يُبَيِّنَ لَهُم } وينبه عليهم { مَّا يَتَّقُونَ } ويحذرون من المحارم والمعاصي\n لامتناع تكليف الغافل\n ثم بعد ارتكاب المحذور به يسميهم ما يسميهم\n ويأخذهم منتقماً عليه { إِنَّ ٱللَّهَ } المدبر لأمور عباده { بِكُلِّ شَيْءٍ } مما يتعلق بصلاحهم وإصلاحهم { عَلِيمٌ } [التوبة: 115] لا يعزب عن علمه شيء\n فعليكم أيها المؤمنون أن تفوضوا أموركم كلها إلى الله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وما كان الله ليضل قوماً } أي: يسميهم ضلالاً\n ويؤاخذهم مؤاخذتهم\n { بعد إذ هداهم } للإسلام\n { حتى يُبين لهم ما يتقونَ } أي: حتى يُبين لهم خطر ما يجب اتقاؤه\n فإن خالفوا بعد البيان\n أضلهم وآخذهم إن لم يتوبوا\n قال البيضاوي: وكأنه بيان عذر الرسول في قوله لعمه:\n \" لأستغفرن لك\n ولمن استغفر لأسلافه المشركين قبل المنع \"\n \nوقيل: إنه في قوم مضوا على الأمر الأول في القبلة والخمر\n ولم يعلموا بالنسخ والمنع\n وفي الجملة: دليل على أن الغافل غير مكلف\n هـ\n وقال ابن جزي: نزلت في قوم من المسلمين استغفروا للمشركين من غير إذن\n فخافوا على أنفسهم من ذلك\n فنزلت الآية تأنيساً لهم\n أي: ما كان الله ليؤاخذهم بذلك قبل أن يُبَيَّن لكم المنع من ذلك\n هـ\n { إن الله بكل شيءٍ عليمٌ } فيعلم أمرهم قبل النهي وبعده",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:117",
      "similarity": 0.37485560482700514
    },
    {
      "verse": "68:7",
      "similarity": 0.37485560482700514
    },
    {
      "verse": "4:116",
      "similarity": 0.3555867639840682
    },
    {
      "verse": "37:124",
      "similarity": 0.34576027681036403
    },
    {
      "verse": "20:79",
      "similarity": 0.3451541677385859
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009115.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009115.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:115.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}