{
  "chapter": "التوبة",
  "text": "لقد تاب الله على النبى والمهجرين والانصار الذين اتبعوه فى ساعة العسرة منۢ بعد ما كاد يزيغ قلوب فريق منهم ثم تاب عليهم انه بهم رءوف رحيم",
  "translations": [
    {
      "translation": "Allah has turned towards the Prophet, and the Muhajirun and the Ansar, those who followed him at the 'time of difficulty', after the hearts of a group of them had almost deviated. Then He turned towards them - He is All-Gentle, Most Merciful to them -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God was kind to the Prophet, the emigrants, and the helpers of the faithful who followed him in the hour of distress. When a section of them were about to lose courage He turned to them in His mercy, for He is compassionate and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah has relented towards the Prophet, and towards the Muhajirun (Emigrants) and the Ansar (Helpers) who stood by him in the hour of hardship, although the hearts of a party of them had well-nigh swerved. (But when they gave up swerving from the Right Course and followed the Prophet), Allah relented towards them. Surely to them He is the Most Tender, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God pardoned the Prophet, the Emigrants, the Helpers, and those who followed them, when the hearts of some of them almost deviated (from the truth) in their hour of difficulty. God forgave them because of His Compassion and Mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah’s mercy inclined towards the Herald of the Hidden, and the Muhajirs and the Ansar who stood by him in the time of hardship, after it was likely that the hearts of a group among them would turn away – He then inclined towards them with mercy; indeed He is Most Compassionate, Most Merciful upon them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has forgiven the Prophet, the Muhajirin and the Ansar who followed him in the time of distress (Tabuk expedition), after the hearts of a party of them had nearly deviated (from the right path), but He accepted their repentance. Certainly, He is unto them full of kindness, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly Allah has turned (mercifully) to the Prophet and those who fled (their homes) and the helpers who followed him in the hour of straitness after the hearts of a part of them were about to deviate, then He turned to them (mercifully); surely to them He is Compassionate, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has turned towards the Prophet and the Emigrants and the Helpers who followed him in the hour of difficulty, after the hearts of a part of them well-nigh swerved aside; then He turned towards them; surely He is Gentle to them, and All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath turned in mercy to the Prophet, and to the Muhajirin and the Ansar who followed him in the hour of hardship. After the hearts of a party of them had almost swerved aside, then turned He unto them in mercy. Lo! He is Full of Pity, Merciful for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God turned in mercy to the Prophet, and the emigrants and the helpers who followed him in the hour of hardship. After the hearts of a group of them had almost faltered, He turned towards them, for He was compassionate and merciful towards them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly Allah hath relented toward the Prophet and the Muhajirs and the Ansar who followed him in the hour of distress after the hearts of a part of them had well-nigh swerved aside when He relented toward them. Verily He is unto them Tender, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly Allah turned clemently to the Prophet and the Emigrants and the Helpers, who followed him in the hour of difficulty, after the hearts of a part of them were about to swerve. Then He turned clemently to them—indeed, He is most kind and merciful to them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah turned with favour to the Prophet, the Muhajirs, and the Ansar,- who followed him in a time of distress, after that the hearts of a part of them had nearly swerved (from duty); but He turned to them (also): for He is unto them Most Kind, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has forgiven the Prophet (SAW), the Muhajirun (Muslim emigrants who left their homes and came to Al-Madinah) and the Ansar (Muslims of Al-Madinah) who followed him (Muhammad SAW) in the time of distress (Tabuk expedition, etc.), after the hearts of a party of them had nearly deviated (from the Right Path), but He accepted their repentance. Certainly, He is unto them full of Kindness, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the hour of adversity, Allah turned (in mercy) to the Prophet, the Emigrants (of Mecca) and the Supporters (of Madinah) who followed him when some of their hearts were about to swerve away. He turned to them, indeed, He is Gentle, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has redeemed the Prophet, and the Emigrants, and the Supporters—those who followed him in the hour of difficulty—after the hearts of some of them almost swerved. Then He pardoned them. He is Kind towards them, Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has already forgiven the Prophet and the Muhajireen and the Ansar who followed him in the hour of difficulty after the hearts of a party of them had almost inclined [to doubt], and then He forgave them. Indeed, He was to them Kind and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:117] God has truly relented, that is, He has [truly] perpetuated His relenting, to the Prophet and the Emigrants and the Helpers who followed him in the hour of hardship, that is, during the time of this [hardship], which was their predicament during the raid at Tabūk, where two men would share a single date, ten men would take turns on one camel, and where the heat became so intense that they resorted to drinking filth; after the hearts of a party of them had almost deviated (read either as tazīghu or yazīghu), [had almost] inclined away from following him, in favour of staying behind due to the hardship that afflicted them, then He relented to them, by making them steadfast. Truly He is Gentle, Merciful to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "209 (Allah hath turned in mercy to the Prophet) Allah has forgiven the Prophet, (and to the Muhajirin and the Ansar) as He has forgiven the Emigrants and the Helpers who prayed towards the two Qiblahs and had participated in the Battle of Badr. Allah then explained who these were, saying: (who followed him) who followed the Prophet in the Battle of Tabuk (in the hour of hardship) at a time of hardship and adversity. They were short of provision and mounts and in great hardship because of the heat, the enemy and the long distance they had to travel. (After the hearts of a party of them had almost swerved aside) a party of sincere believers almost refrained from going forth with the Prophet (pbuh) (then turned He unto them in mercy) He forgave them and made their hearts firm such that they went with the Prophet (pbuh). (Lo! He is Full of Pity, Merciful for them).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَزِيغُ قُلُوبُ فَرِيقٍ مِّنْهُمْ } معناهُ تَعدِلُ وَتَجورُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Their hearts have been perverted} means that they are unjust and wicked.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَقَدْ تَابَ الله عَلَىٰ ٱلنَّبِيِّ } أي: وفقه على التوبة بعدما صار عنه إذن المخالفين، المستأذنين المعتذرين بالأعذار الكاذبة؛ تعزيراً له وتلبيساً عليه، مع عدم علمه بحالهم { وَ } تاب أيضاً على { ٱلْمُهَاجِرِينَ وَٱلأَنصَارِ ٱلَّذِينَ ٱتَّبَعُوهُ } نحو تبوك حين خرج إليها { فِي سَاعَةِ ٱلْعُسْرَةِ } وأيام القحط؛ إذ ليس لهم في تلك السفر زاد ولا راحلة ولا ماء، حيث يتعاقب عشرة على بعير، وقسيم تمر بين اثنين في يوم، وشرب الفظ والفرث من شدة العطش، لذلك تمايل على المخالفة { مِن بَعْدِ مَا كَادَ } وقرب { يَزِيغُ } ويميل عن المتابعة { قُلُوبُ فَرِيقٍ مِّنْهُمْ } من قلة البصر، وكثرة المقاساة والأحزان { ثُمَّ تَابَ } الله { عَلَيْهِمْ } ووفقهم على التوبة مما أخطروا ببالهم، وتخيلوا في خيالهم { إِنَّهُ } سبحانه { بِهِمْ } بعدما علم استعدادهم وقابليتهم { رَءُوفٌ } عطوف، يعفو عمَّا صدر عنهم وقت الاضطرار { رَّحِيمٌ } [التوبة: 117] يقبل عنهم ما جاءوا به من الإنابة والاستغفار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: في \" كاد \" ضمير الشأن، ويرتفع بها قلوبُ\n يقول الحق جل جلاله: { لقد تابَ الله على النبي } أي: برأه وطهره من الذنوب، كقوله:\n\n[الفتح: 2]، { و } تاب على { المهاجرين والأنصار } مما عسى أن يكون ارتكبوه إذ لا يخلو العبد من ذنب أو عيب\n وقيل: هو حض على التوبة، وإظهار لفضلها، بأنها مقام الأنبياء والصالحين، وقيل: تاب عليهم من نقص المقامات التي ترقوا عنها، إلى ما هو أكمل منها، فما من أحد إلا وله مقام يستنقص بالنسبة إلى ما فوقه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "53:17",
      "similarity": 0.4057203808943743
    },
    {
      "verse": "3:8",
      "similarity": 0.39314758559979407
    },
    {
      "verse": "38:63",
      "similarity": 0.39137751765897544
    },
    {
      "verse": "61:5",
      "similarity": 0.3903297505458459
    },
    {
      "verse": "25:26",
      "similarity": 0.31039534020356413
    }
  ]
}