{
  "chapter": "التوبة",
  "text": "يايها الذين ءامنوا۟ اتقوا۟ الله وكونوا۟ مع الصدقين",
  "translations": [
    {
      "translation": "You who have iman! have taqwa of Allah and be with the truly sincere.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, do not stray from the path of God, and be with those who are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Have fear of Allah and stand with those that are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, have fear of God and always be friends with the truthful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Fear Allah, and be with the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Have Taqwa of Allah, and be with those who are true (in words and deeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! be careful of (your duty to) Allah and be with the true ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, fear God, and be with the truthful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Be careful of your duty to Allah, and be with the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, fear God and stand with the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! fear Allah, and be with the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Be wary of Allah, and be with the Truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Fear Allah and be with those who are true (in word and deed).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Be afraid of Allah, and be with those who are true (in words and deeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, fear Allah and stand with the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Be conscious of God, and be with the sincere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, fear Allah and be with those who are true.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:119] O you who believe, fear God, by refraining from [acts of] disobedience to Him, and be with those who are truthful, in [their] faith and covenants, by adhering to sincerity.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe!) 'Abdullah Ibn Salam and his followers as well as all other believers (Be careful of your duty to Allah) obey Allah in that which He has commanded you, (and be with the Truthful) with Abu Bakr, 'Umar and their companions when they stay behind and when they participate in jihad.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يا أيها الذين آمنُوا اتّقوا الله } في جميع الرذائل بالاجتناب عنها خاصة رذيلة الكذب، وذلك معنى قوله: { وكونوا مع الصادقين } فإن الكذب أسوأ الرذائل وأقبحها لكونه ينافي المروءة لقوله صلى الله عليه وسلم:\n\n \" لا مروءة لكذوب \" \n\nإذ المراد من الكلام الذي يتميز به الإنسان عن سائر الحيوان إخبار الغير عما لا يعلم، فإذا كان الخبر غير مطابق لم تحصل فائدة النطق وحصل منه اعتقاد غير مطابق وذلك من خواص الشيطنة، فالكاذب شيطان\n وكما أن الكذب أقبح الرذائل، فالصدق أحسن الفضائل\n وأصل كل حسنة ومادة كل خصلة محمودة وملاك كل خير وسعادة به يحصل كل كمال ويحصل كل حال وأصله الصدق في عهد الله تعالى الذي هو نتيجة الوفاء بميثاق الفطرة أو نفسه كما قال تعالى:\n\n[الأحزاب، الآية: 23] في عقد العزيمة ووعد الخليقة، كما قال تعالى في إسماعيل عليه السلام:\n\n[مريم، 54] وإذا روعي في المواطن كلها حتى الخاطر والفكر والنية والقول والعمل صدقت المنامات والواردات والأحوال والمقامات والمواهب والمشاهدات كأنه أصل شجرة الكمال وبذر ثمرة الأحوال\n { فلولا نفر من كل فرقة منهم طائفة } أي: يجب على كل مستعد من جماعة سلوك طريق طلب العلم إذ لا يمكن لجميعهم، أما ظاهراً فلفوات المصالح، وأما باطناً فلعدم الاستعداد\n والتفقه في الدين هو من علوم القلب لا من علوم الكسب إذ ليس كل من يكتسب العلم يتفقه كما قال تعالى:\n\n[الأنعام، الآية: 25] والأكنة: هي الغشاوات الطبيعية والحجب النفسانية فمن أراد التفّقه فلينفر في سبيل الله وليسلك طريق التزكية والتصفية حتى يظهر العلم من قلبه على لسانه كما نزل على بعض أنبياء بني إسرائيل: \" يا بني إسرائيل، لا تقولوا العلم في السماء من ينزل به، ولا في تخوم الأرض من يصعد به، ولا من وراء البحر من يعبر ويأتي به، العلم مجعول في قلوبكم تأدّبوا بين يديّ بآداب الروحانيين، وتخلقوا بأخلاق الصديقين، أظهر العلم من قلوبكم حتى يغمركم ويغطيكم \"\n فالمراد من التفقه علم راسخ في القلب، ضارب بعروقه في النفس، ظاهر أثره على الجوارح بحيث لا يمكن صاحبه ارتكاب ما يخالف ذلك العلم وإلا لم يكن عالماً\n ألا ترى كيف سلب الله الفقه عمن لم تكن رهبة الله أغلب عليه من رهبة الناس بقوله تعالى:\n\n[الحشر، الآية: 13] لكون رهبة الله لازمة للعلم، كما قال تعالى:\n\n[فاطر، الآية: 28] وسلب العلم عمن لم يعمل به في قوله تعالى:\n\n\n\n[الزمر، الآية: 9]\n وإذا تفقهوا وظهر علمهم على جوارحهم أثر في غيرهم وتأثروا منه لارتوائهم به وترشحهم منه كما كان حال رسول الله صلى الله عليه وسلم، فلزم الإنذار الذي هو غايته كما قال: { ولينذروا قومهم إذا رجعوا إليهم لعلهم يحذرون } ومن لازم التفقه الجهاد الأكبر ثم الأصغر فلذلك قال بعده: { قاتلوا الذين يلونكم } من كفار قوى نفوسكم التي هي أعدى عدوكم { وليجدوا فيكم غِلظَة } أي: قهراً وشدة حتى تبلغوا درجة التقوى فينزل عليكم النصر من عند الله كما قال: { واعلموا أن الله مع المتقين }\n { أو لا يرون أنهم يفتنون } الآية، البلاء قائد من الله تعالى يقود الناس إليه\n وقد ورد في الحديث:\n\n \" البلاء سوط من سياط الله تعالى، يسوق به عباده إليه \" \n\nفإن كل مرض وفقر وسوء حال يحل بأحد يكسر ثورة نفسه وقواها ويقمع صفاتها وهواها، فيلين القلب ويبرز من حجابها وينزعج من الركون إلى الدنيا ولذاتها وينقبض منها ويشمئز، فيتوجه إلى الله تعالى\n وأقلّ درجاته أنه إذا اطلع على أن لا مفرّ منه إلا إليه، ولم يجد مهرباً ومحيصاً من البلاء سواه، تضرّع إليه وتذلّل بين يديه، كما قال تعالى:\n\n[لقمان، الآية: 32]،\n\n[يونس، الآية: 12]، وبالجملة يوجب رقة الحجاب أو ارتفاعه فليغتنم وقته وليتعوذ وليتخذ ملكة يعود إليها أبداً حتى يستقرّ التيقظ والتذكر وتتسهل التوبة والحضور فلا يتعود الغفلة عند الخلاص وتتقوى النفس عند الأمان فتغلب وينسبل الحجاب أغلظ مما كان كما قال:\n\n[العنكبوت، الآية: 65]،\n\n[يونس، الآية: 12]\n\n",
      "translations": [
        {
          "translation": " O you who have believed, fear Allah. In all the messages, avoid lying, especially the lie of disbelief.,\n\nAnd that is the meaning of the saying: {And be with the truthful} for lying is the worst of all messages and the most ugly because it contradicts the honor of the saying of the Messenger of Allah, peace and blessings be upon him:\n\n\n\"There is no beauty in deception\"\n\n\nThe point of speech that distinguishes humans from other animals is informing others of what they do not know., If the news does not correspond, there is no benefit to the pronunciation, and an incorrect belief is obtained from it, which is one of the properties of Satan.,\n\nThe liar is Satan.\n And as lying is the ugliest of messages.,\n\nThe truth is the best of virtues.\n\n\nThe origin of every good thing and every material thing is the perfection and excellence of Allah, and the owner of every good and every happiness is Allah. He is the source of all perfection and every situation, and His origin is truthfulness in the covenant of Allah Almighty, which is the result of fulfilling the covenant of faith or of the self, as Allah Almighty said:\n\n\nThe Parties,\n\nThe verse refers to the covenant of al-‘Uqdah (the firm pact) and the promise of creation., As Allah said about Ishmael (peace be upon him):\n\n\"I will make him a great nation\" (Genesis 17:20)\n\n\nMary,\n\nWhen one is in a state of complete concentration, such that one's thoughts, words and deeds are all in alignment, one's dreams and visions will be truthful, and one will be able to correctly interpret the signs and omens one sees. This is as if one were the root of a perfect tree, bearing the fruit of truth.\n\n\n{} If only one group from each faction of them would take action } meaning: each individual from the group should take the initiative to seek knowledge, as it is not possible for everyone to do so.,\n\nHowever, the apparent benefits of the agreement {between the two parties} are many.,\n\nAs for the inner self, unless it is prepared (for death),\n\n\nAnd understanding religion is from the sciences of the heart, not from the sciences of earning; for not everyone who earns knowledge is understanding, as Allah said:\n Livestock,\n\nThe ayah: 25] And the Akn: they are the natural Ghashawaat and the human Hijab, so whoever wills to understand, let him travel in the way of Allah and let him take the path of Tazkiyah and Tasfiyah until the knowledge appears from his heart onto his tongue as it was revealed to some of the Prophets of Bani Israel: \"O Bani Israel,\n\nDo not say that knowledge is in the heavens, for who can bring it down from there?,\n\nAnd there is no one who climbs up {into the earth} with it.,\n\nAnd none shall cross the sea to come with it.,\n\nThe knowledge is in your hearts. Be righteous in your dealings with others, according to the standards of the righteous.,\n\nCreate friends with good character.,\n\n\"Show your knowledge from your hearts, so that it may submerge and cover you.\"\n\n\nThe aim of understanding is to have a deep knowledge in the heart.,\n\nThe mind is a battlefield., The effect of it is such that its possessor cannot do anything contrary to that knowledge, unless he is not a scholar.\n\n\nDo you not see how Allah has taken away the understanding of those who do not have the fear of Allah? Most of them have more fear of people than of Allah, as Allah says:\n\n\nThe Resurrection,\n\n{Because} the fear of God is necessary for knowledge.,\n\nAs the Almighty said:\n The Originator]\n\n[الرحمن\nEnglish: The Most Merciful]\n\n[الرحيم\nEnglish: The Most Merciful]\n\n[ملك\nEnglish: The King]\n\n[القدوس\nEnglish: The Most Holy]\n\n[السلام\nEnglish: The Peace]\n\n[المؤمن\nEnglish: The Faithful]\n\n[المهيمن\nEnglish: The Guardian]\n\n[العزيز\nEnglish: The Almighty]\n\n[الجبار\nEnglish: The Compeller]\n\n[المتكبر\nEnglish: The Proud],\n\nAnd those who do not use their knowledge are deprived of it, as Allah says:\n\n\nThe Tribes,\n\n{And We have sent down to you the Book as clarification for all things and as guidance and mercy and good tidings for the Muslims.}\n\nAnd if they understood and their knowledge appeared on their limbs, impacting others, and they were impacted by it, due to their taking it in, and they chose it over others, as was the case with the Messenger of Allah ﷺ.,\n\nHeed the warning that its purpose is as {He said: \"Let them warn their people when they return to them, lest they be cautious\"}. And it is necessary to understand that the greatest jihad is followed by the lesser one, so he said after that: {\"Kill those who disbelieve in you\"}. Fight the powerful disbelievers of your hearts that are your most dangerous enemies {and find in you harshness}. Meaning: domination and intensity, until you reach the level of taqwa, then victory will come to you from Allah as He said: {And know that Allah is with the righteous}.\n\n{Or do they not see} that they are being put to the test?,\n\nThe tribulations are sent by Allah to lead people to Him.\n\n\nIt has been narrated in the hadith:\n\n\nThe trials and tribulations that come from Allah are like a sharpened sword.,\n\nHe is shopping with his slaves.\n\n\nEvery illness, poverty, and bad circumstance can be cured by someone who breaks their own revolution and strengthens themselves, and overcomes their own qualities and desires., The heart flutters and stands out from its veil and is disturbed by the movement from the world to the Hereafter and its delights and it contracts from it and is content.,\n\nHe turns to Allah, the Most High.\n\n\nAnd the lowest of his degrees is that if he looks and sees that there is no escape from him except to him.,\n\nHe found no respite or refuge from hardship other than {it}.,\n\nSupplicate to Him and prostrate between His hands.,\n\nAs the Almighty said:\n\n\nThe Book of Luqman is one of the books of wisdom in Islam. It is named after Luqman, a prophet mentioned in the Quran. The book contains various ethical and moral lessons.,\n\nAnd when they hear {the Qur'an}, they do not fall down in prostration,\n\nAnd when they hear the Qur'an, they do not prostrate themselves.,\n\nThe {Arabic} word for \"peace\" is \"salam\". It is also used as a greeting, meaning \"hello\" or \"goodbye\".\n\n\nYounus,\n\nIn the name of God, the Most Merciful, the Most Compassionate\n\n{Bismillah al-rahman al-rahim}\n\n1. God is He besides Whom there is no god, the Living, the Self-Subsisting, Eternal.\n2. He has sent down to you the Book with the truth, confirming what was before it, and He sent down the Torah and the Gospel\n3. before, as guidance for the people, and He sent down the Criterion {of distinction between right and wrong}.\n4. Surely those who disbelieve in God's revelations {ayat} shall be sternly punished; God is All-Mighty, All-Avenger.\n5. Surely God nothing is hidden from Him in the earth or in the heaven.\n6. He it is Who shapes you in the wombs as He pleases; there is no god but He, the All-Mighty, the All-Wise.\n7. He it is Who has sent down to you the Book; in it are verses clear {that are} the mother of the Book, and others not so clear. As for those in whose hearts is deviation, they follow the unclear part, desiring discord and seeking its interpretation. But no one knows its interpretation except God, and those who are firmly grounded in knowledge say, \"We believe in it; all of it is from our Lord.\" But only those of understanding keep it in mind.\n8. \"Our Lord, do not let our hearts deviate after You have guided us, and bestow upon us mercy from Your Presence; You are the All-Giving.\"\n9. \"Our Lord, You will indeed gather humanity together on the Day about which there is no doubt. God will not fail in His promise.\"\n10. Surely those who disbelieve and die while they are disbelievers, God will not forgive them.\n11. God will guide those who believe and do good deeds to gardens beneath which rivers flow; God will do whatever He wills.\n12. That is the great achievement.,\n\nIn general, one should lower or raise their hijab so that they may take advantage of their time and so that they may take a queen as their return, so that they may wake up and remember, and so that repentance and attendance may become easy. So that carelessness does not return at the end, and so that the soul is at peace when safe. So that it overcomes and the hijab becomes more intense than it was before, as was said:\n The Spider\n\nThe spider is a small, eight-legged creature that can be found in nearly every corner of the world. Spiders are known for their ability to spin webs, which they use to catch their prey.,\n\n{And We have certainly sent Our messengers with clear proofs and sent down with them the Book and the Balance}\n\nAnd We have certainly sent Our messengers with clear proofs and sent down with them the Book and the Balance, so that people might uphold justice.,\n\nIn the name of God, the Most Merciful, the Most Compassionate\n\n{Bismillah al-Rahman al-Rahim}\n\nPraise be to God, Lord of the Worlds,\n\n{Alhamdu lillahi Rabbil 'alamin}\n\nThe Most Merciful, the Most Compassionate,\n\n{Ar-Rahman ar-Rahim}\n\nMaster of the Day of Judgment.\n\n{Malik yawm al-din}\n\nYou alone we worship, and You alone we ask for help.\n\n{Anta ta'lamu ma nukallifu nuhyi wa nunti}\n\nGuide us on the straight path,\n\n{Ihdina siratal mustaqim}\n\nthe path of those who have received Your grace;\n\n{Siratal ladhina an'amta 'alayhim ghayril maghduubi 'alayhim wa lad-dallin}\n\n\nYounus,\n\nIn the name of God, the Most Merciful, the Most Compassionate\n\n1. God is the Light of the heavens and the earth. {The likeness of His Light} is as a niche in which is a lamp; {the lamp} is in a glass; {the glass} is as if it were a shining star; {lit from} a blessed olive tree, {neither eastern nor western,} whose oil would almost glow even if untouched by fire. {Light upon light;} God guides to His Light whoever He wills. And God {sets forth} parables for mankind, for God {is} All-Knowing.\n\n2. {In houses} which God has permitted to be raised up and in which His name is mentioned, {there are} men who proclaim His glory morning and evening, {not} distracted by any business {from the remembrance of God} and {from} establishing prayer and {from} giving alms; fearing a Day on which hearts and eyes will {overflow with tears,} God will reward them for their {deeds;} and God {is} All-Encompassing, All-Knowing.\n\n3. {They are those who} believe in God and the Last Day, and {engage in} righteous deeds, and {give} of what We have provided for them, {even though} they are {sure} that they will {return to Us.}\n\n4. {Such is} the reward of those who do good, {but} the punishment of those who {turn away from the truth} and disbelieve in Our signs will be {severe.}",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَـٰأيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم التقوى عن محارم الله { ٱتَّقُواْ ٱللَّهَ } عن مخالفة أمره { وَكُونُواْ } في السراء والضراء { مَعَ ٱلصَّادِقِينَ } [التوبة: 119] المصدقين لرسوله، المتابعين له في جميع أموره\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { يا أيها الذين آمنوا اتقوا الله } بالمحافظة على ما أمركم به، والانكفاف عما نهاكم عنه، { وكونوا مع الصادقين } في إيمانهم وأقوالهم وأفعالهم وعهودهم\n قال ابن جزي: ويحتمل أن يريد به صدق اللسان إذ كان هؤلاء قد صدقوا ولم يعتذروا بالكذب، فنفعهم الله بذلك، ويحتمل أن يريد أعم من صدق اللسان وهو الصدق في الأقوال والأعمال والمقاصد والعزائم، والمراد بالصادقين: المهاجرين، لقوله في الحشر:\n\n\n\n إلى قوله:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:33",
      "similarity": 0.5388274119868186
    },
    {
      "verse": "16:128",
      "similarity": 0.5207713084092969
    },
    {
      "verse": "7:106",
      "similarity": 0.42097772863823923
    },
    {
      "verse": "10:63",
      "similarity": 0.4176108550429299
    },
    {
      "verse": "3:102",
      "similarity": 0.40610999410443666
    }
  ]
}