{
  "chapter": "التوبة",
  "text": "وما كان استغفار ابرهيم لابيه الا عن موعدة وعدها اياه فلما تبين له انه عدو لله تبرا منه ان ابرهيم لاوه حليم",
  "translations": [
    {
      "translation": "As for Abraham's prayer for his father, he was fulfilling a promise he had made to him. Yet when it became evident to him that (his father) was an enemy of God, he broke away from him, though Abraham was soft hearted and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Abraham's prayer for the forgiveness of his father was only because of a promise which he had made to him. Then, when it became clear to him that he was an enemy of Allah, he dissociated himself from him. Surely Abraham was most tender-hearted, God-fearing, forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was no other reason for Abraham to seek forgiveness from God for his father except the promise that he had made with him. When Abraham knew that his father was an enemy of God, he disowned his father. Abraham was very tender-hearted and forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the seeking of forgiveness for his father (paternal uncle) by Ibrahim was only because of a promise he had made to him; then when it became clear to him that he was an enemy of Allah, Ibrahim broke off ties with him; indeed Ibrahim is surely very soft-hearted, most forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Ibrahim's invoking (of Allah) for his father's forgiveness was only because of a promise he [Ibrahim] had made to him (his father). But when it became clear to him [Ibrahim] that he (his father) is an enemy of Allah, he dissociated himself from him. Verily, Ibrahim was Awwah and forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Ibrahim asking forgiveness for his sire was only owing to a promise which he had made to him; but when it became clear to him that he was an enemy of Allah, he declared himself to be clear of him; most surely Ibrahim was very tender-hearted forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham asked not pardon for his father except because of a promise he had made to him; and when it became clear to him that he was an enemy of God, he declared himself quit of him; Abraham was compassionate, clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The prayer of Abraham for the forgiveness of his father was only because of a promise he had promised him, but when it had become clear unto him that he (his father) was an enemy to Allah he (Abraham) disowned him. Lo! Abraham was soft of heart, long-suffering.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham's asking forgiveness for his father was only because of a promise he had made to him, but when it became clear to him, that he was God's enemy, he disassociated himself from him. Surely, Abraham was most tender-hearted and forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Ibrahim's asking for the forgiveness of his father was only in pursuance of a promise which he had made unto him. Then, when it became manifest unto him that he was an enemy of Allah, he declared himself quit of him. Verily Ibrahim was long-suffering, forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham’s pleading forgiveness for his father was only to fulfill a promise he had made him. So when it became manifest to him that he was an enemy of God, he repudiated him. Indeed Abraham was most plaintive and forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Abraham prayed for his father's forgiveness only because of a promise he had made to him. But when it became clear to him that he was an enemy to Allah, he dissociated himself from him: for Abraham was most tender-hearted, forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [Ibrahim's (Abraham)] invoking (of Allah) for his father's forgiveness was only because of a promise he [Ibrahim (Abraham)] had made to him (his father). But when it became clear to him [Ibrahim (Abraham)] that he (his father) is an enemy to Allah, he dissociated himself from him. Verily Ibrahim (Abraham) was Al-Awwah (has fifteen different meanings but the correct one seems to be that he used to invoke Allah with humility, glorify Him and remember Him much), and was forbearing. (Tafsir Al-Qurtubi).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham only asked for forgiveness for his father because of a promise he had made to him. But when it became clear to him that he was an enemy of Allah, he declared himself quit of him. Surely, Abraham was earnest in his supplication and tenderhearted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham asked forgiveness for his father only because of a promise he had made to him. But when it became clear to him that he was an enemy of God, he disowned him. Abraham was kind and clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the request of forgiveness of Abraham for his father was only because of a promise he had made to him. But when it became apparent to Abraham that his father was an enemy to Allah, he disassociated himself from him. Indeed was Abraham compassionate and patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:114] Abraham’s prayer for the forgiveness of his father was only because of a promise he had made to him, when he said to him, I will ask my Lord forgiveness for you [Q. 19:47], in the hope that he would submit [to God]; but when it became clear to him that he was an enemy of God, upon his death as an disbeliever, he declared himself innocent of him, and refrained from asking forgiveness for him; truly Abraham was soft of heart, making frequent entreaty and supplication [to God], forbearing, enduring harm patiently.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The prayer of Abraham for the forgiveness of his father was only because of a promise he had promised him) that he would surrender, (but when it had become clear unto him that he (his father) was an enemy to Allah) that he had died an unbeliever (he (Abraham) disowned him) and his religion. (Lo! Abraham was soft of heart) in the face of ignorance, (long-suffering) compassionate; it is also said that Abraham used to complain about fire even before being thrown in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّ إِبْرَاهِيمَ لأَوَّاهٌ حَلِيمٌ } والأَواهُ: المُتضرعُ بالدعاءِ والأَواهُ: المُسّبحُ\n والأَواهُ: الرَّحيمُ\n والأَواهُ: المُوقنُ بالخَشْيَةِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لا يرد على هذا استغفار إبراهيم لأبيه؛ إذ { مَا كَانَ ٱسْتِغْفَارُ إِبْرَاهِيمَ لأَبِيهِ } على سبيل الشفاعة والشفقة، والعطف الموجب لها، بل ما هو { إِلاَّ عَن مَّوْعِدَةٍ } وعهد { وَعَدَهَآ إِيَّاهُ } حين أراد أن يخرجه من الكفر والشرك، بأن يستغفر له ما تقدم من ذنبه إن آمن فاستغفر قبل الإيمان إنجازاً لوعده ليلين قلبه { فَلَمَّا تَبَيَّنَ لَهُ } ظهر عنده { أَنَّهُ عَدُوٌّ لِلَّهِ } مصر على كفره، مطبوع على قبله { تَبَرَّأَ مِنْهُ } واسترجع إلى الله منيباً؛ لاجترائه واستغفاره في حق أبيه، مع عدم العلم باستعداده وتوفيق الله إياه { إِنَّ إِبْرَاهِيمَ } مع كونه متحققاً بمقام الخلة مع الله { لأَوَّاهٌ } كثير التأوه والتحزن عن أمثال هذه الجرأة { حَلِيمٌ } [التوبة: 114] كثير الشفقة والمرحمة على أهل الغفلة؛ لظهوره على مقتضى اللطف والجمال\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم رفع إيهام النقض باستغفار إبراهيم عليه السلام لأبيه الكافر، فقال: { وما كان استغفار إبراهيم لأبيه إلا عن موعدةٍ وعدها إياه } ، وقيل: إنه صلى الله عليه وسلم قال في شأن عمه:\n\n \" لأ ستغفرن لك، كما استغفر إبراهيم لأبيه \" \n\nفنزلت: { وما كان استغفار إبراهيم لأبيه }\n والموعدة التي وعدها إياه قوله:\n\n[الممتحنة: 4]\n أي: لأطلبن المغفرة لك بالتوفيق للإيمان، فإنه يجب ما قبله\n والمعنى: لا حجة لكم في استغفار إبراهيم لأبيه، فإن ذلك لم يكن إلا لوعد تقدم بقوله: { لأَستَغْفِرَنَّ لَكَ\n\n\n } الخ\n { فلما تبيّنَ له أنه عدوٌ لله } بأن مات على الكفر، أو أوحى إليه بأنه لن يؤمن، { تبرأ منه } بأن قطع استغفاره له، { وإن إبراهيم لأواهٌ } أي: لكثير التأوه، وهو كناية عن فرط ترحمه، أو كثير الدعاء، أو مؤمن، أو فقيه، أو كثير الذكر لله، أو كثير التأوه من خوف الله، { حليمٌ } صبور على الأذى، والجملة: لبيان ما حمله على الاستغفار\n الإشارة: الشفاعة لا تكون فيمن تحقق غضب الله عليه، فإن ذلك من سوء الأدب، كالدعاء بالمحال، وأما من لم يتحقق غضبه عليه فالشفاعة فيه مرغب فيها\n قال عليه الصلاة والسلام:\n\n \" اشفَعُوا تُؤجَروا \" \n\nوالاستغفار شفاعة\n وقد ورد في الخبر:\n\n \" مَن استغفر للمؤمنين والمؤمنات خمساً وعِشرين مرة كتب من الأبدال \"\n \n\nوالشفقة مطلوبة، ما لم يظهر مراد الله من خلقه، فإن برز من عنصر القدرة شيء من القهريات، فالتسليم لمراده تعالى أحسن، فالله ارحم بعباده منك أيها الشفيق، وسيأتي عند قوله تعالى:\n",
      "translations": []
    }
  ]
}