{
  "chapter": "التوبة",
  "text": "ولا ينفقون نفقة صغيرة ولا كبيرة ولا يقطعون واديا الا كتب لهم ليجزيهم الله احسن ما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "Nor will they give away any amount, whether large or small, nor will they cross any valley, without it being written down for them so that Allah can recompense them for the best of what they did.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not a sum, large or small, that they spend, not a piece of land that they traverse (in the service of God) which is not put down in their favour, so that God could reward them for what they had done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Likewise, each amount they spend, be it small or large, and each journey they undertake, shall be recorded in their favour so that Allah may bestow upon them reward for their good deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also, they would not have spent anything, great or small, for the cause of God or travel through a valley without God decreeing a reward for them far better than whatever they had done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever they spend, small or great, or any valley they cross – it is all recorded for them, so that Allah may reward them for their best deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither do they spend any contribution -- small or great -- nor cross a valley, but is written to their credit that Allah may recompense them with the best of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor do they spend anything that may be spent, small or great, nor do they traverse a valley, but it is written down to their credit, that Allah may reward them with the best of what they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor do they expend any sum, small or great, nor do they traverse any valley, but it is written to their account, that God may recompense them the best of what they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor spend they any spending, small or great, nor do they cross a valley, but it is recorded for them, that Allah may repay them the best of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and whenever they spend anything [for the sake of God], be it little or much, and whenever they traverse the land [in God's cause] -- it is recorded to their credit, and God will grant them the best reward for all that they have been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they expend not an expending, small or great, or transverse a vale, but it is written down unto them, so that Allah may recompense them with the best for that which they have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And neither do they incur any expense, big or small, nor do they cross any valley, but it is written to their account, so that Allah may reward them by the best of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor could they spend anything (for the cause) - small or great- nor cut across a valley, but the deed is inscribed to their credit: that Allah may requite their deed with the best (possible reward).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor do they spend anything (in Allah's Cause) - small or great - nor cross a valley, but is written to their credit, that Allah may recompense them with the best of what they used to do (i.e. Allah will reward their good deeds according to the reward of their best deeds which they did in the most perfect manner).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Each sum they spend, be it small or large, and each valley they cross is written to their account, so that Allah may recompense them for their best deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor do they spend any expenditure, small or large, nor do they cross any valley, but it is recorded to their credit. That God may reward them in accordance with the best of their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor do they spend an expenditure, small or large, or cross a valley but that it is registered for them that Allah may reward them for the best of what they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:121] Nor expend they, therein [in the way of God], any sum, small, even if it be a single date, or great, nor do they cross a valley, during a [campaign] march, but it is recorded for them, as a righteous deed, that God may reward them the best of what they used to do, that is, the [due] reward thereof.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nor spend they any spending, small or great) upon going or returning, (nor do they cross a valley) in pursuit of the enemy, (but it is recorded for them) as a reward of a good deed, (that Allah may repay them the best of what they used to do) in jihad.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ يُنفِقُونَ } هؤلاء المحسنون { نَفَقَةً صَغِيرَةً وَلاَ كَبِيرَةً } في سبيل الله؛ طلباً لمرضاته { وَلاَ يَقْطَعُونَ وَادِياً } تجاه العدو حين أمرهم الله ورسوله { إِلاَّ كُتِبَ لَهُمْ } في ديوان حسناتهم { لِيَجْزِيَهُمُ ٱللَّهُ } بها جزاء { أَحْسَنَ مَا كَانُواْ يَعْمَلُونَ } [التوبة: 121] أي: مثل جزاء أحسن أعمالهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "54:53",
      "similarity": 0.42988195385956585
    },
    {
      "verse": "9:29",
      "similarity": 0.3777112037356506
    },
    {
      "verse": "7:13",
      "similarity": 0.3695138343105879
    },
    {
      "verse": "27:37",
      "similarity": 0.36500255333085085
    },
    {
      "verse": "46:24",
      "similarity": 0.33696613316777557
    }
  ]
}