{
  "chapter": "التوبة",
  "text": "لقد جاءكم رسول من انفسكم عزيز عليه ما عنتم حريص عليكم بالمؤمنين رءوف رحيم",
  "translations": [
    {
      "translation": "A Messenger has come to you from among yourselves. Your suffering is distressing to him; he is deeply concerned for you; he is gentle and merciful to the muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To you has come an Apostle from among you. Any sorrow that befalls you weighs upon him; He is eager for your happiness, full of concern for the faithful, compassionate and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There has come to you a Messenger of Allah from among yourselves, who is distressed by the losses you sustain, who is ardently desirous of your welfare and is tender and merciful to those that believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Messenger from your own people has come to you. Your destruction and suffering is extremely grievous to him. He really cares about you and is very compassionate and merciful to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed there has come to you a Noble Messenger from among you – your falling into hardship aggrieves him, most concerned for your well being, for the Muslims most compassionate, most merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, there has come unto you a Messenger from among yourselves. It grieves him that you should receive any injury or difficulty. He is eager for you; for the believers [he is] full of pity, kind, and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly an Apostle has come to you from among yourselves; grievous to him is your falling into distress, excessively solicitous respecting you; to the believers (he is) compassionate,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now there has come to you a Messenger from among yourselves; grievous to him is your suffering; anxious is he over you, gentle to the believers, compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There hath come unto you a messenger, (one) of yourselves, unto whom aught that ye are overburdened is grievous, full of concern for you, for the believers full of pity, merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There has come to you a Messenger of your own. Your suffering distresses him: he is deeply concerned for your welfare and full of kindness and mercy towards the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly there hath come unto you an apostle from amongst yourselves: heavy upon him is that which harasseth you, solicitous for you, and with the believers tender and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There has certainly come to you an apostle from among yourselves. Grievous to him is your distress; he has deep concern for you, and is most kind and merciful to the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now hath come unto you a Messenger from amongst yourselves: it grieves him that ye should perish: ardently anxious is he over you: to the Believers is he most kind and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, there has come unto you a Messenger (Muhammad SAW) from amongst yourselves (i.e. whom you know well). It grieves him that you should receive any injury or difficulty. He (Muhammad SAW) is anxious over you (to be rightly guided, to repent to Allah, and beg Him to pardon and forgive your sins, in order that you may enter Paradise and be saved from the punishment of the Hell-fire), for the believers (he SAW is) full of pity, kind, and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, there has come to you a Messenger from your own, he grieves for your suffering, and is anxious about you, and is gentle, merciful to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There has come to you a messenger from among yourselves, concerned over your suffering, anxious over you. Towards the believers, he is compassionate and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There has certainly come to you a Messenger from among yourselves. Grievous to him is what you suffer; [he is] concerned over you and to the believers is kind and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:128] Verily there has come to you a messenger from among yourselves, that is, one of you — Muhammad (s) — for whom it is grievous, hard, that you should suffer, that is, your suffering, your experiencing hardship and encountering harm [is hard on him]; who is full of concern for you, that you should be rightly guided; to the believers full of pity, profoundly compassionate, merciful, desiring good for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nكانت هذه السورة سورة شدة وغلظة على المشركين وأهل الكتاب والمنافقين من أهل المدينة ومن الأعراب ، وأمْراً للمؤمنين بالجهاد ، وإنحاء على المقصرين في شأنه . وتخلل ذلك تنويه بالمتصفين بضد ذلك من المؤمنين الذين هاجروا والذين نصروا واتبعوا الرسول في ساعة العسْرة .فجاءت خاتمة هذه السورة آيتين بتذكيرهم بالمنة ببعثة محمد صلى الله عليه وسلم والتنويه بصفاته الجامعة للكمال . ومن أخصها حرصهُ على هداهم ، ورغبته في إيمانهم ودخولِهم في جامعة الإسلام ليكون رؤوفاً رحيماً بهم ليعلموا أن ما لقيه المعرضون عن الإسلام من الإغلاظ عليهم بالقول والفعل ما هو إلا استصلاح لحالهم . وهذا من مظاهر الرحمة التي جعلها الله تعالى مقارنة لبعثة رسوله صلى الله عليه وسلم بقوله : { وما أرسلناك إلا رحمة للعالمين } \\[ الأنبياء : 107 \\] ، بحيث جاء في هاتين الآيتين بما شأنه أن يزيل الحرج من قلوب الفرق التي نزلت فيهم آيات الشدة وعوملوا بالغلظة تعقيباً للشدة بالرفق وللغلظة بالرحمة ، وكذلك عادة القرآن . فقد انفتح بهاتين الآيتين باب حظيرة الإيمان والتوبة ليدخلها من وفقه الله إليها .فالجملة مستأنفة استئنافاً ابتدائياً . وفي وقوعها آخر السورة ما يكسبها معنى التذييل والخلاصة .فالخطاب بقوله : { جاءكم } وما تبعه من الخطاب موجه إلى جميع الأمة المدعوة للإسلام . والمقصود بالخطاب بادىء ذي بدء هم المعرضون من المشركين والمنافقين من العرب بقرينة قوله عقب الخطاب { بالمؤمنين رءوف رحيم } وسيجيء أن المقصود العرب .وافتتاحها بحرفَيْ التأكيد وهما اللام و ( قد ) مع كون مضمونها مما لا يتطرق إليه الإنكار لقصد الاهتمام بهذه الجملة لأهمية الغرض الذي سيقت لأجله وهو الذي سنذكره ، ولأن فيما تضمنته ما ينكره المنافقون وهو كونه رسولاً من الله ، ولأن في هذا التأكيد ما يجعل المخاطبين به منزَّلين منزلة المنكرين لمجيئه من حيث إنهم لم ينفعوا أنفسهم بهذا المجيء ، ولأن في هذا التأكيد تسجيلاً عليهم مراداً به الإيماء إلى اقتراب الرحيل ، لأنه لما أعيد الإخبار بمجيئه وهو حاصل منذ أعوام طويلة كان ذلك كناية عن اقتراب انتهائه ، وهو تسجيل منه على المؤمنين ، وإيداع للمنافقين ومن بقي من المشركين . على أن آيات أخرى خوطب بها أهل الكتاب ونحوهم فأكدت بأقل من هذا التأكيد كقوله تعالى : { يأهل الكتاب قد جاءكم رسولنا يبين لكم كثيراً مما كنتم تخفون من الكتاب ويعفوا عن كثير قد جاءكم من الله نور وكتاب مبين } \\[ المائدة : 15 \\] وكقوله تعالى : { يأيها الناس قد جاءكم برهان من ربكم وأنزلنا إليكم نوراً مبيناً } \\[ النساء : 174 \\] فما زيدت الجملة في هذه السورة مؤكدة إلا لغرض أهم من إزالة الإنكار .والمجيء : مستعمل مجازاً في الخطاب بالدعوة إلى الدين . شبه توجهه إليهم بالخطاب الذي لم يكونوا يترقبونه بمجيء الوافد إلى الناس من مكان آخر .وهو استعمال شائع في القرآن .والأنفس : جمع نفْس ، وهي الذات . ويضاف النفس إلى الضمير فيدل على قبيلة معاد الضمير ، أي هو معدود من ذوي نسبهم وليس عداده فيهم بحلف أو ولاء أو إلصاق . يقال : هو قريشي من أنفسهم ، ويقال : القريشي مولاهم أو حليفهم ، فمعنى { من أنفسكم } من صميم نسبكم ، فتعين أن الخطاب للعرب لأن النازل بينهم القرآن يومئذٍ لا يَعدون العربَ ومن حالفهم وتولاهم مثلَ سلمانَ الفارسي وبلاللٍ الحبشي ، وفيه امتنان على العرب وتنبيه على فضيلتهم ، وفيه أيضاً تعريض بتحريضهم على اتباعه وترك مناواته وأن الأجدر بهم الافتخار به والالتفاف حوله كما قال تعالى في ذكر القرآن { وإنه لذكر لك ولقومك } \\[ الزخرف : 44 \\] أي يبقى منه لكم ذكر حسن .والعزيز : الغالب . والعزة : الغلبة . يقال عزّه إذا غلبه . ومنه { وعزني في الخطاب } \\[ ص : 23 \\] ، فإذا عُدي بعلى دل على معنى الثقل والشدة على النفس . قال بشر بن عوانة في ذكر قتله الأسد ومصارعته إياه :فقلتُ له يعزُّ عليَّ أني ... قتلت مناسبي جلداً وقهراًو { ما } مصدرية . و { عنتم } : تعبتم . والعنت : التعب ، أي شاق عليه حزنكم وشقاؤكم . وهذا كقوله : { لعلّك باخِع نفسك أن لا يكونوا مؤمنين } \\[ الشعراء : 3 \\] وذكرُ هذا في صفة الرسول عليه السلام يفيد أن هذا خُلق له فيكون أثر ظهوره الرفق بالأمة والحذر مما يلقي بهم إلى العذاب في الدنيا والآخرة . ومن آثار ذلك شفاعته للناس كلهم في الموقف لتعجيل الحساب . ثم إن ذلك يومىء إلى أن شرعه جاء مناسباً لخُلقه فانتفى عنه الحرج والعسر قال تعالى : { يريد الله بكم اليسر ولا يريد بكم العسر } \\[ البقرة : 185 \\] وقال : { وما جعل عليكم في الدين من حرج } \\[ الحج : 78 \\].والعدول عن الإتيان بلفظ العنت الذي هو المصدر الصريح إلى الإتيان بالفعل مع ( ما ) المصدرية السابكة للمصدر نكتة . وهي إفادة أنه قد عز عليه عنتهم الحاصل في الزمن الذي مضى ، وذلك بما لقوه من قتْل قومهم ، ومن الأسر في الغزوات ، ومن قوارع الوعيد والتهديد في القرآن . فلو أتي بالمصدر لم يكن مشيراً إلى عنتتٍ معيَّن ولا إلى عنت وقع لأن المصدر لا زمَان له بل كان محتملاً أن يعز عليه بأن يجنبهم إياه ، ولكن مجيء المصدر منسبكاً من الفعل الماضي يجعله مصدراً مقيداً بالحصول في الماضي ، ألا ترى أنك تقدره هكذا : عزيز عليه عنتكم الحاصل في ما مضى لتكون هذه الآية تنبيهاً على أن ما لقوه من الشدة إنما هو لاستصلاح حالهم لعلهم يخفضون بعدها من غلوائهم ويرعوون عن غيهم ويشعرون بصلاح أمرهم .والحرص : شدة الرغبة في الشيء والجشعُ إليه . ولما تعدى إلى ضمير المخاطبين الدال على الذوات وليست الذوات هي متعلق الحرص هنا تعين تقدير مضاف فُهم من مقام التشريع ، فيقدر : على إيمانكم أو هَدْيكم .والرؤوف : الشديد الرأفة . والرحيم : الشديد الرحمة ، لأنهما صيغتا مبالغة ، وهما يتنازعان المجرور المتعلق بهما وهو { بالمؤمنين }.والرأفة : رقة تنشأ عند حدوث ضر بالمرءُوف به . يقال : رؤوف رحيم . والرحمة : رقة تقتضي الإحسان للمرحوم ، بينهما عموم وخصوص مطلق ، ولذلك جمع بينهما هنا ولوازمُهما مختلفة . وتقدمت الرأفة عند قوله تعالى : { وما كان الله ليضيع إيمانكم إن الله بالناس لرءوف رحيم } في سورة البقرة ( 143 ) والرحمة في سورة الفاتحة ( 3 ).وتقديم المتعلِّق على عامليه المتنازِعَيْنه في قوله : بالمؤمنين رءوف رحيم } للاهتمام بالمؤمنين في توجه صفتيْ رأفته ورحمته بهم . وأما رحمته العامة الثابتة بقوله تعالى : { وما أرسلناك إلا رحمة للعالمين } \\[ الأنبياء : 107 \\] فهي رحمة مشوبة بشدة على غير المؤمنين فهو بالنسبة لغير المؤمنين رائف وراحم ، ولا يقال : بهم رؤوف رحيم .\n\n",
      "translations": [
        {
          "translation": "(There hath come unto you) people of Mecca (a messenger, (one) of yourselves) an Arab and Hashimite like yourselves, (and it grieves him) it is hard on him (unto whom aught) of sins (that ye are overburdened is grievous, full of concern for you) for your faith, (for the believers) for all the believers he is (full of pity, merciful).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { عَزِيزٌ عَلَيْهِ مَا عَنِتُّمْ } معناهُ شَديدٌ عَليهِ ما شَقَّ عَليكُم\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Exalted is He over whatever offends you} [means that] He is severe against whatever angers you.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ رسولٌ من أنفسكم } ليكون بينكم وبينه جنسية نفسانية بها تقع الأُلفة بينكم وبينه فتخالطونه بتلك الجنسية وتختلطون به فتتأثر من نورانيتها المستفادة من نور قلبه أنفسكم فتتنوّر بها وتنسلخ عنها ظلمة الجبلة والعادة { عزيزٌ عليه } شديد شاق عليه\n عنتكم مشقتكم ولقاؤكم المكروه لرأفته اللازمة للمحبة الإلهية التي له لعباده ورؤيته إياهم بمثابة أعضائه وجوارحه لكونه ناظراً بنظر الوحدة\n فكما يشق على أحدنا تألم بعض أعضائه\n يشق عليه تعذيب بعض أمته { حريص عليكم } لشدة اهتمامه بحفظكم كما يشتدّ اهتمام أحدنا بكل واحد من أجزاء جسده وجوارحه لا يرضى بنقص أقلّ جزء منه ولا بشقائه فكذلك هو\n بل أشدّ اهتماماً لدقة نظره { بالمؤمنين رؤوف } ينجيهم من العقاب بالتحذير عن الذنوب والمعاصي برأفته { رحيم } يفيض عليهم العلوم والمعارف والكمالات المقرّبة بالتعليم والترغيب عليها برحمته\n { فإن تولّوا } وأعرضوا عن قبول الرأفة والرحمة لعدم الاستعداد أو زواله وتعرّضوا للشقاوة الأبدية { فقل حسبي الله } لا حاجة لي بكم ولا باستعانتكم كما لا حاجة للإنسان إلى العضو المألوم المتعفن الذي يجب قطعه عقلاً",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nلذلك { لَقَدْ جَآءَكُمْ } أيها الأعراب { رَسُولٌ } بالمعجزات الظاهرة والآيات الباهرة\n منتشئ { مِّنْ أَنفُسِكُمْ } وجنسكم\n ومن غاية شفقته ومرحمته لكم { عَزِيزٌ } شاق شديد { عَلَيْهِ } صلى الله عليه وسلم { مَا عَنِتُّمْ } أي: عنتكم ولقاءكم المكروه\n إذ هي من أمارات الكفر والشرك\n وعدم الإطاعة والانقياد بأوامر الله ونواهيه\n مع أنه { حَرِيصٌ عَلَيْكُمْ } أي: على إيمانكم وإسلامكم وإصلاح حالكم\n إذ هو { بِٱلْمُؤْمِنِينَ } الموقنين\n الموحدين\n المخلصين { رَءُوفٌ } عطوف\n مشفق { رَّحِيمٌ } [التوبة: 128] يرحمهم ويرضى عنهم\n لخروجهم عن ظلمة الكفر بنور الإيمان\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" عزيز \": صفة \" الرسول \" \n و \" عنتم \": فاعله\n و \" ما \": مصدرية\n أي: عزيز عليه عَنَتُكُم\n أو عزيز: خبر مقدم\n و \" ما عنتم \" مبتدأ\n والعنت: المشقة والتعب\n يقول الحق جل جلاله: مخاطباً العرب\n أو قريش\n أو جميع بني آدم: { لقد جاءكم رسولٌ من أنفسِكم } محمدٌ صلى الله عليه وسلم\n أي: من قبيلتكم\n بحيث تعرفون حسبه وصدقه وأمانته\n وتفهمون خطابه\n أو من جنسكم من البشر\n وقرأ ابن نشيط: بفتح الفاء\n أي: من اشرافكم\n قال صلى الله عليه وسلم:\n \" إِنَّ اللَّهَ اصْطَفَى كِنَانَةًَ مِنْ وَلَدِ إِسْمَاعِيلَ\n واصْطَفَى قُرَيْشاً مَنْ كِنَانَةَ\n واصْطَفَى بَنِي هَاشِم مِنْ قُريْشٍ\n واصْطَفَانِي مِنْ بَنِي هَاشِم\n فأنا مُصْطَََفى من مُصْطَفَيْن \" \n{ عزيزٌ عليه } \n أي: شديد شاق عليه { ما عَنِتُّمْ } أي: عنتكم ومشقتكم ولقاؤكم المكروه في دينكم ودنياكم\n { حريصٌ عليكم } أي: على إيمانكم وسعادتكم وصلاح شأنكم\n { بالمؤمنين } منكم ومن غيركم { رؤوف رحيم } أي: شفيق بهم\n قدَّم الأبلغ منهما لأن الرأفة شدة الرحمة للفاصلة\n وسمى رسوله هنا باسمين من أسمائه تعالى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:103",
      "similarity": 0.5608137542092385
    },
    {
      "verse": "16:37",
      "similarity": 0.556129501555539
    },
    {
      "verse": "49:7",
      "similarity": 0.44331529897251337
    },
    {
      "verse": "2:220",
      "similarity": 0.4139314056292197
    },
    {
      "verse": "4:129",
      "similarity": 0.3025921675808354
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009128.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009128.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:128.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}