{
  "chapter": "التوبة",
  "text": "وان نكثوا۟ ايمنهم منۢ بعد عهدهم وطعنوا۟ فى دينكم فقتلوا۟ ائمة الكفر انهم لا ايمن لهم لعلهم ينتهون",
  "translations": [
    {
      "translation": "If they break their oaths after making their treaty and defame your deen, then fight the leaders of kufr - their oaths mean nothing - so that hopefully they will stop.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they break their pledge after giving their word and revile your faith, fight these specimens of faithlessness, for surely their oaths have no sanctity: They may haply desist.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they break their pledges after making them and attack your faith, make war on the leaders of unbelief that they may desist, for they have no regard for their pledged words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight against the leaders of the unbelievers if they violate their established peace treaty with you and revile your faith, to force them to stop their aggression against you. You do not have to bind yourselves to such a treaty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they break their promises after making a treaty and malign your religion, then fight the leaders of disbelief – indeed their promises are nothing – in the hope that they may desist.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they violate their oaths after their covenant, and attack your religion with disapproval and criticism, then fight (you) against the leaders of disbelief -- for surely, their oaths are nothing to them -- so that they may stop (evil actions).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they break their oaths after their agreement and (openly) revile your religion, then fight the leaders of unbelief-- surely their oaths are nothing-- so that they may desist.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they break their oaths after their covenant and thrust at your religion, then fight the leaders of unbelief; they have no sacred oaths; haply they will give over.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they break their pledges after their treaty (hath been made with you) and assail your religion, then fight the heads of disbelief - Lo! they have no binding oaths - in order that they may desist.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they break faith after pledging it and revile your religion, then fight these leaders of unbelief, so that they may desist, for they have no regard for their pledged word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they violate their oaths after their covenant and revile your religion, fight those leaders of infidelity-verily no oaths will hold in their case that haply they may desist.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they break their pledges after their having made a treaty and revile your religion, then fight the leaders of unfaith—indeed, they have no [commitment to] pledges,—maybe they will desist.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they violate their oaths after their covenant, and taunt you for your Faith,- fight ye the chiefs of Unfaith: for their oaths are nothing to them: that thus they may be restrained.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they violate their oaths after their covenant, and attack your religion with disapproval and criticism then fight (you) the leaders of disbelief (chiefs of Quraish - pagans of Makkah) - for surely their oaths are nothing to them - so that they may stop (evil actions).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if, after coming to terms with you, they break their oaths and revile your belief, fight the leaders of the disbelief for they have no oaths in order that they will desist.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they violate their oaths after their pledge, and attack your religion, then fight the leaders of disbelief—they have no faith—so that they may desist.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they break their oaths after their treaty and defame your religion, then fight the leaders of disbelief, for indeed, there are no oaths [sacred] to them; [fight them that] they might cease.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:12] But if they break, [if] they violate, their oaths, their covenants, after [making] their pact and assail your religion, slander it, then fight the leaders of unbelief, its heads (here an overt noun [‘the leaders of unbelief’] has replaced the [third person] pronominalisation) — verily they have no [binding] oaths, [no] pacts (a variant reading [for aymān, ‘oaths’] has the kasra inflection [for the alif, sc. īmān, ‘[no] faith’]) — so that they might desist, from unbelief.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if they) the people of Mecca (break their pledges) which are between you and them (after their treaty (has been made with you) and assail your religion) and defame the Religion of Islam, (then fight the heads 194 of disbelief) fight the leaders of disbelief: Abu Sufyan and his host. (Lo! they have no binding oaths in order that they may desist) from breaking their pledges.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَقَاتِلُوۤاْ أَئِمَّةَ ٱلْكُفْرِ } معناهُ عِظَماؤهُم\n منهم: عُتبة بن ربيعة، وأبو سُفيان بن حَرب، وأبو جَهل بن هشام وأمية بن خلف، وسُهيل بن عمر\n\n\n\n\nوقوله تعالى: { إِنَّهُمْ لاَ أَيْمَانَ لَهُمْ } معناهُ لاَ عَهدَ لَهُم\n\n",
      "translations": [
        {
          "translation": " {So fight the leaders of disbelief} means their great number.\n\n\n{Among them were} 'Utbah ibn Rabee'ah, Abu Sufyan ibn Harb, Abu Jahl ibn Hisham, and 'Umayyah ibn Khalaf, and Suhayl ibn 'Umar.\n And His saying, {Indeed, they have no faith in it} [means that] they have no covenant with Him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِن نَّكَثُوۤاْ } ونقضوا { أَيْمَانَهُم } ونبذوا عهودهم { مِّن بَعْدِ عَهْدِهِمْ } وراء ظهورهم { وَ } مع ذلك { طَعَنُواْ فِي دِينِكُمْ } بتصريح التكذيب والتقبيح في الأحكامن والمعتقدات، والطاعات والعبادات { فَقَاتِلُوۤاْ } أيها الغزاة المرابطون قلوبكم مع الله ورسوله { أَئِمَّةَ ٱلْكُفْرِ } أي: صناديدهم ورؤساءهم؛ لأنهم ضالون مضلون، وإن تفوهوا بالعهد والميثاق لا تبالوا بهم وبعهودهم { إِنَّهُمْ لاَ أَيْمَانَ لَهُمْ } أصلاً؛ لتخمير طينتهم على الشرك والشقاق { لَعَلَّهُمْ يَنتَهُونَ } [التوبة: 12] وينتبهون؛ أي: سفلتهم الضالون عمَّا عليه رؤساؤهم المضلون بعد انقراضهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وإن نكثُوا أَيمانَهم } أي: نقضوها { من بعدِ عهدهم } أي: من بعد ما أعطوكم من العهود على الوفاء بها، { وطعنوا في دينكم } بصريح التكذيب وتقبيح الأحكام، { فقاتِلُوا أئمّةَ الكفر } أي: فقاتلوهم لأنهم أئمة الكفر، فوضع أئمة الكفر موضع الضمير للدلالة على أنهم صاروا بذلك ذوي الرئاسة والتقدم في الكفر، فهم أحِقاء بالقتل، وقيل: المراد رؤساء المشركين، والتخصيص: إما لأن قتلهم أهم وهم أحق به، أو للمنع من مراقبتهم، { إنهم لا أَيمان لهم } على الحقيقة، وإلاًَّ لم يقدروا أن ينكثوها، واستشهد به الحنفية على أن يمين الكافر لا تلزم، وهو ضعيف لأن المراد، نفي الوثوق عليها، لا أنها ليست بأيمان\n قاله البيضاوي\n قلت: وما قالته الحَنَفِيِّةُ هو مذهب المالكية، إذا حنث في حال الكفر، ثم أسلم، فلا يلزمه شيء\n وقرأ ابن عامر بكسر الهمزة، أي: لا أيمان لهم صحيحاً يعصم دماءهم\n { لعلهم ينتهون } أي: ليكن غرضكم في مقاتلتهم أن ينتهوا عما هم عليه، كما هي طريقة أهل الإخلاص لا إيصال الإذاية لهم، أو مقابلة عداوة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:46",
      "similarity": 0.5077575233025574
    },
    {
      "verse": "48:10",
      "similarity": 0.34160878097420605
    },
    {
      "verse": "43:50",
      "similarity": 0.3321768973394047
    },
    {
      "verse": "9:13",
      "similarity": 0.30851681759075233
    },
    {
      "verse": "7:135",
      "similarity": 0.2905955372967497
    }
  ]
}