{
  "chapter": "التوبة",
  "text": "واذا ما انزلت سورة نظر بعضهم الى بعض هل يرىكم من احد ثم انصرفوا۟ صرف الله قلوبهم بانهم قوم لا يفقهون",
  "translations": [
    {
      "translation": "Each time a sura is sent down, they look at one another, implying, 'Can anyone see you?' Then they turn away. Allah has turned their hearts away because they are people who do not understand.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever a Surah is revealed they look at each other (so as to ask): \"Is anyone looking at Us?\" and then turn away. Indeed God has turned their hearts away (from the truth), for they cannot discern the law of heaven.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever a surah is revealed, they glance at each other as though saying: \"Is anyone watching?\" Then they slip away. Allah has turned away their hearts for they are a people who are bereft of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a chapter (of the Quran) is revealed, (it upsets them). They look at one another and their eyes silently ask this question, \"Has any one noticed the disappointment on our faces?\" Then they walk away. In fact, God has turned their hearts away (from the truth); they are a people who have no understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever a chapter is sent down, one of them looks at the other; “Is there someone watching you?” – and then they turn away; Allah has inverted their hearts because they are a people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever there comes down a Surah, they look at one another (saying): \"Does any one see you\" Then they turn away. Allah has turned their hearts because they are a people that understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever a chapter is revealed, they cast glances at one another: Does any one see you? Then they turn away: Allah has turned away their hearts because they are a people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever a sura is sent down, they look one at another: 'Does anyone see you?' Then they turn away. God has turned away their hearts, for that they are a people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever a surah is revealed, they look one at another (as who should say): Doth anybody see you? Then they turn away. Allah turneth away their hearts because they are a folk who understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever a chapter is revealed, they glance at each other, asking, \"Is anyone watching?\" Then they turn away. God has turned their hearts away, because they are people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever a Surah is sent down they look on at each other as though saying: observeth you anyone? Thereafter they turn to go; Allah hath turned their hearts, for verily they are people who understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever a surah is sent down they look at one another: ‘Is anybody observing you?’ Then they slip away. Allah has turned aside their hearts, for they are a people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever there cometh down a Sura, they look at each other, (saying), \"Doth anyone see you?\" Then they turn aside: Allah hath turned their hearts (from the light); for they are a people that understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever there comes down a Surah (chapter from the Quran), they look at one another (saying): \"Does any one see you?\" Then they turn away. Allah has turned their hearts (from the light) because they are a people that understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever a chapter is sent down, they glance at each other, (asking): 'Does anyone see you' Then they turn away. Allah has turned away their hearts, for they are a nation who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever a chapter is revealed, they look at one another, “Does anyone see you?” Then they slip away. God has diverted their hearts, because they are a people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever a surah is revealed, they look at each other, [saying], \"Does anyone see you?\" and then they dismiss themselves. Allah has dismissed their hearts because they are a people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:127] And whenever a sūra is revealed, wherein is mention of them, and the Prophet (s) recites it, they look at one another, desiring to flee, and saying: ‘Will anyone see you?’, if you get up [and flee]?, and so if no one can see them they get up [and leave], otherwise they stay put. Then they turn away, persisting in their disbelief. God turns their hearts away, from guidance, because they are a folk who do not understand, the truth, for they do not reflect [on it].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And whenever a surah is revealed) whenever Gabriel brings down a surah exposing the fault of the hypocrites and the Prophet (pbuh) used to recite to them, (they) the hypocrites (look one at another (as who should say): Doth anybody) among the sincere believers (see you? Then they turn away) from the prayer, the sermon, the Truth and guidance. (Allah turns away their hearts) from the Truth and guidance; it is also said: they swerved from the Truth and guidance, and so Allah swerved their hearts from the Truth and guidance (because they are a folk who understand not) nor believe in the command of Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة إصرارهم وعنادهم: إنهم { إِذَا مَآ أُنزِلَتْ سُورَةٌ } مفضحة لهم، مفصحة بما عليهم من النفاق والشقاق، ونقض العهود والميثاق { نَّظَرَ بَعْضُهُمْ إِلَىٰ بَعْضٍ } يتغامزون بعيونهم، ويقولون استهزاءً وتهكماً: { هَلْ يَرَاكُمْ مِّنْ أَحَدٍ } من هؤلاء المؤمنين { ثُمَّ ٱنصَرَفُواْ } من عنده مريدين النفاق الشقاق بأضعاف ما كنوا عليه؛ بسبب تفضيحهم بهذه السورة، لذلك { صَرَفَ ٱللَّهُ } الهادي لعباده { قُلُوبَهُم } عن الإيمان وجادة التوحيد { بِأَنَّهُمْ } أي: بسبب أنهم { قَوْمٌ لاَّ يَفْقَهُونَ } [التوبة: 127] أي: لا يفهمون لذة الإيمان، ولا يتخلقون على نشأة التوحيد والعرفان، مثل الموحدين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { وإذا ما أُنزلت سورةٌ نظر بعضُهم إلى بعضٍٍ } ، يريدون الهرب، يقولون: { هل يراكم من أحدٍ } إذا قمتم، فإن لم يرهم أحد قاموا وانصرفوا\n قال البيضاوي: تغامزوا بالعيوب، إنكاراً لها وسخرية، أو غيظاً لما فيها من عيوبهم\n هـ\n قال ابن عطية: المعنى: إذا ما أُنزلت سورة فيها فضيحتهم، نظر بعضهم إلى بعض على جهة التقرير، يُفْهم من تلك النظرة: التقرير: هل معكم من ينقل عنكم؟ هل يراكم من أحد حين تدبرون أمركم؟ وقوله: { ثم انصَرَفُوا } أي: عن طريق الاهتداء، وذلك أنهم حينما بيَّن لهم كشف أسرارهم، يقع لهم ـ لا محالة ـ تعجب وتوقف ونظر، فلو اهتدوا لكان ذلك الوقت مظنة لهم، فهم إذ يصممون على الكفر، ويرتكبون فيه، كأنهم انصرفوا عن تلك الحال، التي كانت مظنة النظر والاهتداء\n هـ\n  والتحقيق: أن معنى { انصرفوا }: قاموا عن مجلس النبي صلى الله عليه وسلم مخافة الفضيحة\n { صَرَفَ اللهُ قلوبَهم } عن الإيمان دعاء عليهم، أو إخبار، فيستوجبون ذلك { بأنهم } بسبب أنهم { قوم لا يفقهون } لا يفهمون عن الله ولا عن رسوله ـ عليه الصلاة والسلام ـ، أو لا يفقهون سوء فهمهم أو عدم تدبرهم\n الإشارة: زيادة الإيمان عند سماع القرآن يكون على حسب التصفية والتطهير من الأغيار، فبقدر ما يصفوا القلب من الأغيار يكشف له عن أسرار القرآن\n قال بعضهم: كنت أقرأ القرآن فلا أجد له حلاوة، فجاهدت نفسي وطهرتها، فصرت كأني أسمعه من النبي صلى الله عليه وسلم، يتلوه على أصحابه، ثم رفعت إلى مقام فوقه، فكنت أتلوه كأني أسمعه من جبريل يلقيه على رسول الله صلى الله عليه وسلم، ثمَّ منَّ عليّ اللهُ بمنزلة أخرى، فأنا الآن أسمعه من المتكلم به، فعندما وجدت له نعيماً لا أصبر عليه\n\n\nهـ\n بلفظه\n مثل هذا يزيده القرآن إيقاناً، ويستبشر قلبه عند سماعه، وأما من كان مريض القلب بحب الدنيا، مَغْمُوراً بالشكوى والأوهام والخواطر فلا يزيده القرآن إلا بُعداً حيث لم يتدبر فيه، ولم يعمل بمقتضاه، وإذا حضر مثلُ هذا الغافل مجلسَ وعظ أو تذكير أو ذكر لم يطق الجلوس، بل نظر: هل يراه من أحد؟ ثم انصرف، صرف الله قلبه عن حضرة قدسه لعدم فهمه عن ربه\n والله تعالى أعلم\n ثم ختم السورة بذكر محاسن نبيه ـ عليه الصلاة والسلام ـ لما ظهر عليه في هذه السورة من الرحمة والرأفة بالمؤمنين، ومن العفو والصفح عن المعتذرين، فقال: { لَقَدْ جَآءَكُمْ رَسُولٌ مِّنْ أَنفُسِكُمْ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:124",
      "similarity": 0.41065778077929116
    },
    {
      "verse": "47:20",
      "similarity": 0.4093377834713278
    },
    {
      "verse": "2:23",
      "similarity": 0.382769011736624
    },
    {
      "verse": "9:64",
      "similarity": 0.3739308111654511
    },
    {
      "verse": "20:28",
      "similarity": 0.372863415754599
    }
  ]
}