{
  "chapter": "التوبة",
  "text": "يايها الذين ءامنوا۟ قتلوا۟ الذين يلونكم من الكفار وليجدوا۟ فيكم غلظة واعلموا۟ ان الله مع المتقين",
  "translations": [
    {
      "translation": "You who have iman! fight those of the kuffar who are near to you and let them find you implacable. Know that Allah is with those who have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, fight the unbelievers around you, and let them realise that you are firm: Remember, God is with those who are pious and obedient to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Fight against the unbelievers who live around you; and let them find in you sternness. Know that Allah is with the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, fight the unbelievers near you for the cause of God so that they realize your strength and know that God is with the pious ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe – fight the disbelievers who are near to you, and let them find severity in you, and know well that Allah is with the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Fight those of the disbelievers who are close to you, and let them find harshness in you; and know that Allah is with those who have Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! fight those of the unbelievers who are near to you and let them find in you hardness; and know that Allah is with those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, fight the unbelievers who are near to you; and let them find in you a harshness; and know that God is with the godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Fight those of the disbelievers who are near to you, and let them find harshness in you, and know that Allah is with those who keep their duty (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Fight against those deniers of the truth who are near you.  Deal firmly with them. Know that God is with those who fear Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! fight the infidels who are near unto you, and surely let them find in you sternness, and know that Allah is with the God-fearing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Fight the faithless who are in your vicinity, and let them find severity in you, and know that Allah is with the Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! fight the unbelievers who gird you about, and let them find firmness in you: and know that Allah is with those who fear Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Fight those of the disbelievers who are close to you, and let them find harshness in you, and know that Allah is with those who are the Al-Muttaqun (the pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, fight the unbelievers who are near you. Let them find firmness in you. Know that Allah is with those who are cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Fight those of the disbelievers who attack you, and let them find severity in you, and know that God is with the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, fight those adjacent to you of the disbelievers and let them find in you harshness. And know that Allah is with the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:123] O you who believe, fight those of the disbelievers who are near to you, that is, the nearest, followed by the next nearest of them, and let them find harshness in you, that is, severity, in other words, be harsh with them, and know that God is with the pious, helping and granting [them] victory.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nكان جميع بلاد العرب خلَص للإسلام قبل حجة الوداع ، فكانت تخوم بلاد الإسلام مجاورة لبلاد الشام مقرّ نصارى العرب ، وكانوا تحت حكم الروم ، فكانت غزوة تبوك أول غزوة للإسلام تجاوزت بلاد العرب إلى مشارف الشام ولم يكن فيها قتال ولكن وُضعت الجزية على أيْلَةَ وبُصرى ، وكانت تلك الغزوة إرهاباً للنصارى ، ونزلت سورة براءة عقبها فكانت هذه الآية كالوصية بالاستمرار على غزو بلاد الكفر المجاورة لبلاد الإسلام بحيث كلَّما استقر بلد للإسلام وكان تُجاوره بلاد كفر كان حقاً على المسلمين غزو البلاد المجاورة . ولذلك ابتدأ الخلفاء بفتح الشام ثم العراق ثم فارس ثم انثنوا إلى مصر ثم إلى إفريقية ثم الأندلس .فالجملةُ مستأنفة استئنافاً ابتدائياً تكملة للأمر بما يتعين على المسلمين في ذيول غزوة تبوك .وفي توجيه الخطاب للذين آمنوا دون النبي إيماء إلى أن النبي عليه الصلاة والسلام لا يغزو بعد ذلك وأن أجله الشريف قد اقترب . ولعل في قوله : { واعلموا أن الله مع المتقين } إيماء إلى التسلية على فقد نبيهم عليه الصلاة والسلام وأن الله معهم كقوله في الآية الأخرى { وسيجْزي الله الشاكرين } \\[ آل عمران : 144 \\].والغلظة بكسر الغين : الشدة الحسية والخشونة ، وهي مستعارة هنا للمعاملة الضارة ، كقوله : { واغلظ عليهم } \\[ التوبة : 73 \\]. قال في «الكشاف» : وذلك يجمع الجرأة والصبر على القتال والعنف في القتل والأسر . اه .قلت : والمقصد من ذلك إلقاءُ الرعب في قلوب الأعداء حتى يخشوا عاقبة التصدي لقتال المسلمين .ومعنى أمر المسلمين بحصول ما يجده الكافرون من غلظة المؤمنين عليهم هو أمر المؤمنين بأن يكونوا أشداء في قتالهم . وهذه مبالغة في الأمر بالشدة لأنه أمر لهم بأن يجد الكفار فيهم الشدة . وذلك الوجدان لا يتحقق إلا إذا كانت الغلظة بحيث تظهر وتَنال العدو فيحِس بها ، كقوله تعالى لموسى : { فلا يَصدَّنَّك عنها من لا يؤمن بها } \\[ طه : 16 \\]. وإنما وقعت هذه المبالغة لِما عليه العدو من القوة ، فإن المقصود من الكفار هنا هم نصارى العرب وأنصارهم الروم ، وهم أصحاب عَدد وعُدد فلا يجدون الشدة من المؤمنين إلا إذا كانت شدة عظيمة .ومن وراء صريح هذا الكلام تعريض بالتهديد للمنافقين ، إذ قد ظُهر على كفرهم وهم أشد قرباً من المؤمنين في المدينة . وفي هذا السياق جاء قوله تعالى : { يأيها النبيءُ جاهد الكفار والمنافقين واغلُظ عليهم } \\[ التوبة : 73 \\].وجملة : { واعلموا أن الله مع المتقين } تأييد وتشجيع ووعد بالنصر إن اتقوا بامتثال الأمر بالجهاد .وافتتحت الجملة ب { اعلموا } للاهتمام بما يراد العلم به كما تقدم في قوله تعالى : { واعلموا أنما غنمتم من شيء } في سورة الأنفال ( 41 ). والمعية هنا معية النصر والتأييد ، كقوله تعالى : { إذ يقول لصاحبه لا تحزن إن الله معنا } \\[ التوبة : 40 \\]. وهذا تأييد لهم إذ قد علموا قوة الروم .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe!) in Muhammad (pbuh) and in the Qur'an (Fight those of the disbelievers who are near to you) the Banu Qurayzah, Banu'l-Nadir, Fadak and Khaybar, (and let them find harshness in you) toughness from you, (and know) believers (that Allah is with those who keep their duty (unto Him)) Allah helps the believers: Muhammad (pbuh) and his Companions, by making them victorious over their enemies.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن معظم شعائر الإسلام: القتال { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ قَاتِلُواْ ٱلَّذِينَ يَلُونَكُمْ } ويقرب منكم في حواليكم وحواشيكم { مِّنَ ٱلْكُفَّارِ } وليضيقوا ويشددوا عليهم { وَلْيَجِدُواْ } ويشاهدوا { فِيكُمْ غِلْظَةً } تشدداً وتصبراً على القتال\n وجرأةً وتهوراً عليها فيخافوا منكم\n فيتركوا عنادهم\n ولا تبالوا بكثرة عددهم وعددهم\n واجترئوا عليهم { وَٱعْلَمُوۤاْ أَنَّ ٱللَّهَ } القادر المقتدر بالقدرة التامة الكاملة { مَعَ ٱلْمُتَّقِينَ } [التوبة: 123] الذين يحفظون حدود ما أنزل الله عليهم فتوكلوا عليه\n وامتثلوا بمأموره إن كنتم موقنين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { يا أيها الذين آمنوا قاتلوا الذين يلونكم من الكفار } ، أي: جاهدوا الأقرب فالأقرب بالتدريج، كما أمر رسوله صلى الله عليه وسلم بإنذار عشيرته الأقربين، فإن الأقرب أحق بالشفقة والاستصلاح. وقيل: هم يهود حوالي المدينة، كقريظة والنضير وخيبر، وقيل: الروم بالشام وهو قريب من المدينة، وكانت أرض العرب قد عمها الإسلام، وكانت العراق حينئذٍ بعيدة. { وليجدوا فيكم غِلْظَةً } شدة وصبراً على قتالهم، { واعلموا أن الله مع المتقين } بالإعانة والنصر والحراسة. الإشارة: ينبغي لأهل الوعظ والتذكير أن يبدأوا بالأقرب فالأقرب على التدريج قال الرفاعي رضي الله عنه: إذا أراد الله أن يرقي عبداً إلى مقامات الرجال كلفه بأمر نفسه أولاً، فإذا أدب نفسه واستقامت معه، كلفه بأهله فإن أحسن إليهم وساسهم، كلفه بأهل بلده، فإن أحسن إليهم وساسهم، كلفه جهةً من البلاد، فإن هو نصحهم، وساسهم، وأصلح سريرته مع الله، كلفه رتبة ما بين السماء والأرض، فإن لله خلقاً لا يعلمهم إلا الله، ثم لا يزال يرتفع من سماء حتى يرتفع ويصل إلى محل القطب الغوث، وهناك يطلعه الله على بعض غيبه. انتهى. والغلطة التي تكون في المذكر، إذا رأى منكراً، أو ذُكرَ له وأراد النهي عنه. وأما في الترغيب والإرشاد فينبغي أن يُغلب جانب اللطافة واللين. والله تعالى أعلم. ثم ذكر حال المنافقين عند نزول الوحي، لأن السورة جُلها في فضيحتهم، فقال: { وَإِذَا مَآ أُنزِلَتْ سُورَةٌ فَمِنْهُمْ مَّن يَقُولُ أَيُّكُمْ زَادَتْهُ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:58",
      "similarity": 0.6098883528067552
    },
    {
      "verse": "31:24",
      "similarity": 0.6036466915365345
    },
    {
      "verse": "9:73",
      "similarity": 0.49366482023370545
    },
    {
      "verse": "66:9",
      "similarity": 0.49366482023370545
    },
    {
      "verse": "41:50",
      "similarity": 0.471578199512425
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009123.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009123.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:123.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}