{
  "chapter": "التوبة",
  "text": "واذا ما انزلت سورة فمنهم من يقول ايكم زادته هذه ايمنا فاما الذين ءامنوا۟ فزادتهم ايمنا وهم يستبشرون",
  "translations": [
    {
      "translation": "When a Surah is revealed some of them remark: \"Whose faith among you has it increased?\" It does increase the faith of those who believe, and they rejoice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever a new surah is revealed some of the hypocrites ask the believers (in jest): \"Whose faith has increased because of this?\" As for those who believe, it will certainly increase their faith, and they are joyful over that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a chapter (of the Quran) is revealed, some people ask others, \"Whose faith among you people has received strength from this (revelation)?\" It (the revelation) certainly strengthens the faith of the believers and they consider it to be a glad news.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever a chapter is sent down, some of them say, “Whose faith among you has this promoted?” So it has promoted the faith of the believers and they are rejoicing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever there comes down a Surah, some of them (hypocrites) say: \"Which of you has had his faith increased by it\" As for those who believe, it has increased their faith, and they rejoice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever a chapter is revealed, there are some of them who say: Which of you has it strengthened in faith? Then as for those who believe, it strengthens them in faith and they rejoice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever a sura is sent down to thee, some of them say, 'Which of you has this increased in belief?' As for the believers, them it has increased in belief, and they are joyful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever a surah is revealed there are some of them who say: Which one of you hath thus increased in faith? As for those who believe, it hath increased them in faith and they rejoice (therefor).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever a chapter is sent down, there are some of them who say, \"Which of you has had his faith increased by it?\" But, as for those who believe, it increases their faith and they rejoice,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever a Surah s sent down, there are some of them who say which of You hath this increased in faith! As for those who believe, it hath increased them in faith, and they rejoice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever a surah is sent down, there are some of them who say, ‘Which of you did it increase in faith?’ As for those who have faith, it increases them in faith, and they rejoice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever there cometh down a sura, some of them say: \"Which of you has had His faith increased by it?\" Yea, those who believe,- their faith is increased and they do rejoice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever there comes down a Surah (chapter from the Quran), some of them (hypocrites) say: \"Which of you has had his Faith increased by it?\" As for those who believe, it has increased their Faith, and they rejoice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever a chapter is sent down to you, some ask: 'Which of you has it increased in belief' It will surely increase the belief of the believers and they are joyful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever a chapter is revealed, some of them say, “Which of you has this increased in faith?” As for those who believe: it increases them in faith, and they rejoice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever a surah is revealed, there are among the hypocrites those who say, \"Which of you has this increased faith?\" As for those who believed, it has increased them in faith, while they are rejoicing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:124] And whenever a sūra, of the Qur’ān, is revealed, there are some of them, that is, the hypocrites, who say, to their companions, mockingly: ‘Which of you has this increased in faith?’, and God says: As for those who believe, it has increased them in faith, because they accept that it is true, and they rejoice, because of it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And whenever a surah is revealed) whenever a verse is revealed and Muhammad (pbuh) recites it to them (there are some of them) i.e. of the hypocrites (who say) to one another: (Which one of you hath this) surah or verse (increased in faith) in fear, hope and certainty in what Muhammad said? (As for those who believe) in Muhammad (pbuh) and in hid Companions, (it hath increased them in faith) it has increased them in fear, hope and certainty (and they rejoice (therefore)) they rejoice in that which is revealed of the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا تقاتلون ولا تشددون أيها المؤمنون على الغواة المستهزئين الذين { إِذَا مَآ أُنزِلَتْ سُورَةٌ } من عندنا مشتملة على تكميل دينكم، وزيادة إيمانكم ويقينكم { فَمِنْهُمْ } أي: من المنافقين { مَّن يَقُولُ } لأصحابه ورفقائه له من خبث باطنه وركاكة فطنته؛ استهزاءً وسخريةً: { أَيُّكُمْ زَادَتْهُ هَـٰذِهِ } استحقاراً لها { إِيمَاناً فَأَمَّا ٱلَّذِينَ آمَنُواْ } بالله وبجميع ما نزل من عنده؛ لإصلاح أحوال عباده { فَزَادَتْهُمْ } بعدما تأمنوا فيها، وتدبروا في مرموزاتها { إِيمَاناً } يقيناً واطمئناناً { وَهُمْ } بعدما أطعلوا على مطالعها { يَسْتَبْشِرُونَ } [التوبة: 124] بنزولها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وإذا ما أنزلت سورةٌ } من القرآن، { فمنهم } فمن المنافقين { من يقولُ } إنكاراً واستهزاءً: { أيُّكم زادتْهُ هذه } السورة { إيماناً } ، كما يزعم أصحاب محمد: ان القرآن يزيدهم إيماناً، فلا زيادة فيه، ولا دليل أنه من عند الله\n قال تعالى في الرد عليهم: { فأما الذين آمنوا فزادتهم إيماناً } لتنوير قلوبهم، وصفاء سرائرهم، فتزيدهم إيماناً وعلماً لما فيها من الإنذار والإخبار، ولانضمام الإيمان بها وبما فيها إلى إيمانهم، { وهم يستبشرون } بنزولها لأنها سبب لزيادة إيمانهم، وارتفاع درجاتهم، بخلاف قلوب المنافقين فلظلمانيتها وخوضها لم تزدهم إلا خوضاً، كما قال تعالى: { واما الذين في قلوبهم مرض } كفر وشك، { فزادتهم رجْساً إلى رِجْسِهِمْ } أي: كفراً بها، مضموماً إلى الكفر بغيرها، الذي كان حاصلاً فيهم، { وماتوا وهم كافرون } أي: وتحكم ذلك في قلوبهم حتى ماتوا عليه",
      "translations": []
    }
  ]
}