{
  "chapter": "التوبة",
  "text": "وما كان المؤمنون لينفروا۟ كافة فلولا نفر من كل فرقة منهم طائفة ليتفقهوا۟ فى الدين ولينذروا۟ قومهم اذا رجعوا۟ اليهم لعلهم يحذرون",
  "translations": [
    {
      "translation": "It is not necessary for the muminun to go out all together. If a party from each group of them were to go out so they could increase their knowledge of the deen they would be able to notify their people when they returned to them so that hopefully they would take warning!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not possible for all believers to go out (to fight). So a part of each section (of the population) should go (to fight) in order that the others may acquire understanding of law and divinity, and warn their companions on return so that they may take heed for themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was not necessary for the believers to go forth all together (to receive religious instruction), but why did not a party of them go forth that they may grow in religious understanding, and that they may warn their people when they return to them, so that they may avoid (erroneous attitudes)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not all believers have to become specialists in religious learning. Why do not some people from each group of believers seek to become specialists in religious learning and, after completing their studies, guide their group so that they will have fear of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not possible for the Muslims that all of them go out; so it should be that a party from each group goes forth in order to gain knowledge in religion, and upon returning they warn their people in the hope that they may avoid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not (proper) for the believers to go out (to fight - Jihad) all together. Of every troop of them, a party only should go forth, that they may get instructions in religion, and that they may warn their people when they return to them, so that they may beware (of evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it does not beseem the believers that they should go forth all together; why should not then a company from every party from among them go forth that they may apply themselves to obtain understanding in religion, and that they may warn their people when they come back to them that they may be cautious?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the believers to go forth totally; but why should not a party of every section of them go forth, to become learned in religion, and to warn their people when they return to them, that haply they may beware?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the believers should not all go out to fight. Of every troop of them, a party only should go forth, that they (who are left behind) may gain sound knowledge in religion, and that they may warn their folk when they return to them, so that they may beware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not right that all the believers should go out [in time of war] all together. Why, then, does not a party from every group come to [the Prophet] in order to acquire a deeper knowledge of religion and to warn their people, so that they can guard themselves against evil?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not for the believers to march forth all together. So why should not a band from each party of them march forth so that they may gain understanding in religion and that when they come back unto them, haply they might warn their people when they come back unto them, haply they may beware!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet it is not for the faithful to go forth en masse. But why should not there a group from each of their sections go forth to become learned in religion, and to warn their people when they return to them, so that they may beware?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor should the Believers all go forth together: if a contingent from every expedition remained behind, they could devote themselves to studies in religion, and admonish the people when they return to them,- that thus they (may learn) to guard themselves (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not (proper) for the believers to go out to fight (Jihad) all together. Of every troop of them, a party only should go forth, that they (who are left behind) may get instructions in (Islamic) religion, and that they may warn their people when they return to them, so that they may beware (of evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers should not go forth altogether, rather, a party from each section should go forth to become well versed in the religion, and when they return to their people warn them in order that they may beware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not advisable for the believers to march out altogether. Of every division that marches out, let a group remain behind, to gain understanding of the religion, and to notify their people when they have returned to them, that they may beware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is not for the believers to go forth [to battle] all at once. For there should separate from every division of them a group [remaining] to obtain understanding in the religion and warn their people when they return to them that they might be cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:122] When the Prophet (s) was about to dispatch a raiding party — after they [certain Muslims] had been reproached for staying behind — all of them went forth, and so the following was revealed: It is not for the believers to go forth, on a raid, altogether: why should not a party, a group, of every section, of every tribe, of them go forth, while the others remain behind, so that they, those who remain behind, may become learned in religion and that they may warn their folk when they return to them, from the raid, by teaching them some of the rulings which they have come to learn, so that they may beware? of God’s punishment, by adhering to His commands and prohibitions. Ibn ‘Abbās said that this [verse] is specifically [intended] for raiding parties, while the previous one is [specifically] to prohibit any individual staying behind when the Prophet (s) sets out [on a campaign].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nكان غالب ما تقدم من هذه السورة تحريضاً على الجهاد وتنديداً على المقصرين في شأنه ، وانتهى الكلام قبل هذا بتبرئة أهل المدينة والذين حولهم من التخلف عن رسول الله صلى الله عليه وسلم فلا جرم كانت قوة الكلام مؤذنة بوجوب تمحض المسلمين للغزو . وإذ قد كان من مقاصد الإسلام بث علومه وآدابه بين الأمة وتكوين جماعات قائمة بعلم الدين وتثقيف أذهان المسلمين كي تصلح سياسة الأمة على ما قصده الدين منها ، من أجل ذلك عُقب التحريض على الجهاد بما يبين أن ليس من المصلحة تمحض المسلمين كلهم لأن يكونوا غزاة أو جُنداً ، وأن ليس حظ القائم بواجب التعليم دون حظ الغازي في سبيل الله من حيث إن كليهما يقوم بعمل لتأييد الدين ، فهذا يؤيده بتوسع سلطانه وتكثير أتباعه ، والآخَرُ يؤيده بتثبيت ذلك السلطان وإعداده لأن يصدر عنه ما يضمن انتظام أمره وطول دوامه ، فإن اتساع الفتوح وبسالة الأمة لا يكفيان لاستبقاء سلطانها إذا هي خلت من جماعة صالحة من العلماء والسَّاسَة وأولي الرأي المهْتمين بتدبير ذلك السلطان ، ولذلك لم يثبت ملك اللمتونيين في الأندلس إلا قليلاً حتى تقلص ، ولم تثبت دولة التتار إلا بعد أن امتزجوا بعلماء المُدن التي فتحوها ووكَلوا أمر الدولة إليهم .وإذ قد كانت الآية السابقة قد حرضت فريقاً من المسلمين على الالتفاف حول رسول الله صلى الله عليه وسلم في الغزو لمصلحة نشر الإسلام ناسب أن يُذكر عقبها نَفْر فريق من المؤمنين إلى رسول الله صلى الله عليه وسلم للتفقه في الدين ليكونوا مرشدين لأقوامهم الذين دخلوا في الإسلام .ومن محاسن هذا البيان أن قابل صيغة التحريض على الغزو بمثلها في التحريض على العلم إذْ افتتحت صيغة تحريض الغزو بلام الجحود في قوله : { ما كان لأهل المدينة ومن حولهم من الأعراب } \\[ التوبة : 120 \\] الآية وافتتحت صيغة التحريض على العلم والتفقه بمثل ذلك إذ يقول : { وما كان المؤمنون لينفروا كافة }.وهذه الجملة معطوفة على مجموع الكلام الذي قبلها فهي جملة ابتدائية مستأنفة لغرض جديد ناشىء عن قوله : { مالكم إذا قيل لكم انفروا } \\[ التوبة : 38 \\] ثم عن قوله : { ما كان لأهل المدينة ومن حولهم من الأعراب أن يتخلفوا } \\[ التوبة : 120 \\] الخ . ومعنى { أن يتخلفوا } هو أن لا ينفروا ، فناسب أن يذكر بعده { وما كان المؤمنون لينفروا كافة }.والمراد بالنفير في قوله : { لينفروا } وقوله : { فلولا نفر من كل فرقة منهم طائفة } الخروج إلى الغزو المأخوذ من قوله : { يأيها الذين آمنوا ما لكم إذا قيل لكم انفروا في سبيل الله اثّاقلتم إلى الأرض } \\[ التوبة : 38 \\] أي وما كان المؤمنون لينفروا ذلك النفرَ كلُّهم .فضمير { ليتفقهوا في الدين } يجوز أن يعود على قوله : { المؤمنون } ، أي ليتفقه المؤمنون .والمراد ليتفقه منهم طائفة وهي الطائفة التي لم تنفر ، كما اقتضاه قوله : { فلولا نفر من كل فرقة منهم طائفة } ، فهو عام مراد به الخصوص .ويجوز أن يعود الضمير إلى مفهوممٍ من الكلام من قوله : { فلولا نفر من كل فرقة منهم طائفة } لأن مفهومه وبقيتْ طائفةً ليتفقهوا في الدين ، فأعيد الضمير على ( طائفة ) بصيغة الجمع نظراً إلى معنى طائفة ، كقوله تعالى : { وإن طائفتان من المؤمنين اقتتلوا } \\[ الحجرات : 9 \\] على تأويل اقتتل جمعهم .ويجوز أن يكون المراد من النفرْ في قوله : { لينفروا كافة فلولا نفر من كل فرقة منهم طائفة } نفْراً آخر غير النفر في سبيل الله ، وهو النفر للتفقه في الدين ، وتكون إعادةُ فعل ( ينفروا ) و ( نَفَر ) من الاستخدام بقرينة قوله : { ليتفقهوا في الدين } فيكون الضمير في قوله : { ليتفقهوا } عائداً إلى { طائفة } ويكون قوله : { وما كان المؤمنون لينفروا كافة } تمهيداً لقوله : { فلولا نفر من كل فرقة منهم طائفة }.وقد نقل عن أيمة المفسرين وأسباب النزول أقوال تجري على الاحتمالين . والاعتماد في مراجع الضمائر على قرائن الكلام على عادة العرب في الإيجاز والاعتماد على فطنة السامع فإنهم أمة فطنة .والإتيان بصيغة لام الجحود تأكيد للنفي ، وهو خبر مستعمل في النهي فتأكيده يفيد تأكيد النهي ، أي كونه نهياً جازماً يقتضي التحريم . وذلك أنه كما كان النفْر للغزو واجباً لأن في تركه إضاعة مصلحة الأمة كذلك كان تركه من طائفة من المسلمين واجباً لأن في تمحض جميع المسلمين للغزو إضاعة مصلحة للأمة أيضاً ، فأفاد مجموع الكلامين أن النفْر للغزو واجب على الكفاية أي على طائفة كافية لتحصيل المقصد الشرعي منه ، وأن تركه متعين على طائفة كافية منهم لتحصيل المقصد الشرعي مما أمروا بالاشتغال به من العلم في وقت اشتغال الطائفة الأخرى بالغزو . وهذا تقييد للإطلاق الذي في فعل ( انفروا ) ، أو تخصيص للعموم الذي في ضمير ( انفروا ).ولذلك كانت هذه الآية أصلاً في وجوب طلب العلم على طائفة عظيمة من المسلمين وجوباً على الكفاية ، أي على المقدار الكافي لتحصيل المقصد من ذلك الإيجاب . وأشعر نفي وجوب النفْر على جميع المسلمين وإثباتُ إيجابه على طائفة من كل فرقة منهم بأن الذين يجب عليهم النفر ليسوا بأوفر عدداً من الذين يبقون للتفقه والإنذار ، وأن ليست إحدى الحالتين بأوْلى من الأخرى على الإطلاق فيعلم أن ذلك منوط بمقدار الحاجة الداعية للنفر ، وأن البقية باقية على الأصل ، فعلم منه أن النفير إلى الجهاد يكون بمقدار ما يقتضيه حال العدو المغزُو ، وأن الذين يبقون للتفقه يبقون بأكثر ما يستطاع ، وأن ذلك سواء . ولا ينبغي الاعتماد على ما يخالف هذا التفسير من الأقوال في معنى الآية وموقعها من الآي السالفة .ولولا : حرف تحْضيض .والفرقة : الجماعة من الناس الذين تفرقوا عن غيرهم في المواطن؛ فالقبيلة فرقة ، وأهل البلاد الواحدة فرقة .والطائفة : الجماعة ، ولا تتقيد بعدد . وتقدم عند قوله : { فلتقم طائفة منهم معك } في سورة النساء ( 102 ).وتنكير { طائفة } مؤذن بأن النفر للتفقه في الدين وما يترتب عليه من الإنذار واجب على الكفاية . وتعيين مقدار الطائفة وضبط حد التفقه موكول إلى ولاة أمور الفرق فتتعين الطائفة بتعيينهم فهم أدرى بمقدار ما تتطلبه المصلحة المنوط بها وجوب الكفاية .والتفقه : تكلف الفقاهة ، وهي مشتقة من فقه ( بكسر القاف ) إذا فهم ما يدق فهمه فهو فاقِهٌ . فالفقه أخص من العلم ، ولذلك نجد في القرآن استعمال الفقه فيما يخفى علمه كقوله : { لا تفقهون تسبيحهم } \\[ الإسراء : 44 \\] ، ويجيء منه فقه بضم القاف إذا صار الفقه سجيته ، فقاهة فهو فقيه .ولما كان مصير الفقه سجية لا يحصل إلا بمزاولة ما يبلغ إلى ذلك كانت صيغة التفعل المؤذنة بالتكلف متعينة لأن يكون المراد بها تكلف حصول الفقه ، أي الفهم في الدين . وفي هذا إيماء إلى أن فهم الدين أمرٌ دقيق المسلك لا يحصل بسهولة ، ولذلك جاء في الحديث الصحيح « مَن يرد الله به خيراً يفَقِّهْه في الدِين » ، ولذلك جزم العلماء بأن الفقه أفضل العلوم .وقد ضبط العلماء حقيقة الفقه بأنه العلم بالأحكام الشرعية العملية المكتسب من أدلتها التفصيلية بالاجتهاد .والإنذار : الإخبار بما يتوقع منه شر . والمراد هنا الإنذار من المهلكات في الآخرة . ومنه النذير . وتقدم في قوله تعالى : { إنا أرسلناك بالحق بشيراً ونذيراً } في سورة البقرة ( 119 ) ، فالإنذار هو الموعظة ، وإنما اقتصر عليه لأنه أهم ، لأن التخلية مقدمة على التحْلية ، ولأنه ما من إرشاد إلى الخير إلا وهو يشتمل على إنذار من ضده . ويدخل في معنى الإنذار تعليم الناس ما يميزون به بين الحق والباطل وبين الصواب والخطإ وذلك بأداء العالم بث علوم الدين للمتعلمين .وحذف مفعول يحذرون } للتعميم ، أي يحذرون ما يُحذر ، وهو فعل المحرمات وترك الواجبات . واقتصر على الحذر دون العمل للإنذار لأن مقتضى الإنذار التحذير ، وقد علمت أنه يفيد الأمرين .\n\n",
      "translations": [
        {
          "translation": "(And the believers should not all) it is not permissible for all the believers to (go out to fight) and leave the Prophet (pbuh) alone in Medina. (Of every troop of them, a party only should go forth) while another party should stay in Medina, (that they (who are left behind) may gain sound knowledge in religion) that they may learn the religion from the Prophet (pbuh) (and that they may warn) and that they may inform (their folk when they return to them) from their military expedition, (so that they may beware) in order to know that which they have been commanded to do and that which they have been prohibited from doing. It is also said that this verse was revealed about the Banu Asad who came to the Prophet (pbuh) in Medina after 210 being hit by drought. Their arrival caused prices in Medina to rise and all the streets became filthy with excrement. And so Allah prohibited them from this.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { وَمَا كَانَ ٱلْمُؤْمِنُونَ } أي: وما استقام لهم وناسب بحالهم { لِيَنفِرُواْ } عن أماكنهم وبلادهم { كَآفَّةً } بحيث تخلو بلدانهم عن الحفظة والحراس { فَلَوْلاَ } وهلا { نَفَرَ مِن كُلِّ فِرْقَةٍ مِّنْهُمْ طَآئِفَةٌ } إلى الرسول { لِّيَتَفَقَّهُواْ فِي ٱلدِّينِ } ويتعلموا شعائره وما يتعلق به من الأدب { وَلِيُنذِرُواْ قَوْمَهُمْ } بذلك { إِذَا رَجَعُوۤاْ إِلَيْهِمْ } ويقيموا لهم ما يتعلمون من شعائر الإسلام ومناسك الدين القويم { لَعَلَّهُمْ يَحْذَرُونَ } [التوبة: 122] عن منهيات الدين\n ويتصفون بمأموراته\n ويصلحون عقائدهم بها فيؤمنوا ويوقنوا بالله\n ويتدينوا بدينه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { وما كان المؤمنون } يستقيم لهم ان ينفروا { كافةً } جميعاً لنحو غزو، أو طلب علم، كما لا يستقيم لهم أن يقعدوا جميعاً، فإنه بخل، ووهن للإسلام. قال ابن عباس: هذه الآية في البعوث إلى الغزو والسرايا، أي: لا ينبغي خروج جميع المؤمنين في السرايا، وإنما يجب ذلك إذا خرج رسول الله صلى الله عليه وسلم بنفسه، ولذلك عاتبهم في الآية المتقدمة على التخلف عنه. فالآية الأولى في الخروج معه صلى الله عليه وسلم، وهذه في السرايا التي كان يبعثها، وقيل: ناسخة لكل ما ورد من الأمر بخروج الجميع، فهي دليل على أن الجهاد فرض كفاية. { فلولا }: فهلا { نَفَرَ من كل فرقةٍ } جماعة كبيرة، كقبيلة أو بلدة، { طائفة } قليلة منها { ليتفقهوا في الدين } ، اما إذا خرجوا للغزو فإنه لا يخلو الجيش من عالم أو عارف يتفقهون، مع أن مشاق السفر تشحذ الأذهان، وترقق البشرية، فتستفيد الروح حينئذٍ علوماً لدنية، وأسراراً ربانية، من غير تعلم، وهذا هو العلم الذي يصلح للإنذار. قال في الإحياء: التفقه: الفقه عن الله بإدراك جلاله وعظمته، وهو العلم الذي يورث الخوف والخشية والهيبة والخشوع، ويحمل على التقوى وملازمتها، وهذا مقتضى الآية. فإن معرفة صفاته تعالى المخوفة والمرجوة هو الذي يحصل به الانذار، لا الفقه المصطلح عليه.هـ. وأما إذا وقع الخروج لطلب العلم فالتفقه ظاهر.  ثم قال تعالى: { وليُنْذِرُوا قومَهم إذا رجعوا إليهم } ، أي: وليجعلوا غاية سعيهم ومُعظم غرضهم من التفقه إرشاد القوم وإنذارهم. وتخصيصه بالذكر لأنه أهم، وفيه دليل على أن التفقه والتذكير من فروض الكفاية، وأنه ينبغي أن يكون غرض المتعلم فيه أن يستقيم ويقيم، لا الترفع على الناس والتبسط في البلاد. قاله البيضاوي. وقوله: { لعلهم يَحذَرُون } ، أي: لعلهم يخافون مما حذروا منه. قال البيضاوي: قد قيل: للآية معنى آخر، وهو أنه لما نزل في المتخلفين ما نزل تسابق المؤمنون إلى نفير، وانقطعوا عن التفقه، فأمروا ان ينفر من كل فرقة طائفة إلى الجهاد، ويبقى أعقابهم يتفقهون، حتى لا ينقطع التفقه الذي هو الجهاد الأكبر لأن الجدال بالحجة هو الأصل، المقصود من البعثة، فيكون الضمير في { ليتفقهوا } ، { ولينذروا }: للفرق البواقي بعد الطوائف النافرة للغزو، وفي { رجعوا }: للطوائف النافرة، أي: لينذروا البواقي من قومهم النافرين إذا رجعوا إليهم حصَّلوا أيام غيبتهم من العلوم.هـ. وتقدير الآية على هذا: فلولا نفر من كل فرقةٍ طائفةٌ، وجلس طائفة ليتفقهوا في الدين، ولينذروا قومهم الخارجين للغزو إذا رجعوا إليهم من غزوهم. والله تعالى أعلم. الإشارة: قال القشيري: لو اشتغل الكُلُّ بالتَّفَقُّه في الدين لَتَعطَّلَ عليهم المعاش، ولمنعهم الكافر عن درك المطلوب، فجعل ذلك فرضاً على كفاية.\nويقال: المسلمون على مراتب: فعوامَّهم كالرعية للمَلِك، وكَتَبَةُ الحديث كخزنة المَلِك، وأهل القرآن كحُفَّاظ الدفاتر، ونفائس الأموال. والفقهاء بمنزلة الوكلاء إذ الفقيه يوقع الحكم عن الله. وعلماءُ الأصول كالقُوَّاد وامراء الجيوش. والأولياءُ كأركان الباب. وأربابُ القلوب وأصحابُ الصفاء كخواص المَلِكِ وجُلَسائه. فشغل قوماً بحفظ أركان الشرع، وآخرين بإمضاء الأحكام، وآخران بالردِّ على المخالفين، وآخران بالأمر بالمعروف والنهي عن المنكر، وجعل قوماً مُفْرَدين لحضور القلب وهم أصحاب الشهود، وليس لهم شُغْلٌ، يراعون مع الله أنفاسَهم، وهم أصحاب الفراغ، لا يستفزُّهم طلَبٌ، ولا يهزُّهم أمر، فهم بالله لله، بمحو ما سوَّى الله، وامَّا الذين يتفقهون في الدين فهم الداعون إلى الله، وإنما يفهم الخلق عن الله بمَنْ كان يَفْهَمُ عن الله. هـ.  قوله: وأما الذين يتفقهون... الخ، الداعون إلى الله على الحقيقة هم العارفون بالله، وهم أصحاب الشهود، الذين وصفهم قبل، وأما الفقهاء في الدِّين فإنما يدعون إلى أحكام الله، وتعلم دينه دون معرفة ذاته وصفاته فدعواهم ضعيفة التأثير، فلا ينهض على أيديهم ما ينهض على أيدي العارفين. وقال الورتجبي، في قوله تعالى: { ليتفقهوا في الدين }: قال المرتعش: السياحة والأسفار على ضربين: سياحة لتعلّم احكام الدين وأساس الشريعة، وسياحة لآداب العبودية ورياضة الأنفس، فمن رجع عن سياحة الأحكام قام بلسانه يدعو الخلق إلى ربه، ومن رجع من سياحة الأدب والرياضة قام في الخلق يهديهم لأخلاقه وشمائله. وسياحة هي سياحة الحق، وهي رؤية أهل الحق والتأدب بآدابهم، فهذا بركته تعم البلاد والعباد.هـ. ثم أمر بجهاد الأقرب فالأقرب، فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ قَاتِلُواْ ٱلَّذِينَ يَلُونَكُمْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:28",
      "similarity": 0.35545397186287
    },
    {
      "verse": "17:46",
      "similarity": 0.314328900568806
    },
    {
      "verse": "9:81",
      "similarity": 0.2997657258410735
    },
    {
      "verse": "25:60",
      "similarity": 0.29379013365965995
    },
    {
      "verse": "21:39",
      "similarity": 0.28481571871684447
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009122.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009122.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:122.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}