{
  "chapter": "التوبة",
  "text": "الا تقتلون قوما نكثوا۟ ايمنهم وهموا۟ باخراج الرسول وهم بدءوكم اول مرة اتخشونهم فالله احق ان تخشوه ان كنتم مؤمنين",
  "translations": [
    {
      "translation": "Will you not fight a people who have broken their oaths and resolved to expel the Messenger, and who initiated hostilities against you in the first place? Is it them you fear? Allah has more right to your fear if you are",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will you not fight those who broke their pledge and plotted to banish the Apostle, and who were the first to attack you? Are you afraid of them? If you are believers you should fear God more.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will you not fight against those who broke their pledges and did all they could to drive the Messenger away and initiated hostilities against you? Do you fear them? Surely Allah has greater right that you should fear Him, if you are true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why will you not fight against a people who have broken their peace treaty with you, have decided to expel the Messenger (from his home town), and who were the first to disregard the peace treaty? If you are true believers, you should only have fear of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will you not fight the people who broke their promises, and intended to expel the Noble Messenger whereas they had started it? Do you fear them? So Allah has more right that you should fear Him, if you have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will you not fight a people who have violated their oaths and intended to expel the Messenger while they did attack you first Do you fear them Allah has more right that you should fear Him if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! will you not fight a people who broke their oaths and aimed at the expulsion of the Apostle, and they attacked you first; do you fear them? But Allah is most deserving that you should fear Him, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will you not fight a people who broke their oaths and purposed to expel the Messenger, beginning the first time against you? Are you afraid of them? You would do better to be afraid of God, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will ye not fight a folk who broke their solemn pledges, and purposed to drive out the messenger and did attack you first? What! Fear ye them? Now Allah hath more right that ye should fear Him, if ye are believers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will you not fight against those who have broken their oaths and conspired to banish the Messenger? They were the first to attack you. Do you fear them? Surely God is more deserving of your fear, if you are true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will ye not fight a people who have violate their oaths and resolved the expulsion of the apostle and who began against you for the first time? Fear ye them? Allah is more worthy that ye should fear Him, if ye are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will you not make war on a people who broke their pledges and resolved to expel the Apostle, and opened [hostilities] against you initially? Do you fear them? But Allah is worthier of being feared by you, should you be faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will ye not fight people who violated their oaths, plotted to expel the Messenger, and took the aggressive by being the first (to assault) you? Do ye fear them? Nay, it is Allah Whom ye should more justly fear, if ye believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will you not fight a people who have violated their oaths (pagans of Makkah) and intended to expel the Messenger, while they did attack you first? Do you fear them? Allah has more right that you should fear Him, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will you not fight against those who have broken their oaths and conspired to expel the Messenger? They were the first to attack you. Do you fear them? Surely, Allah has better rights that you fear Him, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will you not fight a people who violated their oaths, and planned to exile the Messenger, and initiated hostilities against you? Do you fear them? It is God you should fear, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would you not fight a people who broke their oaths and determined to expel the Messenger, and they had begun [the attack upon] you the first time? Do you fear them? But Allah has more right that you should fear Him, if you are [truly] believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:13] Will you not (a-lā, ‘will not’ or ‘is not’, denotes incitement) fight a people who broke, violated, their oaths, their pacts, and intended to expel the Messenger, from Mecca — for they discussed this between them in their council assembly — initiating, combat, against you first?, when they fought alongside Banū Bakr against Khuzā‘a, your allies? So what is stopping you from fighting them? Are you afraid of them? God is more worthy of your fear, when you fail to fight them, if you are believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتحذير من التواني في قتالهم عدا ما استثني منهم بعد الأمر بقتلهم ، وأسرهم ، وحصارهم ، وسدّ مسالك النجدة في وجوههم ، بقوله : { فاقتلوا المشركين حيث وجدتموهم إلى قوله كل مرصد } \\[ التوبة : 5 \\]. وبعد أن أثبتت لهم ثمانية خلال تغري بعدم الهوادة في قتالهم ، وهي قوله : { كيف يكون للمشركين عهد } \\[ التوبة : 7 \\] وقوله : { كيف وإن يظهروا عليكم } \\[ التوبة : 8 \\] وقولُه { يرضونكم بأفواههم وتأبى قلوبهم } \\[ التوبة : 8 \\] وقولُه : { وأكثرهم فاسقون } \\[ التوبة : 8 \\] وقولُه : { اشتروا بآيات الله ثمناً قليلاً } \\[ التوبة : 9 \\] وقولُه : { لا يرقبون في مؤمن إلا ولا ذمة } \\[ التوبة : 10 \\] وقولُه : { وأولئك هم المعتدون } \\[ التوبة : 10 \\] وقولُه : { إنهم لا أيمان لهم } \\[ التوبة : 12 \\].فكانت جملة { ألا تقاتلون قوماً نكثوا أيمانهم } تحذيراً من التراخي في مبادرتهم بالقتال .ولفظ { ألا } يحتمل أن يكون مجموع حرفين : هما همزة الاستفهام ، و ( لا ) النافيةُ ، ويحتمل أن يكون حرفاً واحداً للتحْضيض ، مثل قوله تعالى : { ألا تحبون أن يغفر الله لكم } \\[ النور : 22 \\]. فعلى الاحتمال الأول يجوز أن يكون الاستفهام إنكارياً ، على انتفاء مقاتلة المشركين في المستقبل ، وهو ما ذهب إليه البيضاوي ، فيكون دفعاً لأن يَتوهَّم المسلمون حُرمة لتلك العهود . ويجوز أن يكون الاستفهام تقريرياً ، وهو ظاهر ما حمله عليه صاحب «الكشّاف» ، تقريراً على النفي تنزيلاً لهم منزلة من ترك القتال فاستوجب طلب إقراره بتركه ، قال في «الكشاف» : ومعناه الحضّ على القتال على سبيل المبالغة ، وفي «مغني اللبيب» أن { ألا التي للاستفهام عن النفي تختصّ بالدخول على الجملة الاسمية ، وسلّمه شارحاه ، ولا يخفى أنّ كلام الكشاف } ينادي على خلافه .وعلى الاحتمال الثاني أن يكون { ألا } حرفاً واحداً للتحْضيض فهو تحْضيض على القتال . وجَعَل في «المغني» هذه الآية مثالاً لهذا الاستعمال على طريقة المبالغة في التحذير ولعلّ موجب هذا التفنّن في التحذير من التهاون بقتالهم مع بيان استحقاقهم إياه : أن كثيراً من المسلمين كانوا قد فرحوا بالنصر يوم فتح مكة ومالوا إلى اجتناء ثمرة السلم ، بالإقبال على إصلاح أحوالهم وأموالهم ، فلذلك لمّا أمروا بقتال هؤلاء المشركين كانوا مظنّة التثاقل عنه خشية الهزيمة ، بعد أن فازوا بسُمعة النصر ، وفي قوله عقبه { أتخشونهم } ما يزيد هذا وضوحاً .أمّا نكثهم أيمانهم فظاهر مما تقدّم عند قوله تعالى : { إلا الذين عاهدتم من المشركين } \\[ التوبة : 4 \\] وقوله { إلا الذين عاهدتم من المشركين ثم لم ينقصوكم } \\[ التوبة : 4 \\] الآية . وذلك نكثهم عهد الحديبية إذ أعانوا بني بكر على خزاعة وكانت خزاعة من جانب عهد المسلمين كما تقدّم .وأمّا همّهم بإخراج الرسول فظاهره أنّه همٌّ حصل مع نكث أيمانهم وأن المراد إخراج الرسول من المدينة ، أي نفيه عنها لأن إخراجه من مكّة أمر قد مضى منذ سنين ، ولأنّ إلجاءه إلى القتال لا يعرف إطلاق الإخراج عليه فالظاهر أنّ همّهم هذا أضمروه في أنفسهم وعلمه الله تعالى ونبّه المسلمين إليه .وهو أنّهم لمّا نكثوا العهد طمعوا في إعادة القتال وتوهّموا أنفسهم منصورين وأنّهم إن انتصروا أخرجوا الرسول عليه الصلاة والسلام من المدينة .و ( الهم ) هو العزم على فعل شيء ، سواء فعله أم انصرف عنه . ومؤاخذتهم في هذه الآية على مجرّد الهمّ بإخراج الرسول تدلّ على أنّهم لم يخرجوه ، وإلاّ لكان الأجدر أن ينعى عليهم الإخراج لا الهمّ به ، كما في قوله : { إذ أخرجه الذين كفروا } \\[ التوبة : 40 \\] وتدلّ على أنّهم لم يرجعوا عمّا همّوا به إلاّ لِمَا حيل بينهم وبين تنفيذه ، فعن الحسن : همّوا بإخراج الرسول من المدينة حين غزوْه في أحد وحين غزوا غزوة الأحزاب ، أي فكفاه الله سوء ما همّوا به ، ولا يجوز أن يكون المراد إخراجه من مكة للهجرة لأنّ ذلك قد حدث قبل انعقاد العهد بينهم وبين المسلمين في الحديبية ، فالوجه عندي : أنّ المعنيَّ بالذين هَمّوا بإخراج الرسول قبائل كانوا معاهدين للمسلمين ، فنكثوا العهد سنة ثمان ، يوم فتح مكة ، وهمّوا بنجدة أهل مكة يوم الفتح ، والغدر بالنَّبي عليه الصلاة والسلام والمسلمين ، وأن يأتوهم وهم غارون ، فيكونوا هم وقريش ألباً واحداً على المسلمين ، فيُخرجون الرسول صلى الله عليه وسلم والمسلمين من مكة ، ولكنّ الله صرفهم عن ذلك بعد أن همّوا ، وفضح دخيلتهم للنبيء صلى الله عليه وسلم وأمره بقتالهم ونبذِ عهدهم في سنة تسع ، ولا ندري أقاتلهم النبي صلى الله عليه وسلم بعد نزول هذه الآية أم كان إعلان الأمر بقتالهم ( وهم يعلمون أنهم المراد بهذا الأمر ) سبباً في إسلامهم وتوبة الله عليهم ، تحقيقاً للرجاء الذي في قوله : { لعلهم ينتهون } \\[ التوبة : 12 \\] ولعل بعض هؤلاء كانوا قد أعلنوا الحرب على المسلمين يوم الفتح ناكثين العهد ، وأمدّوا قريشاً بالعدد ، فلمّا لم تنشب حرب بين المسلمين والمشركين يومئذٍ أيسوا من نصرتهم فرجعوا إلى ديارهم ، وأغضى النبي صلى الله عليه وسلم عنهم ، فلم يؤاخذهم بغدْرهم ، وبقي على مراعاة ذلك العهد ، فاستمرّ إلى وقت نزول هذه الآية ، وذلك قوله : { وهم بدوءكم أول مرة } أي كانوا البادئين بالنكث ، وذلك أنّ قريشاً انتصروا لأحلافهم من كنانة ، فقاتلوا خزاعة أحلاف المسلمين .و { أول مرة } نَصْب على المصدرية . وإضافة { أول } إلى { مرة } من إضافة الصفة إلى الموصوف . والتقدير : مرة أولى والمرّة الوَحدة من حدث يحدث ، فمعنى { بدءوكم أول مرة } بدأوكم أوّل بدء بالنكث ، أي بَدْءا أولَ؛ فالمَرّة اسم مبهم للوحدة من فعل ما ، والأغلب أن يفسر إبهامه بالمقام ، كما هنا ، وقد يفسّره اللفظ .و { أوّل } اسم تفضيل جاء بصيغة التذكير ، وإن كان موصوفه مؤنّثاً لفظاً ، لأن اسم التفضيل إذا أضيف إلى نكرة يلازم الإفراد والتذكير بدلالة المضاف إليه ويقال : ثاني مرة وثالث مرّة .والمقصود من هذا الكلام تهديدهم على النكث الذي أضمروه ، وأنّه لا تسامح فيه .وعلى كلّ فالمقصود من إخراج الرسول عليه الصلاة والسلام : إمّا إخراجه من مكة منهزماً بعدَ أن دخلها ظافراً ، وإمّا إخراجه من المدينة بعد أن رجع إليها عقب الفتح ، بأن يكونوا قد همّوا بغزو المدينة وإخراج الرسول والمسلمين منها وتشتيت جامعة الإسلام .وجملة { أتخشونهم } بدل اشتمال من جملة { ألا تقاتلون } فالاستفهام فيها إنكار أو تقرير على سبب التردّد في قتالهم ، فالتقدير : أينتفي قتالكم إيّاهم لَخشيكم إياهم ، وهذا زيادة في التحريض على قتالهم .وفُرّع على هذا التقرير جملة { فالله أحق أن تخشوه } أي فالله الذي أمركم بقتالهم أحقّ أن تخشوه إذا خطر في نفوسكم خاطر عدم الامتثال لأمره ، إن كنتم مؤمنين ، لأنّ الإيمان يقتضي الخشية من الله وعدم التردّد في نجاح الامتثال له .وجيء بالشرط المتعلّق بالمستقبل ، مع أنّه لا شكّ فيه ، لقصد إثارة همّتهم الدينية فيبرهنوا على أنّهم مؤمنون حقّا يقدمون خشية الله على خشية الناس .\n\n",
      "translations": [
        {
          "translation": "(Will ye not fight a folk) why is it that you do not fight a people, i.e. the people of Mecca (who broke their solemn pledges) which are between them and you, (and purposed to drive out the messenger) and wanted to kill the Messenger when they entered Dar al-Nadwah (and did attack you first) by breaking their pledge when they helped the Banu Bakr, their allies, against the Banu Khuza'ah, the allies of the Prophet (pbuh)? (What! Fear ye them?) believers, do you fear fighting them? (Now Allah hath more right that you should fear Him) because of leaving His command, (if ye are believers).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { نَّكَثُوۤاْ أَيْمَانَهُمْ } معناهُ نَقَضوهَا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"They have broken their oaths,\" means that they have nullified them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه تحريضاً للمؤمنين على القتال على وجه المبالغة: { أَلاَ تُقَاتِلُونَ قَوْماً نَّكَثُوۤاْ أَيْمَانَهُمْ وَ } بعد نقضهم الأيمان والعهود { هَمُّواْ } أي: قصدوا واهتموا { بِإِخْرَاجِ ٱلرَّسُولِ } من مكة { وَ } الحال أنه { هُم } قوم { بَدَءُوكُمْ } بالمعاداة والمخاصمة { أَوَّلَ مَرَّةٍ } في بدء الإسلام حين تحدوا مع رسول الله بالمعارضة فأفحموا\n والتجأوا إلى المقارعة والمشاجرة { أَتَخْشَوْنَهُمْ } منهم أيها المؤمنون في مقاتلتهم أن يحلقكم مكروه من جانبهم أم تداهنون معهم وتضعفون عنهم؟! وإن خشيتم عن لحقوق المكروه وعروض المنكر { فَٱللَّهُ أَحَقُّ أَن تَخْشَوْهُ } لأنه قادر على وجوه الانتقامات\n فعليكم أن تخشوا من الله ومخالفة أمره وحكمه { إِن كُنتُمْ مُّؤُمِنِينَ } [التوبة: 13] بالله وبأوامره ونواهيه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم حضَّ على قتالهم فقال: { أَلاَ تُقاتِلُون قوماً نَكَثُوا أَيمانهم } التي حلفوها للرسول صلىالله عليه وسلم وللمؤمنين على ألا يعاونوا عليهم\n فعاونوا بني بكر على خزاعة\n { وهمّوا بإخراج الرسول } حين تشاوروا في أمره بدار الندوة على ما مرّ\n { وهم بدؤوكم أول مرة } بالمعاداة والمقاتلة لأنه ـ عليه الصلاة والسلام ـ بدأهم بالدعوة\n وإلزام الحجة بالكتاب والتحدي به\n فعدلوا عن معارضته إلى المعاداة والمقاتلة\n فما يمنعكم أن تعارضوهم وتصادموهم\n { أتخشونهم } أي: أتهابون قتالهم حتى تتركوا أمري\n { فالله أحقُّ أن تخشَوه إن كنتم مؤمنين } فإن قضية الإيمان ألا يُخاف إلا منه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:50",
      "similarity": 0.47380794013498867
    },
    {
      "verse": "48:10",
      "similarity": 0.39912341590798034
    },
    {
      "verse": "7:135",
      "similarity": 0.39349556011373743
    },
    {
      "verse": "4:113",
      "similarity": 0.3587342332719658
    },
    {
      "verse": "5:11",
      "similarity": 0.3362352360584307
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009013.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009013.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:13.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}