{
  "chapter": "التوبة",
  "text": "قتلوهم يعذبهم الله بايديكم ويخزهم وينصركم عليهم ويشف صدور قوم مؤمنين",
  "translations": [
    {
      "translation": "Fight them! Allah will punish them at your hands, and disgrace them and help you against them, and heal the hearts of those who have iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight them so that God may punish them at your hands, and put them to shame, and help you against them, and heal the wounds of the hearts of believers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make war on them. Allah will chastise them through you and will humiliate them. He will grant you victory over them, and will soothe the bosoms of those who believe,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight them. May God punish them by your hands, humiliate them, give you victory over them, delight the hearts of the believers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So fight them – Allah will punish them at your hands, and He will disgrace them and assist you over them, and He will soothe the hearts of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight against them so that Allah will punish them by your hands, and disgrace them and give you victory over them, and heal the breasts of a believing people,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight them, Allah will punish them by your hands and bring them to disgrace, and assist you against them and heal the hearts of a believing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight them, and God will chastise them at your hands and degrade them, and He will help you against them, and bring healing to the breasts of a people who believe,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight them! Allah will chastise them at your hands, and He will lay them low and give you victory over them, and He will heal the breasts of folk who are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight them: God will punish them at your hands, and will disgrace them. He will help you to overcome them and heal the hearts of the faithful;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight them. Allah will torment them at your hands, and humiliate them and give you victory over them and heal the breasts of the believing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make war on them so that Allah may punish them by your hands and humiliate them, and help you against them, and heal the hearts of a faithful folk,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight them, and Allah will punish them by your hands, cover them with shame, help you (to victory) over them, heal the breasts of Believers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight against them so that Allah will punish them by your hands and disgrace them and give you victory over them and heal the breasts of a believing people,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight them, Allah will punish them with your hands and degrade them. He will grant you victory over them and heal the chests of a believing nation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight them. God will punish them at your hands, and humiliate them, and help you against them, and heal the hearts of a believing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight them; Allah will punish them by your hands and will disgrace them and give you victory over them and satisfy the breasts of a believing people\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:14] Fight them, and God will chastise them, He will have them killed, at your hands and degrade them, humiliate them through capture and subjugation, and He will give you victory against them, and He will heal the breasts of a people who believe, [removing the harm] done to them — these are the Banū Khuzā‘a.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Fight them! Allah will chastise them at your hands) He will chastise them by means of your swords, i.e. by killing them, (and He will lay them low) He will abase them by means of defeat (and give you victory over them, and He will heal the breasts of folk who are believers) by the exultation of the Banu Khuza'ah, in that they were allowed to kill their enemies for a while in the Sacred Precinct upon the Conquest of Mecca.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { قَاتِلُوهُمْ } حيث وجدتموهم، فإنكم منصورون عليهم { يُعَذِّبْهُمُ ٱللَّهُ بِأَيْدِيكُمْ } بأنواع العذاب من الأسر والقتل والإجلاء { وَيُخْزِهِمْ } أي: بذلهم ويهينهم ما بقي منهم من ذرياتهم { وَيَنْصُرْكُمْ } دائماً { عَلَيْهِمْ وَيَشْفِ } بقهرهم وإذلالهم { صُدُورَ قَوْمٍ } غرباء { مُّؤْمِنِينَ } [التوبة: 14] حيث صارت قلوبهم مرضى من وعيدات أولئك الطغاة الغواة، المتجبرين المستكبرين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم وعدهم بالنصر فقال: { قاتلوهم يُعذِّبْهُم الله بأيديكم ويُخْزِهِمْ } يُهنهم بالقتل والأسر، { وينصركُمْ عليهم } ، فيمكنكم من رقابهم، ويملككم أموالهم ونساءهم، { وَيشْفِ صدورَ قومٍ مؤمنين } ، يعني: بني خزاعة شفوا صدورهم من بني بكر لأنهم كانوا أغاروا عليهم وقتلوا فيهم\n وقيل: بطوناً من اليمن قدموا مكة وأسلموا، فلقوا من أهلها أذى شديداً، فشكوا إلى رسول الله صلى الله عليه وسلم، فقال:\n\n \" أبشروا، فإن الفرج قريب \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:57",
      "similarity": 0.7307537103529365
    },
    {
      "verse": "26:80",
      "similarity": 0.6988652906496973
    },
    {
      "verse": "17:82",
      "similarity": 0.6820942085763617
    },
    {
      "verse": "16:69",
      "similarity": 0.3660740001360259
    },
    {
      "verse": "41:44",
      "similarity": 0.3178975226380456
    }
  ]
}