{
  "chapter": "التوبة",
  "text": "ويذهب غيظ قلوبهم ويتوب الله على من يشاء والله عليم حكيم",
  "translations": [
    {
      "translation": "He will remove the rage from their hearts. Allah turns to anyone He wills. Allah is All-Knowing, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remove the anger from their breasts; for God turns to whosoever desires. God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and will remove rage from their hearts, and will enable whomsoever He wills to repent. Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and appease their anger. God forgives whomever He wants and He is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He will remove the anxiety of their hearts; and Allah may accept the repentance of whomever He wills; and Allah is All Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remove the anger of their (believers') hearts. Allah accepts the repentance of whom He wills. Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remove the rage of their hearts; and Allah turns (mercifully) to whom He pleases, and Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and He will remove the rage within their hearts; and God turns towards whomsoever He will; God is All-knowing, All-wise\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He will remove the anger of their hearts. Allah relenteth toward whom He will. Allah is Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will remove the rage from their hearts. God will turn in His mercy to whom He wills. God is all knowing and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He will take away the rage of their hearts. And Allah will relent toward whomsoever He liketh; and Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and remove rage from their hearts, and Allah turns clemently to whomever He wishes, and Allah is all-knowing, all-wise\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And still the indignation of their hearts. For Allah will turn (in mercy) to whom He will; and Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remove the anger of their (believers') hearts. Allah accepts the repentance of whom He wills. Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will take away all anger from their hearts: Allah turns to whomsoever He will. Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He will remove the anger of their hearts. God redeems whomever He wills. God is Knowledgeable and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remove the fury in the believers' hearts. And Allah turns in forgiveness to whom He wills; and Allah is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:15] And He will remove the rage, the grief, in their hearts. God turns [in forgiveness] to whomever He will, when they return to Islam, as in the case of Abū Sufyān. And God is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And He will remove the anger of their hearts. Allah relenteth towards whom He will) He will relent towards whoever repents of them. (Allah is Knower) of those who repent and of those who do not, (Wise) in that which He decreed for them; it is also said that this means: He ordained their defeat and killing.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَيُذْهِبْ } بقتل أولئك الكفرة، وقمعهم واستئصالهم { غَيْظَ قُلُوبِهِمْ } أيما حدث وخدش في قلوب هؤلاء الغرباء المؤمنين الذين تركوا أوطانهم؛ لحب دين الإسلام من استيلاء الكفار وكثرة عددهم وعُددهم، وجاههم ومالهم { وَيَتُوبُ ٱللَّهُ عَلَىٰ مَن يَشَآءُ } أي: يصرف ويرجع من الباطل؛ بسبب قلعهم وقمعهم من في قلوبهم مرض من الأقاصي والأداني { وَٱللَّهُ } المطلع لضمائر عباده { عَلِيمٌ } بمخايلهم وأمراض قلوبهم { حَكِيمٌ } [التوبة: 15] في علاجها ودفعها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ ويُذْهِبْ غيظَ قلوبهم } بما لقوا منهم حين أغاروا عليهم، وقد أوفى الله بما وعدهم بفتح مكة وهوازن\n والآية من المعجزات\n قاله البيضاوي\n وهذا يقتضي أن هذا التخصيص كان قبل الفتح، فيلتئم مع ما بعده، ويبعد اتسامه مع ما قبله من البراءة، ونبذ العهد والإعلام بذلك لكونه بعد الفتح، والله أعلم\n قاله المحشي\n ويمكن الجواب بأن يكون صدر السورة بعد الفتح، وبعضها من قوله: وإن أحد من المشركين\n\n\n إلخ نزل قبل الفتح، فإن الآيات كانت تنزل متفرقة فيقول صلى الله عليه وسلم:\n\n\n\n \" اجعلوا هذه الآية في محل كذا \"\n \n\nوالله تعالى أعلم\n ثم أخبر تعالى بأن بعض المشركين يتوب من كفره بقوله: { ويتوبُ اللَّهُ على من يشاءُ } هدايته، فيهديه للإيمان، ثم يتوب عليه، وقد كان ذلك في كثير منهم\n { والله عليمٌ } بما كان يكون، { حكيم } لا يفعل ولا يحكم إلا على وفق حكمته\n الإشارة: من رجع عن طريق القوم، ونقض عهد الأشياخ، ثم طعن في طريقهم، لا يرجى فلاحه، لا في الدنيا ولا في الآخرة، أعني في طريق الخصوص لأنه جمع بين نقض العهد والطعن على الأولياء، وقد قال تعالى:\n\n \" من آذى لي ولياً فقد آذنني بالحرب \" \n\nومن رجع عنها لضعف ووهن، مع بقاء الاعتقاد والتسليم، فربما تقع الشفاعة منهم فيلحق بهم، بخلاف الأول، فقد تقدم عن القشيري، في سورة آل عمران، أنهم يريدون الشفاعة فيه، فيخلق الله صورة على مثله، فإذا رأوها تركوا الشفاعة فيه، فيبقى مع عوام أهل اليمين\n فانظره\n وبالله التوفيق\n ثم عاتبهم على تأخر بعضهم عن الجهاد، فقال: { أَمْ حَسِبْتُمْ أَن تُتْرَكُواْ وَلَمَّا يَعْلَمِ ٱللَّهُ ٱلَّذِينَ جَاهَدُواْ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:55",
      "similarity": 0.7992758343018722
    },
    {
      "verse": "33:25",
      "similarity": 0.44166476271289484
    },
    {
      "verse": "22:15",
      "similarity": 0.43274782859629934
    },
    {
      "verse": "3:134",
      "similarity": 0.38510377281607094
    },
    {
      "verse": "25:12",
      "similarity": 0.33467610743356085
    }
  ]
}