{
  "chapter": "التوبة",
  "text": "ام حسبتم ان تتركوا۟ ولما يعلم الله الذين جهدوا۟ منكم ولم يتخذوا۟ من دون الله ولا رسوله ولا المؤمنين وليجة والله خبيرۢ بما تعملون",
  "translations": [
    {
      "translation": "Or did you suppose that you would be left without Allah knowing those of you who have done jihad and who have not taken anyone as their intimate friends besides Allah and His Messenger and the muminun? Allah is aware of what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you think you will get away before God knows who among you fought and did not take anyone but God, His Apostle and the faithful, as their friends? God is cognisant of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you imagine that you will be spared without being subjected to any test? Know well that Allah has not yet determined who strove hard (in His cause), and has not taken any others instead of His Messenger and the believers as his trusted allies? Allah is well aware of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you think that God will not make any distinction between those of you who have fought for His cause and have relied on no one other than God, His Messenger, and the faithful ones, and other people? God is Well Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you under the illusion that you would be left just like this, whereas Allah has not yet made known those of you who will fight and not confide their secrets with anyone except Allah and His Noble Messenger and the Muslims? And Allah is Well Aware of your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you think that you shall be left alone while Allah has not yet tested those among you who have striven hard and fought, and have not taken Walijah besides Allah and His Messenger, and the believers. Allah is well-acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! do you think that you will be left alone while Allah has not yet known those of you who have struggled hard and have not taken any one as an adherent besides Allah and His Apostle and the believers; and Allah is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or did you suppose you would be left in peace, and God knows not as yet those of you who have struggled, and taken not -- apart from God and His Messenger and the believers -- any intimate? God is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or deemed ye that ye would be left (in peace) when Allah yet knoweth not those of you who strive, choosing for familiar none save Allah and His messenger and the believers? Allah is Informed of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you [O believers] think that you will be spared without God identifying which of you have struggled and did not take anyone for friends and protectors except God, His Messenger, and the believers? God is fully aware of all your actions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Deem ye that ye would be left alone while yet Allah hath not known those of you who have striven hard and have not taken an ally besides Allah and His apostle and the believers? And Allah is Aware of that which ye work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you suppose that you will be let off while Allah has not yet ascertained those of you who wage jihad and those who do not take anyone as [their] confidant besides Allah and His Apostle and the faithful? Allah is well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or think ye that ye shall be abandoned, as though Allah did not know those among you who strive with might and main, and take none for friends and protectors except Allah, His Messenger, and the (community of) Believers? But Allah is well-acquainted with (all) that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you think that you shall be left alone while Allah has not yet tested those among you who have striven hard and fought and have not taken Walijah [(Batanah - helpers, advisors and consultants from disbelievers, pagans, etc.) giving openly to them their secrets] besides Allah and His Messenger, and the believers. Allah is Well-Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you suppose that you would be left before Allah has known those of you who fought and did not take a confidant other than Allah, His Messenger, and the believers? Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you think that you will be left alone, without God identifying which of you will strive, and take no supporters apart from God, His Messenger, and the believers? God is well Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you think that you will be left [as you are] while Allah has not yet made evident those among you who strive [for His cause] and do not take other than Allah, His Messenger and the believers as intimates? And Allah is Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:16] Or (am has the meaning of the [initial a-] hamza used to express disavowal) did you suppose that you would be left [in peace] when God does not yet know, that is, through knowledge outwardly manifested, those of you who have struggled, sincerely, and have not taken, besides God and His Messenger and the believers, an intimate friend?, as a confidant or an ally? In other words: when it has not yet become manifest who the sincere ones are — those described in the exclusive way mentioned. And God is aware of what you do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or deemed ye) believers (that ye would be left (in peace)) that you would be given respite and not commanded to fight (when Allah yet knoweth not) has not yet seen (those of you who strive) in the way of Allah, (choosing for familiar none) of the disbelievers (save Allah and His messenger and the) sincere (believers? Allah is Informed of what ye do) of good or evil during jihad and at other places and times.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَمْ يَتَّخِذُواْ مِن دُونِ ٱللَّهِ وَلاَ رَسُولِهِ وَلاَ ٱلْمُؤْمِنِينَ وَلِيجَةً } فالوَلِيجَةُ: الرَّجلُ يَكونُ فِي القَوم\n وَلَيسَ مِنهُم وَلاَ مِن أَهل دِينِهم\n وكُلُّ شَيءٍ أَدْخَلتَهُ فِي شَيْءٍ وَلَيْسَ مَنهُ فَهو وَليجَةٌ\n وهُوَ الدَّخِيلُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah {And they did not take any of their Lord and His Messenger and the believers as allies}, so the ally is the man who is among the people.\n\n\nAnd he is not from them, nor from their religious tradition.\n\n\nAnd whatever you enter into something, and it is not part of it, then it is an intruder.\n\n\nAnd he is the one who enters.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على وجه التشنيع للمؤمنين؛ تحريكاً لحمية الإيمان: { أَمْ حَسِبْتُمْ } وظننتم أيها المؤمنون الكارهون للقتال، المتقاعدون عن امتثال الأوامر الواقعة فيه { أَن تُتْرَكُواْ } على ما أنتم عليه، ولا تؤمروا بالقتال من بعد { وَ } زعمتم زعماً فاسداً { لَمَّا يَعْلَمِ ٱللَّهُ } ولما يفصل ويميز بعلمه الحضوري { ٱلَّذِينَ جَاهَدُواْ مِنكُمْ } في سبيله مخلصين خالصاً لرضاه\n\n\n\n\n{ وَ } مع ذلك { لَمْ يَتَّخِذُواْ مِن دُونِ ٱللَّهِ }  { وَلاَ } من دون { رَسُولِهِ } المستخلف منه، النائب عنه { وَلاَ } من دون { ٱلْمُؤْمِنِينَ } المرابطين قلوبهم مع الله ورسوله { وَلِيجَةً } أي: بطانةً ومرجعاً يوالونهم ويفشون إليهم سرائرهم، بلى إن الله عليم بجميع ما صدر عنكم من علامات الإخلاص وأمارات النفاق { وَٱللَّهُ } المطلع لجميع أحوالكم { خَبِيرٌ بِمَا تَعْمَلُونَ } [التوبة: 16] أي: تتخيلون وتحضرون من التكاسل والتواني والإلجاء إلى الأعداء والرجوع إليهم في خلواتكم وأسراركم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" أم \": منقطعة، بمعنى الهمزة للإنكار والتوبيخ على الحسبان، والخطاب للمؤمنين أو المنافقين، والوليجة: البطانة والصحبة\n يقول الحق جل جلاله: { أم حسبتم } أي: أظننتم { أن تُتْركُوا } من غير اختبار، { ولمَّا يعلمِ الله الذين جاهدُوا منكم } أي: ولم يتبين الخلَّص منكم، وهم الذين جاهدوا، من غيرهم، والمراد: علمَ ظهور، أي: أظننتم أن تتركوا ولم يظهر منكم المجاهد من غيره، قال البيضاوي: نفى العلم، وأراد نفي المعلوم للمبالغة، فإنه كالبرهان عليه من حيث إن تعلق العلم به مستلزم لوقوعه\n هـ\n بل يختبركم حتى يظهر الذين جاهدوا منكم\n { ولم يتخِذوا من دون الله ولا رسولِه ولا المؤمنين وَليجَةً } بطانة، أي: جاهدوا وأفردوا محبتهم لله ولرسوله وللمؤمنين، ولم يتخذوا من دونهم بطانة، أي أصحاب سرٍ يوالونهم ويبثون إليهم أسرارهم، بل اكتفوا بمحبة الله ومودة رسول الله والمؤمنين، دون موالاة من عاداهم، والتعبير بـ لما: يقتضي أن ظهورَ ذلك متوقع، { واللَّهُ خبيرٌ بما تعملون }: تهديد لمن يفعل ذلك\n الإشارة: إفراد المحبة لله ولأولياء الله من أعظم القربات إلى الله، وأقرب الأمور الموصلة إلى حضرة الله، والالتفات إلى أهل الغفلة بالصحبة والمودة، من أعظم الآفات والأسباب المبعدة عن اللهِ، والعياذ بالله\n وفي الحديث:\n\n \" المَرْءُ عَلَى دِينِ خَلِيله \" \n\nو\n\n \" المَرْءُ مَعَ مَنْ أحَبَّ \" \n\nو\n\n \" مَنْ أَحَبْ قَوْماً حُشِرَ مَعَهم \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:61",
      "similarity": 0.5856659700074521
    },
    {
      "verse": "3:27",
      "similarity": 0.5821421432844788
    },
    {
      "verse": "57:6",
      "similarity": 0.5620927839329304
    },
    {
      "verse": "31:29",
      "similarity": 0.5109615501931406
    },
    {
      "verse": "34:2",
      "similarity": 0.4680861582110673
    }
  ]
}