{
  "chapter": "التوبة",
  "text": "ما كان للمشركين ان يعمروا۟ مسجد الله شهدين على انفسهم بالكفر او۟لئك حبطت اعملهم وفى النار هم خلدون",
  "translations": [
    {
      "translation": "It is not for the idolaters to frequent the mosques of Allah, bearing witness against themselves of their kufr. They are the ones whose actions will come to nothing. They will be in the Fire timelessly, for ever.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The idolaters have no right to visit the mosques of God while bearing testimony to their disbelief. Meaningless will be their acts, and in Hell they will bide for ever,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It does not become those who associate others with Allah in His Divinity to visit and tend Allah's mosques while they bear witness of unbelief against themselves. All their works have gone to waste. They shall abide in the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The pagans do not have any right to establish (and patronize) the mosque of God while they testify against their souls to its disbelief. Their deeds are devoid of all virtue and they will live forever in hell fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It does not befit the polytheists to assemble in Allah’s mosques after themselves bearing witness of their disbelief; in fact all their deeds are wasted; and they will remain in the fire forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the Mushrikin, to maintain the Masjids of Allah, while they witness against themselves of disbelief. The works of such are in vain and in Fire shall they abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The idolaters have no right to visit the mosques of Allah while bearing witness to unbelief against themselves, these it is whose doings are null, and in the fire shall they abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the idolaters to inhabit God's places of worship, witnessing against themselves unbelief; those -- their works have failed them, and in the Fire they shall dwell forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the idolaters to tend Allah's sanctuaries, bearing witness against themselves of disbelief. As for such, their works are vain and in the Fire they will abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not right that the polytheists should frequent God's places of worship while they are self-confessed unbelievers. It is they whose works shall come to nothing and they shall abide in Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the associators that they shall tend Allah's mosques, while giving evidence of infidelity against themselves. Those! vain shall be their works, and in the Fire they shall be abiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The polytheists may not maintain Allah’s mosques while they are witness to their own unfaith. Their works have failed, and they shall remain in the Fire [forever].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for such as join gods with Allah, to visit or maintain the mosques of Allah while they witness against their own souls to infidelity. The works of such bear no fruit: In Fire shall they dwell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the Mushrikun (polytheists, idolaters, pagans, disbelievers in the Oneness of Allah), to maintain the Mosques of Allah (i.e. to pray and worship Allah therein, to look after their cleanliness and their building, etc.), while they witness against their ownselves of disbelief. The works of such are in vain and in Fire shall they abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Idolaters should not inhabit the mosques of Allah bearing witness against themselves with disbelief. Those, their deeds have been annulled, and in the Fire they shall live for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the polytheists to attend God’s places of worship while professing their disbelief. These—their works are in vain, and in the Fire they will abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for the polytheists to maintain the mosques of Allah [while] witnessing against themselves with disbelief. [For] those, their deeds have become worthless, and in the Fire they will abide eternally.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:17] It is not for the idolaters to attend God’s places of worship (masājid, is also read in the singular, masjid), entering them or sitting in them, bearing witness, against themselves, to unbelief; those, their works have failed, [their works] are invalid, and in the Fire they shall abide.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It is not for the idolaters) the idolaters ought not (to tend Allah's sanctuaries, bearing witness against themselves) through their calling (of disbelief. As for such, their works are vain) their works are thwarted for as long as they remain disbelievers (and in the Fire they will abide) never to die or leave it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { مَا كَانَ } أي: ما صحّ وجاز { لِلْمُشْرِكِينَ } المصرين على الشرك والعناد { أَن يَعْمُرُواْ مَسَٰجِدَ ٱللهِ } المعدة لأهل الإيمان ليعبدوا فيها حتى يتحققوا بمقام المعرفة والتوحيد حال كونهم { شَٰهِدِينَ عَلَىٰ أَنْفُسِهِمْ بِالْكُفْرِ } والشرك قولاً وفعلاً وشركهم منافٍ لتعميرها\n إذ { أُوْلَئِكَ } البعداء الهالكون في تيه الضلال { حَبِطَتْ } أي: سقطت عن درجة الاعتبار { أَعْمَٰلُهُمْ } الصالحة عند الله بحيث لا ينفعهم أصلاً\n لمقارنتها بالشرك بل { وَ } مآل أمرهم { فِي ٱلنَّارِ } المعدة لأهل الشرك والضلال { هُمْ خَٰلِدُونَ } [التوبة: 17] لا نجاة لهم أصلاً\n سواء صدر عنهم الأعمال الصالحة أم لا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ما كان للمشركين } أي: ما صح لهم { أن يعمرُوا مساجدَ الله } أي: شيئاً من المساجد\n فضلاً عن المسجد الحرام\n وقيل: هو المراد\n وإنما جمع لأنه قبلة المساجد وإمامها\n فأمره كأمرها\n ويدل عليه قراءة من قرأ بالتوحيد\n أي: ليس لهم ذلك\n وإن كانوا قد عمروه تغلباً وظلماً\n حال كونهم { شاهدين على أنفسهم بالكفر } بإظهار الشرك وتكذيب الرسول\n أي: ما استقام لهم أن يجمعوا بين أمرين متباينين: عمارة بيت الله\n وعبادة غير الله\n { أولئك حَبِطَتْ أعمالُهم } في الدنيا والآخرة لما قارنها من الشرك والافتخار بها\n { وفي النار هم خالدون } لأجل كفرهم\n  { إنما يَعْمُرُ مساجدَ الله من آمن بالله واليوم الآخر وأقام الصلاة وآتى الزكاة } \n أي: إنما تستقيم عمارتها بهؤلاء الجامعين للكمالات العلمية والعملية\n ومن عمارتها: تزيينها بالفرش\n وتنويرها بالسرج\n وإدامة العبادة والذكر ودروس العلم فيها\n وصيانتها مما لم تبن له كحديث الدنيا\n وعن النبي صلى الله عليه وسلم قال: قال الله تعالى:\n \" إِنَّ بُيُوتِي في أَرْضِي المَسَاجدُ وإنَّ زُوَّاري فيهَا عُمَّارُهَا\n فَطُوبى لعَبْدٍ تَطَهَّرَ في بَيْتِهِ\n ثُمَّ زَارَني في بَيْتِي\n فَحَقٌ عَلَى المَزُوِر أَنْ يُكْرِمَ زَائِرَه \" \nووقف عبد الله بن مسعود على جماعة في المسجد يتذاكرون العلم فقال: بأبي وأمي العلماء\n بروح الله ائتلفتم\n وكتاب الله تلوتم\n ومسجد الله عمرتم\n ورحمة الله انتظرتم\n أحبكم الله\n وأحب من أحبكم\n هـ\n وإنما لم يذكر الإيمان بالرسول صلى الله عليه وسلم لما علم أن الإيمان بالله قرينُه وتمامه الإيمانُ به\n ولدلالة قوله: \" وأقام الصلاة وآتى الزكاة \" عليه\n قال البيضاوي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:88",
      "similarity": 0.5668091962817413
    },
    {
      "verse": "3:22",
      "similarity": 0.5186792592394861
    },
    {
      "verse": "39:65",
      "similarity": 0.5023877082228516
    },
    {
      "verse": "47:9",
      "similarity": 0.501200495597529
    },
    {
      "verse": "7:147",
      "similarity": 0.4789240708797665
    }
  ]
}