{
  "chapter": "التوبة",
  "text": "انما يعمر مسجد الله من ءامن بالله واليوم الءاخر واقام الصلوة وءاتى الزكوة ولم يخش الا الله فعسى او۟لئك ان يكونوا۟ من المهتدين",
  "translations": [
    {
      "translation": "Only those who believe in God and the Last Day, who fulfil their devotional obligations, pay the zakat, and fear no one but God, can visit the mosques of God. They may hope to be among the guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It only becomes those who believe in Allah and the Last Day and establish Prayer and pay Zakah and fear none but Allah to visit and tend the mosques of Allah. These are likely to be guided aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those who believe in God, the Day of Judgment, perform their prayers, pay the religious tax, and have fear of God alone have the right to establish and patronize the mosque of God so that perhaps they will have the right guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those enliven the mosques of Allah who believe in Allah and the Last Day and establish prayer and pay the obligatory charity and fear none except Allah – so it is likely that they will be among the people of guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Masjids of Allah shall be maintained only by those who believe in Allah and the Last Day; perform the Salah, and give Zakah and fear none but Allah. It is they who are on true guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only he shall visit the mosques of Allah who believes in Allah and the latter day, and keeps up prayer and pays the poor-rate and fears none but Allah; so (as for) these, it may be that they are of the followers of the right course.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only he shall inhabit God's places of worship who believes in God and the Last Day, and performs the prayer, and pays the alms, and fears none but God alone; it may be that those will be among the guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He only shall tend Allah's sanctuaries who believeth in Allah and the Last Day and observeth proper worship and payeth the poor-due and feareth none save Allah. For such (only) is it possible that they can be of the rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only he should tend God's houses of worship who believes in God and the Last Day, and is constant in prayer, and spends in charity, and stands in awe of none but God: such people may hope to be among the rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They only shall tend Allah's mosques who believe in Allah and the Last Day and establish prayer and give the poor rate and fear none save Allah. Belike those will be of the guided ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those shall maintain Allah’s mosques who believe in Allah and the Last Day, and maintain the prayer, and give the zakat, and fear no one except Allah. They, hopefully, will be among the guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The mosques of Allah shall be visited and maintained by such as believe in Allah and the Last Day, establish regular prayers, and practise regular charity, and fear none (at all) except Allah. It is they who are expected to be on true guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Mosques of Allah shall be maintained only by those who believe in Allah and the Last Day; perform As-Salat (Iqamat-as-Salat), and give Zakat and fear none but Allah. It is they who are expected to be on true guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "None should inhabit the mosques of Allah except those who believe in Allah and the Last Day, establish their prayers and pay the obligatory charity, and fear none except Allah. May these be among the guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only people to attend God’s places of worship are those who believe in God and the Last Day, and pray regularly, and practice regular charity, and fear none but God. These are most likely to be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The mosques of Allah are only to be maintained by those who believe in Allah and the Last Day and establish prayer and give zakah and do not fear except Allah, for it is expected that those will be of the [rightly] guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:18] Only he shall attend God’s places of worship who believes in God and the Last Day, and observes prayer, and pays the alms, and fears none but God alone; it may be that those will be among the rightly guided.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He only shall tend Allah's sanctuaries) the Inviolable Place of Worship (who believeth in Allah and the Last Day) believes in resurrection after death (and observeth proper worship) fulfils the five daily prayers (and payeth the poor-due) which is obligated (and feareth) and worships (none save Allah. For such (only) is it possible that they can be of the rightly guided) by means of Allah's Religion and clear proof.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبل { إِنَّمَا يَعْمُرُ مَسَٰجِدَ ٱللَّهِ } المعدة لخلاء العبادة والتوجه نحو الحق والمناجاة معه { مَنْ ءَامَنَ بِٱللَّهِ } وتحقق بمرتبة اليقين العلمي في توحيده { وَٱلْيَوْمِ ٱلآخِرِ } الذي يصير الكل إليه { وَأَقَامَ ٱلصَّلَٰوةَ } أي: أدام الميل والرجوع نحو الحق دائماً { وَءَاتَىٰ ٱلزَّكَٰوةَ } تخفيفاً وتطهيراً لنفسها عن العلائق العائقة عن التوجه الحقيقي الحقي { وَلَمْ يَخْشَ إِلاَّ ٱللَّهَ } أي: لم يكن في قلبه خضية من فوات شيء أصلاً إلاَّ من عدم قبول الله أعماله، ومن عدم رضاه سبحانه منه { فَعَسَىٰ } وقرب { أُوْلَـٰئِكَ } السعداء الأماء، الباذلون جهدهم في طريق التوحيد، المشتاقون إلى فضاء الفناء { أَن يَكُونُواْ مِنَ ٱلْمُهْتَدِينَ } [التوبة: 18] المتحققين في مقام الرضا والتسليم وإن وفقوا بالإخلاص من عنده\n\n\n\n\nاصنع بنا ما تحب أنت وترضى يا دليل الحائرين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولم يخش } في أموره كلها { إلا الله } ، فهذا الذي يصلح لعمارة بيت الله، { فعسى أولئك أن يكونوا من المهتدين } ، وعبَّر بعسى، قطعاً لأطماع المشركين في الاهتداء والانتفاع بأعمالهم، وتوبيخاً لهم على القطع بأنهم مهتدون فإن كان اهتداء هؤلاء، مع كمالهم، ودائراً بين عسى ولعل، فما ظنك بأضدادهم؟، ومنعاً للمؤمنين أن يغتروا بأحوالهم فيتكلوا عليها\n وفي الحديث عنه صلى الله عليه وسلم:\n\n \" مَنْ رَأَيْتُمُوهُ يَتَعَاهَدُ المسجِد فاشهدوا لَهُ بالإيمان \" \n",
      "translations": []
    }
  ]
}