{
  "chapter": "التوبة",
  "text": "فسيحوا۟ فى الارض اربعة اشهر واعلموا۟ انكم غير معجزى الله وان الله مخزى الكفرين",
  "translations": [
    {
      "translation": "'You may travel about in the land for four months and know that you cannot thwart Allah and that Allah will humiliate the kafirun.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They can) move about for four months freely in the land, but should know they cannot escape (the law of) God, and that God can put the unbelievers to shame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may go about freely in the land, for four months, but know well that you will not be able to frustrate Allah, and that Allah will bring disgrace upon those who deny the Truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, during the four sacred months, they (pagans) may travel peacefully through the land. Know (pagans) that you cannot make God helpless, but it is God who has the power to disgrace the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Travel freely in the land for four months, and bear in mind that you cannot escape from Allah, and that Allah will humiliate the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So travel freely (O Mushrikin) for four months (as you will) throughout the land, but know that you cannot escape (from the punishment of) Allah; and Allah will disgrace the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So go about in the land for four months and know that you cannot weaken Allah and that Allah will bring disgrace to the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Journey freely in the land for four months; and know that you cannot frustrate the will of God, and that God degrades the unbelievers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Travel freely in the land four months, and know that ye cannot escape Allah and that Allah will confound the disbelievers (in His Guidance).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So go about in the land for four months, but know that you cannot frustrate the plan of God and that God will disgrace those who deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go about, then, in the land for four months. And know that verily ye cannot escape Allah, and that verily Allah is the humiliator of the infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Travel [unmolested] in the land for four months, but know that you cannot frustrate Allah, and that Allah shall disgrace the faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go ye, then, for four months, backwards and forwards, (as ye will), throughout the land, but know ye that ye cannot frustrate Allah (by your falsehood) but that Allah will cover with shame those who reject Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So travel freely (O Mushrikun - see V. 2:105) for four months (as you will) throughout the land, but know that you cannot escape (from the Punishment of) Allah, and Allah will disgrace the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For four months you shall journey freely in the land. But know that you shall not render Allah incapable, and that Allah will humiliate the unbelievers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So travel the land for four months, and know that you cannot escape God, and that God will disgrace the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So travel freely, [O disbelievers], throughout the land [during] four months but know that you cannot cause failure to Allah and that Allah will disgrace the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:2] ‘Journey freely, travel in security, O idolaters, in the land for four months — beginning with [the month of] Shawwāl, on the basis of what will come shortly — after which there will be no security for you, and know that you cannot escape God, that is, you shall [not] elude His punishment, and that God degrades the disbelievers’, humiliating them in this world by having them killed, and in the Hereafter, by [sending them to] the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah said to them (Travel freely in the land) move about in the land beginning from the day of immolation for (four months) safe from being killed because of the treaty, (and know) O disbelievers (that ye cannot escape Allah) that you cannot escape Allah's punishment, by being killed, after the lapse of a the four months (and that Allah will confound the disbelievers) He will punish the disbelievers after four months by subjecting them to death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوعليكم ألاَّ تبادروا ولا تفاجئوا إلى المقاتلة بعد نبذ العهد، بل أمهلوهم وقولا لهم: { فَسِيحُواْ } أي: سيروا أيها المسرفون { فِي ٱلأَرْضِ } أي: في أرضنا هذه آمنين بلا خوف { أَرْبَعَةَ أَشْهُرٍ } قيل: هي عشرون من ذي الحجة وتمام المحرم والصفر، وربيع الأول وعشر من ربيع الآخر، واستعدوا في تلك المدة وهيئوا أسباب القتال فيها { وَٱعْلَمُوۤاْ } أيها المصرون على الشرك يقيناً، وإن زعمتم غلبتكم علينا بمظاهرة إخوانكم واستعانة قبائلكم وعشائركم { أَنَّكُمْ غَيْرُ مُعْجِزِي ٱللَّهِ } أي: لستم غالبين على الله المتعزز برداء العظمة والكبرياء، المتفرد بالمجد والبهاء { وَ } اعلموا أيضاً { أَنَّ ٱللَّهَ } المنتقم من عصاة عباده { مُخْزِي ٱلْكَافِرِينَ } [التوبة: 2] أي: مهينهم ومذلهم وإن أمهلهم زماناً بطريق على تجبرهم وتكبرهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}