{
  "chapter": "التوبة",
  "text": "الذين ءامنوا۟ وهاجروا۟ وجهدوا۟ فى سبيل الله بامولهم وانفسهم اعظم درجة عند الله واو۟لئك هم الفائزون",
  "translations": [
    {
      "translation": "Those who have iman and make hijra and do jihad in the Way of Allah with their wealth and themselves have a higher rank with Allah. They are the ones who are victorious.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who accepted the faith and left their homes and fought in the way of God, wealth and soul, have a greater reward with God, and will be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The higher rank with Allah is for those who believed and migrated and strove in His cause with their belongings and their persons. It is they who are triumphant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To those who have believed in God, left their homes, and fought for His cause with their possessions and in person, God will grant high ranks and success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who accepted faith, and left their homes and fought with their wealth and their lives in Allah’s way have a greater rank before Allah; and it is they who have succeeded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believed and emigrated and strove hard and fought in Allah's cause with their wealth and their lives, are far higher in degree with Allah. They are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believed and fled (their homes), and strove hard in Allah's way with their property and their souls, are much higher in rank with Allah; and those are they who are the achievers (of their objects).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and have emigrated, and have struggled in the way of God with their possessions and their selves are mightier in rank with God; and those -- they are the triumphant;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and have left their homes and striven with their wealth and their lives in Allah's way are of much greater worth in Allah's sight. These are they who are triumphant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have believed and have migrated, and have striven for God's sake with their possessions and persons, stand much higher in God's esteem. It is they who will triumph;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have believed and emigrated and have striven hard in the way of Allah with their riches and their lives are for higher in degree with Allah. Those! they are the achievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have believed and migrated, and waged jihad in the way of Allah with their possessions and persons have a greater rank near Allah, and it is they who are the triumphant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and suffer exile and strive with might and main, in Allah's cause, with their goods and their persons, have the highest rank in the sight of Allah: they are the people who will achieve (salvation).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believed (in the Oneness of Allah - Islamic Monotheism) and emigrated and strove hard and fought in Allah's Cause with their wealth and their lives are far higher in degree with Allah. They are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and migrated, and struggle in the Way of Allah with their wealth and their persons are greater in rank with Allah. It is they who are the winners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and emigrate, and strive in God’s path with their possessions and their persons, are of a higher rank with God. These are the winners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ones who have believed, emigrated and striven in the cause of Allah with their wealth and their lives are greater in rank in the sight of Allah. And it is those who are the attainers [of success].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:20] Those who believe, and have emigrated, and have struggled in the way of God with their possessions and their lives are greater in degree, in rank, with God, than others; and those, they are the triumphant, the ones who will attain good.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who believe) in Muhammad (pbuh) and in the Qur'an, (and have left their homes) migrating from Mecca to Medina (and striven with their wealth and their lives) by spending their wealth and sacrificing their lives (in Allah's way) in obedience of Allah (are of much greater worth) have much greater merit (in Allah's sight) than others. (These are they who are triumphant) they have gained Paradise and been saved from hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ الذينَ آمنوا } علماً { وهاجروا } الرغائب الحسية والمواطن النفسية بالسلوك في سبيل الله وجاهدوا بأموال معلوماتهم ومراداتهم ومقدوراتهم بمحو صفاتهم في صفات الله { وأنفسهم } بإفنائها في ذات الله { أولئك أعْظَم دَرَجة } في التوحيد { عند الله }",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ظالبين إفناء أنانياتهم وهوياتهم في هوية الحق { أَعْظَمُ دَرَجَةً عِندَ ٱللَّهِ } وأعلى منزلة ومرتبة ما داموا سالكين سائرين { وَ } بعد وصولهم وانقطاع سلوكم { أُوْلَـٰئِكَ } السعداء الواصلون { هُمُ ٱلْفَائِزُونَ } [التوبة: 20] بما لا عينٌ رأت ولا أذنٌ سمعت\n ولا خطر على قلب بشر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأولئك هم الفائزون } بكل خير\n الظافرون بنيل الحسنى والزلفى عند الله\n دون من عداهم ممن لم يفعل ذلك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:95",
      "similarity": 0.5283298964709657
    },
    {
      "verse": "2:218",
      "similarity": 0.48149207474915073
    },
    {
      "verse": "8:75",
      "similarity": 0.45096396676293016
    },
    {
      "verse": "8:72",
      "similarity": 0.44683072052950007
    },
    {
      "verse": "8:74",
      "similarity": 0.44139334759802
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/9:20.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/9:20.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:20.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}