{
  "chapter": "التوبة",
  "text": "قل ان كان ءاباؤكم وابناؤكم واخونكم وازوجكم وعشيرتكم وامول اقترفتموها وتجرة تخشون كسادها ومسكن ترضونها احب اليكم من الله ورسوله وجهاد فى سبيله فتربصوا۟ حتى ياتى الله بامره والله لا يهدى القوم الفسقين",
  "translations": [
    {
      "translation": "Say: 'If your fathers or your sons or your brothers or your wives or your tribe, or any wealth you have acquired, or any business you fear may slump, or any house which pleases you, are dearer to you than Allah and His Messenger and doing jihad in His Way, then wait until Allah brings about His command. Allah does not guide people who are deviators.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You tell them: \"If your fathers and sons, your brothers and wives and families and wealth, or the business you fear may fail, and the mansions that you love, are dearer to you than God, His Apostle, and struggling in His cause, then wait until God's command arrives, for God does not show transgressors the way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them, (O Prophet): \"If your fathers and your sons and your brothers and your wives and your tribe and the riches you have acquired and the commerce of which you fear a slackening, and the dwellings that you love, if they are dearer to you than Allah and His Messenger and striving in His cause, then wait until Allah brings about His decree. Allah does not guide the evil-doing folk.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them, \"If your fathers, children, brothers, spouses, relatives, the property that you possess, the trade you fear may have no profit and the homely life are more beloved to you than God, His Messenger and fighting for His cause, wait until God fulfills His decree (of making the right distinct from the wrong). God does not guide the evil-doers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “If your fathers, and your sons, and your brothers, and your wives, and your tribe, and your acquired wealth, and the trade in which you fear a loss, and the houses of your liking – if all these are dearer to you than Allah and His Noble Messenger and fighting in His way, then wait until Allah brings about His command; and Allah does not guide the sinful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If your fathers, your sons, your brothers, your spouses, your kindred, the wealth that you have gained, the commerce in which you fear a decline, and the dwellings in which you delight are dearer to you than Allah and His Messenger, and striving hard and fighting in His cause, then wait until Allah brings about His decision (torment). And Allah guides not the people who are rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If your fathers and your sons and your brethren and your mates and your kinsfolk and property which you have acquired, and the slackness of trade which you fear and dwellings which you like, are dearer to you than Allah and His Apostle and striving in His way, then wait till Allah brings about His command: and Allah does not guide the transgressing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If your fathers, your sons, your brothers, your wives, your clan, your possessions that you have gained, commerce you fear may slacken, dwellings you love -- if these are dearer to you than God and His Messenger, and to struggle in His way, then wait till God brings His command; God guides not the people of the ungodly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If your fathers, and your sons, and your brethren, and your wives, and your tribe, and the wealth ye have acquired, and merchandise for which ye fear that there will no sale, and dwellings ye desire are dearer to you than Allah and His messenger and striving in His way: then wait till Allah bringeth His command to pass. Allah guideth not wrongdoing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If your fathers and your sons and your brothers and your spouses and your tribe, and the worldly goods which you have acquired, and the commerce which you fear will decline, and the homes you love are dearer to you than God and His Messenger and the struggle for His cause, then wait until God fulfills His decree. God does not guide the disobedient people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: if you fathers and your sons and your brothers and your wives and your family and the riches ye have acquired and the traffic wherein ye fear a slackening and the dwellings which please you are dearer unto you than Allah and His apostle and striving in His cause, then wait until Allah bringeth about His decree, and Allah guideth not the ungodly people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘If your fathers and your sons, your brethren, your spouses, and your kinsfolk, the possessions that you have acquired, the business you fear may suffer, and the dwellings you are fond of, are dearer to you than Allah and His Apostle and to waging jihad in His way, then wait until Allah issues His edict, and Allah does not guide the transgressing lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If it be that your fathers, your sons, your brothers, your mates, or your kindred; the wealth that ye have gained; the commerce in which ye fear a decline: or the dwellings in which ye delight - are dearer to you than Allah, or His Messenger, or the striving in His cause;- then wait until Allah brings about His decision: and Allah guides not the rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If your fathers, your sons, your brothers, your wives, your kindred, the wealth that you have gained, the commerce in which you fear a decline, and the dwellings in which you delight  are dearer to you than Allah and His Messenger, and striving hard and fighting in His Cause, then wait until Allah brings about His Decision (torment). And Allah guides not the people who are Al-Fasiqun (the rebellious, disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If your fathers, your sons, your brothers, your wives, your tribes, the property you have acquired, the merchandise you fear will not be sold, and the homes you love, are dearer to you than Allah, His Messenger and the struggling for His Way, then wait until Allah shall bring His command. Allah does not guide the evildoers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “If your parents, and your children, and your siblings, and your spouses, and your relatives, and the wealth you have acquired, and a business you worry about, and homes you love, are more dear to you than God, and His Messenger, and the struggle in His cause, then wait until God executes His judgment.” God does not guide the sinful people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"If your fathers, your sons, your brothers, your wives, your relatives, wealth which you have obtained, commerce wherein you fear decline, and dwellings with which you are pleased are more beloved to you than Allah and His Messenger and jihad in His cause, then wait until Allah executes His command. And Allah does not guide the defiantly disobedient people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:24] Say: ‘If your fathers, and your sons, and your brothers, and your wives, and your clan, your kinsmen (‘ashīratukum: a variant reading has ‘ashīrātukum), and the possessions which you have acquired, and merchandise for which you fear there may be no sale, no longer viable, and dwellings which you love, are dearer to you than God and His Messenger and struggling in His way, so that you have refrained from emigrating and struggling for the sake of such [things], then wait until God brings about His command — this is meant as a threat to them. And God does not guide the wicked folk’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad: (If your fathers, and your sons, and your brethren, and your wives, and your tribe) your folk who are in Mecca, (and the wealth ye have acquired) you have earned, (and merchandise for which ye fear that there will be no sale) that will not be spent in Medina, (and dwellings) houses (ye desire) to live in (are dearer to you than Allah) than Allah's obedience (and His messenger) and dearer to you than migrating to His Messenger (and striving in His way) for the sake of His obedience: (then wait till Allah bringeth His command to pass) His punishment, i.e. killing upon the Conquest of Mecca. Those who migrated after this (Allah guideth not) He does not lead to His religion (wrong-doing folk) the disbelievers: those who not deserve it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل للمؤمنين الذين يقصدون موالاة أنسابهم: { إِن كَانَ آبَاؤُكُمْ وَأَبْنَآؤُكُمْ وَإِخْوَانُكُمْ وَأَزْوَاجُكُمْ وَعَشِيرَتُكُمْ } أي: أقاربكم وذووا أرحامكم { وَأَمْوَالٌ ٱقْتَرَفْتُمُوهَا } أي: اكتسبتموها بأيدكم { وَتِجَارَةٌ تَخْشَوْنَ كَسَادَهَا } لمضي وقت ربحها ونمائها { وَمَسَاكِنُ } طيبة { تَرْضَوْنَهَآ } أي: ترضى بها نفسوكم، وتطيب بها قلوبكم { أَحَبَّ إِلَيْكُمْ مِّنَ ٱللَّهِ } المحبوب في قلوب أوليائه { وَرَسُولِهِ } الذي هو حبيبه وخليله { وَ } من { جِهَادٍ } هو عبارة عن الاجتهاد { وَجِهَادٍ فِي سَبِيلِهِ } لتفوزوا بشرف الوصول والشهود { فَتَرَبَّصُواْ } أي: فعليكم أن تتربصوا وتنتظروا { حَتَّىٰ يَأْتِيَ ٱللَّهُ } المنتقم من المتخذين لغيرهم أولياء { بِأَمْرِهِ } الموجب لعذابه { وَٱللَّهُ } الهادي لعباده { لاَ يَهْدِي ٱلْقَوْمَ ٱلْفَاسِقِينَ } [التوبة: 24] الخارجين عن مقتضى ولائه وولايته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل إِن كان آباؤكُم وأبناؤكُم وإِخوانُكم وعشيرتُكم } أي: أصحابكم، أو أقرباؤكم، { وأموال اقترفتُموها } اكتسبتموها، { وتجارة تخشوْنَ كسادَهَا } أي: فوات وقت إنفاقها، { ومساكنُ ترضونها } لحسنها وسعتها، فإن كان ذلك { أحبَّ إليكم من الله ورسولهِ } أي: من الإيمان بالله وصحبة ورسوله، { وجهادِ في سبيله } ، فآثرتم ذلك، وتخلفتم عن الإيمان والهجرة، { فتربصوا حتى يأتي اللَّهُ بأمره } أي: بعقوبة عاجلة أو آجلة، أو بنصر وفتح على المؤمنين، كفتح مكة وغيرها، والمراد بالمحبة: الاختيارية دون الطبيعة فإنها لا تدخل تحت التكليف، والتحفظ عنها لأن حب الأوطان والعشائر طبيعي، والحب المكلف به اختياري، بحيث يجاهد نفسه في إبدال الطبيعي بالاختياري\n ثم هدد من وقف مع حب الأوطان بقوله: { والله لا يهدي القوم الفاسقين } لا يرشدهم ولا يوفقهم\n وفي الآية تهديد عظيم، وقلَّ من تحفظ عنه\n قاله البيضاوي\n الإشارة: الهجرة من أوطان الغفلة واجبة، ومفارقة الأصحاب والعشائر الذين لا يوافقون العبد على النهوض إلى الله فريضة، فيجب على المريد أن يهاجر من البلد التي لا يجد فيها قلبه، ولا يجد فيها من يتعاون به على ربه، كائنة ما كانت، وما رأينا ولياً قط أنتج في بلده، إلا القليل، فلما هاجر صلى الله عليه وسلم من وطنه إلى المدينة\n وحينئذ نصر الدين، بقيت سنة في الأولياء، لا تجد ولياً يعمر سوقُه إلا في غير بلده، ويجب عليه أيضاً أن يعتزل من يشغله عن الآباء والأبناء والأزواج والعشائر، وكذلك الأموال والتجارات التي تشغل قلبه عن الله، بعد أن يقيم في أولاده حقوق الشريعة، فاللبيب هو الذي يجمع بين الحقيقة والشريعة، فلا يضيع من يعول، ولا يترك حق من يتعلق به من الزوجة أو غيرها، ويذكر الله مع ذلك، فيخالطهم بحسه، ويفارقهم بقلبه، فإن لم يستطع وأراد دواء قلبه فليخير الزوجة، ويُوكل من ينوب عنه في القيام بحقوق العيال، حتى يقوى قلبه ويتمكن مع ربه،\n\n[الطلاق: 2 ـ 3]\n\n\nولإبراهيم بن أدهم رضي الله عنه:\n",
      "translations": []
    }
  ]
}