{
  "chapter": "التوبة",
  "text": "لقد نصركم الله فى مواطن كثيرة ويوم حنين اذ اعجبتكم كثرتكم فلم تغن عنكم شيـا وضاقت عليكم الارض بما رحبت ثم وليتم مدبرين",
  "translations": [
    {
      "translation": "Allah has helped you on many occasions, including the Day of Hunayn* when your great numbers delighted you but did not help you in any way, and the earth seemed narrow to you for all its great breadth, and you turned your backs.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed God has helped you on many occasions, even during the battle of Hunain, when you were elated with joy at your numbers which did not prove of the least avail, so that the earth and its vast expanse became too narrow for you, and you turned back and retreated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah has succoured you before on many a battlefield, and (you have yourselves witnessed His succour to you) on the day of Hunayn when your numbers made you proud, but they did you no good, and the earth, for all its vastness, constrained you, and you turned your backs in retreat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has helped you on many occasions including the day of Hunayn (name of a place near Mecca). When you were happy with the number of your men who proved to be of no help to you and the whole vast earth seemed to have no place to hide you (from your enemies) and you turned back in retreat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah helped you on many occasions – and on the day of Huneyn – when you prided in your multitude, so it did not benefit you at all, and the earth despite being vast became restricted for you – then you turned back and returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, Allah has given you victory on many battlefields, and on the day of Hunayn (battle) when you rejoiced at your great number, but it availed you naught and the earth, vast as it is, was straitened for you, then you turned back in flight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly Allah helped you in many battlefields and on the day of Hunain, when your great numbers made you vain, but they availed you nothing and the earth became strait to you notwithstanding its spaciousness, then you turned back retreating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has already helped you on many fields, and on the day of Hunain, when your multitude was pleasing to you, but it availed you naught, and the land for all its breadth was strait for you, and you turned about, retreating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath given you victory on many fields and on the day of Huneyn, when ye exulted in your multitude but it availed you naught, and the earth, vast as it is, was straitened for you; then ye turned back in flight;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, God has helped you on many occasions. On the day of Hunayn, when you took pride in your great numbers, they proved of no avail to you -- for the earth, despite all its vastness, became [too] narrow for you and you turned back, in retreat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly Allah hath succoured you on many fields and on the day of Hunain, When your number elated you; then it availed you naught, and the earth, wide as it is, straitened unto you; then ye turned away in retreat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has certainly helped you in many situations, and on the day of Hunayn, when your great number impressed you, but it did not avail you in any way, and the earth became narrow for you in spite of its expanse, whereupon you turned your backs [to flee].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly Allah did help you in many battle-fields and on the day of Hunain: Behold! your great numbers elated you, but they availed you naught: the land, for all that it is wide, did constrain you, and ye turned back in retreat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly Allah has given you victory on many battle fields, and on the Day of Hunain (battle) when you rejoiced at your great number but it availed you naught and the earth, vast as it is, was straitened for you, then you turned back in flight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has helped you on many a battlefield. In the Battle of Hunain, when your numbers were pleasing you they availed you nothing; the earth, for all its vastness, seemed to close in upon you and you turned your backs and fled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has given you victory in numerous regions; but on the day of Hunayn, your great number impressed you, but it availed you nothing; and the land, as spacious as it was, narrowed for you; and you turned your backs in retreat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has already given you victory in many regions and [even] on the day of Hunayn, when your great number pleased you, but it did not avail you at all, and the earth was confining for you with its vastness; then you turned back, fleeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:25] God has already helped you on many fields, of battle, such as Badr, and [against] Qurayza and al-Nadīr, and, remember, on the day of Hunayn — a valley between Mecca and Tā’if; that is, [remember] the day on which you fought Hawāzin — this was in Shawwāl in year 8 [of the Hijra], when (idh substitutes for yawma, ‘the day’) your vast numbers were pleasing to you, such that you were saying, ‘We shall not be defeated today, not on account of our being few’: and they numbered 12,000, while the disbelievers were 4,000); but it availed you nothing and the earth, for all its breadth (bi-mā rahubat, the mā refers to the verbal noun, in other words [understand it as being] ma‘a rahbihā, ‘despite its breadth’), it was straitened for you, such that you could not find a place in which you felt secure, because of the severe fear that afflicted you; then you turned back, retreating, fleeing: the Prophet (s), however, on his white mule remained firm, with only al‘Abbās by his side, while Abū Sufyān was charging on his mount.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah hath given you victory on many fields) on many battlefields (and on the day of Hunayn) and especially on the day of Hunayn, a valley between Mecca and Ta'if, (when ye exulted in your multitude) when you were pleased by your sheer numbers. They were then 10,000 men (but it availed you naught) but your multitude did not prevent your defeat, (and the earth, vast as it is, was straitened for you) because of fear; (then ye turned back in flight) from the enemy, who consisted of 4,000 men;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكروا أيها المؤمنون { لَقَدْ نَصَرَكُمُ ٱللَّهُ } الحفيظ الرقيب عليكم { فِي مَوَاطِنَ } ومواقع { كَثِيرَةٍ } حين لا ينفعكم أحسابكم وأنسابكم شيئاً\n لا سيما في حرابكم مع هوازن وثقيف { وَيَوْمَ حُنَيْنٍ } هو وادس بين مكة والطائف { إِذْ أَعْجَبَتْكُمْ كَثْرَتُكُمْ } أن تكونوا مغلوبين\n إذ أنتم اثنا عشر ألفاً\n وعدوكم أربعة آلاف { فَلَمْ تُغْنِ } حينئذٍ كثرتكم { عَنكُمْ شَيْئاً } من غلبة العدو مع قلتهم { وَ } صرتم من غاية رعبكم وخوفكم إلى حيث { ضَاقَتْ عَلَيْكُمُ ٱلأَرْضُ بِمَا رَحُبَتْ } أي: مع وسعتها فلم تجدوا فيها مقراً تمكنون عليها من غاية رهبتكم { ثُمَّ } أدى أمركم وخوفكم إلى أن { وَلَّيْتُم } ورجعتم { مُّدْبِرِينَ } [التوبة: 25] صائرين ظهركم على العدو\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ويوم حنين }: عطف على { مواطن } ، أو منصوب بفعل مضمر، وهذا أحسن لأن قوله: { إذ أعجبتكم كثرتكم } خاص بيوم حنين\n انظر: ابن جزي\n يقول الحق جل جلاله: في تذكيرهم بالنعم: { لقد نصَركُم اللَّهُ في مواطنَ كثيرةٍ } أي: في مواقف الحرب ومداحضها في مواضع كثيرة، { و } نصركم أيضاً { يومَ حُنينٍ } ، وهي غزوة كانت بعد فتح مكة، متصلة بها، في موضع يقال له: حنين، سمي باسم رجل كان يسكنه، وهو وادٍ بين مكة والطائف، حارب فيه رسول الله صلى الله عليه وسلم والمسلمون، وكانوا اثنى عشر ألفاً: عشرة آلاف من الذين حضروا فتح مكة، وألفان انضموا إليهم من الطلقاء، قاتلوا هوازن وثقيف ومن انضم إليهم من قبائل العرب\n وكانوا ثلاثين ألفاً، فلما التقوا مع بعض المشركين قال بعض المسلمين: لن نُغلَبَ اليوم من قلة، إعجاباً بكثرتهم، واقتتلوا قتالاً شديداً، فأدرك المسلمين إعجابهم، واعتمادهم على كثرتهم، فانهزموا حتى وصل جُلهم إلى مكة، وبقي رسول الله صلى الله عليه وسلم في مركزه، ليس معه إلا عمه العباس، آخذاً بلجامه، وابن عمه أبو سفيان بن الحارث، وناهيك شهادة على تناهي شجاعته صلى الله عليه وسلم، فقال العباس ـ وكان صيِّتاً ـ: صِحْ بالناس، فنادى: يا عباد الله، يا أصحاب الشجرة، يا أصحاب سورة البقرة، فكروا عنقاً واحداً، يقولون: لبيك لبيك، ونزلت الملائكة، فالتقوا مع المشركين، فقال ـ عليه الصلاة والسلام ـ:\n\n \" هذا حين حَمِي الوَطيس \" \n\n، ثم أخذ كفاً من تراب فرماهم، وقال:\n\n \" شاهت الوجوه \" \n\n، ثم قال:\n\n \" انهزموا وربِّ الكعبة \" \n\n، فانهزموا\n فأشار تعالى إلى مقالتهم معاتباً لهم عليها بقوله: { إذْ أعجبتكُم كثرتُكم فلم تُغن عنكم شيئاً } أي: فلم تُغن تلك الكثرة عنكم شيئاً من الإغناء، أو من أمر العدو\n وهذه المقالة صدرت من غير النبي صلى الله عليه وسلم كما تقدم لأنه معصوم من الإعجاب، وإن ثبت أنه قال ذلك فليس على وجه الإعجاب، بل على وجه الإخبار، وعلى ذلك جرى الحكم في المذهب: من حرمة الفرار عند بلوغ اثني عشر ألفاً، وكان المسلمون يومئذ اثني عشر ألفاً بالطلقاء وهم مسلمة الفتح: وكانوا ألفين، وسُموا بالطلقاء لمنّ النبي صلى الله عليه وسلم عليهم، يقال لمن أطلق من أسر: طليق، وجمعه على طلقاء نادر لأنه يشترط في فعيل، الذي يجمع على فعلاء، أن يكون بمعنى فاعل، كظريف وشريف، لا بمعنى مفعول، كدفين ودفنى، وسخين وسخنى، منه\n طليق\n ثم قال تعالى: { وضاقتْ عليكم الأرضُ بما رحُبَتْ } برحبها، أي: ضاقت على كثرة اتساعها، فلم تجدوا فيها مكاناً تطمئن إليه نفوسكم من الدهش، { ثم وليتم مدبرين } هاربين عن رسول الله صلى الله عليه وسلم، { ثم أنزل الله سكينته } أي: طمأنينته { على رسوله وعلى المؤمنين } بعد انهزامهم، فرجعوا وقاتلوا، أو على من بقي مع الرسول صلى الله عليه وسلم، ولم يفروا\n\n\nوإعادة الجار للتنبيه على اختلاف حالهما",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:118",
      "similarity": 0.21178884401494535
    },
    {
      "verse": "38:60",
      "similarity": 0.18102868518976406
    },
    {
      "verse": "38:59",
      "similarity": 0.1448090712709277
    },
    {
      "verse": "15:97",
      "similarity": 0.06813334846310795
    },
    {
      "verse": "16:127",
      "similarity": 0.06609945180255092
    }
  ]
}