{
  "chapter": "التوبة",
  "text": "ثم انزل الله سكينته على رسوله وعلى المؤمنين وانزل جنودا لم تروها وعذب الذين كفروا۟ وذلك جزاء الكفرين",
  "translations": [
    {
      "translation": "Then Allah sent down His serenity on His Messenger and on the muminun, and sent down troops you could not see, and punished those who were kafir. That is how the kuffar are repaid.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then God sent down a sense of tranquility on His Apostle and the faithful; and sent down troops invisible to punish the infidels. This is the recompense of those who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Allah caused His tranquillity to descend upon His Messenger and upon the believers, and He sent down hosts whom you did not see, and chastised those who disbelieved. Such is the recompense of those who deny the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God gave confidence to His Messenger and the believers and helped them with an army which you could not see. God punished the unbelievers; this is the only recompense that the unbelievers deserve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Allah sent down His calm upon His Noble Messenger and upon the Muslims, and sent down armies you did not see, and punished the disbelievers; and such is the reward of the deniers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Allah did send down His Sakinah (tranquillity) on His Messenger, and on the believers, and sent down forces (angels) which you saw not, and punished the disbelievers. Such is the recompense of disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Allah sent down His tranquillity upon His Apostle and upon the believers, and sent down hosts which you did not see, and chastised those who disbelieved, and that is the reward of the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then God sent down upon His Messenger His Shechina, and upon the believers, and He sent down legions you did not see, and He chastised the unbelievers; and that is the recompense of the unbelievers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Allah sent His peace of reassurance down upon His messenger and upon the believers, and sent down hosts ye could not see, and punished those who disbelieved. Such is the reward of disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God caused His tranquillity to descend upon His Messenger and the faithful: and sent down forces which you did not see: He punished those who denied the truth, for such is the recompense of all who deny the truth,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter Allah sent down His calm upon His apostle and upon the believers, and He sent down hosts ye saw not and tormented those who would disbelieve: such is the meed of the infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Allah sent down His composure upon His Apostle and upon the faithful, and He sent down hosts you did not see, and He punished the faithless, and that is the requital of the faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah did pour His calm on the Messenger and on the Believers, and sent down forces which ye saw not: He punished the Unbelievers; thus doth He reward those without Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Allah did send down His Sakinah (calmness, tranquillity and reassurance, etc.) on the Messenger (Muhammad SAW), and on the believers, and sent down forces (angels) which you saw not, and punished the disbelievers. Such is the recompense of disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, Allah caused His tranquility (sechina) to descend upon His Messenger and the believers; He sent legions you did not see and sternly punished the unbelievers. Such is the recompense of the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then God sent down His serenity upon His Messenger, and upon the believers; and He sent down troops you did not see; and He punished those who disbelieved. Such is the recompense of the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Allah sent down His tranquillity upon His Messenger and upon the believers and sent down soldiers angels whom you did not see and punished those who disbelieved. And that is the recompense of the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:26] Then God sent down His Spirit of Peace, His reassurance, upon His Messenger and upon the believers, and so they turned back towards the Prophet (s), after al-‘Abbās called them, with his [the Prophet’s] permission, and they fought [once again]; and He sent down legions, of angels, you did not see, and chastised the disbelievers, with slaughter and capture, and that is the requital of the disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then Allah sent His peace of reassurance) His tranquillity (down upon His messenger and upon the believers, and sent down hosts) from heaven (ye could not see) meaning angels, to assist the believers, (and punished those who disbelieved) through their killing and defeat. The reference here is to the clan of Malik Ibn 'Awf al-Dahmani, and to that of Kinanah Ibn 'Abd Yalayl al-Thaqafi. (Such is the reward of disbelievers) in the life of this world. 196\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ أَنَزلَ ٱللَّهُ سَكِينَتَهُ } فالسّكينةُ: الوَقارُ، والسُّكونُ والطُّمأَنينةُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High: { Then Allah sent down His tranquility } So the tranquility: the dignity, and the calm and the security.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } بعد انهزامكم وإدباركم { أَنَزلَ ٱللَّهُ } المولي لأموركم { سَكِينَتَهُ } أي: رحمته الموجبة للقرار والوقار، والطمأنينة { عَلَىٰ } قلب { رَسُولِهِ وَعَلَى } قلوب { ٱلْمُؤْمِنِينَ } الذين تمكنوا معه، واستقروا حوله؛ اتكالاً على الله وإتفاقاً مع رسوله صلى الله عليه وسلم { وَ } بتثبيت الرسول وتقرير من تبعه { أَنزَلَ } سبحانه نصرةً لنبيه من الملائكة { جُنُوداً } مجندة { لَّمْ تَرَوْهَا } عيونكم { وَعذَّبَ ٱلَّذِينَ كَفَرُواْ } ينزولها عذاباً شديداً من القتل والأسر والإذلال في النشأة الأولى والأخرى بأضعافها { وَذٰلِكَ } أي: ما لحقهم من أنواع الإذلال { جَزَآءُ ٱلْكَافِرِينَ } [التوبة: 26] المحاربين مع الله ورسوله\n\n\n\n\n \" رُوي أن رسول الله صلى الله عليه وسلم خرج بعد فتح مكة، ثمَّ توجه نحو حنين؛ لقتال هوازن وثقيف مع عشرة آلاف من المهاجرين وألفين من الطلقاء، وكان العدو أربعة آلاف فأعجب المسلمين كثرتهم، فلمَّا التقوا، فقالوا: لن نُغلب اليوم؛ لأن العدو في غاية القلة فكره الله قولهم وإعجابهم هذا، فاقتتلوا قتالاً عظيماً فغلب العدو عليهم، فولوا منهزمين فبقي رسول الله صلى الله عليه وسلم مع شرذمة قليلة فأراد أن يقتحم على العدو، وذلك عند نزول الملائكة، فقال: \" أَنَا النَّبِيُّ لا كَذِبْ، أَنَا ابْنُ عَبْد الْمُطَّلِبْ، الآنَ حَمِيَ الْوَطِيسُ \" أي: التنور\n \n\n \n\n فأمر العباس أن يصيح على الناس المنهزمين فصاح: يا عبد الله، يا أصحاب الشجرة، يا أصحاب سورة البقرة، فكروا عنقاً واحداً، فاستقبلوا قائلين: لبيك لبيك فصفوا خلف الملائكة وازدحموا، وهجموا على العدو، والريح من خلفهم ومن أمام عدوهم فانهزم العدو بنصر الله وتأييده \" \n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأنزل جنوداً } من الملائكة { لم تروها } بأعينكم، وكانوا خمسة آلاف، أو ثمانية، أو ستة عشر، على اختلاف الأقوال\n { وعذَّبَ الذين كفروا } بالقتل والأسر والسبيٍ، { وذلك جزاءُ الكافرين } أي: ما فعل بهم هو جزاء كفرهم في الدنيا، { ثم يتوبُ الله من بعد ذلك على من يشاء } منهم، بالتوفيق للإسلام، { والله غفور رحيم } يتجاوز عنهم ويتفضل عليهم بالتوفيق والهداية\n رُوي أن أناساً منهم جاؤوا إلى رسول الله صلى الله عليه وسلم وأسْلَمُوا، وقالوا: يا رسولَ الله، أنْتَ خيرُ الناس وأبرهم، وقد سُبي أهلُونا وأولادُنا، وأُخِذَتْ أموالُنَا ـ وقد سُبي يومئذ ستة آلاف نفس، وأخذ من الإبل والغنم ما لا يحصى، فقال:\n\n \" اختاروا، إما سَبْيكُمْ، وإما أمْوالَكُم \"\n \n\nفقالوا ما كُنَّا نَعدِلُ الأحسابِ شيئأً، فمنْ كان بيَدِهِ سبي فطابتْ نفسُهُ أنْ يرُدَّهُ فشأنُهُ، ومن لا، فليُعْطِنَا، وليكُنْ قَرْضاً علينا حتَّى نُصيب شيئاً فنُعطِيِه مثله \" ، فقالوا: رضينا وسَلَّمنا، فقال:\n\n \" إنِّي لا أدري، لَعَلَّ فِيكُمْ مَنْ لا يَرضَى، فارجعوا حتى يرفع إِليَّ عُرفَاوكُمُ أمرَكم \" \n\nفرفعوا إليه أمْرَهمْ، وقالوا: قد رضُوا، فردَّ السبي إليهم، وقسم الأموال في المؤلفة قلوبهم، ترغيباً في تسكين قلوبهم للإسلام\n والغزوة مطولة في كتب السيرة، والله تعالى أعلم\n الإشارة: لقد نصركم الله، يا معشر المريدين، على جهاد نفوسكم وتيسير أموركم، في مواطن كثيرة، إذا رجعتم إلى ربكم، واعتزلتم من حولكم وقوتكم في جميع أموركم، فمن علامة النجاح في النهاية الرجوع إلى الله في البداية، ما تعذر مطلب أنت طالبه بربك، ولا تيسر مطلب أنت طالبه بنفسك، فمن رجع إلى نفسه، أو استند إلى عقله وحدسه، لم تغن عنه شيئاً، وضاقت عليه الأرض بما رحبت، ورجع من حيث جاء، فإن انتبه، ورجع إلى ربه، أنزل سكينة عليه، وأيده باليقين، ورجا أن يدرك أمله من رب العالمين\n قال الورتجبي: قوله تعالى: { ثم أنزل الله سكينتة على رسوله } ، سكينته ـ عليه الصلاة والسلام ـ زيادة أنوار كشف مشاهدة الله، له، حين خاف من مكر الأزل، فأراه الله اصطفائيته الأزلية، وأمنة من مكره، لا أنه ينظر من الحق إلى نفسه طرفة عين، لكن إذا غاب في بحر القدم لم ير للحدث اثراً، ورأى الحدثان متلاشية في فيض العظمة، ففزع منه به، فآواه الله منه إليه، حتى سكن به عنه\nهـ\n ثم أمر بمنع المشركين من دخول البيت الحرام، فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُوۤاْ إِنَّمَا ٱلْمُشْرِكُونَ نَجَسٌ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "48:4",
      "similarity": 0.625541132203545
    },
    {
      "verse": "36:28",
      "similarity": 0.5996473776735054
    },
    {
      "verse": "48:7",
      "similarity": 0.5256891807909672
    },
    {
      "verse": "33:9",
      "similarity": 0.5088362679775764
    },
    {
      "verse": "37:173",
      "similarity": 0.4675204641851048
    }
  ]
}