{
  "chapter": "التوبة",
  "text": "يايها الذين ءامنوا۟ انما المشركون نجس فلا يقربوا۟ المسجد الحرام بعد عامهم هذا وان خفتم عيلة فسوف يغنيكم الله من فضله ان شاء ان الله عليم حكيم",
  "translations": [
    {
      "translation": "You who have iman! the idolaters are unclean, so after this year they should not come near the Masjid al- Haram. If you fear impoverishment, Allah will enrich you from His bounty if He wills. Allah is All-Knowing, All- Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, the idolaters are unclean. So they should not approach the Holy Mosque after this year. In case you fear indigence (from the stoppage of business with them), then God will enrich you of His bounty if He will, for God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, those who associate others with Allah in His Divinity are unclean. So, after the expiry of this year, let them not even go near the Sacred Mosque. And should you fear poverty, Allah will enrich you out of His bounty, if He wills. Surely Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, the pagans are filthy. Do not let them come near to the Sacred Mosque after this year. If you are afraid of poverty, He will make you rich if He wishes, by His favor. God is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! The polytheists are utterly filthy*; so after this year do not let them come near the Sacred Mosque; and if you fear poverty**, then Allah will soon make you wealthy with His grace, if He wills; indeed Allah is All Knowing, Wise. (* Filthy in body and soul. **Due to loss of trade.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Verily, the Mushrikin are impure. So let them not come near Al-Masjid Al-Haram after this year; and if you fear poverty, Allah will enrich you if He wills, out of His bounty. Surely, Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! the idolaters are nothing but unclean, so they shall not approach the Sacred Mosque after this year; and if you fear poverty then Allah will enrich you out of His grace if He please; surely Allah is Knowing Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, the idolaters are indeed unclean; so let them not come near the Holy Mosque after this year of theirs. If you fear poverty, God shall surely enrich you of His bounty, if He will; God is All-knowing; All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! The idolaters only are unclean. So let them not come near the Inviolable Place of Worship after this their year. If ye fear poverty (from the loss of their merchandise) Allah shall preserve you of His bounty if He will. Lo! Allah is Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, know that the polytheists are impure, so they should not approach the Sacred Mosque after this year onwards. If you should fear destitution, God will enrich you out of His bounty, if He so wishes. God is aware and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! the associators are simply filthy; so let them not approach the Sacred Mosque after this their year; and if ye fear poverty, Allah shall presently enrich you out of His grace, if He will. Verily Allah is grace. Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! The polytheists are indeed unclean: so let them not approach the Holy Mosque after this year. Should you fear poverty, Allah will enrich you out of His grace, if He wishes. Indeed Allah is all-knowing, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Truly the Pagans are unclean; so let them not, after this year of theirs, approach the Sacred Mosque. And if ye fear poverty, soon will Allah enrich you, if He wills, out of His bounty, for Allah is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe (in Allah's Oneness and in His Messenger (Muhammad SAW)! Verily, the Mushrikun (polytheists, pagans, idolaters, disbelievers in the Oneness of Allah, and in the Message of Muhammad SAW) are Najasun (impure). So let them not come near Al-Masjid-al-Haram (at Makkah) after this year, and if you fear poverty, Allah will enrich you if He will, out of His Bounty. Surely, Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, the idolaters are unclean. Do not let them approach the Sacred Mosque after this year. If you fear poverty, Allah, if He wills, will enrich you through His bounty. He is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! The polytheists are polluted, so let them not approach the Sacred Mosque after this year of theirs. And if you fear poverty, God will enrich you from His grace, if He wills. God is Aware and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, indeed the polytheists are unclean, so let them not approach al-Masjid al-Haram after this, their [final] year. And if you fear privation, Allah will enrich you from His bounty if He wills. Indeed, Allah is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:28] O you who believe, the idolaters are indeed unclean, [they are] filth, on account of their inner vileness, so do not let them come near the Sacred Mosque, that is, let them not enter the Sanctuary, after this year of theirs, year 9 of the Hijra. If you fear impoverishment, poverty, as a result of the cessation of their commerce with you, God will surely enrich you from His bounty, if He will: and He indeed enriched them through conquests and [the imposition of] the jizya. God is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe! The idolaters only are unclean) impure. (So let them not come near the Inviolable Place of Worship) for pilgrimage and circumambulation (after this their year) the year of freedom from obligation (bara'ah) after the day of immolation. (If ye fear poverty) impoverishment and neediness (Allah shall preserve you of His bounty) of His provision in another way (if He will) when He wills and will make you dispense with trading with Bakr Ibn Wa'il. (Lo! Allah is Knower) of your sustenance, (Wise) in that which He has ordained for you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِنْ خِفْتُمْ عَيْلَةً } معناهُ من الجِريةِ الجَارِيةِ شَهراً فشهراً وعاماً فعاماً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And if you fear poverty} means continuous fear of poverty month after month and year after year.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { يٰأَيُّهَا ٱلَّذِينَ آمَنُوۤاْ } مقتضى إيمانمكم: أن تذبوا وتدفعوا أهل الشرك عن الحرم { إِنَّمَا ٱلْمُشْرِكُونَ } المنغمسون في خباثة الشرك والضلال { نَجَسٌ } يجب أن يُطَّهر بيت الله منهم { فَلاَ يَقْرَبُواْ ٱلْمَسْجِدَ ٱلْحَرَامَ بَعْدَ عَامِهِمْ هَـٰذَا } أي: سنة حجة الوداع { وَإِنْ خِفْتُمْ } أيها المؤمنون\n بسبب إخراجهم ومنعهم عن الحرم { عَيْلَةً } فقراً وقلة زاد ومكتسب { فَسَوْفَ يُغْنِيكُمُ ٱللَّهُ مِن فَضْلِهِ } وسعة رزقه { إِن شَآءَ } ترفهكم واتساعكم { إِنَّ ٱللَّهَ } المدبر لأمور عباده { عَلِيمٌ } بمصالحهم { حَكِيمٌ } [التوبة: 28] في إتيانها عند الحاجة ومقدارها\n\n\nوبالجملة: { قَاتِلُواْ } أيها الغزاة الحماة لدين الله المشركين { ٱلَّذِينَ لاَ يُؤْمِنُونَ بِٱللَّهِ } وتوحيده { وَلاَ بِٱلْيَوْمِ ٱلآخِرِ } المعدّ لجزاء الأعمال\n وإن تفوهوا بالإيمان مداهنةً ونفاقاً لا تبالوا بإيمانهم { وَ } هم ليسوا مراعين مقتضى الإيمان",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "93:8",
      "similarity": 0.44813810963990675
    },
    {
      "verse": "9:126",
      "similarity": 0.1438069727108172
    },
    {
      "verse": "31:14",
      "similarity": 0.129664431584316
    },
    {
      "verse": "29:14",
      "similarity": 0.12778097527307367
    },
    {
      "verse": "12:49",
      "similarity": 0.1253738844840028
    }
  ]
}