{
  "chapter": "التوبة",
  "text": "واذن من الله ورسوله الى الناس يوم الحج الاكبر ان الله برىء من المشركين ورسوله فان تبتم فهو خير لكم وان توليتم فاعلموا۟ انكم غير معجزى الله وبشر الذين كفروا۟ بعذاب اليم",
  "translations": [
    {
      "translation": "A proclamation from Allah and His Messenger to mankind on the day of the greater pilgrimage: 'Allah is free of the idolaters, as is His Messenger. If you make tawba, it will be better for you. But if you turn your backs, know that you cannot thwart Allah.' Give the kuffar the news of a painful punishment -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A general proclamation is (made) this day of the Greater Pilgrimage on the part of God and His Apostle, that God is not bound (by any contract) to idolaters, nor is His Apostle. It is, therefore, better for you to repent. If you do not, remember that you cannot elude (the grip of) God. So announce to those who deny the truth the news of painful punishment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a public proclamation by Allah and His Messenger to all people on the day of the Great Pilgrimage: \"Allah is free from all obligation to those who associate others with Allah in His Divinity; and so is His Messenger. If you repent, it shall be for your own good; but if you turn away, then know well that you will not be able to frustrate Allah. So give glad tidings of a painful chastisement to those who disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Announcement from God and His Messenger is to be made to the people on the day of the great Pilgrimage; God and His Messenger have declared no amnesty for the pagans. If you (pagans) repent, it would be better for you, but if you turn away (from God), know that you cannot make God helpless. (Muhammad) tell the unbelievers that a painful punishment has been prepared for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And proclaim from Allah and His Noble Messenger to all men on the day of the Great Pilgrimage (Haj) that Allah is disgusted with the polytheists, and so is His Noble Messenger; so if you repent it is better for you; but if you turn away, then know that you cannot escape from Allah; and give the disbelievers the glad tidings of a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a declaration from Allah and His Messenger to mankind on the greatest day of Hajj that Allah is free from obligations to the Mushrikin and so is His Messenger. So if you repent, it is better for you, but if you turn away, then know that you cannot escape Allah. And give tidings of a painful torment for those who disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And an announcement from Allah and His Apostle to the people on the day of the greater pilgrimage that Allah and His Apostle are free from liability to the idolaters; therefore if you repent, it will be better for you, and if you turn back, then know that you will not weaken Allah; and announce painful punishment to those who disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A proclamation, from God and His Messenger, unto mankind on the day of the Greater Pilgrimage: 'God is quit, and His Messenger, of the idolaters. So if you repent, that will be better for you; but if you turn your backs; know that you cannot frustrate the will of God. And give thou good tidings to the unbelievers of a painful chastisement;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a proclamation from Allah and His messenger to all men on the day of the Greater Pilgrimage that Allah is free from obligation to the idolaters, and (so is) His messenger. So, if ye repent, it will be better for you; but if ye are averse, then know that ye cannot escape Allah. Give tidings (O Muhammad) of a painful doom to those who disbelieve,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a proclamation from God and His Messenger to the people on the day of the Pilgrimage, that God is free of all obligation to the polytheists, and so is His Messenger. If you repent, it will be better for you, but if you turn away, then know that you cannot frustrate the plan of God. Proclaim a grievous punishment to those who are bent on denying the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a proclamation is this from Allah and His apostle unto the mankind on the day of the greater pilgrimage that Allah is quit of the associators, and so is His apostle. Wherefore if ye repent, it shall be better for you, but if ye turn away, then know that ye cannot escape Allah. And announce thou unto those who disbelieve a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[This is] an announcement from Allah and His Apostle to all the people on the day of the greater Hajj: that Allah and His Apostle repudiate the polytheists: If you repent that is better for you; but if you turn your backs [on Allah], know that you cannot frustrate Allah, and inform the faithless of a painful punishment\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And an announcement from Allah and His Messenger, to the people (assembled) on the day of the Great Pilgrimage,- that Allah and His Messenger dissolve (treaty) obligations with the Pagans. If then, ye repent, it were best for you; but if ye turn away, know ye that ye cannot frustrate Allah. And proclaim a grievous penalty to those who reject Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a declaration from Allah and His Messenger to mankind on the greatest day (the 10th of Dhul-Hijjah - the 12th month of Islamic calendar) that Allah is free from (all) obligations to the Mushrikun (see V. 2:105) and so is His Messenger. So if you (Mushrikun) repent, it is better for you, but if you turn away, then know that you cannot escape (from the Punishment of) Allah. And give tidings (O Muhammad SAW) of a painful torment to those who disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A proclamation from Allah and His Messenger, to the people on the day of the Grand Pilgrimage; 'Allah rejects, and His Messenger (rejects) the idolaters. So if you repent, that will be better for you; but if you turn your backs, know that you cannot frustrate Allah. And give glad tidings to the unbelievers of a painful punishment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a proclamation from God and His Messenger to the people on the day of the Greater Pilgrimage, that God has disowned the polytheists, and so did His Messenger. If you repent, it will be better for you. But if you turn away, know that you cannot escape God. And announce to those who disbelieve a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [it is] an announcement from Allah and His Messenger to the people on the day of the greater pilgrimage that Allah is disassociated from the disbelievers, and [so is] His Messenger. So if you repent, that is best for you; but if you turn away - then know that you will not cause failure to Allah. And give tidings to those who disbelieve of a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:3] A proclamation, a notification, from God and His Messenger to mankind on the day of the Greater Pilgrimage, the Day of Sacrifice (yawm al-nahr), that God is free from obligation to the idolaters, and their pacts, and [so is] His Messenger, also free from obligation: in that same year, year 9 [of the Hijra], the Prophet (s) sent forth ‘Alī, who proclaimed these verses on the Day of Sacrifice at Minā, and also [he proclaimed] that after this year no idolater will [be allowed to] make pilgrimage or circumambulate the House naked, as reported by al-Bukhārī. So, if you repent, of unbelief, it will be better for you; but if you turn away, from belief, then know that you cannot escape God. And give tidings to — inform — those who disbelieve of a painful chastisement, namely, [of] slaughter or capture in this world, and of [punishment in] the Fire in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And a proclamation from Allah) and this is a declaration from Allah (and His messenger to all men on the day of the Greater Pilgrimage) on the day of immolation (that Allah is free from obligation to the idolaters) their religion, and the treaties they broke, (and (so is) His messenger) he is also free from obligation to them. (So, if ye repent) from idolatry and believe in Allah and Muhammad (pbuh) as well as in the Qur'an, (it will be better for you) than idolatry; (but if ye are averse) to faith and repentance, (then know) O idolaters (that ye cannot escape Allah) you cannot escape His punishment. (Give tidings (O Muhammad) of a painful doom to those who disbelieve) i.e. that they will be killed after the elapse of four months.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأَخبرنا أبو جعفر\n قالَ: حدثنا علي بن أحمد\n قال: حدثنا عطاء بن السائب، عن أبي خالد، عن زيد بن علي عليهما السلام في قوله تعالى: { وَأَذَانٌ مِّنَ ٱللَّهِ وَرَسُولِهِ } معناهُ عِلمٌ مِنهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n\n\nHe said: \"Ali ibn Ahmad told us...\"\n\n\n\"It was narrated that 'Ata' ibn Al-Sa'ib narrated from his father that Zayd ibn 'Ali said regarding Allah's statement, {And a call from Allah and His Messenger}, its meaning is 'knowledge from Him.'\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } هذه أيضاً { أَذَانٌ } إعلام وتشييع\n ونداء صدر عنه { مِّنَ ٱللَّهِ وَرَسُولِهِ } بإذنه { إِلَى ٱلنَّاسِ } المجتمعين من أقصى البلاد { يَوْمَ ٱلْحَجِّ ٱلأَكْبَرِ } لأن وقوف يوم عرفة كان يوم الجمعة\n لذلك سمي به { أَنَّ ٱللَّهَ } أي: بأن الله المتعزز بالعظمة والكبرياء { بَرِيۤءٌ مِّنَ ٱلْمُشْرِكِينَ } أي: من عهودهم ومواثيقهم\n لا يؤمنهم بعد عامكم هذا { وَرَسُولُهُ } أيضاً مأمور من عنده بالبراءة ونقض العهد وإسقاط الذمة\n ويعد اليوم ارتفعت الهدنة وصار الأمر الأمر إما بالسيق وإما الإسلام\n\n\n{ فَإِن تُبْتُمْ } ورجعتم عمَّا أنتم عليه من الكفر والشرك إلى الإيمان والتوحيد { فَهُوَ } أي: إيمانكم ورجوعكم { خَيْرٌ لَّكُمْ } في أولاكم وأخراكم { وَإِن تَوَلَّيْتُمْ } وأعرضتم عن الإسلام والإيمان\n وأصررتم على الشرك والطغيان { فَٱعْلَمُوۤاْ أَنَّكُمْ غَيْرُ مُعْجِزِي ٱللَّهِ } أي: لستم غالبين على جنوده { وَ } بالجملة: { بَشِّرِ } يا أكمل الرسل { ٱلَّذِينَ كَفَرُواْ } بالله وأصروا عليه\n ولم يرجعوا عنه مع ورود الزواجر والخوارق { بِعَذَابٍ أَلِيمٍ } [التوبة: 3] في النشأة الاولى بالقتل والسبي والإجلاء\n وفي الآخرة بالحرمان عن رتبة الإنسان",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: وأذان: مبتدأ\n أو خبر\n على ما تقدم في براءة\n وهو فَعال بمعنى إفعال كالعطاء بمعنى الإعطاء\n أي: وإعلام من الله ورسوله واصل إلى الناس\n ورفع \" رسوله \" إما عطف على ضمير برئ\n أو على محل \" إن \" واسمها\n أو مبتدأ حُذف خبره\n أي: ورسوله كذلك\n يقول الحق جل جلاله: { وأذانٌ من الله ورسوله } واصل إلى الناس\n ويكون { يومَ الحج الأكبر } وهو يوم النحر لأن فيه تمام الحج ومعظم أفعاله\n ولأن الإعلام كان فيه\n ولما روي أنه ـ عليه الصلاة والسلام ـ وقف يوم النحر\n عند الجمرات\n في حجة الوداع فقال:\n \" هذا يوم الحج الأكبر \" \n\n وقيل: يوم عرفة لقوله ـ عليه الصلاة والسلام ـ:\n \" الحج عرفة \" \nووصف الحج بالأكبر لأن العمرة تسمى الحج الأصغر\n وذلك الإعلام بأنَّ { الله بريء من المشركين ورسولُه } ـ عليه الصلاة والسلام ـ كذلك\n قال البيضاوي ولا تكرار فإن قوله: { براءة من الله }: إخبار بثبوت البراءة\n وهذا إخبار بوجوب الإعلام بذلك\n ولذلك علقه بالناس ولم يخص بالمعاهدين\n هـ\n { فإن تُبْتُم } يا معشر الكفار ورجعتم عن الشرك\n { فهو } أي: الرجوع { خيرٌ لكم } \n { وإن توليتم } أي: أعرضتم عن التوبة وأصررتم على الكفر { فاعلموا أنكم غيرُ معجزي الله } لا تفوتونه طلباً\n ولا تعجزونه هرباً في الدنيا\n { وبَشّرِ الذين كفروا بعذاب أليمٍ } في الآخرة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:165",
      "similarity": 0.3615136503096758
    },
    {
      "verse": "2:54",
      "similarity": 0.34859687933787137
    },
    {
      "verse": "42:31",
      "similarity": 0.33754395399176124
    },
    {
      "verse": "9:1",
      "similarity": 0.3357706470552508
    },
    {
      "verse": "29:22",
      "similarity": 0.3341512007010387
    }
  ]
}