{
  "chapter": "التوبة",
  "text": "وقالت اليهود عزير ابن الله وقالت النصرى المسيح ابن الله ذلك قولهم بافوههم يضهـون قول الذين كفروا۟ من قبل قتلهم الله انى يؤفكون",
  "translations": [
    {
      "translation": "The Jews say, \"Uzayr is the son of Allah,' and the Christians say, 'The Messiah is the son of Allah.' That is what they say with their mouths, copying the words of those who were kafir before. Allah fight them! How perverted they are!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say: \"Ezra is the son of God;\" the Christians say: \"Christ is the son of God.\" That is what they say with their tongues following assertions made by unbelievers before them. May they be damned by God: How perverse are they!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say: \"Ezra ('Uzayr) is Allah's son,\" and the Christians say: \"The Messiah is the son of Allah.\" These are merely verbal assertions in imitation of the sayings of those unbelievers who preceded them. May Allah ruin them. How do they turn away from the Truth?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of the Jews have said that Ezra is the son of God and Christians have said the same of Jesus. This is only what they say and it is similar to what the unbelievers who lived before them had said. May God destroy them wherever they exist!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Jews said, “Uzair is the son of Allah”, and the Christians said “The Messiah is the son of Allah”; they utter this from their own mouths; they speak like the former disbelievers; may Allah kill them; where are they reverting!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Jews say: \"Uzayr (Ezra) is the son of Allah,\" and the Christians say: \"The Messiah is the son of Allah.\" That is their saying with their mouths, resembling the saying of those who disbelieved aforetime. May Allah fight them, how they are deluded away from the truth!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Jews say: Uzair is the son of Allah; and the Christians say: The Messiah is the son of Allah; these are the words of their mouths; they imitate the saying of those who disbelieved before; may Allah destroy them; how they are turned away!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say, 'Ezra is the Son of God'; the Christians say, 'The Messiah is the Son of God.' That is the utterance of their mouths, conforming with the unbelievers before them. God assail them! How they are perverted!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Jews say: Ezra is the son of Allah, and the Christians say: The Messiah is the son of Allah. That is their saying with their mouths. They imitate the saying of those who disbelieved of old. Allah (Himself) fighteth against them. How perverse are they!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say, \"Ezra is the son of God,\" and the Christians say, \"The Messiah is the son of God.\" These are but their baseless utterances. They imitate the assertions made in earlier times by those who deny the truth. May God destroy them! How far astray they have been led!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Jews say: Uzair is a child of God; and the Nazarenes say: the Masih is a child of God. That is their saying with their mouth, resembling the saying of those who disbelieved aforetime. May Allah confound them'. whither are they turning away!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say, ‘Ezra is the son of Allah,’ and the Christians say, ‘Christ is the son of Allah.’ That is an opinion that they mouth, imitating the opinions of the faithless of former times. May Allah assail them, where do they stray?!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews call 'Uzair a son of Allah, and the Christians call Christ the son of Allah. That is a saying from their mouth; (in this) they but imitate what the unbelievers of old used to say. Allah's curse be on them: how they are deluded away from the Truth!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Jews say: 'Uzair (Ezra) is the son of Allah, and the Christians say: Messiah is the son of Allah. That is a saying from their mouths. They imitate the saying of the disbelievers of old. Allah's Curse be on them, how they are deluded away from the truth!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say Ezra is the son of Allah, while the Christians (who follow Paul) say the Messiah is the son of Allah. Such are their assertions, by which they imitate those who disbelieved before. Allah fights them! How perverted are they!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews said, “Ezra is the son of God,” and the Christians said, “The Messiah is the son of God.” These are their statements, out of their mouths. They emulate the statements of those who blasphemed before. May God assail them! How deceived they are!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say, \"Ezra is the son of Allah \"; and the Christians say, \"The Messiah is the son of Allah.\" That is their statement from their mouths; they imitate the saying of those who disbelieved [before them]. May Allah destroy them; how are they deluded?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:30] The Jews say: Ezra is the son of God; and the Christians say: The Messiah, Jesus, is the son of God. That is the utterance of their mouths, for which they have no support, nay, imitating the utterances of those who disbelieved before [them], from among their forefathers, mimicking them. God assail, curse, them! How they are deviated!, turned away from the truth, despite the proofs having been established.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the Jews) the Jews of Medina (say: Ezra is the son of Allah, and the Christians) the Christians of Najran (say: The Messiah is the son of Allah. That is their saying with their mouths) with their tongues. (They imitate the saying of those who disbelieved of old) before them, i.e. the disbelievers of Mecca who said that al-Lat, al-'Uzza and Manat were His daughters, just as the Jews claimed that Ezra was the son of Allah and some of the Christians claimed that Jesus was the son of Allah, others that he was Allah's partner while there were others who said that he was Allah Himself or one god among three. (Allah (Himself) fights against them) Allah curses them. (How perverse are they!) from where do they get their lies?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يُضَاهِئُونَ قَوْلَ ٱلَّذِينَ كَفَرُواْ } معناهُ يَقولونَ مِثلَ قَولِهِم وشِبْهَهُ\n\n\n\n\nوقوله تعالى: { قَاتَلَهُمُ ٱللَّهُ } معناه لَعَنَهُمْ الله\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: خذوا الجزية منهم على وجه تضطروهم وتلجئوهم إلى الإيمان وكيف لا يقتل هؤلاء الكفرة المشركون؟! { قَالَتِ ٱلْيَهُودُ } منهم: { عُزَيْرٌ ٱبْنُ ٱللَّهِ } المنزه عن التزوج والازدواج، والأبوة والبنوة؛ إذ هي من لوازم البشر { وَقَالَتْ ٱلنَّصَارَى } أيضاً { ٱلْمَسِيحُ ٱبْنُ ٱللَّهِ } تعالى عمَّا يقول الظالمون علواً كبيراً { ذٰلِكَ } القول المهمل { قَوْلُهُم } دائماً جارياً { بِأَفْوَاهِهِمْ } وأن فرض مخالفة اعتقادهم قولهم فلا أقل: إنهم { يُضَاهِئُونَ } ويشابهون قولهم هذا { قَوْلَ ٱلَّذِينَ كَفَرُواْ } وأشركوا { مِن قَبْلُ } بأمثال هذه المهملات، حيث قالوا: الملائكة بنات الله؛ لذلك { قَاتَلَهُمُ ٱللَّهُ } وأهلكهم بأمثال هذه المقالات المهملة { أَنَّىٰ يُؤْفَكُونَ } [التوبة: 30] أي: كيف يصرفون أيها الناكبون عن الطريق الحق الصريح إلى الباطل الزائغ الزائل؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: عزيز: مبتدأ، و ابن الله: خبر، فمن نونه جعله مصروفاً لأنه عنده عربي، ومن حذف تنوينه: إما لمنعه من الصرف للعلمية والعجمية عنده، وإما لالتقاء الساكنين تشبيهاً للنون بحروف اللين، وهو ضعيف، والأول أحسن\n يقول الحق جل جلاله: { وقالت اليهودُ عُزَيرٌ ابنُ الله } ، قال ابن عباس: هذه المقالة قالها أربعة منهم، وهم: سَلامُ بن مُشْكم، ونُعْمَانُ أو لُقْمَانُ بْنُ أَوفَى، وشَاسُ بنُ قَيس، وَمَالِكُ بْنُ الصَّيْفِ\n وقيل: لم يقلها إلا فنحاص، ونسب ذلك لجميعهم لسكوتهم عنه\n قال البيضاوي: إنما قال ذلك بعضهم من متقدميهم، أو ممن كانوا بالمدينة، وإنما قالوا ذلك لأنه لم يبق فيهم بعد وقعة بختنصر من يحفظ التوراة، وهو ـ أي عزير ـ لما أحياه الله بعد مائة عام، أملى عليهم التوراة حفظاً، فتعجبوا من ذلك، وقالوا: ما هذا إلا أنه ابن الله، والدليل على أن هذا القول كان فيهم أن الآية قُرئت عليهم فلم يكذبوا مع تهالكهم على التكذيب\n هـ\n { وقالت النصارى المسيحُ ابنُ الله } ، هو أيضاً قول بعضهم، وإنما قالوه استحالة أن يكون الولد بلا أب، أو لما كان يفعل من إبراء الأكمه والأبرص وإحياء الموتى، وتقدم الرد عليهم، وسبب إدخال هذه الشبهة عليهم، في سورة المائدة\n قال تعالى: { ذلك قولُهم بأفواههم } من غير دليل ولا برهان، بل قالوا به من عندهم { يُضاهِئون } أي: يشابهون في هذه المقالة { قولَ الذين كفروا من قبلُ } ، يعني: قدماءهم، على معنى أن الكفر قديم فيهم\n قال ابن جزي: فإن كان الضمير لليهود والنصارى، أي المتقدمين، فالإشارة بقوله: الذين كفروا من قبل للمشركين من العرب، إذ قالوا: الملائكة بنات الله، وهم أول كافر، أو للصابئين، أو لأمم تقدمت، وإن كان الضمير للمعاصرين للنبي صلى الله عليه وسلم من اليهود والنصارى، فالذين كفروا من قبل هم أسلافهم المتقدمون\n هـ\n  { قاتَلهُم اللَّهُ } أي: أهلكهم ودمرهم لأن من قاتله الله هلك، فيكون دعاء، أو تعجباً من شناعة قولهم، { أنَى يُؤفكون } أي: كيف يصرفون عن الحق إلى الباطل",
      "translations": []
    }
  ]
}