{
  "chapter": "التوبة",
  "text": "اتخذوا۟ احبارهم ورهبنهم اربابا من دون الله والمسيح ابن مريم وما امروا۟ الا ليعبدوا۟ الها وحدا لا اله الا هو سبحنه عما يشركون",
  "translations": [
    {
      "translation": "They have taken their rabbis and monks as lords besides Allah, and also the Messiah, son of Maryam. Yet they were commanded to worship only one God. There is no god but Him! Glory be to Him above anything they associate with Him!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They consider their rabbis and monks and the Christ, son of Mary, to be gods apart from God, even though they had been enjoined to worship only one God, for there is no god but He. Too holy is He for what they ascribe to Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They take their rabbis and their monks for their lords apart from Allah, and also the Messiah, son of Mary, whereas they were commanded to worship none but the One True God. There is no god but He. Exalted be He above those whom they associate with Him in His Divinity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (unconditionally) obeyed the rabbis and the monks and worshipped the Messiah, son of Mary, as they should have obeyed God. They were commanded to worship no one besides God who is the only God and who is too exalted to be considered equal to any idols.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have taken their rabbis and their monks as Gods besides Allah and (also) Messiah the son of Maryam; and they were not commanded except to worship only One God – Allah; none is worthy of worship except Him; Purity is to Him from all that they ascribe as partners (to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (Jews and Christians) took their rabbis and their monks to be their lords besides Allah, and (they also took as their Lord) the Messiah, son of Maryam, while they were commanded to worship none but One God, none has the right to be worshipped but He. Praise and hallowed be He above what they associate (with Him).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have taken their doctors of law and their monks for lords besides Allah, and (also) the Messiah son of Marium and they were enjoined that they should serve one Allah only, there is no god but He; far from His glory be what they set up (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have taken their rabbis and their monks as lords apart from God, and the Messiah, Mary's son -- and they were commanded to serve but One God; there is no god but He; glory be to Him, above that they associate --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have taken as lords beside Allah their rabbis and their monks and the Messiah son of Mary, when they were bidden to worship only One Allah. There is no Allah save Him. Be He Glorified from all that they ascribe as partner (unto Him)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have taken their learned men and their monks for their lords besides God. So have they taken the Messiah, son of Mary, although they were commanded to worship only the One God. There is no deity but He. He is far above whatever they set up as His partners!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have taken their priests and their monks for their Lords besides God, and also the Masih son of Maryam; whereas they Were commanded not but to worship the One God: no god is there but he. Hallowed be He from that which they associate'.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have taken their scribes and their monks as lords besides Allah, and also Christ, Mary’s son; though they were commanded to worship only the One God, there is no god except Him; He is far too immaculate to have any partners that they ascribe [to Him]!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They take their priests and their anchorites to be their lords in derogation of Allah, and (they take as their Lord) Christ the son of Mary; yet they were commanded to worship but One Allah: there is no god but He. Praise and glory to Him: (Far is He) from having the partners they associate (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (Jews and Christians) took their rabbis and their monks to be their lords besides Allah (by obeying them in things which they made lawful or unlawful according to their own desires without being ordered by Allah), and (they also took as their Lord) Messiah, son of Maryam (Mary), while they (Jews and Christians) were commanded [in the Taurat (Torah) and the Injeel (Gospel)) to worship none but One Ilah (God - Allah) La ilaha illa Huwa (none has the right to be worshipped but He). Praise and glory be to Him, (far above is He) from having the partners they associate (with Him).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They take their rabbis and monks as lords besides Allah, and the Messiah, son of Mary, though they were ordered to worship but one God, there is no god except He. Exalted is He above that they associate with Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have taken their rabbis and their priests as lords instead of God, as well as the Messiah son of Mary. Although they were commanded to worship none but The One God. There is no god except He. Glory be to Him; High above what they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have taken their scholars and monks as lords besides Allah, and [also] the Messiah, the son of Mary. And they were not commanded except to worship one God; there is no deity except Him. Exalted is He above whatever they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:31] They have taken their rabbis, the scholars among the Jews, and their monks, the devout among the Christians, as lords beside God — following them in making lawful what God has made unlawful and making   unlawful what He has made lawful — and the Messiah, son of Mary, when they were not commanded, in the Torah and the Gospel, except to worship One God: there is no god except Him; glory be to Him, as an affirmation of His transcendence [high], above what they associate [with Him].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالجملة تقرير لمضمون جملة { وقالت اليهود عزير ابن الله وقالت النصارى المسيح ابن الله } \\[ التوبة : 30 \\] ليُبنى على التقرير زيادة التشنيع بقوله : { وما أمروا إلا ليعبدوا إلها واحداً } إلخ ، فوزان هذه الجملة وزان جملة { اتخذوه وكانوا ظالمين } \\[ الأعراف : 148 \\] بعد جملة { واتخذ قوم موسى من بعده من حليهم عجلاً جسداً له خوار } \\[ الأعراف : 148 \\]. والضمير لليهود والنصارى .والأحبار جمع حَبَر بفتح الحاء وهو العالِم من علماء اليهود .الرهبان اسم جمع لراهب وهو التقي المنقطع لعبادة الله من أهل دين النصرانية ، وإنّما خص الحَبر بعالمِ اليهود لأنّ عظماء دين اليهودية يشتغلون بتحرير علوم شريعة التوراة فهم علماء في الدين وخصّ الراهب بعظيم دين النصرانية لأنّ دين النصارى قائم على أصل الزهد في الدنيا والانقطاع للعبادة .ومعنى اتّخاذهم هؤلاء أرباباً أنّ اليهود ادّعوا لبعضهم بنوةَ الله تعالى وذلك تأليه ، وأنّ النصارى أشدّ منهم في ذلك إذ كانوا يسجدون لصور عظماء ملّتهم مثل صورة مريم ، وصور الحواريين ، وصورة يحيى بن زكرياء ، والسجود من شعار الربوبية ، وكانوا يستنصرون بهم في حروبهم ولا يستنصرون بالله .وهذا حال كثير من طوائفهم وفرقهم ، ولأنّهم كانوا يأخذون بأقْوال أحبارهم ورهبانهم المخالفة لما هو معلوم بالضرورة أنّه من الدين ، فكانوا يعتقدون أنّ أحبارهم ورهبانهم يحلّلون ما حرم الله ، ويحرّمون ما أحلّ الله ، وهذا مطرد في جميع أهل الدينين ، ولذلك أفحم به النبي صلى الله عليه وسلم عدياً بنَ حاتم لمّا وفد عليه قُبيل إسلامه لما سمع قوله تعالى : { اتخذوا أحبارهم ورهبانهم أرباباً من دون الله } وقال عدي : لسنا نعبدهم فقال : «أليس يحرّمون ما أحلّ الله فتحرّمونه ويحلّون ما حرّم الله فتستحلّونه فقلت : بلى قال : فتلك عبادتهم» فحصل من مجموع أقوال اليهود والنصارى أنّهم جعلوا لبعض أحبارهم ورهبانهم مرتبة الربوبية في اعتقادهم فكانت الشناعة لازمة للأمتين ولو كان من بينهم من لم يقل بمقالهم كما زعم عدي بن حاتم فإنّ الأمّة تؤاخذ بما يصدر من أفرادها إذا أقرته ولم تنكره ، ومعنى اتّخاذهم أرباباً من دون الله أنّهم اتّخذوهم أرباباً دون أن يفردوا الله بالوحدانية ، وتخصيص المسيح بالذكر لأنّ تأليه النصارى إياه أشنع وأشهر .وجملة { وما أمروا إلا ليعبدوا إلها واحداً } في موضع الحال من ضمير { اتخذوا أحبارهم } ، وهي محطّ زيادة التشنيع عليهم وإنكار صنيعهم بأنّهم لا عذر لهم فيما زعموا ، لأنّ وصايا كتب الملّتين طافحة بالتحذير من عبادة المخلوقات ومن إشراكها في خصائص الإلهية .وجملة { لا إله إلّا هو } صفة ثانية ل { إلهاً واحداً }.وجملة { سبحانه عما يشركون } مستأنفة لقصد التنزيه والتبرّىء ممّا افتروا على الله تعالى ، ولذلك سمي ذلك إشراكاً .\n\n",
      "translations": [
        {
          "translation": "(They have taken as lords beside Allah) i.e. they obeyed them in acts of disobedience (their rabbis) the men of knowledge among the Jews (and their monks) who reside in monasteries (and the Messiah son of Mary) and they have taken the Messiah son of Mary as lord, (when they were bidden) in all Scriptures (to worship) to confess the divine Oneness of (only One God. There is no god save Him. Be He glorified from all that they ascribe as partner (unto Him)!) Allah exalts Himself above all that which they ascribe to Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱتَّخَذُوۤاْ أَحْبَارَهُمْ وَرُهْبَانَهُمْ أَرْبَاباً مِّن دُونِ ٱللَّهِ } فالأَحْبَارُ: العُلماءُ\n والرُّهبانُ: العُبَّادُ\n قال زيد بن علي عليهما السلام ما صَلُّوا وَلاَ صَامُوا ولكن أَطَاعُوهُمْ فِي مَعصيةِ الله تَعالى، فَسُموا لِطَاعتِهم لَهُمْ أَربَاباً\n\n",
      "translations": [
        {
          "translation": "\nAnd the saying of Allah: {And they took their scholars and monks as lords besides Allah } So the scholars are the ulama.\n\n\nAnd the monks: the servants\n Zaid ibn Ali said, \"They neither prayed nor fasted, but they obeyed them in disobedience to Allah. So they made them their gods for their obedience to them.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { ٱتَّخَذُوۤاْ } من فرط جهلهم وخبث طينتهم { أَحْبَارَهُمْ وَرُهْبَانَهُمْ أَرْبَاباً } مستقلين في الوجود\n ومتأصلين فيه { مِّن دُونِ ٱللَّهِ } المنزه عن الشريك مطلقاً\n المستقل في الوجود\n المتفرد فيه بلا وجود لغيره أصلاً\n يعبدونهم كعبادة الله { وَ } خصوصاً { ٱلْمَسِيحَ ٱبْنَ مَرْيَمَ وَ } الحال أنهم { مَآ أُمِرُوۤاْ } في كتبهم التي يدعون بمقتضاها { إِلاَّ لِيَعْبُدُوۤاْ إِلَـٰهاً وَاحِداً } أحداً صمداً\n فرداً وتراً\n لم يتخذ صاحبة ولا ولداً\n إذ { لاَّ إِلَـٰهَ } ولا موجود { إِلاَّ هُوَ سُبْحَانَهُ عَمَّا يُشْرِكُونَ } [التوبة: 31] له من مصنوعاته وأضلاله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { اتخذوا أحبارَهم } أي: علماءَهم { ورهبانَهم } عُبَّادَهم { أرباباً من دون الله } بأن أطاعوهم في تحريم ما أحل الله\n وتحليل ما حرم الله\n وفي السجود لهم\n { والمسيحَ ابنَ مريمَ } بأن جعلوه ابن الله\n { وما أمروا إلا ليعبدوا إِلهاً واحداً } وهو الله الواحد الحق\n وأما طاعة الرسول ـ عليه الصلاة والسلام ـ وسائر من أمر بطاعته\n فهو في الحقيقة طاعة الله\n { لا إله إلا هو } تقرير للتوحيد\n { سبحانه عما يشركون } تنزيهاً له عن أن يكون معه شريك\n { يريدون أن يُطفئوا } أي: يُخمدوا { نورَ الله } القرآن أو الإسلام بجملته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:70",
      "similarity": 0.531761810271527
    },
    {
      "verse": "9:34",
      "similarity": 0.4635624798347423
    },
    {
      "verse": "5:72",
      "similarity": 0.4083453428715617
    },
    {
      "verse": "5:17",
      "similarity": 0.38914976519065364
    },
    {
      "verse": "5:44",
      "similarity": 0.371257869032352
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009031.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009031.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:31.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}