{
  "chapter": "التوبة",
  "text": "يريدون ان يطفـوا۟ نور الله بافوههم ويابى الله الا ان يتم نوره ولو كره الكفرون",
  "translations": [
    {
      "translation": "They wish to extinguish the light of God by uttering blasphemies; but God will not have it so, for He wills to perfect His light, however the unbelievers be averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They seek to extinguish the light of Allah by blowing through their mouths; but Allah refuses everything except that He will perfect His light howsoever the unbelievers might abhor it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They would like to extinguish the light of God with a blow from their mouths, but even though the unbelievers may dislike it, God has decided to let His light shine forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They wish to extinguish the light of Allah with their mouths, but Allah will not agree except that He will perfect His light, even if the disbelievers get annoyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They want to extinguish Allah's Light with their mouths, but Allah will not allow except that His Light should be perfected even though the disbelievers hate (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They desire to put out the light of Allah with their mouths, and Allah will not consent save to perfect His light, though the unbelievers are averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "desiring to extinguish with their mouths God's light; and God refuses but to perfect His light, though the unbelievers be averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fain would they put out the light of Allah with their mouths, but Allah disdaineth (aught) save that He shall perfect His light, however much the disbelievers are averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They want to extinguish God's light with their mouths, but God seeks only to perfect His light, no matter how those who deny the truth may abhor it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They seek to extinguish the light of Allah with their mouths; and Allah refuseth to do otherwise than perfect His light, although the infidels may detest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They desire to put out the light of Allah with their mouths, but Allah is intent on perfecting His light though the faithless should be averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fain would they extinguish Allah's light with their mouths, but Allah will not allow but that His light should be perfected, even though the Unbelievers may detest (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (the disbelievers, the Jews and the Christians) want to extinguish Allah's Light (with which Muhammad SAW has been sent - Islamic Monotheism) with their mouths, but Allah will not allow except that His Light should be perfected even though the Kafirun (disbelievers) hate (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They desire to extinguish the Light of Allah with their mouths; but Allah seeks only to perfect His Light, though the unbelievers hate it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They want to extinguish God’s light with their mouths, but God refuses except to complete His light, even though the disbelievers dislike it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They want to extinguish the light of Allah with their mouths, but Allah refuses except to perfect His light, although the disbelievers dislike it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:32] They desire to extinguish God’s light, His Law and His proofs, with their tongues, with what they say about Him; and God refuses but to perfect, to make manifest, His light, even though the disbelievers be averse, to this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Fain would they put out) thwart (the light of Allah) the religion of Allah (with their mouths) through their lies; it is also said: by means of their mouths, (but Allah disdaineth (aught)) But Allah does not leave things (save that He shall perfect His light) save that He shall manifest His religion: Islam, (however much the disbelievers are averse) that this should be so.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يُرِيدُونَ } بأمثال هذه المفتريات الباطلة { أَن يُطْفِئُواْ } أي: يخمدوا ويستروا { نُورَ ٱللَّهِ } المتجلي في الآفاق، المتشعشع في الكائنات { بِأَفْوَٰهِهِمْ } أي: بشركهم الناشئ من أفواههم بلا سند من عقل أو نقل، أو كشف وشهود { وَيَأْبَىٰ } أي: يمنع { ٱللَّهُ } المنز عن التعدد مطلقاً أن يكون له شريك في الوجود { إِلاَّ أَن يُتِمَّ نُورَهُ } أي: سوى أن يتجلى بجميع أوصافه وأسمائه على من استخلفه من خلقه، فيتراءى منه جميع آثار أسمائه وأوصافه وأخلاقه، ألا وهو المظهر الكامل، الجامع المحمدي الذي اتحد دون مرتبته صلى الله عليه وسلم قوسا الوجوب والإمكان، ودائرتا الغيب والشهادة\n\n\n\n\nلذلك قال صلى الله عليه وسلم:\n\n \" أنا أتمم مكارم الأخلاق \" \n\n، وقال أيضاً:\n\n \" أنا سيد ولد آدم \" \n\nوقال أيضاً:\n\n \" أدم ومن دونه تحت لوائي \" \n\n، وقال أيضاً:\n\n \" من أطاعني فقد أطاع الله، ومن رآني فقد رأى الحق \"\n \n\n \n\nونزل في شأنه:\n\n[المائدة: 3] إلى غير ذلك ممَّا دل وحدة مرتبته وإحاطتها على جميع المراتب؛ لذلك ختم به صلى الله عليه وسلم أمر الرسالة والتشريع { وَلَوْ كَرِهَ ٱلْكَٰفِرُونَ } [التوبة: 32] الساترون ظهور الحق، المريدون إطفاء نور الوجود في المشكاة المحمدية، وكيف يريدون إطفاء نوره اللائح اللامع من المظهر الجامع المحمدي؟!\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يريدون أن يُطفئوا } أي: يُخمدوا { نورَ الله } القرآن أو الإسلام بجملته، { بأفواههم } كقولهم فيه: سحر، وشعر، وغير ذلك، وفيه إشارة إلى ضعف حيلتهم فيما أرادوا، { ويأبى اللَّهُ } لا يرضى { إلا أن يُتِمَ نوره } بإعلاء التوحيد وإظهار الإسلام، وإعزاز القرآن وأهله، { ولو كره الكافرون } ذلك، فإن الله لا محالة يُتم نوره، ويظهر دينه\n\n",
      "translations": []
    }
  ]
}