{
  "chapter": "التوبة",
  "text": "هو الذى ارسل رسوله بالهدى ودين الحق ليظهره على الدين كله ولو كره المشركون",
  "translations": [
    {
      "translation": "It is He who sent His Messenger with guidance and the Deen of Truth to exalt it over every other deen, even though the idolaters detest it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sent His Messenger with guidance and the true faith in order to make it superior to other systems of belief, even though the idolaters may not like it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who has sent His Messenger with the guidance and the True Religion that He may make it prevail over all religions, howsoever those who associate others with Allah in His Divinity might detest it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God Who sent His Messenger with guidance and a true religion that will prevail over all other religions, even though the pagans may dislike it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has sent His Noble Messenger with guidance and the true religion, in order to prevail over all other religions – even if the polytheists get annoyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has sent His Messenger with guidance and the religion of truth, to make it superior over all religions even though the idolators hate (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sent His Apostle with guidance and the religion of truth, that He might cause it to prevail over all religions, though the polytheists may be averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent His Messenger with the guidance and the religion of truth, that He may uplift it above every religion, though the unbelievers be averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who hath sent His messenger with the guidance and the Religion of Truth, that He may cause it to prevail over all religion, however much the idolaters may be averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent His Messenger with guidance and the religion of Truth, so that He may make it prevail [ideologically] over every other religion, however much the polytheists may hate this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is who hath sent His apostle with the guidance and the true religion that he may make it prevail over all religions, although the associators may detest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent His Apostle with the guidance and the religion of truth that He may make it prevail over all religions, though the polytheists should be averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who hath sent His Messenger with guidance and the Religion of Truth, to proclaim it over all religion, even though the Pagans may detest (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has sent His Messenger (Muhammad SAW) with guidance and the religion of truth (Islam), to make it superior over all religions even though the Mushrikun (polytheists, pagans, idolaters, disbelievers in the Oneness of Allah) hate (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent forth His Messenger with guidance and the religion of truth to uplift it above every religion, no matter how much the idolaters hate it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sent His Messenger with the guidance and the religion of truth, in order to make it prevail over all religions, even though the idolaters dislike it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent His Messenger with guidance and the religion of truth to manifest it over all religion, although they who associate others with Allah dislike it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:33] He it is Who has sent His Messenger, Muhammad (s), with the guidance and the religion of truth, that He may manifest it, make it prevail, over every religion, all the religions which oppose it, even though the disbelievers be averse, to this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is Who hath sent His messenger) Muhammad (pbuh) (with the guidance) with the Qur'an and faith (and the Religion of Truth) the religion of Islam, and with it the confession that there is no deity except Allah, (that He may cause it to prevail over all religion) that He may Cause the religion of Islam to prevail over all religions which came before it until the Day of Judgement, (however much the idolaters may be averse) that this should be so. 197\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ هُوَ ٱلَّذِيۤ أَرْسَلَ رَسُولَهُ } الهادي { بِٱلْهُدَىٰ } العام الشامل لكافة البرايا { وَدِينِ ٱلْحَقِّ } وهو الإسلام { لِيُظْهِرَهُ } أي: الرسول ودينه { عَلَى ٱلدِّينِ كُلِّهِ } أي: على كل الأديان، وينسخ جميعها به؛ لابتناء دينه على التوحيد الصرف، الخالي عن شوب التنويه وشين الكثرة مطلقاً { وَلَوْ كَرِهَ ٱلْمُشْرِكُونَ } [التوبة: 33] ظهوره بالهداية العامة، ونسخ دينه جميع الأديان؛ لخبث باطنهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ هو الذي أرسلَ رسولهُ } محمداً صلى الله عليه وسلم { بالهدى ودين الحق ليُظهرَهُ على الدين كله } ، الضمير في \" يُظهره \"\n للدين الحق، أو للرسول صلى الله عليه وسلم\n واللام في \" الدين \"\n للجنس، أي: على سائر الأديان فينسخها، أو على أهلها فيخذلهم، وقد أنجز وعده، وأظهر دينه ورسوله على الأديان كلها، حتى عم المشارق والمغارب، { ولو كَرِهَ المشركون } ذلك الإظهار، فيظهره الله رغماً من أنفهم\n وقيل: يتحقق ذلك عند نزول عيسى عليه السلام، حتى لا يبقى دين إلا دين الإسلام، والله تعالى أعلم\n الإشارة: من انطمس نور بصيرته نسب لله ما لا يليق بكمالاته، ومن لم تنهضه سوابق العناية وقف مع الوسائط ولم ينفذ إلى شهود الوسائط، وقد عيَّر الله قوماً وقفوا مع الوسائط فقال: { اتخذوا أحبارهم ورهبانهم أرباباً من دون الله } ، وقال، في شأن الواسطة العظمى غيرةً على القلوب أن تقف مع غيره:\n\n[آل عمران: 128]،\n\n[هود: 12]، ودخل بعض العارفين على إنسان وهو يبكي، فقال: وما يبكيك؟ فقال له: مات أستاذي، فقال له ذلك العارف: ولم جعلت أستاذك من يموت؟\n فالوسائط كالأنبياء والأولياء، إنما هم مُوَصِّلونَ إلى الله، دالون عليه، فمن وقف معهم ولم ينفذ إلى الله فقد اتخذه رباً عند الخواص\n وقال الورتجبي على هذه الآية: عيَّر الحق تعالى من بقي في رؤية المقتدَى به دون رؤية الحق، وإن كان وسيلة منه، فإن في إفراد القدم من الحدوث، النظر إلى الوسائط، وهو شرك، وتصديق ذلك تمام الآية { وما أمروا إلا ليعبدوا إلهاً واحداً }\n غَيرهُ الوحدانية ما أبقت في البَيْن غيراً من الشواهد والآيات وجميع الخلق\n قال الله تعالى: { قُلِ اللَّهُ ثُمَّ ذَرهُم } [الأنعام: 91]\n ولما رأى صلى الله عليه وسلم غيره القدم على شأن استهلاك الغير زجر من مدحه وتجاوز في المدح فقال:\n\n \" لا تطروني كما أطرت النصارى المسيح \"\n \n\nثم قال الورتجبي: قال بعضهم في هذه الآية: سكنوا إلى أمثالهم، فطلبوا الحق من غير مظانه، وطُرق الحق واضحة لمن كحل بنور التوفيق، وبصر سبل التحقيق، ومن أعمي عن ذلك كان مردوداً عن طريق الحق إلى طرق الضالين من الخلق، وقد وقع أنهم معيرون وموبخون بقلة عرفانهم أهل الحقائق، وركونهم إلى أهل التقليد، وسقطوا عن منازل أهل التوحيد في التفريد، وهكذا شأن من اقتدى بالزّواقين من أهل السالوس المتزينين بزي المشايخ والعارفين المتحققين، وتخلفَ خلفَ الجامعين للدنيا، الذين يقولون: نحن أبناء المشايخ ونحن رؤساء الطريقة، يُضْحك اللهُ الدهرَ من جهلهم حيث حيث علموا أن الولاية بالنسب، حاشا أن من لم يُذق طعمِ وِصال الله، وقلبُه معلق بغير الله، هو من أولياء الله\n\n\nقال الجنيد: إذا أراد الله بالمريد خيراً هداه إلى صحبة الصوفية، ووقاه من صحبة القراء\n ولو اشتغلوا بشأنهم وجمع دنياهم، ولم يتعرضوا لأولياء الله، ولم يقصدوا إسقاط جاههم، لكفيهم شقاوتهم، لا سيما ويطعنون على الصديقين العارفين\n قال الله في شأنهم: { يريدون أن يطفئوا نور الله بأفواههم ويأبى الله إلا أن يتم نوره ولو كره الكافرون } ، كيف تطفأ بتراب حسبانهم أنوارُ شموس الصفات، التي من جباه وجوههم، ولئالئ خدودهم، وأصلها ثابت في أفلاك الوحدانية وسماوات القيومية، ويزيد نورهم على نور لأنه تعالى بلا نهاية ولا منتهى لصفاته\n قوله تعالى: { هو الذي أرسل رسوله بالهدى ودين الحق }: إن الله سبحانه سن سنة أزلية: ألا يجد أحدٌ سبيله إلا من يقُيض له أستاذاً عارفاً بالله، وبسِّر دينه وربوبيته، فيدله إلى منهاج عبوديته، ومعارج روحه وقلبه، إلى مشاهدة ربوبيته، ويكون هو واسطة بينه وبين الله، وإن كان الفضل بيد الله، يؤتيه من يشاء بغير علة ولا سبب، جعله واسطة للتأديب لا للتقريب، وصيره شفيعاً للجنايات، لا شريكاً في الهدايات، هداه نور القرآن، وبيّنه حقيقة البيان، مع إظهار البرهان\n قيل: جعل الله الوسائط طريقاً لعباده إليه، وبعثهم أعلاماً على الطرق ونوراً يهتدى بهم، وعرفهم سبل الحق وحقيقة الدين، قال الله تعالى: { أرسل رسوله بالهدى ودين الحق } ، انتهى كلامه\n ثم ذكر مساوئ الأحبار والرهبان، تنفيراً من طاعتهم وذماً لمن اتخذهم أرباباً، فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ إِنَّ كَثِيراً مِّنَ ٱلأَحْبَارِ وَٱلرُّهْبَانِ }\n\n",
      "translations": []
    }
  ]
}