{
  "chapter": "التوبة",
  "text": "يايها الذين ءامنوا۟ ان كثيرا من الاحبار والرهبان لياكلون امول الناس بالبطل ويصدون عن سبيل الله والذين يكنزون الذهب والفضة ولا ينفقونها فى سبيل الله فبشرهم بعذاب اليم",
  "translations": [
    {
      "translation": "You who have iman! many of the rabbis and monks devour people's property under false pretences and bar people from access to the Way of Allah. As for those who hoard up gold and silver and do not spend it in the Way of Allah, give them the news of a painful punishment",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, many rabbis and priests devour the possessions of others wrongfully, and keep men away from the path of God. To those who accumulate gold and silver, and do not spend in the way of God, announce the news of painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Many of the rabbis and monks wrongfully devour mankind's possessions and hinder people from the Way of Allah. And there are those who amass gold and silver and do not spend it in the Way of Allah. Announce to them the tidings of a painful chastisement\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, many rabbis and monks consume other people's property by false means and create obstacles in the way of God. Those who horde gold and silver and do not spend (anything out of it) for the cause of God, should know that their recompense will be a painful torment\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Indeed many of the (Jewish) rabbis and the (Christian) monks unjustly devour people's wealth and prevent from Allah’s way; and those who hoard up gold and silver and do not spend it in Allah’s way – so them give the glad tidings of a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Verily, there are many of the Ahbar (rabbis) and the Ruhban (monks) who devour the wealth of mankind in falsehood, and hinder (them) from the way of Allah. And those who hoard up gold and silver and spend them not in the way of Allah, announce unto them a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! most surely many of the doctors of law and the monks eat away the property of men falsely, and turn (them) from Allah's way; and (as for) those who hoard up gold and silver and do not spend it in Allah's way, announce to them a painful chastisement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, many of the rabbis and monks indeed consume the goods of the people in vanity and bar from God's way. Those who treasure up gold and silver, and do not expend them in the way of God -- give them the good tidings of a painful chastisement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Lo! many of the (Jewish) rabbis and the (Christian) monks devour the wealth of mankind wantonly and debar (men) from the way of Allah. They who hoard up gold and silver and spend it not in the way of Allah, unto them give tidings (O Muhammad) of a painful doom,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, many religious scholars and monks wrongfully appropriate people's possessions and turn people away from God's path! Tell those who hoard gold and silver instead of giving in God's cause that they will have a painful punishment:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! verily many of the priests and the monks devour the substances of men in falsehood and hinder People from the way of Allah. And those who treasure up gold and silver and expend them not in the way of Allah -announce thou unto them a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Indeed many of the scribes and monks wrongfully eat up the people’s wealth, and bar [them] from the way of Allah. Those who treasure up gold and silver, and do not spend it in the way of Allah, inform them of a painful punishment\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! there are indeed many among the priests and anchorites, who in Falsehood devour the substance of men and hinder (them) from the way of Allah. And there are those who bury gold and silver and spend it not in the way of Allah: announce unto them a most grievous penalty-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Verily, there are many of the (Jewish) rabbis and the (Christian) monks who devour the wealth of mankind in falsehood, and hinder (them) from the Way of Allah (i.e. Allah's Religion of Islamic Monotheism). And those who hoard up gold and silver [Al-Kanz: the money, the Zakat of which has not been paid], and spend it not in the Way of Allah, -announce unto them a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, many are the rabbis and monks who in falsehood defraud people of their possessions and bar people from the Path of Allah. Give glad tidings of a painful punishment to those who treasure gold and silver and do not spend it in the Way of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Many of the rabbis and priests consume people's wealth illicitly, and hinder from God’s path. Those who hoard gold and silver, and do not spend them in God’s cause, inform them of a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, indeed many of the scholars and the monks devour the wealth of people unjustly and avert [them] from the way of Allah. And those who hoard gold and silver and spend it not in the way of Allah - give them tidings of a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:34] O you who believe, many of the rabbis and monks indeed consume, take, people’s goods by false means, as in the case of bribes [paid] for judgements, and bar, people, from the way of God, [from] His religion. And those who (wa’lladhīna is the subject) hoard up gold and silver, and do not expend them, these treasurehoards, in the way of God, that is, they do not pay from it what is due to Him by way of alms and charity — give them tidings, inform them, of a painful chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 you, who believe!) in Muhammad (pbuh) and in the Qur'an, (Lo! many of the (Jewish) rabbis) the scholars of the Children of Israel (and the (Christian) monks) who reside in monasteries (devour the wealth of mankind wantonly) through bribery and unlawful earning (and debar (men) from the way of Allah) from Allah's Religion and obedience. (They who hoard up) amass (gold and silver and spend it not) the gold and silver (in the way of Allah) in obedience of Allah; it is also said that this means: who do not pay the poor-due from it, (unto them give tidings) Muhammad (of a painful doom).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } بالله ورسوله، وتحققوا وتيقنوا { إِنَّ كَثِيراً مِّنَ ٱلأَحْبَارِ وَٱلرُّهْبَانِ } الموسوسين لضعفاء العوام، الملبسين لهم طريق الحق بالتغديرات المبتدعة من تلقاء نفوسهم، كالشيخوخة التي ظهرت في زماننا هذا، إنما غرضهم ومعظم مأمولهم { لَيَأْكُلُونَ } ويأخذون { أَمْوَالَ ٱلنَّاسِ } المنحطين عن زمرة أهل التحقيق { بِٱلْبَاطِلِ } أي: بتزويج الباطل الزائغ الذي ابتدعوها بلا مستند لهم\n\n\n\n\n{ وَيَصُدُّونَ } أي: يصرفون ويضلون أباطيلهم وتلبساتهم ضعاء الأنام { عَن سَبِيلِ ٱللَّهِ } الذي هو الإسلام تلبيساً عليهم وتغريراً لهم؛ ليأخذوا الرضى منهم ويكنزوها { وَ } لم يعلموا أن { ٱلَّذِينَ يَكْنِزُونَ ٱلذَّهَبَ وَٱلْفِضَّةَ } أي: يجعلونها مخزوناً محفوظاً من أي ملة كانوا { وَلاَ يُنفِقُونَهَا فِي سَبِيلِ ٱللَّهِ } طلباً لمرضاته { فَبَشِّرْهُمْ } يا أكمل الرسل { بِعَذَابٍ أَلِيمٍ } [التوبة: 34] مؤلم مفزع\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: يحمى عليها: الجار والمجرور: نائب الفاعل، وأصله: يوم تحمى النار الشديدة الحمى عليها، فجعل الإحماء للنار مبالغةً، ثم حذفت النار، وأسند الفعل إلى الجار والمجرور تنبيهاً على المقصود، فانتقل من صيغة التأنيث إلى صيغة التذكير\n يقول الحق جل جلاله: { يا أيها الذين آمنوا إن كثيراً من الأحبار والرهبان ليأكلون أموالَ الناس بالباطل } يأخذونها بالرشا في الأحكام، وسَمى أخذ المال أكلاً لأنه الغرض الأعظم منه، { ويصدون عن سبيل الله } أي: يعوقون الناس عن الدخول في دينه، { والذين يكنزون الذهبَ والفِضةَ } أي: يدخرونها { ولا يُنفقونها } أي: الأموال المفهومة من الذهب والفضة، أو الكنوز، أو الفضة، واكتفى بذكرها عن الذهب إذ الحُكم واحد، { فبشِّرهم بعذاب أليم } وهو الكي بها، وهذا الحكم يحتمل أن يرجع لكثير من الأحبار والرهبان، فيكون مبالغة في وصفهم، بالحرص على المال وجمعه، وأن يراد به المسلمون الذين يجمعون الأموال، ويقتنونها ولا يؤدون حقها، ويكون اقترانه بأكلة الرشا من أهل الكتب للتغليظ\n ويدل عليه: أنه لما نزلت على رسول الله صلى الله عليه وسلم، ذكر ذلك عمر لرسول الله صلى الله عليه وسلم، فقال:\n\n \" إِنَّ الله لم يفرض الزكاة إلا ليطيِّبَ بها ما بقي من أموالكم \"\n \n\nوقوله ـ عليه الصلاة والسلام ـ:\n\n \" ما أدى زَكَاته فَلَيْسَ بِكَنْز \"\n \n\nوقال أبو ذر وجماعة من الزهاد: كل ما فضل عن حاجة الإنسان فهو كنز، وحمل الآية عليه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:31",
      "similarity": 0.4635624798347423
    },
    {
      "verse": "43:70",
      "similarity": 0.3880601967955597
    },
    {
      "verse": "25:8",
      "similarity": 0.34928845820683024
    },
    {
      "verse": "26:58",
      "similarity": 0.3436352260507892
    },
    {
      "verse": "5:44",
      "similarity": 0.30722628818321546
    }
  ]
}