{
  "chapter": "التوبة",
  "text": "ان عدة الشهور عند الله اثنا عشر شهرا فى كتب الله يوم خلق السموت والارض منها اربعة حرم ذلك الدين القيم فلا تظلموا۟ فيهن انفسكم وقتلوا۟ المشركين كافة كما يقتلونكم كافة واعلموا۟ ان الله مع المتقين",
  "translations": [
    {
      "translation": "There have been twelve months with Allah in the Book of Allah, from the day He first created the heavens and earth. Four of them are haram. That is the True Deen. So do not wrong one another during them. However, fight the idolaters totally just as they fight you totally, and know that Allah is with those who have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The number of months with God is twelve in accordance with God's law since the day He created the heavens and the earth. Of these four are holy. This is the straight reckoning. So do not exceed yourselves during them; but fight the idolaters to the end as they fight you in like manner; and remember, God is with those Who preserve themselves from evil and do the right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the reckoning of months, in the sight of Allah, is twelve months, laid down in Allah's decree on the day when He created the heavens and the earth; and out of these months four are sacred. That is the true ordainment. Do not, therefore, wrong yourselves, with respect to these months. And fight all together against those who associate others with Allah in His Divinity in the manner that they fight against you all together, and know well that Allah is with the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "According to the Book of God, from the day He created the heavens and the earth, the number of months are twelve, four of which are sacred. (This is part of the law) of the religion. Do not commit injustice against your souls during the sacred months but fight all the pagans just as they fight against all of you. Know that God is with the pious ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the number of months before Allah is twelve – in the Book of Allah – since the day He created the heavens and the earth, of which four are sacred; this the straight religion; so do not wrong yourselves in those months; and constantly fight against the polytheists as they constantly fight against you; and know well that Allah is with the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, the number of months with Allah is twelve months (in a year), so was it ordained by Allah on the Day when He created the heavens and the earth; of them four are sacred. That is the right religion, so wrong not yourselves therein, and fight against the Mushrikin idolaters collectively as they fight against you collectively. But know that Allah is with those who have Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the number of months with Allah is twelve months in Allah's ordinance since the day when He created the heavens and the earth, of these four being sacred; that is the right reckoning; therefore be not unjust to yourselves regarding them, and fight the polytheists all together as they fight you all together; and know that Allah is with those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The number of the months, with God, is twelve in the Book of God, the day that He created the heavens and the earth; four of them are sacred. That is the right religion. So wrong not each other during them. And fight the unbelievers totally even as they fight you totally and know that God is with the godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! the number of the months with Allah is twelve months by Allah's ordinance in the day that He created the heavens and the earth. Four of them are sacred: that is the right religion. So wrong not yourselves in them. And wage war on all of the idolaters as they are waging war on all of you. And know that Allah is with those who keep their duty (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day God created heaven and earth, He decreed that the number of months should be twelve in number. Out of these, four are sacred. That is the true religion. Do not wrong your souls in these months. Fight the polytheists  all together, as they fight you all together, and know that God is with the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the number of months with Allah is twelve months ordained in the writ of Allah on the day whereon He created the heavens and the earth; of these four sacred: that is the right religion. Wherefore wrong not yourselves in respect thereof. And fight the associators, all of them even as they fight all of you; and knew that Allah is with the God-fearing\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the number of months with Allah is twelve months in Allah’s Book, the day when He created the heavens and the earth. Of these, four are sacred. That is the upright religion. So do not wrong yourselves during them. Fight all the polytheists, just as they fight you all, and know that Allah is with the Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The number of months in the sight of Allah is twelve (in a year)- so ordained by Him the day He created the heavens and the earth; of them four are sacred: that is the straight usage. So wrong not yourselves therein, and fight the Pagans all together as they fight you all together. But know that Allah is with those who restrain themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, the number of months with Allah is twelve months (in a year), so was it ordained by Allah on the Day when He created the heavens and the earth; of them four are Sacred, (i.e. the 1st, the 7th, the 11th and the 12th months of the Islamic calendar). That is the right religion, so wrong not yourselves therein, and fight against the Mushrikun (polytheists, pagans, idolaters, disbelievers in the Oneness of Allah) collectively, as they fight against you collectively. But know that Allah is with those who are Al-Muttaqun (the pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The number of the months, with Allah, is twelve in the Book of Allah, the day when He created the heavens and the earth; of these, four are sacred. That is the right religion. Therefore, do not wrong yourselves in them and fight against the unbelievers all together as they themselves fight against you all together; know that Allah is with the cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The number of months, according to God, is twelve months—in the decree of God—since the Day He created the heavens and the earth, of which four are sacred. This is the correct religion. So do not wrong yourselves during them. And fight the polytheists collectively, as they fight you collectively, and know that God is with the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the number of months with Allah is twelve [lunar] months in the register of Allah [from] the day He created the heavens and the earth; of these, four are sacred. That is the correct religion, so do not wrong yourselves during them. And fight against the disbelievers collectively as they fight against you collectively. And know that Allah is with the righteous [who fear Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:36] Verily the number of months, used to reckon the year, with God is twelve months in the Book of God, the Preserved Tablet (al-lawh al-mahfūz), from the day that He created the heavens and the earth; four of them, that is, the months, are sacred, inviolable: Dhū’l-Qa‘da, Dhū’l-Hijja, Muharram and Rajab. That, making of them sacred, is the right, the upright, religion. So do not wrong yourselves during them, during these sacred months, with acts of disobedience, for their burden [of sin] is greater therein; but it is also said to mean [do not wrong yourselves] at any time during all the months [of the year]. And fight the idolaters altogether, all of them, throughout the months, even as they fight you altogether; and know that God is with those who fear Him, supporting and assisting [them].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! the number of the months with Allah) he says: the year is counted by months, i.e. the months of the year in which the poor-due is paid (is twelve months by Allah's ordinance) in the Guarded Tablet (in the day) from the day (that He created the heavens and the earth. Four of them) four of these months (are sacred): Rajab, Dhu'l-Qa'dah, Dhu'l-Hijjah and Muharram: (that is the right religion) that is the right calculation: it neither increases or decreases. (So wrong not) harm not (yourselves) through transgression (in them) in those months; it is also said: in the sacred months. (And wage war on all the idolaters) in the sacred months and in other months (as they are waging war on all of you) all together. (And know) believers (that Allah is with those who keep their duty (unto Him)) with those who ward off disbelief, idolatry, indecencies, the breaking of treaties and fighting during the sacred months.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱلدِّينُ ٱلْقَيِّمُ } هُوَ القَائِمُ المُسْتَقيمُ\n\n\n\n\nوقوله تعالى: { وَقَاتِلُواْ ٱلْمُشْرِكِينَ كَآفَّةً } معناهُ عَامةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - exalted be He - \"The Religion is the upright [one]\" - that is, the Religion that is straight and true.\n\n\nAnd fight the polytheists all together as they fight you all together.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه تعليماً للمؤمنين على ما ثبت عنده من الأيام والشهور؛ لتتميم مصالحهم ومعاملاتهم: { إِنَّ عِدَّةَ ٱلشُّهُورِ } على ما ثبت { عِندَ ٱللَّهِ ٱثْنَا عَشَرَ شَهْراً فِي كِتَابِ ٱللَّهِ } أي: في حضرة علمه ولوح قضائه { يَوْمَ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ } أي: حين أظهر سبحانه عالم الكون والفساد المقدر بمكال الأيام والليالي المنقسمتين إلى الشهور والأعوام والأسبوع والساعات؛ إذ في أزل الذات لا صباح ولا مساء، ولا صيف ولا شتاء، ولا الشهور ولا السنون، فسبحان من تنزه عن التبديل والتحويل، وتقدس عن الظهور والبطون\n\n\n\n\n{ مِنْهَآ } من تلك الشهور في كتاب الله { أَرْبَعَةٌ حُرُمٌ } هي رجب وذو القعدة وذو الحجة ومحرم، سيمت بها؛ لأن الله سبحانه حرم فيها لعباده بعض ما أباح في الشهور الأخر كرامةً لها واحترامناً، فعليكم أيها المكلفون أن تواظبوا فيها على الطاعات، وتداموا على الخيرات المبرات، واجتنبوا عن الآثام والجهالات، وأكثروا فيها الأعمال الصالحات وتوجهوا نحو الحق في جميع الحالات، سيما في تكل الشهور المعدة للتوجه من عنده { ذٰلِكَ } أي: تحريم الشهور الأربعة { ٱلدِّينُ ٱلْقَيِّمُ } المستقيم الموروث لكم من ملة إبراهيم وإسماعيل - عليهما السلام - { فَلاَ تَظْلِمُواْ فِيهِنَّ أَنْفُسَكُمْ } بالخروج عن مقتضى تحريمها وهتك حرمتها؛ حتى لا تستحقوا عذاب الله ونكاله\n\n\n\n\n{ وَقَاتِلُواْ ٱلْمُشْرِكِينَ } فيها إن قاتلوكم، ولا تبادروا وتسابقوا إلى قتالهم فيها وفي غيرها، بل إن بادروا على قتالكم قاتلوكم، واقتلوهم { كَآفَّةً } أي: جميعاً { كَمَا يُقَاتِلُونَكُمْ كَآفَّةً } بلا ترحم وتوقيت { وَٱعْلَمُوۤاْ } أيها المؤمنون { أَنَّ ٱللَّهَ } المستوي على العدل القويم { مَعَ ٱلْمُتَّقِينَ } [التوبة: 36] الذي يحفظون نفوسهم عن هتك حرمة الله، قد حرمها الله لحكمة ومصلحة لم يطلعكم عليها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: عند الله: معمول لعدة لأنها مصدر، و في كتاب الله: صفة لاثني عشر، و يوم: متعلق بالثبوت المقدر في الخبر، أي: ثابتة في كتاب الله يوم خلق الأكوان والزمان\n وقوله: منها: أي: الأشهر، ثم قال: فيهن\n وضابط الضمير إن عاد على الجماعة المؤنثة، حقيقة أو مجازاً، إن كانت أكثر من عشرة، قلتَ: منها وفيها، وإن كانت أقل من عشرة، قلت: منهن وفيهن، قال تعالى:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:234",
      "similarity": 0.3919514366814662
    },
    {
      "verse": "2:194",
      "similarity": 0.34124656887788907
    },
    {
      "verse": "35:1",
      "similarity": 0.3110514965596253
    },
    {
      "verse": "34:28",
      "similarity": 0.3094578556497426
    },
    {
      "verse": "21:39",
      "similarity": 0.27904752897323215
    }
  ]
}