{
  "chapter": "التوبة",
  "text": "انما النسىء زيادة فى الكفر يضل به الذين كفروا۟ يحلونه عاما ويحرمونه عاما ليواطـوا۟ عدة ما حرم الله فيحلوا۟ ما حرم الله زين لهم سوء اعملهم والله لا يهدى القوم الكفرين",
  "translations": [
    {
      "translation": "Deferring a sacred month is an increase in kufr by which the kuffar lead many people astray. One year they make it profane and another sacred to tally with the number Allah has made sacred. In that way they profane what Allah has made sacred. Their bad actions are made to seem good to them. Allah does not guide kafir people.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Intercalating a month is adding to unbelief. The unbelievers are misguided by this, for they take the same month to be sacred one year and sacrilegious the next, thus making the number of months sanctified by God accord with theirs in order to make what God has forbidden, lawful. Attractive seem to them their evil deeds; but God does not show the unbelievers the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The intercalation (of sacred months) is an act of gross infidelity which causes the unbelievers to be led further astray. They declare a month to be lawful in one year and forbidden in another year in order that they may conform to the number of months that Allah has declared as sacred, and at the same time make lawful what Allah has forbidden. Their foul acts seem fair to them. Allah does not direct those who deny the Truth to the Right Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To disregard the observation of the sacred months and to observe it during the non-sacred months is to add more to one's disbelief. This causes the unbelievers to go further astray. One year they (the pagans) consider a sacred month not sacred, (and observe it during a non-sacred month) but the next year they consider it sacred at the right time. By dealing with the sacred months in such a manner, they think that they have observed the laws of God, but, in fact, they have changed them. Their evil deeds seem attractive to them but God does not guide the unbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their postponing of the months is nothing but furtherance in disbelief – the disbelievers are misled by it – they decree it lawful in one year and regard it forbidden in another year, in order to equate to the number of the months which Allah has made sacred, and to make lawful what Allah has forbidden; their evil deeds seem good in their sight; and Allah does not guide the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The postponing (of a Sacred Month) is indeed an addition to disbelief: thereby the disbelievers are led astray, for they make it lawful one year and forbid it another year in order to adjust the number of months forbidden by Allah, and make such forbidden ones lawful. The evil of their deeds is made fair-seeming to them. And Allah guides not the people who disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Postponing (of the sacred month) is only an addition in unbelief, wherewith those who disbelieve are led astray, violating it one year and keeping it sacred another, that they may agree in the number (of months) that Allah has made sacred, and thus violate what Allah has made sacred; the evil of their doings is made fairseeming to them; and Allah does not guide the unbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month postponed is an increase of unbelief whereby the unbelievers go astray; one year they make it profane, and hallow it another, to agree with the number that God has hallowed, and so profane what God has hallowed. Decked out fair to them are their evil deeds; and God guides not the people of the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Postponement (of a sacred month) is only an excess of disbelief whereby those who disbelieve are misled; they allow it one year and forbid it (another) year, that they may make up the number of the months which Allah hath hallowed, so that they allow that which Allah hath forbidden. The evil of their deeds is made fairseeming unto them. Allah guideth not the disbelieving folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The postponing of [sacred months] is but one more instance of [their] refusal to acknowledge the truth -- by which those who are bent on denying the truth are led astray. They declare this to be permissible in one year and forbidden in another year, so that they may adjust the months which God has sanctified, thus making lawful what God has forbidden. Their evil deed seems fair to them: God does not guide those who deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The postponement is but an addition unto infidelity, whereby the infidels are led astray, allowing it one year and forbidding it anot her year, that they may make up the number which Allah hath sanctified; and then they allow that which Allah hath forbidden. Made fair-seeming unto them is the vileness of their works; and Allah guideth not an infidel people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed nasee is an increase in unfaith, whereby the faithless are led [further] astray. They allow it in one year and forbid it another year, so as to fit in with the number, which Allah has made inviolable, thus permitting what Allah has forbidden. Their evil deeds appear to them as decorous, and Allah does not guide the faithless lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the transposing (of a prohibited month) is an addition to Unbelief: the Unbelievers are led to wrong thereby: for they make it lawful one year, and forbidden another year, in order to adjust the number of months forbidden by Allah and make such forbidden ones lawful. The evil of their course seems pleasing to them. But Allah guideth not those who reject Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The postponing (of a Sacred Month) is indeed an addition to disbelief: thereby the disbelievers are led astray, for they make it lawful one year and forbid it another year in order to adjust the number of months forbidden by Allah, and make such forbidden ones lawful. The evil of their deeds seems pleasing to them. And Allah guides not the people, who disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The postponement of sacred months is an increase in disbelief in which the unbelievers are misguided. They allow it one year and forbid it another year, so that they can make up for the months that Allah has sanctified so making lawful what Allah has forbidden. Their foul acts seem fair to them Allah does not guide the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Postponement is an increase in disbelief—by which those who disbelieve are led astray. They allow it one year, and forbid it another year, in order to conform to the number made sacred by God, thus permitting what God has forbidden. The evil of their deeds seems good to them. God does not guide the disbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the postponing [of restriction within sacred months] is an increase in disbelief by which those who have disbelieved are led [further] astray. They make it lawful one year and unlawful another year to correspond to the number made unlawful by Allah and [thus] make lawful what Allah has made unlawful. Made pleasing to them is the evil of their deeds; and Allah does not guide the disbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:37] Postponement [of the sacred month] — that is, the deferment of the sacredness of a given month to another, as they used to do during paganism, such as postponing the sacredness of Muharram, if it arrives while they are at war, to Safar — is only an excess of unbelief, because of their rejection of God’s ruling thereof, whereby those who disbelieve are led astray (yudallu may also be read yadillu, ‘[they] go astray’), one year they make it, the month postponed, profane, and hallow it another, that they may make up, by profaning one month and hallowing another in its place, the number, of months, which God has hallowed, such that they do not hallow more, or less, than the four months, but without observing the individual months themselves; and so they profane what God has hallowed. Their evil deeds have been adorned for them, such that they deem them to be good [deeds]; and God does not guide the disbelieving folk.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف بياني ناشىء عن قوله تعالى : { إن عدة الشهور عند الله } \\[ التوبة : 36 \\] الآية لأنّ ذلك كالمقدّمة إلى المقصود وهو إبطال النسيء وتشنيعه .والنسيء يطلق على الشهر الحرام الذي أرجئت حرمتُه وجعلت لشهر آخر فالنسيء فَعِيل بمعنى مفعول من نَسَأ المهموز اللام ، ويطلق مصدراً بوزن فعيل مثل نَذير من قوله : { كيف نذير } \\[ الملك : 17 \\] ، ومثل النكير والعذر وفعله نسأ المهموز ، أي أخّر ، فالنسيء بهمزة بعد الياء في المشهور . وبذلك قرأه جمهور العشرة . وقرأه ورش عن نافع بياء مشدّدة في آخره على تخفيف الهمزة ياء وإدغامِها في أختها ، والإخبارُ عن النسيء بأنّه زيادة إخبار بالمصدر كما أخبر عن هاروت وماروت بالفتنة في قوله : { إنما نحن فتنة } \\[ البقرة : 102 \\].والنسيءُ عند العرب تأخير يجعلونه لشهرٍ حرام فيصيرونه حلالاً ويحرّمون شهراً آخر من الأشهر الحلال عوضاً عنه في عامه .والداعي الذي دعا العرب إلى وضع النسيء أنّ العرب سَنَتهم قمرية تبعاً للأشهر ، فكانت سنتهم اثني عشر شهراً قمرية تامة ، وداموا على ذلك قروناً طويلة ثم بدا لهم فجعلوا النسيء .وأحسن ما روي في صفة ذلك قول أبي وائل أنّ العرب كانوا أصحاب حروب وغارات فكان يشقّ عليهم أن يمكثوا ثلاثة أشهر متوالية لا يغيرون فيها فقالوا لئن توالت علينا ثلاثة أشهر لا نُصيب فيها شيئاً لنهلِكَنّ . وسكت المفسّرون عمّا نشأ بعد قول العرب هذا ، ووقع في بعض ما رواه الطبري والقرطبي ما يوهم أنّ أوّل من نسأ لهم النسيء هو جنادة بن عوف وليس الأمر ذلك لأنّ جنادة بن عوف أدرك الإسلام وأمر النسيء متوغّل في القدم والذي يجب اعتماده أنّ أول من نسأ النسيء هو حذيفة بن عبد نعيم أو فقيم ( ولعل نعيم تحريف فقيم لقول ابن عطية اسم نعيم لم يعرف في هذا ). وهو الملقب بالقَلَمَّس ولا يوجد ذكر بني فقيم في «جمهرة ابن حزم» وقد ذكره صاحب «القاموس» وابن عطية . قال ابن حزم أول من نسأ الشهور سرير ( كذا ولعلّه سري ) بن ثعلبة بن الحارث بن مالك بن كنانة ثم ابن أخيه عدي بن عامر بن ثعلبة . وفي ابن عطية خلاف ذلك قال : انتدب القلمس وهو حذيفة بن عبدِ فقيم فنسأ لهم الشهور . ثم خلفه ابنه عبّاد . ثم ابنه قُلَع ، ثم ابنه أمية ، ثم ابنه عوف ، ثم ابنه أبو ثمامة جنادة وعليه قام الإسلامُ قال ابن عطية كان بنو فقيم أهل دين في العرب وتمسُّككِ بشرع إبراهيم فانتدب منهم القلمس وهو حذيفة بن عبد فقيم فنسأ الشهور للعرب . وفي «تفسير القرطبي» عن الضحّاك عن ابن عباس أول من نسأ عَمْرو بن لُحَي ( أي الذي أدخل عبادة الأصنام في العرب وبحر البحيرة وسيّب السائبة ).وقال الكلبي أول من نسأ رجل من بني كنانة يقال له نعيم بن ثعلبة .قال ابن حزم : كلّ من صارت إليه هذه المرتبة ( أي مرتبة النسيء ) كان يسمّى القلمس . وقال القرطبي : كان الذي يلي النسيء يظفر بالرئاسة لترييس العرب إيّاه . وكان القلمس يقف عند جمرة العقبة ويقول : اللهم إنّي ناسىءُ الشهور وواضعُها مواضعها ولا أعاب ولا أجاب . اللهم أنّي قد أحللت أحد الصفرين وحرمت صفر المؤخّر انفروا على اسم الله تعالى . وكان آخر النسأة جنادة بن عوف ويكنى أبا ثمامة وكان ذا رأي فيهم وكان يحضر الموسم على حمار له فينادي أيها الناس ألا إنّ أبا ثمامة لا يُعاب ولا يجاب . ولا مرد لما يقول فيقولون أنْسئنا شهراً ، أي أخِّرْ عنّا حرمة المحرّم واجعلها في صفر فيُحل لهم المحرّم وينادي : ألا إنّ آلهتكم قد حرمت العام صفر فيحرّمونه ذلك العام فإذا حجّوا في ذي الحجّة تركوا المحرّم وسَمّوه صفراً فإذا انسلخ ذو الحجّة خرجوا في محرّم وغزوا فيه وأغاروا وغنموا لأنّه صار صفراً فيكون لهم في عامهم ذلك صفران وفي العام القابل يصير ذو الحجة بالنسبة إليهم ذا القعدة ويصير محرّم ذا الحجة فيحجون في محرم يفعلون ذلك عامين متتابعين ثم يبدلون فيحجّون في شهر صفر عامين ولاءً ثم كذلك .وقال السهيلي في «الروض الأنف» إنّ تأخير بعض الشهور بعد مدة لقصد تأخير الحج عن وقته القمري ، تحرياً منهم للسنة الشمسية ، فكانوا يؤخّرونه في كلّ عام أحد عشر يوماً أو أكثر قليلاً ، حتى يعود الدور إلى ثلاث وثلاثين سنة ، فيعود إلى وقته ونسَب إلى شيخه أبي بكر بن العربي أنّ ذلك اعتبار منهم بالشهور العجمية ولعلّه تبع في هذا قول إياس بن معاوية الذي ذكره القرطبي ، وأحسب أنّه اشتباه .وكان النسيء بأيدي بني فقيم من كنانة وأول من نسأ الشهور هو حذيفة بن عبد بن فقيم .وتقريب زمن ابتداء العمل بالنسيء أنّه في أواخر القرن الثالث قبل الهجرة ، أي في حدود سنة عشرين ومائتين قبل الهجرة .وصيغة القصر في قوله : { إنما النسىء زيادة في الكفر } تقتضي أنّه لا يعدو كونه من أثر الكفر لمحبّة الاعتداءِ والغارات فهو قصر حقيقي ، ويلزم من كونه زيادة في الكفر أنّ الذين وضعوه ليسوا إلاّ كافرين وما هم بمصلحين ، وما الذين تابعوهم إلاّ كافرون كذلك وما هم بمتّقين .ووجه كونه كفراً أنّهم يعلمون أنّ الله شرع لهم الحجّ ووقتَّه بشهر من الشهور القمرية المعدودة المسمّاة بأسماء تميّزها عن الاختلاط ، فلمّا وضعوا النسيء قد علموا أنّهم يجعلون بعض الشهور في غير موقعه ، ويسمّونه بغير اسمه ، ويصادفون إيقاع الحج في غير الشهر المعيّن له ، أعني شهر ذي الحجّة ولذلك سمّوه النسيء اسماً مشتقّاً من مادة النَّسَاء وهو التأخير ، فهم قد اعترفوا بأنّه تأخير شيء عن وقته ، وهم في ذلك مستخفّون بشرع الله تعالى ، ومخالفون لما وقّت لهم عن تعمّد مثبتين الحلَّ لشهر حرام والحرمةَ لشهر غير حرام ، وذلك جرأة على دين الله واستخفاف به ، فلذلك يشبه جعلَهم لله شركاء ، فكما جعلوا لله شركاء في الإلهية جعلوا من أنفسهم شركاء لله في التشريع يخالفونه فيما شرعه فهو بهذا الاعتبار كالكفر ، فلا دلالة في الآية على أنّ الأعمال السيّئة توجب كفر فاعلها ولكن كفر هؤلاء أوجب عملهم الباطل .وحرف { في } المفيد الظرفية متعلّق «بزيادة» لأنّ الزيادة تتعدّى بفي { يزيد في الخلق ما يشاء } \\[ فاطر : 1 \\] فالزيادة في الأجسام تقتضي حلول تلك الزيادة في الجسم المشابهِ للظرف ويجوز أن يكون تأويله أنّه لمّا كان إحداثه من أعمال المشركين في شؤون ديانتهم وكان فيه إبطال لمواقيت الحجّ ولحرمة الشهر الحرام اعتبر زيادة في الكفر بمعنى في أعمال الكفر وإن لم يكن في ذاته كفراً وهذا كما يقول السلف : إنّ الإيمان يزيد وينقص يريدون به يزيد بزيادة الأعمال الصالحة وينقص بنقصها مع الجزم بأنّ ماهية الإيمان لا تزيد ولا تنقص وهذا كقوله تعالى : { وما كان الله ليضيع إيمانكم } \\[ البقرة : 143 \\] ، أي صلاتكم . على أنّ إطلاق اسم الإيمان على أعمال دين الإسلام وإطلاق اسم الكفر على أعمال الجاهلية ممّا طفحت به أقوال الكتاب والسنّة مع اتّفاق جمهور علماء الأمّة على أنّ الأعمال غيرَ الاعتقاد لا تقتضي إيماناً ولا كفراً .وعلى الاحتمال الثاني فتأويله بتقدير مضاف ، أي زيادة في أحوال أهل الكفر ، أي أمر من الضلال زيد على ما هم فيه من الكفر بضدّ قوله تعالى : { ويزيد الله الذين اهتدوا هدى } \\[ مريم : 76 \\]. وهذان التأويلان متقاربان لا خلاف بينهما إلا بالاعتبار ، فالتأويل الأول يقتضي أنّ إطلاق الكفر فيه مجاز مرسل والتأويل الثاني يقتضي أنّ إطلاق الكفر فيه إيجازُ حذف بتقدير مضاف .وجملة { يضل به الذين كفروا } خبر ثان عن النسيء أي هو ضلال مستمرّ ، لما اقتضاه الفعل المضارع من التجدّد .وجملة { يحلونه عاماً ويحرمونه عاماً } بيان لسبب كونه ضلالاً .وقد اختير المضارع لهذه الأفعال لدلالته على التجدّد والاستمرار ، أي هم في ضلال متجدّد مستمرّ بتجدّد سببه ، وهو تحليله تارة وتحريمه أخرى ، ومواطأة عدّة ما حرم الله .وإسناد الضلال إلى الذين كفروا يقتضي أنّ النسيء كان عمله مطّرداً بين جميع المشركين من العرب فما وقع في «تفسير الطبري» عن ابن عباس والضحّاك من قولهما وكانت هوازن وغطفان وبنو سليم يفعلونه ويعظمونه ليس معناه اختصاصهم بالنسيء ولكنّهم ابتدأوا بمتابعته .وقرأ الجمهور { يضل } بفتح التحتية وقرأه حفص عن عاصم ، وحمزةُ ، والكسائي وخلَف ، ويعقوب بضمّ التحتية على أنّهم يضلّون غيرهم .والتنكير والوحدة في قوله : { عاماً } في الموضعين للنوعية ، أي يحلّونه في بعض الأعوام ويحرّمونه في بعض الأعوام ، فهو كالوحدة في قول الشاعر :يوماً بحزوى ويوماً بالعقيق ... وليس المراد أنّ ذلك يوماً غبّ يوم ، فكذلك في الآية ليس المراد أنّ النسيء يقع عاماً غبّ عام كما ظنّه بعض المفسّرين . ونظيرُه قول أبي الطيّب :فيوماً بخيل تطْرُد الرومَ عنهم ... ويوماً بجُود تَطرد الفقرَ والجَدْبا( يريد تارة تدفع عنهم العدوّ وتارة تدفع عنهم الفقر والجدب ) وإنّما يكون ذلك حين حلول العدوّ بهم وإصابةِ الفقر والجدب بلادَهم ، ولذلك فسّره المعري في كتاب «مُعْجِز أحمد» بأنْ قال : «فإنّ قَصَدَهم الرومُ طَرَدْتَهم بخيلك وإن نازَلَهم فقر وجدب كشفتَه عنهم بجُودك وإفضالك» .وقد أبقي الكلام مجملاً لعدم تعلّق الغرض في هذا المقام ببيان كيفية عمل النسيء ، ولعلّ لهم فيه كيفيات مختلفة هي معروفة عند السامعين .ومحلّ الذمّ هو ما يحصل في عمل النسيء من تغيير أوقات الحجّ المعيّنة من الله في غير أيامها في سنين كثيرة ، ومن تغيير حرمة بعض الأشهر الحرم في سنين كثيرة ويتعلّق قوله : { ليواطئوا عدة ما حرم الله } بقوله : { يحلونه عاماً ويحرمونه عاماً } أي يفعلون ذلك ليوافقوا عدد الأشهر الحرم فتبقى أربعة .والموطأة الموافقة ، وهي مفاعلة عن الوَطىء شبه التماثل في المقدار وفي الفعل بالتوافق ( في ) وطيء الأرجل ومن هذا قولهم ( وقوع الحافر على الحافر ).و { عِدّة ما حرم الله } هي عدّة الأشهر الحرم الأربعة .وظاهر هذا أنّه تأويل عنهم وضربٌ من المعذرة ، فلا يناسب عده في سياق التشنيع بعملهم والتوبيخ لهم ، ولكن ذِكْره ليُرتَّب عليه قولُه : { فيحلوا ما حرم الله } فإنّه يتفرّع على محاولتهم موافقة عدّة ما حرم الله أن يحلّوا ما حرّم الله ، وهذا نداء على فساد دينهم واضطرابه فإنّهم يحتفظون بعدد الأشهر الحرم الذي ليس له مزيد أثر في الدين ، وإنّما هو عدد تابع لتعيين الأشهر الحرم ، ويفرّطون في نفس الحُرمة فيحلون الشهر الحرام ، ثم يزيدون باطلاً آخر فيحرّمون الشهر الحلال . فقد احتفظوا بالعدد وأفسدوا المعدود .وتوجيه عطف { فيحلوا } على مجرور لام التعليل في قوله : { ليواطئوا عدة ما حرم الله } هو تنزيل الأمر المترتّب على العلّة منزلة المقصود من التعليل وإن لم يكن قصد صاحبه به التعليل ، على طريقة التهكّم والتخطئة مثل قوله تعالى : { فالتقطه آل فرعون ليكون لهم عدواً وحزناً } \\[ القصص : 8 \\].والإتيان بالموصول في قوله : { عدة ما حرم الله } دون أن يعبّر بنحو عدة الأشهر الحرم ، للإشارة إلى تعليل عملهم في اعتقادهم بأنّهم حافظوا على عدة الأشهر التي حرّمها الله تعظيماً . ففيه تعريض بالتهكّم بهم .والإظهار في قوله : { فيحلوا ما حرم الله } دون أن يقال فيُحلوه ، لزيادة التصريح بتسجيل شناعة عملهم ، وهو مخالفتهم أمر الله تعالى وإبطالُهم حرمة بعض الأشهر الحرم ، تلك الحرمة التي لأجلها زعموا أنّهم يحرّمون بعض الأشهر الحلال حفاظاً على عدّة الأشهر التي حرّمها الله تعالى .وجملة { زين لهم سوء أعمالهم } مستأنفة استئنافاً بيانياً : لأنّ ما حكي من اضطراب حالهم يثير سؤال السائلين عن سبب هذا الضغث من الضلال الذي تمَّلأُوه فقيل : لأنّهم زيّن لهم سوء أعمالهم ، أي لأنّ الشيطان زيّن لهم سوء أعمالهم فحسّن لهم القبيح .والتزيين التحسين ، أي جعلُ شيء زيْناً ، وهو إذا يسند إلى مَا لا تتغيّر حقيقته فلا يصير حسناً ، يؤذن بأنّ التحسين تلبيس . وتقدّم التزيينُ في قوله تعالى : { زين للذين كفروا الحياة الدنيا } في سورة البقرة ( 212 ). وقوله : { كذلك زينا لكل أمة عملهم } في سورة الأنعام ( 108 ).وفي هذا الاستئناف معنى التعليل لحالهم العجيبة حتّى يزول تعجّب السامع منها .وجملة والله لا يهدي القوم الكافرين } عطف على جملة { زين لهم سوء أعمالهم } فهي مشمولة لمعنى الاستئناف البياني المراد منه التعليل لتلك الحالة الغريبة ، لأنّ التعجيب من تلك الحالة يستلزم التعجيب من دوامهم على ضلالهم وعدم اهتدائهم إلى ما في صنيعهم من الاضطراب ، حتّى يقلعوا عن ضلالهم ، فبعد أن أفيد السائل بأنّ سبب ذلك الاضطراب هو تزيين الشيطان لهم سوءَ أعمالهم ، أفيد بأنّ دوامهم عليه لأنّ الله أمسك عنهم اللطف والتوفيق ، الذيْن بهما يتفطّن الضالّ لضلاله فيقلع عنه ، جزاءاً لهم على ما أسلفوه من الكفر ، فلم يزالوا في دركات الضلال إلى أقصى غاية .والإظهار في مقام الإضمار بقوله : { القوم الكافرين } لقصد إفادة التعميم الذي يشملهم وغيرهم ، أي : هذا شأن الله مع جميع الكافرين .واعلم أنّ حرمة الأزمان والبقاع إنّما تُتلقَّى عن الوحي الإلهي لأنّ الله الذي خلق هذا العالم هو الذي يسُنّ له نظامَه فبذلك تستقرّ حرمة كلّ ذي حرمة في نفوس جميع الناس إذ ليس في ذلك عمل لبعضهم دون بعض ، فإذا أدخل على ما جعله الله من ذلك تغييرٌ تقشّعت الحرمة من النفوس فلا يرضى فريق بما وضعه غيره من الفرق ، فلذلك كان النسيء زيادة في الكفر لأنّه من الأوضاع التي اصطلح عليها الناس ، كما اصطلحوا على عبادة الأصنام بتلقين عمرو ابن لحَيّ .وقد أوْحَى الله لرسوله صلى الله عليه وسلم أنّ العامَ الذي يَحُجّ فيه يصادف يومُ الحجّ منه يومَ تسعة من ذي الحجة ، على الحساب الذي يتسلسل من يوم خلق الله السماوات والأرض ، وأنّ فيه يندحض أثر النسيء ولذلك قال النبي صلى الله عليه وسلم في خطبة حجّة الوداع « إنّ الزمان قد استدار كهيئتِه يومَ خلق اللَّهُ السماوات والأرض » ، قالوا فصادفت حجّة أبي بكر سنة تسع أنّها وقعت في شهر ذي القعدة بحساب النسيء ، فجاءت حجّةُ النبي صلى الله عليه وسلم في شهر ذي الحجّة في الحساب الذي جعله الله يومَ خلق السماوات والأرض .\n\n",
      "translations": [
        {
          "translation": "(Postponement (of a sacred month) is only an excess of disbelief) He says: postponement of the month of Muharram to the month of Safar is an excess of disbelief (whereby those who disbelieve are misled) they are wrong to postpone Muharram to Safar, (they allow it) i.e. Muharram (one year) and thus fight in it (and forbid it) i.e. Muharram ((another) year) and thus abstain from fighting during it. And so when they used to do this, Muharram would not be considered sacred while Safar became sacred instead, (that they may make up) that they may match (the number of the months which Allah hath hallowed) four in number, (so that they allow that which Allah hath forbidden) i.e. Muharram. (The evil of their deeds is made fair-seeming unto them. Allah guideth not) leads not to His religion (the disbelieving folk) those who do not deserve it. The one who used to postpone the sacred months was a man called Nu'aym Ibn Tha'labah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّمَا ٱلنَّسِيۤءُ زِيَادَةٌ فِي ٱلْكُفْرِ } هُمْ قَومٌ مِن بَني كِنَانة كَانوا يَنسَئونَ الشّهورَ: معناهُ يؤخِّرونَها لِحربٍ أَو لأمرٍ فَيِجْعَلونَ ذِي الحِجةِ في المُحرَّمِ وذي القعدةِ أَو غَيرها مِن الشّهورِ\n\n\n\n\nوقوله تعالى: { لِّيُوَاطِئُواْ } معناه لِيوافِقوا\n\n",
      "translations": [
        {
          "translation": "\nThe meaning of the verse {Indeed, evil is an increase in disbelief} is that they are a people from the tribe of Kinanah who used to annul the months: meaning they would delay it for war or some matter, so they would make Dhu al-Hijjah in the sacred month or Dhu al-Qa‘dah or other months.\n\n\nAnd His saying, \"Let them be even,\" means let them be in agreement.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتبديلها كفر آخر { يُضَلُّ بِهِ ٱلَّذِينَ كَفَرُواْ } أي: بسبب تبديلهم إضلالاً زائداً على ضلالهم الأصلي\n إذ { يُحِلُّونَهُ } أي: النسيء الذي يؤخرونه { عَاماً } سنة { وَيُحَرِّمُونَهُ عَاماً } أخر بلا رعاية خصوصية في التحريم\n وليس غرضهم من هذا التحليل والتحريم إلاَّ { لِّيُوَاطِئُواْ } ويوافقوا { عِدَّةَ مَا حَرَّمَ ٱللَّهُ } وهي الأربعة من غير التفات إلى خصوصية { فَيُحِلُّواْ } بفعلهم وتبديلهم { مَا حَرَّمَ ٱللَّهُ } بخصوصه\n وما ذلك إلا أن { زُيِّنَ } أي: حسن وحبب لهم { لَهُمْ سُوۤءُ أَعْمَالِهِمْ } أي: تحليلهم وتبديلهم القبيح { وَٱللَّهُ } الهادي لعباده إلى صوب جنابه { لاَ يَهْدِي ٱلْقَوْمَ ٱلْكَافِرِينَ } [التوبة: 37] الخارجين عن مقتضى مأموراته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: النسيء: التأخير، يقال بالهمزة وبقلبها ياء. يقول الحق جل جلاله: { إنما النسيءُ } ، وهو تأخير حرمة الشهر الحرام إلى شهر آخر، وذلك أن العرب كانوا أصحاب حروب وإغارات، وكانت محرمة عليهم في الأشهر الحرم، فيشق عليهم تركها، فيجعلونها في شهر حرام، ويحرمون شهراً آخر بدلاً منه، وربما أحلوا المحرم وحرموا صفر، حتى يُكملوا في العام أربعة أشهر محرمة، وإنما ذلك { زيادةٌ في الكفر } لأنه تحريم ما أحل الله، وتحليل ما حرم الله، وهو كفر آخر ضموه إلى كفرهم، { يُضَلُّ به الذين كفروا } عن الحق، ضلالاً زائداً على ضلالهم، أو يضلهم الله بذلك، { يُحلونه عاماً } أي: يحلون الشهر الحرام عاماً، ويجعلون مكانه آخر، { ويحرمونه عاما } ، فيتركونه على حرمته، فكانوا تارة ينسئون وتارة يتركون. قيل: أول من أحدث ذلك: جُنادَهُ بن عوف الكناني كان يقوم على جمل في الموسم فينادي: إن آلهتكم قد أحلت لكم المحرم فأحلوه، ثم ينادي من قابل: إن آلهتكم قد حرمت عليكم المحرم فحرموه، فتتبعه العرب. ثم حرّموا شهراً آخر مكان المحرم { ليواطئُوا } ليوافقوا { عِدَّةَ ما حرّمَ الله } ، وهي الأربعة الحرم، { فيُحلّوا ما حرّم الله } عليهم من القتال في الأشهر الحرم، { زُيِّنَ لهم سوء أعمالهم } أي: خذلهم وأضلهم، والمُزين حقيقة: الله، أو الشيطان حكمةً وأدباً. { والله لا يهدي القوم الكافرين } إلى طريق الرشد، ما داموا على غيهم، حتى يسلكوا سبيل نبيه صلى الله عليه وسلم. الإشارة: إنما تأخير التوبة واليقظة، وترك السير إلى مقام التصفية والترقية، زيادة في البعد والقسوة، يضل به الذين هجروا طريق التربية والتصفية، عن مقام أهل الإحسان والمعرفة، فتارةً يُحلون المقام مع النفس الأمارة، ويقولون: قد انقطعت التربية، وعُدِمَ الطبيبُ الذي يداويها ويخرجها عن وصفها، وتارة يُحرمون المقام معها والاشتغال بحظوظها وهواها، ويقولون: البركة لا تنقطع، والمدد لا ينعدم، ليوافقوا بين الأمر بمجاهدتها في قوله: { والذين جاهدوا فينا } ، وبين من قال: قد انقطعت التربية، زُين له سواء أعمالهم، والله لا يهدي القوم الكافرين إلى السير والوصول إلى ربهم. ثم عاتبهم على التأخر عن الجهاد في غزوة تبوك، فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ مَا لَكُمْ إِذَا قِيلَ لَكُمُ ٱنفِرُواْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:14",
      "similarity": 0.530688087794403
    },
    {
      "verse": "73:6",
      "similarity": 0.32813575171087594
    },
    {
      "verse": "33:27",
      "similarity": 0.3208876961627402
    },
    {
      "verse": "9:126",
      "similarity": 0.241336168420357
    },
    {
      "verse": "48:25",
      "similarity": 0.2357410297349124
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009037.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009037.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:37.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}