{
  "chapter": "التوبة",
  "text": "يايها الذين ءامنوا۟ ما لكم اذا قيل لكم انفروا۟ فى سبيل الله اثاقلتم الى الارض ارضيتم بالحيوة الدنيا من الءاخرة فما متع الحيوة الدنيا فى الءاخرة الا قليل",
  "translations": [
    {
      "translation": "You who have iman! what is the matter with you that when you are told, 'Go out and fight in the way of Allah,' you sink down heavily to the earth? Are you happier with this world than the Next World? Yet the enjoyment of this world is very small compared to that of the Next World.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What has happened to you, O believers, that when you are asked to set out in the cause of God your feet begin to drag? Do you find the life of the world so pleasing that you forget the life to come? Yet the profit of the life of this world is but meagre as compared to the life to come.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! What is amiss with you that when it is said to you: \"March forth in the cause of Allah,\" you cling heavily to the earth? Do you prefer the worldly life to the Hereafter? Know well that all the enjoyment of this world, in comparison with the Hereafter, is trivial.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, why is it that when you are told to march for the cause of God, you seem to linger at home. Have you given preference to the worldly life over the life hereafter? The worldly gains compared to those of the next life are but very little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! What is the matter with you, that when it is said to you, “Migrate in Allah's cause”, you sit on the ground with heaviness? Have you preferred this worldly life over the Hereafter? And the wealth of the life of this world, in comparison with the Hereafter, is but only a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! What is the matter with you, that when you are asked to march forth in the cause of Allah, you cling heavily to the earth Are you pleased with the life of this world rather than the Hereafter But little is the enjoyment of the life of this world compared to the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! What (excuse) have you that when it is said to you: Go forth in Allah's way, you should incline heavily to earth; are you contented with this world's life instead of the hereafter? But the provision of this world's life compared with the hereafter is but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, what is amiss with you, that when it is said to you, 'Go forth in the way of God,' you sink down heavily to the ground? Are you so content with this present life, rather than the world to come? Yet the enjoyment of this present life, compared with the world to come, is a little thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! What aileth you that when it is said unto you: Go forth in the way of Allah, ye are bowed down to the ground with heaviness. Take ye pleasure in the life of the world rather than in the Hereafter? The comfort of the life of the world is but little in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, what is the matter with you that when you are asked to go forth in the cause of God, you cling slothfully to the land? Do you prefer the life of this world to the Hereafter? But little is the comfort of this life, compared to that of the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! what aileth you that when it is said unto you: march forth in the way of Allah, ye are weighed down earthward? Are ye pleased with the life of the world rather than the Hereafter? whereas the enjoyment of the life of the world by the side of the Hereafter is but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! What is the matter with you that when you are told: ‘Go forth in the way of Allah,’ you sink heavily to the ground? Are you pleased with the life of this world instead of the Hereafter? But the wares of the life of this world compared with the Hereafter are but insignificant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! what is the matter with you, that, when ye are asked to go forth in the cause of Allah, ye cling heavily to the earth? Do ye prefer the life of this world to the Hereafter? But little is the comfort of this life, as compared with the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! What is the matter with you, that when you are asked to march forth in the Cause of Allah (i.e. Jihad) you cling heavily to the earth? Are you pleased with the life of this world rather than the Hereafter? But little is the enjoyment of the life of this world as compared with the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, why is it that when it is said to you: 'March in the Way of Allah' you linger with heaviness in the land? Are you content with this life rather than theEverlasting Life? Yet the enjoyment of this life in (comparison to) the Everlasting Life is little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! What is the matter with you, when it is said to you, “Mobilize in the cause of God,” you cling heavily to the earth? Do you prefer the present life to the Hereafter? The enjoyment of the present life, compared to the Hereafter, is only a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, what is [the matter] with you that, when you are told to go forth in the cause of Allah, you adhere heavily to the earth? Are you satisfied with the life of this world rather than the Hereafter? But what is the enjoyment of worldly life compared to the Hereafter except a [very] little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:38]   When the Prophet (s) summoned men for the Tabūk campaign, and they thought it too burdensome, because of the hardship and the extreme heat from which they were suffering, the following was revealed: O you who believe, what is wrong with you that, when it is said to you, ‘Go forth in the way of God,’ you sink down heavily (iththāqaltum: the original tā’ [of tathāqaltum] has been assimilated with the thā’, and the conjunctive hamza has been supplied), in other words, you hesitate and are disinclined to [participate in] the struggle, to the ground, to stay sitting upon it? (the interrogative is meant as a rebuke). Are you so content with the life of this world, and its delights, rather than with the Hereafter?, that is, in place of its bliss? Yet the enjoyment of the life of this world is, in, comparison with the enjoyment of, the Hereafter but little, trivial.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذا ابتداء خطاب للمؤمنين للتحريض على الجهاد في سبيل الله ، بطريقة العتاب على التباطىء بإجابة دعوة النفير إلى الجهاد ، والمقصود بذلك غزوة تبوك . قال ابن عطية : «لا اختلاف بين العلماء في أنّ هذه الآية نزلت عتاباً على تخلّف مَن تخلّف عن غزوة تبوك ، إذ تخلّف عنها قبائل ورجال من المؤمنين والمنافقون» فالكلام متّصل بقوله : { وقاتلوا المشركين كافة } \\[ التوبة : 36 \\] وبقوله { قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر إلى قوله فذوقوا ما كنتم تكنزون } \\[ التوبة : 29 35 \\] كما أشرنا إليه في تفسير تلك الآيات .وهو خطاب للذين حصل منهم التثاقل ، وكان رسول الله صلى الله عليه وسلم استنفر المسلمين إلى تلك الغزوة ، وكان ذلك في وقت حرّ شديد ، واستقبل سفراً بعيداً ومفازاً ، حين نضجت الثمار ، وطابت الظلال ، وكان المسلمون يومئذٍ في شدّة حاجة إلى الظهر والعُدّة . فلذلك سُمّيت غزوة العُسرة كما سيأتي في هذه السورة ، فجلى رسولُ الله للمسلمين أمرهم ليتأهّبوا أهبة عدوّهم ، وأخبرهم بوجههِ الذي يريد ، وكان قبل ذلك لا يريد غزوة إلاّ وَرَّى بما يوهم مكاناً غير المكان المقصود ، فحصل لبعض المسلمين تثاقل ، ومن بعضهم تخلّف ، فوجه الله إليهم هذا الملام المعقّب بالوعيد .فإنّ نحن جرَينا على أنّ نزول السورة كان دفعة واحدة ، وأنّه بعد غزوة تبوك ، كما هو الأرجح ، وهو قول جمهور المفسّرين ، كان محمل هذه الآية أنّها عتاب على ما مضى وكانت { إذا } مستعملة ظرفاً للماضي ، على خلاف غالب استعمالها ، كقوله تعالى : { وإذا رأوا تجارة أو لهواً انفضوا إليها } \\[ الجمعة : 11 \\] وقوله : { ولا على الذين إذا ما أتوك لتحملهم قلت لا أجد } \\[ التوبة : 92 \\] الآية ، فإنّ قوله : { وما لكم لا تقاتلون في سبيل الله } \\[ النساء : 75 \\] صالح لإفادَة ذلك ، وتحذيرٌ من العودة إليه ، لأنّ قوله : { إلاَّ تنفروا } و { إلاّ تنصروه } و { انفروا خفافاً } مراد به ما يستقبل حين يُدعَون إلى غزوة أخرى ، وسنبيّن ذلك مفصّلاً في مواضعه من الآيات .وإن جرينا على ما عَزاه ابن عطية إلى النقاش : أنّ قوله تعالى : { يا أيها الذين آمنوا ما لكم إذا قيل لكم انفروا في سبيل الله اثاقلتم إلى الأرض } هي أول آية نزلت من سورة براءة ، كانت الآية عتاباً على تكاسلٍ وتثاقلٍ ظهرا على بعض الناس ، فكانت { إذا } ظرفاً للمستقبل ، على ما هو الغالب فيها ، وكان قوله : { إلا تنفروا يعذبكم عذاباً أليماً } \\[ التوبة : 39 \\] تحذيراً من ترك الخروج إلى غزوة تبوك ، وهذا كلّه بعيد ممّا ثبت في «السيرة» وما ترجّح في نزول هذه السورة .و { مَا } في قوله : و { ما لكم } اسم استفهام إنكاري ، والمعنى : أي شيء ، و { لكم خبر عن الاستفهام أي : أي شيء ثَبت لكم .وإذا } ظرف تعلّق بمعنى الاستفهام الإنكاري على معنى : أنّ الإنكار حاصل في ذلك الزمان الذي قيل لهم فيه : انفروا ، وليس مضمّناً معنى الشرط لأنّه ظرفُ مُضيّ .وجملة { اثاقلتم } في موضع الحال من ضمير الجماعة ، وتلك الحالة هي محل الإنكار ، أي : ما لكم متثاقلين . يقال : ما لكَ فعلت كذا ، وما لك تَفعل كذا كقوله : { ما لكم لا تناصرون } \\[ الصافات : 25 \\] ، وما لك فاعِلاً ، كقوله : { فما لكم في المنافقين فئتين } \\[ النساء : 88 \\].والنَّفْر : الخروج السريع من موضع إلى غيره لأمرٍ يحدث ، وأكثر ما يطلق على الخروج إلى الحرب ، ومصدره حينئذٍ النفير .وسبيل الله : الجهاد ، سمّي بذلك لأنّه كالطريق الموصّل إلى الله ، أي إلى رضاه .و { اثَّاقلتم } أصله تثاقلتم قلبت التاء المثنّاة ثاء مثلّثة لتقارب مخرجيهما طلباً للإدغام ، واجتلبت همزة الوصل لإمكان تسكين الحرف الأول من الكلمة عند إدغامه .( والتثاقل ) تكلّف الثقل ، أي إظهار أنّه ثقيل لا يستطيع النهوض .والثِقَل حالة في الجسم تقتضي شدّة تطلّبه للنزول إلى أسفل ، وعُسرَ انتقاله ، وهو مستعمل هنا في البطء مجازاً مرسلاً ، وفيه تعريض بأنّ بُطأهم ليس عن عجز ، ولكنّه عن تعلّق بالإقامة في بلادهم وأموالهم .وعُدّي التثاقل ب { إلى } لأنّه ضمن معنى المَيل والإخلاد ، كأنّه تثاقل يطلب فاعله الوصول إلى الأرض للقعود والسكون بها .والأرض ما يمشي عليه الناس .ومجموع قوله : { اثاقلتم إلى الأرض } تمثيل لحال الكارهين للغزو المتطلّبين للعُذر عن الجهاد كسلاً وجبناً بحال من يُطلب منه النهوض والخروج ، فيقابل ذلك الطلب بالالتصاق بالأرض ، والتمكّن من القعود ، فيأبى النهوض فضلاً عن السير .وقوله : { إلى الأرض } كلام موجه بديع : لأنّ تباطؤهم عن الغزو ، وتطلّبهم العذر ، كان أعظم بواعثه رغبتهم البقاء في حوائطهم وثمارهم ، حتّى جعل بعض المفسّرين معنى اثاقلتم إلى الأرض : ملتم إلى أرضكم ودياركم .والاستفهام في { أرضيتم بالحياة الدنيا } إنكاري توبيخي ، إذ لا يليق ذلك بالمؤمنين .و { مِنْ } في { من الآخرة } للبدل : أي كيف ترضون بالحياة الدنيا بدلاً عن الآخرة . ومثل ذلك لا يُرضَى به والمراد بالحياة الدنيا ، وبالآخرة : منافعهما ، فإنّهم لمّا حاولوا التخلّف عن الجهاد قد آثروا الراحة في الدنيا على الثواب الحاصل للمجاهدين في الآخرة .واختير فعل { رَضيتم } دون نحو آثرتم أو فضّلتم : مبالغة في الإنكار ، لأن فعل ( رضي بكذا ) يدلّ على انشراح النفس ، ومنه قول أبي بكر الصديق في حديث الغار «فشرب حتّى رضيت» .والمَتاع : اسم مصدر تمتّع ، فهو الالتذاذ والتنعّم ، كقوله : { متاعاً لكم ولأنعامكم } \\[ عبس : 32 \\] ووصفه ب { قليل } بمعنى ضعيف ودنيء استعير القليل للتافه .ويحتمل أن يكون المتاع هنا مراداً به الشيء المتمتّع به ، من إطلاق المصدر على المفعول ، كالخلق بمعنى المخلوق فالإخبار عنه بالقليل حقيقة .وحرف { في } من قوله : { في الآخرة } دالّ على معنى المقايسة ، وقد جعلوا المقايسة من معاني { في } كما في «التسهيل» و«المغني» ، واستشهدوا بهذه الآية أخذاً من «الكشاف» ولم يتكلّم على هذا المعنى شارحوهما ولا شارحو «الكشّاف» ، وقد تكرّر نظيره في القرآن كقوله في سورة الرعد ( 26 ){ وما الحياة الدنيا في الآخرة إلا متاع } ، وقوله في حديث مسلم ما الدنيا في الآخرة إلاّ كمثَل ما يجعل أحدكم أصبعه في اليمّ فلينظر بم يرجع وهو في التحقيق ( مِن ) الظرفية المجازية : أي متاع الحياة الدنيا إذا أقحم في خيرات الآخرة كان قليلاً بالنسبة إلى كثرة خيرات الآخرة ، فلزم أنّه ما ظهرت قلّته إلاّ عندما قيس بخيرات عظيمة ونسب إليها ، فالتحقيق أنّ المقايسة معنى حاصل لاستعماللِ حرف الظرفية ، وليس معنى موضوعاً له حرف ( في ).\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe!) the address is to the Companions of Muhammad (pbuh) (What aileth you that when it is said unto you: Go forth) with your Prophet (in the way of Allah) in obedience of Allah at the Battle of Tabuk, (ye are bowed down to the ground with heaviness) you wish to remain bowed down to the ground. (Take ye pleasure in the life of the world) i.e. in that which is in the life of this world (rather than in the Hereafter? The comfort of the life of the world is but little in the Hereafter) and will not last.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قِيلَ لَكُمُ ٱنفِرُواْ فِي سَبِيلِ ٱللَّهِ } معناهُ أُخرُجُوا { ٱثَّاقَلْتُمْ } معناه تَثَاقَلتُم\n\n\n\n\nوقوله تعالى:\n\n[الأعراف: 176] معناهُ سَكَنَ إِليهَا\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {It was said to you, \"Go forth in the way of Allah.\"} Its meaning is that you should go out {you have become heavy} Its meaning is that you have become heavy.\n\n\nAnd His saying, {Exalted is He}, \"O Iblees, what prevented you from prostrating to that which I created with My hands? Were you arrogant [then], or were you [one] of the exalted?\"\n It means \"He dwelt with her\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ مَا } ذا عرض ولحق { لَكُمْ إِذَا قِيلَ لَكُمُ ٱنفِرُواْ فِي سَبِيلِ ٱللَّهِ } لنصرة دينه وإعلاء كلمة توحيده { ٱثَّاقَلْتُمْ } أي: تثاقلتم وتعاللتم وتباطأتم\n وصرتم من غاية ثقلكم وتكاسلكم كأنكم تلزقون { إِلَى ٱلأَرْضِ أَرَضِيتُمْ } أيها المستبطئون { بِٱلْحَيَاةِ ٱلدُّنْيَا } الدنية الحقيرة ومزخرفاتها الفانية بدلاً { مِنَ ٱلآخِرَةِ } ولذاتها الباقية { فَمَا مَتَاعُ ٱلْحَيَاةِ ٱلدُّنْيَا } والاستمتاع بها\n والتلذذ بمستلذاتها ومشتهياتها { فِي ٱلآخِرَةِ } أي: جنب لذاتها ودرجاتها { إِلاَّ قَلِيلٌ } [التوبة: 38] مستحقر مسترذل\n بل فانٍ مطلقاً\n لا وجود لها أصلاً عند من كحل الله عين بصيرته\n وأذهب عمى قلبه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: اثاقلتم\n أصله: تثاقلتم أدغمت التاء في الثاء\n وجلبت الهمزة للساكن\n وقرئ على الأصل\n وضمن معنى الإخلاد\n فَعُدِّيَ بإلى\n  يقول الحق جل جلاله: { يا أيها الذين آمنوا ما لكم إذا قيل لكم انفروا في سبيل الله } للجهاد مع رسول الله صلى الله عليه وسلم\n { اثَّاقلتُم } أي: تباطأتم وأخلدتم { إلى الأرض } كسلاً وفشلاً\n وكان ذلك في غزوة تبوك\n أُمروا بها بعد رجوعهم من الطائف\n في وقت عسر\n وحَر\n وبُعد الشقة\n وكثرة العدو\n فشق عليهم ذلك\n { أرضيتُم بالحياة الدنيا } وكدرها\n { من الآخرة } \n بدل الآخرة ونعيمها\n { فما متاع الحياة الدنيا } أي: التمتع بها في جانب الآخرة\n { إلا قليلٌ } مستحقر\n لسرعة فنائه ومزجه بالكدر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:41",
      "similarity": 0.5267643341355229
    },
    {
      "verse": "25:60",
      "similarity": 0.4607358340683567
    },
    {
      "verse": "17:41",
      "similarity": 0.40986985513012275
    },
    {
      "verse": "72:1",
      "similarity": 0.38687064858749126
    },
    {
      "verse": "9:39",
      "similarity": 0.37497531934995026
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009038.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009038.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:38.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}