{
  "chapter": "التوبة",
  "text": "الا تنفروا۟ يعذبكم عذابا اليما ويستبدل قوما غيركم ولا تضروه شيـا والله على كل شىء قدير",
  "translations": [
    {
      "translation": "If you do not go out to fight, He will punish you with a painful punishment and substitute another people in your place. You will not harm Him in any way. Allah has power over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unless you go out (to strive), God will inflict grievous punishment on you, and bring other people in your place, and you will not be able to harm Him in the least, for God has the power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do not march forth, Allah will chastise you grievously and will replace you by another people, while you will in no way be able to harm Him. Allah has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do not march for His cause, He will afflict your with a painful punishment and replace you by another nation and your (destruction) will not harm Him at all. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do not migrate, He will afflict you with a painful punishment and bring other people in your stead and you will not be able to harm Him in the least; and Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you march not forth, He will punish you with a painful torment and will replace you by another people; and you cannot harm Him at all, and Allah is able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do not go forth, He will chastise you with a painful chastisement and bring in your place a people other than you, and you will do Him no harm; and Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you go not forth, He will chastise you with a painful chastisement, and instead of you He will substitute another people; and you will not hurt Him anything, for God is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye go not forth He will afflict you with a painful doom, and will choose instead of you a folk other than you. Ye cannot harm Him at all. Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do not go forth, He will punish you sternly and replace you by other people. You will not harm Him in the least. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye march not forth, He will torment you with a torment afflictive, and will substitute for you a people-other than you; and Him ye cannot hurt in aught; and Allah is over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do not go forth, He will punish you with a painful punishment, and replace you with another people, and you will not hurt Him in the least, and Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unless ye go forth, He will punish you with a grievous penalty, and put others in your place; but Him ye would not harm in the least. For Allah hath power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you march not forth, He will punish you with a painful torment and will replace you by another people, and you cannot harm Him at all, and Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do not go forth, He will punish you with a painful punishment and replace you by another nation. You will in no way harm Him; for Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unless you mobilize, He will punish you most painfully, and will replace you with another people, and you will not harm Him at all. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do not go forth, He will punish you with a painful punishment and will replace you with another people, and you will not harm Him at all. And Allah is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:39] If (illā: lā has been assimilated with the nūn of the conditional particle in, in both instances [here and in the next verse]) you do not go forth, [if you do not] set out with the Prophet (s) for the struggle, He will chastise you with a painful chastisement, and He will substitute [you with] another folk other than you, that is, He will bring them in your place, and you will not hurt Him, that is, God, or [‘him’ as being] the Prophet (s), at all, should you neglect to help him [to victory], for God [Himself] will indeed bring victory to His religion; for God has power over all things, including bringing victory to His religion and His Prophet.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If ye go not forth) with your Prophet at the Battle of Tabuk (He will afflict you with a painful doom) in this world and in the Hereafter, (and will choose instead of you a folk other than you) who are better and more obedient than you. (Ye cannot harm Him all) i.e. by staying back you cannot harm Allah. (Allah is Able to do all things) whether it is punishment or reward.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ تَنفِرُواْ } بعدما أمرتم به { يُعَذِّبْكُمْ } الله المنتقم منكم { عَذَاباً أَلِيماً } باستيلاء عدوكم عليكم\n واستئصالكم بأفظع الوجوه وأفزعها { وَ } بعد إهلاكهم { يَسْتَبْدِلْ } منكم { قَوْماً غَيْرَكُمْ } مطيعين لأمره\n منقادين لحمه\n لينفروا في سبيله\n كأهل اليمن والفرس { وَ } اعلموا أنكم بتكاسلكم وتقاعدكم عن القتال المأمور { لاَ تَضُرُّوهُ شَيْئاً } إذ هو منزه عن تقويتكم وإضراركم\n وكفركم وإيمانكم { وَٱللَّهُ } المنتقم على من خرج عن مقتضى أمره { عَلَىٰ كُلِّ شَيْءٍ } من صور الانتقام { قَدِيرٌ } [التوبة: 39] لا يخرج عن حيطة قدرته شيء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إلاّ تنفرُوا } مع رسوله إلى ما استنفرتم إليه\n { يُعذبكم عذاباً إليماً } في الدنيا والآخرة\n في الدنيا: بالإهلاك بأمر فظيع\n كقحط وظهور عدو\n وغير ذلك من المهلكات\n وفي الآخرة: بعذاب النار\n { ويستبدلْ } مكانكم { قوماً غيركم } في الدنيا\n يكونون مطيعين لله ورسوله\n كأهل اليمن\n وأمثالهم\n { ولا تضرُّوه شيئاً } إذ لا يقدح تثاقلكم في نصر دينه شيئاً\n فإنه الغني عن كل شيء\n في كل وقت\n وقيل: الضمير للرسول صلى الله عليه وسلم فإن الله وعده بالعصمة والنصرة\n ووعده حق\n { والله على كل شيء قدير } لا يعجزه شيء\n فيقدر على التبديل وتغيير الأسباب والنصرة بلا مدد\n كما فعل معه في الغار والهجرة\n على ما ياتي\n الإشارة: ما لكم إذا قيل لكم: انفروا إلى من يُعرفكم بالله\n ويعلمكم كيف تجاهدون نفوسكم في طلب مرضاة الله\n اثاقلتم وأخلدتم إلى أرض الحظوظ والشهوات\n أرضيتم بالحياة الدنيا الدنية\n بل الحياة الأبدية\n في الحضرة القدسية؟ أرضيتم بحياة الأشباح بدل حياة الأرواح؟ فما متاع الحياة الدنيا الفانية في جانب الحياة الأبدية في الحضرة العلية\n إلا نزر قليل حقير ذليل\n إلا تنفروا لجهاد نفوسكم\n يعذبكم عذاباً أليماً\n بغم الحجاب\n وشدة التعب والنصب\n وتوارد الخواطر والهموم\n وترادُف الأكدار والغموم\n ويستبدل قوماً غيركم يكونون عارفين بالله\n مَرْضيين عند الله\n راضين عن الله\n والله على كل شيء قدير\n ثم ذكر نصرته لرسوله بلا سبب\n فقال: { إِلاَّ تَنصُرُوهُ فَقَدْ نَصَرَهُ ٱللَّهُ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:60",
      "similarity": 0.5033585302055388
    },
    {
      "verse": "17:41",
      "similarity": 0.4430439430083715
    },
    {
      "verse": "72:1",
      "similarity": 0.43365332968656983
    },
    {
      "verse": "9:38",
      "similarity": 0.37497531934995026
    },
    {
      "verse": "35:42",
      "similarity": 0.3599765236746358
    }
  ]
}