{
  "chapter": "التوبة",
  "text": "الا الذين عهدتم من المشركين ثم لم ينقصوكم شيـا ولم يظهروا۟ عليكم احدا فاتموا۟ اليهم عهدهم الى مدتهم ان الله يحب المتقين",
  "translations": [
    {
      "translation": "except those among the idolaters you have treaties with, who have not then broken their treaties with you in any way, nor granted assistance to anyone against you. Honour their treaties until their time runs out. Allah loves those who have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those idolaters with whom you have a treaty, who have not failed you in the least, nor helped anyone against you. Fulfil your obligations to them during the term (of the treaty). God loves those who take heed for themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In exception to those who associate others with Allah in His Divinity are those with whom you have made treaties and who have not violated their treaties nor have backed up anyone against you. Fulfil your treaties with them till the end of their term. Surely Allah loves the pious.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This does not apply to the pagans with whom you have a valid peace treaty and who have not broken it from their side or helped others against you. You (believers) must fulfill the terms of the peace treaty with them. God loves the pious ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Other than those polytheists with whom you had a treaty, and they have not diminished anything from your treaty nor supported anyone against you – therefore fulfil their treaty up to the appointed term; indeed Allah befriends the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those of the Mushrikin with whom you have a treaty, and who have not subsequently failed you in aught, nor have supported anyone against you. So fulfill their treaty for them until the end of their term. Surely, Allah loves those who have Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those of the idolaters with whom you made an agreement, then they have not failed you in anything and have not backed up any one against you, so fulfill their agreement to the end of their term; surely Allah loves those who are careful (of their duty).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "excepting those of the idolaters with whom you made covenant, then they failed. you naught neither lent support to any man against you. With them fulfil your covenant till their term; surely God loves the godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Excepting those of the idolaters with whom ye (Muslims) have a treaty, and who have since abated nothing of your right nor have supported anyone against you. (As for these), fulfil their treaty to them till their term. Lo! Allah loveth those who keep their duty (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who have honoured the treaty you made with them and who have not supported anyone against you: fulfill your agreement with them to the end of their term. God loves those who are righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those of the associators with whom ye covenanted and they have not failed you in aught, nor have they backed up anyone against you; so fulfil unto them their covenant till their full period. Verily Allah loveth the Godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(barring the polytheists with whom you have made a treaty, and who did not violate any [of its terms] with you, nor backed anyone against you. So fulfill the treaty with them until [the end of] its term. Indeed Allah loves the Godwary).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(But the treaties are) not dissolved with those Pagans with whom ye have entered into alliance and who have not subsequently failed you in aught, nor aided any one against you. So fulfil your engagements with them to the end of their term: for Allah loveth the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those of the Mushrikun with whom you have a treaty, and who have not subsequently failed you in aught, nor have supported anyone against you. So fulfill their treaty to them to the end of their term. Surely Allah loves Al- Mattaqun (the pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those idolaters who have fully honored their treaties with you and aided none against you. With these fulfill your covenant till their term. Surely, Allah loves the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for those among the polytheists with whom you had made a treaty, and did not violate any of its terms, nor aided anyone against you. So fulfill the treaty with them to the end of its term. God loves the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Excepted are those with whom you made a treaty among the polytheists and then they have not been deficient toward you in anything or supported anyone against you; so complete for them their treaty until their term [has ended]. Indeed, Allah loves the righteous [who fear Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:4] Excepting those of the idolaters with whom you have made a pact, and who have not diminished [their commitment to] you in anyway, with regard to the terms of the pact, nor supported, assisted, anyone, from among the disbelievers, against you; [as for these] fulfil your pact with them until, the completion of, the term, to which you have agreed. Truly God loves those who fear [Him], by fulfilling pacts.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Excepting those of the idolaters with whom ye (Muslims) have a treaty) i.e. the Banu Kinanah after the year of al-Hudaybiyyah, (and who have since abated nothing of your right) who they did not break their treaties, i.e. those who had a nine month treaty (nor have supported anyone) of your enemies (against you. (As for these), fulfil their treaty to them till their term) i.e. nine months. (Lo! Allah loveth those who keep their duty (unto Him)) by not breaking their treaties.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ولم يظاهروا عليكم أحداً } لبقاء الوصلة الأصلية والمودّة الفطرية بينكم وبينهم وعدم ظهور العداوة الكسبية { فأتموا إليهم عهدهم إلى مدتهم } أي: مدة تراكم الرين وتحقق الحجاب إن لم يرجعوا أو يتوبوا { إن الله يحب المتّقين } الذين اجتنبوا الرذائل خصوصاً نقض العهد الذي هو أمّ الرذائل ظاهراً وباطناً",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لمَّا لم يصدر عن بعض المشركين شيء من أمارات النقض والإتيان وعلامات المخالفة والمخادعة استثناهم الله سبحانه\n وأمر المؤمنين بمحافظة عهودهم إلى انقضاء المدة المعلومة\n فقال: { إِلاَّ ٱلَّذِينَ عَاهَدتُّم مِّنَ ٱلْمُشْرِكِينَ ثُمَّ } بعد المعاهدة { لَمْ يَنقُصُوكُمْ شَيْئاً } مما عاهدوا عليه والتزموا حفظه\n بل داوموا على حفظها { وَ } مع ذلك { لَمْ يُظَاهِرُواْ } ولم يعانوا { عَلَيْكُمْ أَحَداً } من أعدائكم حفظاً لعهدكم وميثاقكم { فَأَتِمُّوۤاْ إِلَيْهِمْ عَهْدَهُمْ } أي: أنتم أولى بإيفاء الكعهد وإتمام مدته { إِلَىٰ } انقضاء { مُدَّتِهِمْ } التي عاهدوا عليها { إِنَّ ٱللَّهَ } المستوي على العدل القويم { يُحِبُّ ٱلْمُتَّقِينَ } [التوبة: 4] الذي يواظبون على إيفاء العهود وحفظ المواثيق\n حذراً عن تجاوز حدود الله وعهوده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولما أمر بنقض عهود الناكثين استثنى من لم ينقض فقال: { إَلا الذين عاهدتُّم } أي: لكن الذين عاهدتم { من المشركين } \n وهم بنو ضمره وبنو كنانة\n { ثم لم يَنقُضُوكم شيئاً } من شروط العهد\n ولم ينكثوا\n ولم يقتلوا منكم ولم يضروكم قط\n { ولم يُظاهروا عليكم أحداً } أي: لم يعاونوا عليكم أحداً من أعدائكم\n { فأتموا إليهم عهدهم إلى } تمام { مُدتهم } \n وكانت بقيت لهم من عهدهم تسعة أشهر\n ولا تجروهم مجرى الناكثين { إن الله يحب المتقين } \n وهو تعليل وتنبيه على أن إتمام عهدهم من باب التقوى\n قاله البيضاوي\n الإشارة: من أعظم شؤم الشرك: إن الله ورسوله تبرآ من أهله مرتين: خاصة وعامة\n فيجب على العبد التخلص منه خفياً أو جلياً\n ويستعين على ذلك بصحبة أهل التوحيد الخاص\n حتى يُخلصوه من أنواع الشرك كلها\n فإن صدر منه شيء من ذلك فليبادر بالتوبة وأصر على شركه\n كان ذلك هوانه وخزيه\n وبالله التوفيق\n ثم أمر بجهاد المشركين بعد الأربعة الأشهر التي أمهلتهم فيها\n فقال: { فَإِذَا ٱنسَلَخَ ٱلأَشْهُرُ ٱلْحُرُمُ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:4",
      "similarity": 0.47902950586702103
    },
    {
      "verse": "11:109",
      "similarity": 0.39643240195884494
    },
    {
      "verse": "7:130",
      "similarity": 0.388133144763745
    },
    {
      "verse": "13:41",
      "similarity": 0.3727547301053333
    },
    {
      "verse": "73:3",
      "similarity": 0.3702842504457695
    }
  ]
}