{
  "chapter": "التوبة",
  "text": "انفروا۟ خفافا وثقالا وجهدوا۟ بامولكم وانفسكم فى سبيل الله ذلكم خير لكم ان كنتم تعلمون",
  "translations": [
    {
      "translation": "Go out to fight, whatever your circumstances or desires, and do jihad with your wealth and yourselves in the Way of Allah. That is better for you if you only knew.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, go out in the cause of God, (whether) light or heavy, and strive in the service of God, wealth and soul. This is better for you if you understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "March forth whether light or heavy, and strive in the way of Allah with your belongings and your lives. That is best for you if you only knew it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether unarmed or well equipped, march and fight for the cause of God with your possessions and in person. This would be better for you, if only you knew it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Migrate – whether willingly or with a heavy heart and fight in Allah's cause with your wealth and your lives; this is better for you, if you realise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "March forth, whether you are light or heavy, and strive hard with your wealth and your lives in the cause of Allah. This is better for you, if you but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go forth light and heavy, and strive hard in Allah's way with your property and your persons; this is better for you, if you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go forth, light and heavy! Struggle in God's way with your possessions and your selves; that is better for you, did you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go forth, light-armed and heavy-armed, and strive with your wealth and your lives in the way of Allah! That is best for you if ye but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go forth, whether lightly or heavily equipped, and strive and struggle, with your goods and your persons, for the cause of God. That is better for you, if you only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "March forth light and heavy and strive hard with your riches and your lives in the way of Allah; that is the best for you, if ye have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go forth, whether [armed] lightly or heavily, and wage jihad with your possessions and persons in the way of Allah. That is better for you, should you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go ye forth, (whether equipped) lightly or heavily, and strive and struggle, with your goods and your persons, in the cause of Allah. That is best for you, if ye (but) knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "March forth, whether you are light (being healthy, young and wealthy) or heavy (being ill, old and poor), strive hard with your wealth and your lives in the Cause of Allah. This is better for you, if you but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether lightly or heavily, march on and fight for the Way of Allah, with your wealth and your persons. This will be best for you, if you but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mobilize, light or heavy, and strive with your possessions and your lives in the cause of God. That is better for you, if you only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go forth, whether light or heavy, and strive with your wealth and your lives in the cause of Allah. That is better for you, if you only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:41] Go forth, light and heavy!, that is, energetically or not; it is also said [to mean], [go forth] strong or weak, or rich or poor — but this was abrogated by the verse, The weak would not be at fault … [Q. 9:91]. Struggle in the way of God with your possessions and your lives: that is better for you, if only you knew, that it is better for you; so do not sink down heavily.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالخطاب للمؤمنين الذين سبق لومهم بقوله : { يا أيها الذين آمنوا ما لكم إذ قيل لكم انفروا في سبيل الله اثاقلتم إلى الأرض } \\[ التوبة : 38 \\] ، فالنفير المأمور به ما يستقبل من الجهاد . وقد قدّمنا أنّ الاستنفار إلى غزوة تبوك كان عامَّاً لكلّ قادر على الغزو : لأنّها كانت في زمن مشقّة ، وكان المغزُوُّ عدوّاً عظيماً ، فالضمير في { انفروا } عام للذين استُنفروا فتثاقلوا ، وإنّما استُنفِر القادرون ، وكان الاستنفار على قدر حاجة الغزو ، فلا يقتضي هذا الأمر توجّه وجوب النفير على كلّ مسلم في كلّ غزوة ، ولا على المسلم العاجز لعمىً أو زَمانة أو مرض ، وإنّما يجري العمل في كلّ غزوة على حسب ما يقتضيه حالها وما يصدر إليهم من نفير . وفي الحديث : \" وإذا استنفرتم فانْفِروا \"و { خفافا } جمع خفيف وهو صفة مشبّهة من الخفّة ، وهي حالة للجسم تقتضي قلّة كمية أجزائه بالنسبة إلى أجسام أخرى متعارفة ، فيكون سهْلَ التنقّل سهل الحمل . والثقال ضدّ ذلك . وتقدّم الثقل آنفاً عند قوله : { اثاقلتم إلى الأرض } \\[ التوبة : 38 \\].والخفاف والثقال هنا مستعاران لما يشابههما من أحوال الجيش وعلائقهم ، فالخفّة تستعار للإسراع إلى الحرب ، وكانوا يتمادحون بذلك لدلالتها على الشجاعة والنجدةِ ، قال قُريط بن أنيف العنبري :قومٌ إذا الشرُّ أبدَى ناجِذَيْه لهم ... طَاروا إليه زَرَافَات ووُحدانافالثقل الذي يناسب هذا هو الثبات في القتال كما في قول أبي الطيب :ثِقال إذا لاقَوْا خِفاف إذا دُعوا ... وتستعار الخفّة لقلّة العدد ، والثقلُ لكثرة عدد الجيش كما في قول قُريط : «زَرافات ووُحدانا» .وتستعار الخفّة لتكرير الهجوم على الأعداء ، والثقل للتثبّت في الهجوم . وتستعار الخفّة لقلّة الأزوَاد أو قلّة السلاح ، والثقل لضدّ ذلك . وتستعار الخفّة لقلّة العيال ، والثقل لضدّ ذلك وتستعار الخفّة للركوب لأنّ الراكب أخفّ سيراً ، والثقل للمشي على الأرجل وذلك في وقت القتال . قال النابغة :على عارفاتتٍ للطِّعان عوابِسٍ ... بهِنَّ كلوم بين داممٍ وجالبإذ استُنزلوا عنهنّ للضَّرب ارقلوا ... إلى الموت ارْقالَ الجمال المصَاعبوكلّ هذه المعاني صالحة للإرادة من الآية ولمّا وقع { خفافاً وثقالاً } حالاً من فاعل { انفروا } ، كان محمل بعض معانيهما على أن تكون الحال مقدّرة والواو العاطفة لإحدى الصفتين على الأخرى للتقسيم ، فهي بمعنى ( أو ) ، والمقصود الأمر بالنفير في جميع الأحوال .والمجاهدة : المغالبة للعدوّ ، وهي مشتقّة من الجُهد بضمّ الجيم أي بذل الاستطاعة في المغالبة ، وهو حقيقة في المدافعة بالسلاح ، فإطلاقه على بذل المال في الغزو من إنفاققٍ على الجيش واشتراءِ الكراع والسلاح ، مجاز بعلاقة السببية .وقد أمر الله بكلا الأمرين فمن استطاعهما معاً وجبا عليه ، ومن لم يستطع إلاّ واحداً منهما وجب عليه الذي استطاعه منهما .وتقديم الأموال على الأنفس هنا : لأنّ الجهاد بالأموال أقلّ حُضوراً بالذهن عند سماع الأمر بالجهاد ، فكان ذكره أهمّ بعد ذكر الجهاد مجملاً .والإشارة ب { ذلكم } إلى الجهاد المستفاد من { وجاهدوا }.وإبهام { خير } لقصد توقّع خير الدنيا والآخرة من شعب كثيرة أهمها الاطمئنان من أن يغزوهم الروم ولذلك عُقب بقوله : { إن كنتم تعلمون } أي إن كنتم تعلمون ذلك الخير وشعبه . وفي اختيار فعل العلم دون الإيمان مثلاً للإشارة إلى أنّ من هذا الخير ما يخفى فيحتاج متطلّب تعيين شعبه إلى اعمال النظر والعلم .\n\n",
      "translations": [
        {
          "translation": "(Go forth) with your Prophet to the Battle of Tabuk, (light armed and heavy armed) young and old; it is also said that this means: whether you are enthusiastic for it or not; it is also said that this means: light with property and children and heavy with property and children, (and strive with your wealth and your lives in the way of Allah) in obedience of Allah! (That) jihad (is best for you) than sitting remaining in one place (if ye but knew) and believed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱنْفِرُواْ خِفَافاً وَثِقَالاً } فالخَفيفُ: الشَّابُ\n والثِّقالُ: الشِّيوخُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Travel forth light and heavy}- so the light is the young.\n\n\nAnd the heaviest: the elders.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱنْفِرُواْ } أيها الغزاة المجاهدون في سبيل الله { خِفَافاً } نشطاً فرحاناً\n منبسطين لمرتبة الشهادة { وَثِقَالاً } قاصداً لأخذ الغنيمة والأحمال والأثقال من عدوكم\n أو مشاة وركباناً { وَ } بالجملة: { جَاهِدُواْ بِأَمْوَالِكُمْ } لتهيئة الأسباب وإعداد السفر { وَأَنْفُسِكُمْ } بتحمل المشاق والمتاعب { فِي سَبِيلِ ٱللَّهِ } لتفوزوا من عنده بالمثوبة العظمى والدرجة العليا التي لا درجة أعلى منها { ذٰلِكُمْ } أي: ما أمرتم به من عند ربكم { خَيْرٌ لَّكُمْ } في أولاكم وأخراكم { إِن كُنتُمْ تَعْلَمُونَ } [التوبة: 41] الخير وتميزونه من الشر\n\n\nثمَّ قال سباحنه في حق المستخلفين عن القتال المأمور به\n المستأذنين عن رسول الله صلى الله عليه وسلم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: يُهلكون: حال من فاعل يحلفون\n أو بدل منه\n قال في القاموس: الشقة ـ بالضم والكسر: البُعد والناحية يقصدها المسافر\n والسفر\n البعيد والمشقة\n هـ\n  يقول الحق جل جلاله: { انفرُوا } للجهاد مع الرسول صلى الله عليه وسلم\n حال كونكم { خِفافاً } نشاطاً\n { وثِقالاً } كسالى لمشقته\n أو خفاقاً لمن قَلَّ عياله\n وثقالاً لمن كثر عياله\n أو خفافاً لمن كان فقيراً\n وثقالاً لمن كان غنياً\n أو خفافاً ركباناً\n وثقالاً مشاة\n أو خفافاً بلا سلاح\n وثقالاً بالسلاح\n أو خفافاً شباباً\n وثقالاً شيوخاً\n أو خفافاً أصحاء\n وثقالاً مرضى\n ولذلك قال ابنُ أمِّ مكتوم لرسول الله صلى الله عليه وسلم: أَعَليَّ الغزو يا رسول الله؟ قال:\n \" نعم \" \nحيث نزل:\n[النور: 61]\n { وجاهدوا بأموالكم وأنفسكم في سبيل الله } أي: بما أمكن إمّا بهما أو بأحدهما\n { ذلكم خير لكم } \n مِنْ تركه\n { إن كنتم تعلمون } ما في ذلك من الأجر العظيم والخير الجسيم\n أي: لو علمتم ذلك ما قعدتم خلف سرية\n ثم عاتب من أراد التخلف",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:38",
      "similarity": 0.526764334135523
    },
    {
      "verse": "35:42",
      "similarity": 0.4311165057094679
    },
    {
      "verse": "61:11",
      "similarity": 0.4306914416768278
    },
    {
      "verse": "7:189",
      "similarity": 0.40672953251962696
    },
    {
      "verse": "2:162",
      "similarity": 0.38804459276653047
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009041.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009041.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:41.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}