{
  "chapter": "التوبة",
  "text": "عفا الله عنك لم اذنت لهم حتى يتبين لك الذين صدقوا۟ وتعلم الكذبين",
  "translations": [
    {
      "translation": "Allah pardon you! Why did you excuse them until it was clear to you which of them were telling the truth and until you knew the liars?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "May God forgive you. Why did you allow them (to stay behind) without ascertaining who spoke the truth and who were liars?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), may Allah forgive you! Why did you give them leave to stay behind before it became clear to you as to who were truthful and who were liars?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "May God forgive you! (Muhammad), why did you not let them join the army so that you could discern the liars from the truthful ones?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "May Allah forgive you*; why did you permit them** until the truthful ones had been manifested to you and the liars been exposed? (* This is an expression of love for the Holy Prophet – peace and blessings be upon him. ** The hypocrites had been permitted to stay back from the holy war.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "May Allah forgive you. Why did you grant them leave, until those who told the truth were manifest to you, and you had known the liars\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah pardon you! Why did you give them leave until those who spoke the truth had become manifest to you and you had known the liars?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God pardon thee! Why gavest thou them leave, till it was clear to thee which of them spoke the truth, and thou knewest the liars?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah forgive thee (O Muhammad)! Wherefor didst thou grant them leave ere those who told the truth were manifest to thee and thou didst know the liars?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "May God pardon you! Why did you permit them to do so before it had become clear to you which ones were truthful, so that you might recognize the liars?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah pardon thee! why didst thou give them leave before it was manifest unto thee as to whosoever told the truth and thou hadst known the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "May Allah excuse you! Why did you grant them leave [to stay behind] before those who told the truth were evident to you and you had ascertained the liars?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah give thee grace! why didst thou grant them until those who told the truth were seen by thee in a clear light, and thou hadst proved the liars?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "May Allah forgive you (O Muhammad SAW). Why did you grant them leave (for remaining behind, you should have persisted as regards your order to them to proceed on Jihad), until those who told the truth were seen by you in a clear light, and you had known the liars?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has forgiven you! Why did you give them leave (to stay behind) until it was clear to you which of them was truthful and knew those who lied?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "May God pardon you! Why did you give them permission before it became clear to you who are the truthful ones, and who are the liars?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "May Allah pardon you, [O Muhammad]; why did you give them permission [to remain behind]? [You should not have] until it was evident to you who were truthful and you knew [who were] the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:43] The Prophet (s), exercising his personal judgement, had given leave to a group to stay behind, and so the following was revealed as a reprimand for him, but with the pardon first, in order to reassure his heart: May   God pardon you! Why do you give them leave, to stay behind; why did you not leave them, until it was clear to you which of them spoke the truth, in their excuse, and you knew those who were lying, in it?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستأذن فريق من المنافقين النبي صلى الله عليه وسلم أن يتخلّفوا عن الغزوة ، منهم عبد الله بنُ أبَيْ ابن سَلُول ، والجِدّ بن قَيس ، ورفاعة بن التابوت ، وكانوا تسعة وثلاثين واعتذروا بأعذار كاذبة وأذن النبي صلى الله عليه وسلم لمن استأذنه حملا للناس على الصدق ، إذ كان ظاهر حالهم الإيمان ، وعلماً بأنّ المعتذرين إذا ألجئوا إلى الخروج لا يغنون شيئاً ، كما قال تعالى : { لو خرجوا فيكم ما زادوكم إلا خبالاً } \\[ التوبة : 47 \\] فعاتب الله نبيئه صلى الله عليه وسلم في أنْ أذن لهم ، لأنّه لو لم يأذن لهم لقعدوا ، فيكون ذلك دليلاً للنبيء صلى الله عليه وسلم على نفاقهم وكذبهم في دعوى الإيمان ، كما قال الله تعالى : { ولو نشاء لأريناكهم فلعرفتهم بسيماهم } \\[ محمد : 30 \\].والجملة مستأنفة استئنافاً ابتدائياً لأنّه غرض أنف .وافتتاح العتاب بالإعلام بالعفو إكرام عظيم ، ولطافة شريفة ، فأخبره بالعفو قبل أن يباشره بالعِتاب . وفي هذا الافتتاح كناية عن خفّة موجِب العتاب لأنّه بمنزلة أن يقال : ما كان ينبغي ، وتسمية الصفح عن ذلك عَفْواً ناظر إلى مغزى قول أهل الحقيقة : حسنات الأبرار سيّئاتُ المقرَّبين .وألقي إليه العتاب بصيغة الاستفهام عن العلّة إيماء إلى أنّه ما أذن لهم إلاّ لسبب تَأوَّلَه ورجَا منه الصلاح على الجلمة بحيث يُسْأل عن مثله في استعمال السؤال من سائل يطلب العلم وهذا من صيغ التلطّف في الإنكار أو اللوم ، بأن يظهر المنكِر نفسه كالسائِل عن العلّة التي خفيت عليه ، ثم أعقبه بأنّ ترك الإذن كان أجدر بتبيين حالهم ، وهو غرض آخر لم يتعلّق به قصد النبي صلى الله عليه وسلموحذف متعلِّق { أذنت } لظهوره من السياق ، أي لم أذنت لهم في القعود والتخلف .و { حتَّى } غاية لفعل { أذنت } لأنّه لما وقع في حيز الاستفهام الإنكاري كان في حكم المنفي فالمعنى : لا مقتضيَ للإذن لهم إلى أن يتبيّن الصادق من الكاذب .وفي زيادة { لك } بعد قوله : { يتبين } زيادة ملاطفة بأنّ العتاب ما كان إلاّ عن تفريط في شيء يعود نفعه إليه ، والمراد بالذين صدقوا : الصادقون في إيمانهم ، وبالكافرين الكاذبين فيما أظهروه من الإيمان ، وهم المنافقون . فالمراد بالذين صدقوا المؤمنون .\n\n",
      "translations": [
        {
          "translation": "(Allah forgive thee) Muhammad! (Wherefore didst thou grant them leave) give leave to the hypocrites to stay behind and not go to Tabuk (ere those who told the Truth were manifest to you) until those who are genuine in their faith are manifest to you upon going forth with you (and thou didst know the liars) about their faith, when they fail to set forth with you without leave?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ عَفَا ٱللَّهُ عَنكَ } ما جئت به من ترك الأولى { لِمَ أَذِنتَ لَهُمْ } استأذنوك بالقعود\n أي: هؤلاء المنافقين المتخلفين\n المعتذرين بالأعذار الكاذبة { حَتَّىٰ يَتَبَيَّنَ } ويظهر { لَكَ ٱلَّذِينَ صَدَقُواْ } في الاعتذار والاعتدال { وَتَعْلَمَ ٱلْكَاذِبِينَ } [التوبة: 43] فيها على مقتضى نفاقهم الكامنة في نفوسهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: لنبيه ـ عليه الصلاة والسلام ـ ملاطفاً له في الكلام: { عفا اللَّه عنك لم أذنتَ لهم } \n لِمَ بادرت إلى الإذن إلى المنافقين في التخلف\n واستكفيت بالإذن العام في قولنا:\n[النور: 62]\n فإن الخواص من المقربين لا يكتفون بالإذن العام\n بل يتوقفون إلى الإذن الخاص\n ولذلك عُوتِبَ يونس عليه السلام\n والمعنى: لأي شيء أذنت لهم في القعود حين استأذنوك واعتذروا لك بأكاذيب؟ وهلا توقفت { حتى يتبين لك الذين صدقوا } في الاعتذار\n { وتعلم الكاذبين } فيه\n  قال ابن عطية: قوله: { الذين صدقوا } يريد: في استئذانك\n وأَنك لو لم تأذن لهم لخرجوا معك\n وقوله: { وتعلم الكاذبين } يريد: أنهم استأذنوك يظهرون لك أنهم يقفون عند حدِّك\n وهم كَذَبة\n قد عزموا على العصيان\n أذِنتَ أو لم تأذن\n هـ\n قال ابن جزي: كانوا قد قالوا: استأذنوه في القعود\n فإن إذن لنا قعدنا\n وإن لم يأذن قعدنا\n وإنما كان يظهر الصادق من الكاذب لو لم يأذن لهم\n فحينئذٍ كان يقعد العاصي والمنافق\n ويسافر المطيع الصادق\n هـ\n  { لا يستأذنُك الذين يؤمنون بالله واليوم الآخر أن يُجاهدوا بالله واليوم الآخر أن يُجاهدوا بأموالهم وأنفسهم } أي: ليس من عادة المؤمنين أن يستأذنوك في أن يجاهدوا\n بل الخُلَّص منهم يُبادرون إليه\n ولا يوقفُونه على الإذن فيه\n فضلاً عن أن يستأذنوا في التخلف عنه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:25",
      "similarity": 0.5167223249483324
    },
    {
      "verse": "2:52",
      "similarity": 0.5116968158820859
    },
    {
      "verse": "4:99",
      "similarity": 0.4726453121273408
    },
    {
      "verse": "42:30",
      "similarity": 0.45184188611206616
    },
    {
      "verse": "5:15",
      "similarity": 0.4359251805823824
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009043.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009043.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:43.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}