{
  "chapter": "التوبة",
  "text": "لا يستـذنك الذين يؤمنون بالله واليوم الءاخر ان يجهدوا۟ بامولهم وانفسهم والله عليمۢ بالمتقين",
  "translations": [
    {
      "translation": "Those who have iman in Allah and the Last Day do not ask you to excuse them from doing jihad with their wealth and themselves. Allah knows the people who have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in God and the Last Day, do not ask your leave to be excused from fighting wealth and soul (in the cause of God), for God knows the pious and devout.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in Allah and the Last Day will never ask your leave to be excused from striving (in the cause of Allah) with their belongings and their lives. Allah fully knows the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in God and the Day of Judgment do not ask you whether they should fight for the cause of God with their property and in person, or not. God knows all about the pious ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe in Allah and the Last Day will not seek exemption from you for not fighting with their wealth and their lives; and Allah well knows the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in Allah and the Last Day, would not ask your leave to be exempted from fighting with their properties and their lives; and Allah is the All-Knower of those who have Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do not ask leave of you who believe in Allah and the latter day (to stay away) from striving hard with their property and their persons, and Allah knows those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in God and the Last Day ask not leave of thee, that they may struggle with their possessions and their selves; and God knows the godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in Allah and the Last Day ask no leave of thee lest they should strive with their wealth and their lives. Allah is Aware of those who keep their duty (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in God and the Last Day will never ask you to exempt them from striving with their wealth and their lives, God best knows the righteous,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in Allah and the Last Day would not ask thy leave to be excused from striving hard with their riches and their lives; and Allah is Knower of the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in Allah and the Last Day do not ask you for leave [exempting them] from waging jihad with their possessions and their persons, and Allah knows best the Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in Allah and the Last Day ask thee for no exemption from fighting with their goods and persons. And Allah knoweth well those who do their duty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in Allah and the Last Day would not ask your leave to be exempted from fighting with their properties and their lives, and Allah is the All-Knower of Al-Muttaqun (the pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in Allah and the Last Day will not ask your permission so that they may struggle with their wealth and their selves. Allah knows best the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in God and the Last Day do not ask you for exemption from striving with their possessions and their lives. God is fully aware of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in Allah and the Last Day would not ask permission of you to be excused from striving with their wealth and their lives. And Allah is Knowing of those who fear Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:44] Those who believe in God and the Last Day do not ask leave of you, to stay behind, that they may struggle with their possessions and their lives; and God knows the pious.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذه الجملة واقعة موقع البيان لجملة { حتى يتبين لك الذين صدقوا وتعلم الكاذبين } \\[ التوبة : 43 \\]. وموقع التعليل لجملة { لم أذنت لهم } \\[ التوبة : 43 \\] أو هي استئناف بياني لما تثيره جملة { حتى يتبين لك الذين صدقوا وتعلم الكاذبين } \\[ التوبة : 43 \\] والاعتبارات متقاربة ومآلها واحد .والمعنى : إنّ شأن المؤمنين الذين استنفروا أن لا يستأذنوا النبي صلى الله عليه وسلم في التخلّف عن الجهاد ، فأمّا أهل الأعذار : كالعُمي ، فهم لا يستنفرهم النبي صلى الله عليه وسلم وأمّا الذين تخلّفوا من المؤمنين فقد تخلّفوا ولم يستأذنوا في التخلّف ، لأنّهم كانوا على نية اللحاق بالجيش بعد خروجه .والاستئذان : طلب الإذن ، أي في إباحة عمل وترك ضدّه ، لأنّ شأن الإباحة أن تقتضي التخيير بين أحد أمرين متضادّين .والاستئذان يُعدّى ب ( في ). فقوله : { أن يجاهدوا } في محلّ جرّ ب ( في ) المحذوفة ، وحذف الجارّ مع { أنْ } مطّرد شائع .ولمّا كان الاستئذان يستلزم شيئين متضادّين ، كما قلنا ، جازَ أن يقال : استأذنتُ في كذا واستأذنت في ترك كذا . وإنّما يُذكر غالباً مع فعل الاستئذان الأمر الذي يَرغَب المستأذنُ الإذنَ فيه دون ضدّه وإن كان ذكر كليهما صحيحاً .ولمّا كانَ شأن المؤمنين الرغبة في الجهاد كان المذكور مع استئذان المؤمنين ، في الآية أن يجاهدوا دون أن لا يجاهدوا ، إذ لا يليق بالمؤمنين الاستئذان في ترك الجهاد ، فإذا انتفى أن يستأذنوا في أن يجاهدوا ثبت أنّهم يجاهدون دون استئذان ، وهذا من لطائف بلاغة هذه الآية التي لم يعرّج عليها المفسّرون وتكلّفوا في إقامة نظم الآية .وجملة { والله عليم بالمتقين } معترضة لفائدة التنبيه على أنّ الله مطّلع على أسرار المؤمنين إذ هم المراد بالمتّقين كما تقدّم في قوله في سورة البقرة ( 2 ، 3 ) { هدى للمتقين الذين يؤمنون بالغيب . }\n\n",
      "translations": [
        {
          "translation": "(Those who believe in Allah and the Last Day ask no leave) after the Battle of Tabuk (of thee) in secret or in the open (lest they should strive with their wealth and their lives. Allah is Aware of those who keep their duty (unto Him)) those who ward off disbelief and idolatry.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لاَ يَسْتَأْذِنُكَ ٱلَّذِينَ يُؤْمِنُونَ بِٱللَّهِ وَٱلْيَوْمِ ٱلآخِرِ } أي: ليس من عادة المؤمنين الاستئذان منك إلى الخروج نحو القتال مطلقاً\n بل هم منتظرون دائماً\n متهيئون دائماً أسبابهم\n مترصدون إلى { أَن يُجَاهِدُواْ } في سبيل الله { بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ } وينتهزون الفرصة بالمسابقة حين أمروا\n فيكف أن يتأذنوا بالقعود وعدم الخروج\n والمعذرون متألمون متحسرون بكون في زاوية الحرمان\n محزنون ملهوفون متأسفون\n لذلك وعد لهم سبحانه من فضله درجة عظيمة { وَٱللَّهُ } المطلع لضمائر عباده { عَلِيمٌ بِٱلْمُتَّقِينَ } [التوبة: 44] الذين يحفظون نفوسهم من مخالفة أمر الله وأمر رسوله بلا عذرٍ شرعي\n\n\nبل: { إِنَّمَا يَسْتَأْذِنُكَ } بالقعود والتخلف { ٱلَّذِينَ لاَ يُؤْمِنُونَ بِٱللَّهِ } وتوحيده { وَٱلْيَوْمِ ٱلآخِرِ } المعدّ لجزاء الأعمال { وَٱرْتَابَتْ قُلُوبُهُمْ } لعدم اطمئنانها ورسوخها بالإيمان والتوحيد { فَهُمْ فِي رَيْبِهِمْ } المركوز في جبلتهم { يَتَرَدَّدُونَ } [التوبة: 45] يتحيرون\n ويتذبذبون لا إلى هؤلاء وإلى هؤلاء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والله عليم بالمتقين } فيثيبهم ويقربهم\n وهي شهادة لهم بالتقوى وَعِدَةً لهم بثوابه\n  { إنما يستأذنكَ } في التخلف { الذين لا يؤمنون بالله واليوم الآخر } \n وخصص ذكر الإيمان بالله واليوم الآخر إشعاراً بأن الباعث على الجهاد والوازع عنه: الإيمان وعدم الإيمان بهما",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "61:11",
      "similarity": 0.6940375290326771
    },
    {
      "verse": "9:88",
      "similarity": 0.5595610419520861
    },
    {
      "verse": "49:15",
      "similarity": 0.5493180910327428
    },
    {
      "verse": "29:6",
      "similarity": 0.5408007142726202
    },
    {
      "verse": "25:52",
      "similarity": 0.49251810147632885
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009044.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009044.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:44.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}