{
  "chapter": "التوبة",
  "text": "انما يستـذنك الذين لا يؤمنون بالله واليوم الءاخر وارتابت قلوبهم فهم فى ريبهم يترددون",
  "translations": [
    {
      "translation": "Only those who do not have iman in Allah and the Last Day ask you to excuse them. Their hearts are full of doubt and in their doubt they waver to and fro.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only they ask (for leave) who do not believe in God and the Last Day, whose hearts are full of doubt; and doubting they waver (between gain and loss).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is only those who do not believe in Allah and the Last Day, and whose hearts are filled with doubt that seek exemption from striving (in the cause of Allah). They keep tossing to and fro in their doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those who do not believe in God and the Day of Judgment ask you such questions because their hearts are full of doubts and they cannot make any final decisions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those ask for such an exemption from you who do not believe in Allah and the Last Day, and whose hearts are in doubt – so they waver in their doubts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is only those who believe not in Allah and the Last Day and whose hearts are in doubt that ask your leave. So in their doubts they waver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They only ask leave of you who do not believe in Allah and the latter day and their hearts are in doubt, so in their doubt do they waver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They only ask leave of thee who believe not in God and the Last Day, those whose hearts are filled with doubt, so that in their doubt they go this way and that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They alone ask leave of thee who believe not in Allah and the Last Day, and whose hearts feel doubt, so in their doubt they waver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "only those seek exemption who do not truly believe in God and the Last Day, and whose hearts have become a prey to doubt. Because they doubt, they waver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is only those who believe not in Allah and the Last Day and whose hearts doubt who ask thy leave, so in their doubt they are tossed to and fro.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those seek a leave [of exemption] from you who do not believe in Allah and the Last Day, and whose hearts are in doubt, so they waver in their doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those ask thee for exemption who believe not in Allah and the Last Day, and whose hearts are in doubt, so that they are tossed in their doubts to and fro.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is only those who believe not in Allah and the Last Day and whose hearts are in doubt that ask your leave (to be exempted from Jihad). So in their doubts they waver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those who ask your permission do not believe in Allah and the Last Day and whose hearts are filled with doubt. And in their doubt, they waiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those who do not believe in God and the Last Day ask you for exemption. Their hearts are full of doubts, so they waver in their doubts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those would ask permission of you who do not believe in Allah and the Last Day and whose hearts have doubted, and they, in their doubt, are hesitating.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:45] They alone ask leave of you, to stay behind, who do not believe in God and the Last Day, and whose hearts are doubtful, uncertain, about religion, so in their doubt they waver, they are confused.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They alone ask leave of you) to stay behind and not take part in jihad (who believe not in Allah and the Last Day) in the depth of their hearts, (and whose hearts feel doubt, so in their doubt they waver) they are bewildered.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وارتابت قلوبهم } أي: شكَّت في الإيمان والبعث\n { فهم في ريبهم يترددُون }: يتحيرون\n ونزلت الآية في عبد الله بن أُبيّ والجَدُّ بن قيْس\n وأمثالهما من المنافقين\n الإشارة: لا ينبغي للعارفين بالله الداعين إلى الله\n أن يأذنوا لمن استأذنهم في التخلف عن الجهاد الأكبر\n ويرخصون له في البقاء مع النفس والهوى\n وجمع حطام الدنيا\n شفقةُ ورحمةً لأن الشفقة في هذا المعنى لا تليق بأهل التربية\n فقد قالوا: الشفقة والرطوبة لا تليق بشيوخ التربية\n بل لا يليق بهم إلا الأمر بما تموت به النفوس\n وتحيا به الأرواح\n وإن كان فيه حتفُهم\n وقد قالوا أيضاً: إذا كان الشيخ يحرش على المريد\n ويقدمه للمهالك في نفسه أو ماله أو جاهه\n فهو دليل على أنه يحبه وينصحه\n وإذا كان يرخص له في أمورنفسه\n ويأمره بالمقام معها\n فهو غير ناصح له\n وأما الإذن في التجريد وعدمه: فإن رآه أهلاً له لنفوذ عزمه\n فيجب عليه أن يأمره به\n وإن رآه لا يليق به لعوارض قامت به منعه منه\n حتى ينظر ما يفعل الله به\n وسأل رجلٌ القطبَ ابنَ مشيش\n فقال له: يا سيدي استأذنك في مجاهدة نفسي؟ فقال له: { لا يستأذنك الذين يؤمنون بالله واليوم الآخر أن يجاهدوا بأموالهم وأنفسهم والله عليم بالمتقين إنما يستئذنك الذين لا يؤمنون بالله واليوم الآخر وارتابت قلوبهم فهم في ريبهم يترددون }\n ثم ذكر سبب تخلفهم\n وهو عدم الإرادة\n فقال: { وَلَوْ أَرَادُواْ ٱلْخُرُوجَ لأَعَدُّواْ لَهُ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:2",
      "similarity": 0.5159450025037848
    },
    {
      "verse": "2:2",
      "similarity": 0.505028025324659
    },
    {
      "verse": "3:9",
      "similarity": 0.4822537114250703
    },
    {
      "verse": "6:12",
      "similarity": 0.4444323374996514
    },
    {
      "verse": "40:59",
      "similarity": 0.42797390002427177
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009045.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009045.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:45.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}