{
  "chapter": "التوبة",
  "text": "ولو ارادوا۟ الخروج لاعدوا۟ له عدة ولكن كره الله انۢبعاثهم فثبطهم وقيل اقعدوا۟ مع القعدين",
  "translations": [
    {
      "translation": "If they had really desired to go out, they would have made proper preparations for it, but Allah was averse to their setting out so He held them back and they were told: 'Stay behind with those who stay behind.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they had intended to go out (to fight) they would surely have made preparations. But God did not like their setting forth, and they were held back and told: \"Stay at home with those who stay behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had they truly intended to march forth to fight, they would have certainly made some preparation for it. But Allah was averse to their going forth, so He made them lag behind, and they were told: \"Stay behind with those that are staying behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had they (the hypocrites) wanted to join your army, they would have prepared themselves, but God did not wish to motivate them, so He caused them to linger behind with those whose joining you in battle would be of no use.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if going forth were acceptable to them, they would have made preparations for it, but Allah Himself disliked their getting up (to fight) so He filled them with laze and it was said “Continue sitting with those who remain seated.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they had intended to march out, certainly, they would have made some preparation for it; but Allah was averse to their being sent forth, so He made them lag behind, and it was said (to them): \"Sit among those who sit (at home).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they had intended to go forth, they would certainly have provided equipment for it, but Allah did not like their going forth, so He withheld them, and it was said (to them): Hold back with those who hold back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they had desired to go forth, they would have made some preparation for it; but God was averse that they should be aroused, so He made them pause, and it was said to them, 'Tarry you with the tarriers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they had wished to go forth they would assuredly have made ready some equipment, but Allah was averse to their being sent forth and held them back and it was said (unto them): Sit ye with the sedentary!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they had wished to go forth, they would surely have made some preparation for it, but God disliked their setting out [and being raised high in God's eyes] and held them back. They were told to stay behind with those who stay behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had they intended the going forth, they would have made some preparation therefor; But Allah was averse to their wending, wherefore He withheld them, and the word was passed: stay of home with the stay-at-homes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had they desired to go forth, they would have surely made some preparations for it; but Allah was averse to arouse them, so He held them back, and it was said [to them], ‘Be seated with those who sit back.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they had intended to come out, they would certainly have made some preparation therefor; but Allah was averse to their being sent forth; so He made them lag behind, and they were told, \"Sit ye among those who sit (inactive).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they had intended to march out, certainly, they would have made some preparation for it, but Allah was averse to their being sent forth, so He made them lag behind, and it was said (to them), \"Sit you among those who sit (at home).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had they intended to set forth with you, they would have prepared themselves for it. But Allah did not like their going forth and held them back, and it was said: 'Stay back with those who stay back'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had they wanted to mobilize, they would have made preparations for it; but God disliked their participation, so he held them back, and it was said, “Stay behind with those who stay behind.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they had intended to go forth, they would have prepared for it [some] preparation. But Allah disliked their being sent, so He kept them back, and they were told, \"Remain [behind] with those who remain.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:46] If they had desired to go forth, with you, they would have made some preparation for it, some equipment, such as tools and provisions, but God was averse that they should be sent forth, that is, He did not want them to go forth, so He slowed them down, He made them [feel] lethargic, and it was said, to them: ‘Stay back with those who stay back!’, [with] the sick, the women and the children: in other words, God decreed this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if they had wished to go forth) with you to the Battle of Tabuk (they would assuredly have made ready some equipment) weapons and provision, (but Allah was averse to their being sent forth) with you to the battle of Tabuk (and back and (it was said unto them): Sit ye with the sedentary!) with those who stayed back without an excuse. 199\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَثَبَّطَهُمْ } معناه حَبَسَهُمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {But He has restrained them} [i.e., the devils], means He has shackled them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَوْ أَرَادُواْ ٱلْخُرُوجَ } وقصدوا الوفاق مع المؤمنين كما أظهروا { لأَعَدُّواْ } وهيأوا { لَهُ عُدَّةً } أهبة وأسباباً { وَلَـٰكِن } لخبث باطنهم وانهماكهم في الضلال { كَرِهَ ٱللَّهُ } المطلع على قساوة قلوبهم { ٱنبِعَاثَهُمْ } أي: اهتزازهم وتحركهم نحو القتال { فَثَبَّطَهُمْ } لذلك وحبسهم، وأقعدهم في مكانهم بإلقاء الرعب والكسل في قلوبهم { وَ } كأنه { قِيلَ } لإسماعهم تضليلاً لهم وتغريراً: { ٱقْعُدُواْ } أيها المنهمكون في الغفلة { مَعَ ٱلْقَاعِدِينَ } [التوبة: 46] من النساء والصبيان، والمرضى والزمناء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:81",
      "similarity": 0.09495803017078878
    },
    {
      "verse": "9:83",
      "similarity": 0.07821664575735249
    },
    {
      "verse": "7:88",
      "similarity": 0.06689085853722358
    },
    {
      "verse": "9:86",
      "similarity": 0.06509000714424881
    },
    {
      "verse": "85:6",
      "similarity": 0.06507039199177528
    }
  ]
}