{
  "chapter": "التوبة",
  "text": "لقد ابتغوا۟ الفتنة من قبل وقلبوا۟ لك الامور حتى جاء الحق وظهر امر الله وهم كرهون",
  "translations": [
    {
      "translation": "They have already tried to cause conflict before, and turned things completely upside down for you, until the truth came and Allah's command prevailed even though they detested it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They had tried to create disorder before and intrigued against you, but truth came out in the end and God's will prevailed, even though they did not like it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely they sought even earlier to stir up sedition, and turned things upside down to frustrate you until the Truth came and the decree of Allah appeared, however hateful this may have been to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even prior to this, they tried to cause trouble and to turn your affairs upside-down until the truth came and the cause of God triumphed against their desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed they had sought to cause turmoil at the outset, and O dear Prophet the scheme turned otherwise* for you, so much so that the truth came and the command of Allah appeared, and they disliked it. (* In your favour.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, they had plotted sedition before, and had upset matters for you, until the truth (victory) came and the decree of Allah became manifest though they hated it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly they sought (to sow) dissension before, and they meditated plots against you until the truth came, and Allah's commandment prevailed although they were averse (from it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They sought to stir up sedition already before, and turned things upside down for thee, until the truth came, and God's command appeared, though they were averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aforetime they sought to cause sedition and raised difficulties for thee till the Truth came and the decree of Allah was made manifest, though they were loth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have already tried to sow dissension, and hatched plots against you, until the truth became manifest and God's will prevailed, much to their disgust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly they besought sedition afore and turned the affairs upside down for thee until the truth arrived and the decree of Allah prevailed, averse though they were.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They certainly sought to cause sedition earlier, and upset the matters for you, until the truth came and Allah’s command prevailed, much as they were averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed they had plotted sedition before, and upset matters for thee, until,- the Truth arrived, and the Decree of Allah became manifest much to their disgust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, they had plotted sedition before, and had upset matters for you, - until the truth (victory) came and the Decree of Allah (His Religion, Islam) became manifest though they hated it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beforehand they had already sought to stir up sedition, and turned things upside down for you, until the truth came, and the command of Allah appeared, although they were averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They tried to cause conflict before, and they hatched plots against you, until the truth prevailed, and the command of God became evident—in spite of their dislike.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They had already desired dissension before and had upset matters for you until the truth came and the ordinance of Allah appeared, while they were averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:48] Indeed, they sought to stir up sedition, against you, already before, when you first came to Medina, and scrutinised your affairs, that is, they thought long and hard how to plot against you and invalidate your religion, until the truth, the [victorious] help, came, and God’s command, His religion, prevailed, stood mighty, they still being averse, to it [His religion], entering it superficially.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Aforetime) before the battle of Tabuk (they sought to cause sedition) they sought to cause you evil things (and raised difficulties for you) right and left (till the Truth came) until the believers became many (and the decree of Allah) the religion of Allah: Islam (was made manifest, though they were loth) of it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَقَدِ ٱبْتَغَوُاْ ٱلْفِتْنَةَ } أي: ليس هذا أول ابتغائهم وإيقاعهم، بل أوقعوا الفتنة { مِن قَبْلُ } وأرجفوا بهلاكك، وشتتوا شمل أصحابك { وَقَلَّبُواْ لَكَ ٱلأُمُورَ حَتَّىٰ جَآءَ ٱلْحَقُّ } أي: النصر والتأييد الثابت عنده، المقرر دونه سبحانه من نصر دينك وإعلائه، ونسخ الأديان كلها { وَظَهَرَ أَمْرُ ٱللَّهِ } وإعلاء كلمته { وَهُمْ كَارِهُونَ } [التوبة: 48] من خبث باطنهم ظهور دينك وارتفاع شأنك، وسمو برهانك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لقد ابْتَغَوُا الفتنة } أي: تشتيت أمرك وتفْريق أصحابك { من قبلُ } أي: من قبل هذا الوقت، كرجوعهم عنك يوم أُحد، ليوقعوا الفشل في الناس، { وقلَّبوا لك الأمور } أي: دبروها من كل وجه، فدبروا الحيل، ودوروا الآراء في إبطال امرك، فأبطل الله سعيهم، { حتى جاء الحقُّ وظهر أمرُ الله } أي: علا دينه، { وهم كارهون } أي: على رغم أنفهم، والآيتان تسلية للرسول صلى الله عليه وسلم والمؤمنين على تخلفهم، وبيان ما ثبطهم الله لأجله وكره انبعاثهم له، وهتك أستارهم، وكشف أسرارهم، وإزاحة اعتذارهم\n انظر البيضاوي\n الإشارة: الناس على ثلاثة أقسام: قسم أقامهم الحق تعالى لخدمة أنفسهم وحظوظهم عدلاً\n\n\nوقسم أقامهم الحق تعالى لخدمة معبودهم فضلاً\n وقسم اختصهم بالتوجه إلى محبوبهم رحمة وفضلاً\n فالأوّلون: أثقلهم بكثرة الشواغل والعلائق، ولو أرادوا الخروج منها لأعدوا له عدة بالتخفيف والزهد، ولكن كره الله انبعاثهم فثبطهم، وقيل: اقعدوا مع القاعدين، أقامهم لإصلاح عالم الحكمة، وأما أهل الخدمة: فرآهم لم يصلحوا لصريح معرفته، فشغلهم بخدمته، ولو أرادوا الخروج من سجن الخدمة إلى فضاء المعرفة لأعدوا له عدة بصحبة أهل المعرفة الكاملة\n وأما أهل التوجه إلى محبته وصريح معرفته فلم يشغلهم بشيء، ولم يتركهم مع شيء، بل اختصهم بمحبته، وقام لهم بوجود قسمته،\n\n[آل عمران: 74]\n وكل قسم لو دخل مع من فوقه على ما هو عليه، لأفسده، وما زاده إلا خبالاً وشراً\n والله تعالى أعلم\n ولما دعا النبي صلى الله عليه وسلم الناس إلى غزوة تبوك، قال له الجَدُّ بنُ قَيْس ـ من كبار المنافقين ـ ائْذَنْ لي في القعود، ولا تفتني برؤية بنات بني الأصفر، فإني لا أصبر على النساء، فأنزل الله في شأنه: { وَمِنْهُمْ مَّن يَقُولُ ٱئْذَن لِّي }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:33",
      "similarity": 0.5241700615013766
    },
    {
      "verse": "61:9",
      "similarity": 0.5241700615013766
    },
    {
      "verse": "43:78",
      "similarity": 0.4880347172677541
    },
    {
      "verse": "23:70",
      "similarity": 0.42540618841748457
    },
    {
      "verse": "10:99",
      "similarity": 0.4217233079660701
    }
  ]
}