{
  "chapter": "التوبة",
  "text": "ومنهم من يقول ائذن لى ولا تفتنى الا فى الفتنة سقطوا۟ وان جهنم لمحيطةۢ بالكفرين",
  "translations": [
    {
      "translation": "Among them are there some who say, 'Give me permission to stay. Do not put temptation in my way.' Have they not fallen into that very temptation? Hell hems in the kafirun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (many a one) there is among them who says: \"Allow me (to stay back at home), and put me not on trial.\" Surely they have put themselves on trial already, and Hell will enclose the unbelievers from all sides.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them is he who says: \"Grant me leave to stay behind, and do not expose me to temptation.\" Lo! They have already fallen into temptation. Surely Hell encompasses the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them ask you, \"Make us exempt from taking part in the battle and do not try to tempt us by telling us what we may gain from the battle; many people have died in the battle.\" Hell certainly encompasses the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them is one who requests you that, “Grant me exemption (from fighting) and do not put me to test”; pay heed! They have indeed fallen into trial; and indeed hell surrounds the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them is he who says: \"Grant me leave and put me not into trial.\" Surely, they have fallen into trial. And verily, Hell is surrounding the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them there is he who says: Allow me and do not try me. Surely into trial have they already tumbled down, and most surely hell encompasses the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them there are that say, 'Give me leave and do not tempt me.' Have not such men fallen into temptation? And surely Gehenna encompasses the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of them is he who saith: Grant me leave (to stay at home) and tempt me not. Surely it is into temptation that they (thus) have fallen. Lo! hell verily is all around the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them say, \"Give us leave to stay behind and do not put us to trial.\" Surely, they have already fallen into trial. Surely, Hell shall engulf those who deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them there is he who saith: give me leave, and tempt me not. Lo! into temptation they are already fallen, and verily the Hell is the encompasser of the infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them there are some who say, ‘Give me leave, and do not put me to temptation.’ Look! They have already fallen into temptation and indeed hell besieges the faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them is (many) a man who says: \"Grant me exemption and draw me not into trial.\" Have they not fallen into trial already? and indeed Hell surrounds the Unbelievers (on all sides).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them is he who says:\"Grant me leave (to be exempted from Jihad) and put me not into trial.\" Surely, they have fallen into trial. And verily, Hell is surrounding the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them are some that say: 'Give us leave and do not expose us to temptation' Surely, they have already succumbed to temptation. Gehenna shall encompass the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them is he who says, “Excuse me, and do not trouble me.” In fact, they sunk into trouble. In fact, Hell will engulf the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them is he who says, \"Permit me [to remain at home] and do not put me to trial.\" Unquestionably, into trial they have fallen. And indeed, Hell will encompass the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:49] And there are some of them who say, ‘Grant me leave, to stay behind, and do not lead me into temptation’: this was al-Jadd b. Qays, to whom the Prophet (s) said, ‘Will you do battle against the Byzantines?’, and to which he replied, ‘I am infatuated with women, and I fear that if I were to see these Byzantine women, I shall not be able to stay away from them and be led into temptation’. God, exalted be He, says: Surely they have [already] fallen into temptation!, by staying behind (a variant reading [for saqatū, ‘they have fallen’] has [the singular form] saqat, ‘he has fallen’). And surely Hell shall encompass the disbelievers, for whom there shall be no escape therefrom.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Of them) of the hypocrites (is he who saith) the reference here is to Jadd Ibn Qays: (Grant me leave) to stay at home (and tempt me not) by the women of Historic Syria. (Surely it is into temptation) idolatry and hypocrisy (that they (thus) have fallen. Lo! Hell is all around) will be all around (the disbelievers) on the Day of Judgement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱئْذَن لِّي وَلاَ تَفْتِنِّي } معناهُ وَلاَ تَأْثِمني { أَلا فِي ٱلْفِتْنَةِ سَقَطُواْ } معناهُ فِي الإِثمِ وَقَعوا\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - be glorified - { Is it that you would enter [Paradise] while yet there has not come to you the like of [the suffering which came to] those who passed on before you? } its meaning: { You would not enter [Paradise] while you are committing the sin. }",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنْهُمْ } أي: من المستأذنين المتخلفين { مَّن يَقُولُ } لك حين استأذنك بالعقود: { ٱئْذَن لِّي } إذ ليس لي قوة الخروج { وَلاَ تَفْتِنِّي } أي: لا توقعني في الفتنة بالخروج؛ إذ إني أخاف على نفسي من الفتنة والعصيان لو خرجت، قل لهم يا أكمل الرسل توبيخاً وتقريعاً: { أَلا فِي ٱلْفِتْنَةِ سَقَطُواْ } أي: وقعوا في فتنة التخلف وظهور النفاق والشقاق باستذانهم وقولهم هذا { وَ } استحقوا العذاب والنكال { إِنَّ جَهَنَّمَ } البعد والخذلان { لَمُحِيطَةٌ بِٱلْكَافِرِينَ } [التوبة: 49] في الدنيا والآخرة، ومن شدة شكيمتهم وغيظ قلوبهم معك يا أكمل الرسل\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:149",
      "similarity": 0.594335957844327
    },
    {
      "verse": "26:187",
      "similarity": 0.43686679942529694
    },
    {
      "verse": "17:92",
      "similarity": 0.3865502731710186
    },
    {
      "verse": "41:54",
      "similarity": 0.36665917932719144
    },
    {
      "verse": "29:54",
      "similarity": 0.3386232222096524
    }
  ]
}