{
  "chapter": "التوبة",
  "text": "فاذا انسلخ الاشهر الحرم فاقتلوا۟ المشركين حيث وجدتموهم وخذوهم واحصروهم واقعدوا۟ لهم كل مرصد فان تابوا۟ واقاموا۟ الصلوة وءاتوا۟ الزكوة فخلوا۟ سبيلهم ان الله غفور رحيم",
  "translations": [
    {
      "translation": "Then, when the sacred months are over, kill the idolaters wherever you find them, and seize them and besiege them and lie in wait for them on every road. If they make tawba and establish salat and pay zakat, let them go on their way. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when these months, prohibited (for fighting), are over, slay the idolaters wheresoever you find them, and take them captive or besiege them, and lie in wait for them at every likely place. But if they repent and fulfil their devotional obligations and pay the zakat, then let them go their way, for God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the sacred months expire slay those who associate others with Allah in His Divinity wherever you find them; seize them, and besiege them, and lie in wait for them. But if they repent and establish the Prayer and pay Zakah, leave them alone. Surely Allah is All-Forgiving, Ever-Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the sacred months are over, slay the pagans wherever you find them. Capture, besiege, and ambush them. If they repent, perform prayers and pay the religious tax, set them free. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when the sacred months have passed, slay the polytheists wherever you find them, and catch them and make them captive, and wait in ambush for them at every place; then if they repent and keep the prayer established and pay the charity, leave their way free; indeed Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when the Sacred Months have passed, then fight the Mushrikin wherever you find them, and capture them and besiege them, and lie in wait for them in each and every ambush. But if they repent and perform the Salah, and give the Zakah, then leave their way free. Verily, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when the sacred months have passed away, then slay the idolaters wherever you find them, and take them captives and besiege them and lie in wait for them in every ambush, then if they repent and keep up prayer and pay the poor-rate, leave their way free to them; surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when the sacred months are drawn away, slay the idolaters wherever you find them, and take them, and confine them, and lie in wait for them at every place of ambush. But if they repent, and perform the prayer, and pay the alms, then let them go their way; God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when the sacred months have passed, slay the idolaters wherever ye find them, and take them (captive), and besiege them, and prepare for them each ambush. But if they repent and establish worship and pay the poor-due, then leave their way free. Lo! Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the forbidden months have passed, kill the polytheists [who are at war with you] wherever you find them. Take them captive, and besiege them, and lie in wait for them at every place of ambush. But if they repent, and take to prayer regularly and pay the alms, then let them go their way. God is forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When, therefore, the sacred months have slipped away, slay the associators's wheresoever ye find them and capture them and beset them and lie in wait for them at every ambush. Then, should they repent and establish prayer and give the poor-rate, leave their way free. Verily Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when the sacred months have passed, kill the polytheists wherever you find them, capture them and besiege them, and lie in wait for them at every ambush. But if they repent, and maintain the prayer and give the zakat, then let them alone. Indeed Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the forbidden months are past, then fight and slay the Pagans wherever ye find them, an seize them, beleaguer them, and lie in wait for them in every stratagem (of war); but if they repent, and establish regular prayers and practise regular charity, then open the way for them: for Allah is Oft-forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when the Sacred Months (the Ist, 7th, 11th, and 12th months of the Islamic calendar) have passed, then kill the Mushrikun (see V. 2:105) wherever you find them, and capture them and besiege them, and prepare for them each and every ambush. But if they repent and perform As-Salat (Iqamat-as-Salat), and give Zakat, then leave their way free. Verily, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the sacred months are over, slay the idolaters wherever you find them. Take them and confine them, then lie in ambush everywhere for them. If they repent and establish the prayer and pay the obligatory charity, let them go their way. Allah is Forgiving and the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Sacred Months have passed, kill the polytheists wherever you find them. And capture them, and besiege them, and lie in wait for them at every ambush. But if they repent, and perform the prayers, and pay the alms, then let them go their way. God is Most Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the sacred months have passed, then kill the polytheists wherever you find them and capture them and besiege them and sit in wait for them at every place of ambush. But if they should repent, establish prayer, and give zakah, let them [go] on their way. Indeed, Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:5] Then, when the sacred months have passed — that is, [at] the end of the period of deferment — slay the idolaters wherever you find them, be it during a lawful [period] or a sacred [one], and take them, captive, and confine them, to castles and forts, until they have no choice except [being put to] death or [acceptance of] Islam; and lie in wait for them at every place of ambush, [at every] route that they use (kulla, ‘every’, is in the accusative because a [preceding] genitive-taking preposition has been removed). But if they repent, of unbelief, and establish prayer and pay the alms, then leave their way free, and do not interfere with them. God is Forgiving, Merciful, to those who repent.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then, when the sacred months have passed) then after the day of immolation when the month of 193 Muharram passes, (slay the idolaters) whose treaty is for fifty days (wherever ye find them) whether in the Sacred Precinct or outside it, during the sacred months or at any other time, (and take them (captive)) imprison them, (and besiege them) in their homes, (and prepare for them each ambush) on every road they tread for trade. (But if they repent) from idolatry and believe in Allah (and establish worship) and acknowledge the five daily prayers (and pay the poor-due) acknowledge the payment of the poor-due, (then leave their way free) if they wish to go to the House of Allah. (Lo! Allah is Forgiving) He forgives whoever repents, (Merciful) towards whosoever dies in a state of repentance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱقْعُدُواْ لَهُمْ كُلَّ مَرْصَدٍ } معناهُ كُلَّ طَريقٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And take your stations for them} - meaning, on every road.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِذَا ٱنسَلَخَ } أي: انقضى ومضى { ٱلأَشْهُرُ ٱلْحُرُمُ } المأمورة فيها السياحة والأمن { فَٱقْتُلُواْ ٱلْمُشْرِكِينَ } المصرين على الشرك\n الناقضين للعهد والميثاق { حَيْثُ وَجَدتُّمُوهُمْ } في حل أو حرم مستأمنين أم لا { وَخُذُوهُمْ } أي: ائسروهم واسترقوهم\n واستولوا عليهم { وَ } إن استحفظوا استحصنوا { ٱحْصُرُوهُمْ وَٱقْعُدُواْ لَهُمْ } لأخذهم وقتلهم { كُلَّ مَرْصَدٍ } وممر من شعاب الجبال وشفار الوادي { فَإِن تَابُواْ } ورجعوا عن الشرك\n ومالوا إلى الإيمان { وَ } بعد إيمانهم { أَقَامُواْ ٱلصَّلَٰوةَ } التي هي علامة إيمانهم وتصديقهم\n\n\n{ وَءَاتَوُاْ ٱلزَّكَٰوةَ } التي تطهر قلوبهم عن أمارات النفاق { فَخَلُّواْ سَبِيلَهُمْ } كسائر المسلمين تتذكروا\n وتلتفتوا بما صدر عنهم من المخالفة والمقاتلة والشقاق فيمامضى { إِنَّ ٱللَّهَ } المصلح لأحوال عباده { غَفُورٌ } لما صدر عنهم من المعاصي والآثام { رَّحِيمٌ } [التوبة: 5] لهم يوصلهم إلى دار السلام بعدما أخلصوا الإنابة والرجوع",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { فإذا انسلخ الأشهر } أي: انقضى الأشهر، { الحُرم } وهي الأربعة التي امهلهم فيها، فمن قال: إنها شوال وذو القعدة وذو الحجة والمحرم، فهي الحرم المعروفة، زاد فيها شوال، ونقص رجب، وسميت حرماً تغليباً للأكثر، ومن قال: إنها ذو الحجة إلى ربيع الثاني، فسميت حرماً لحرمتها ومنع القتال فيها حينئذٍ. وغلط من قال: إنها الأشهر الحرم المعلومة لإخلاله بنظم الكلام ومخالفته للإجماع لأنه يقتضي بقاء حرمة الأشهر الحرم. انظر البيضاوي. فإذا انقضت الأربعة التي أمهلتهم فيها { فاقتلوا المشركين } الناكثين { حيث وجدتموهم } من حل أو حرم، { وخُذوهم } أسارى، يقال للأسير: أخيذ، { واحصروهم } واحبسوهم { واقعدوا لهم كل مرصد } كل ممر وطريق لئلا ينبسطوا في البلاد، { فإن تابوا } عن الشرك وآمنوا، { وأقاموا الصلاة وآتوا الزكاة } تصديقاً لتوبتهم وإيمانهم { فخلوا سبيلهم } أي فدعوهم ولا تتعرضوا لهم بشيء من ذلك. وفيه دليل على ان تارك الصلاة ومانع الزكاة لا يخلى سبيله، بل يقاتل كما فعل الصديق رضي الله عنه بأهل الردة. والآية: في معنى قوله صلى الله عليه وسلم\n \" أمرت أن أُقَاتِل النَّاس حتَّى يَقُولوا لا إله إلا الله، ويُقيموا الصَّلاة ويُؤتوا الزَّكَاةَ... \" \nالحديث. { أن الله غفور رحيم } ، هو تعليل لعدم التعرض لمن تاب، أي: فخلوهم لأن الله قد غفر لهم، ورحمهم بسبب توبتهم. الإشارة: فإذا انقضت ايام الغفلة والبطالة التي احترقت النفس فيها، فاقتلوا النفوس والقواطع والعلائق حيث وجدتموهم، وخذوا أعداءكم من النفس والشيطان والهوى، واحصروهم، واقعدوا لهم كل مرصد يتعرضون فيه لكم، فإن أذعنوا، وانقادوا، وألقوا السلاح، فخلوا سبيلهم إن الله غفور رحيم. ولما أمر بقتال المشركين وأخذهم أينما ثُقفوا، استثنى من أتى بطلب الأمان، فقال: { وَإِنْ أَحَدٌ مِّنَ ٱلْمُشْرِكِينَ ٱسْتَجَارَكَ فَأَجِرْهُ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:37",
      "similarity": 0.5140046412373639
    },
    {
      "verse": "7:175",
      "similarity": 0.4855381154084898
    },
    {
      "verse": "89:14",
      "similarity": 0.30066093766353413
    },
    {
      "verse": "78:21",
      "similarity": 0.2965134223140083
    },
    {
      "verse": "72:9",
      "similarity": 0.2893132239630738
    }
  ]
}