{
  "chapter": "التوبة",
  "text": "ان تصبك حسنة تسؤهم وان تصبك مصيبة يقولوا۟ قد اخذنا امرنا من قبل ويتولوا۟ وهم فرحون",
  "translations": [
    {
      "translation": "If good happens to you it galls them. If a mishap occurs to you, they say, 'We made our preparations in advance,' and they turn away rejoicing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If good comes your way they are vexed, but if calamity befalls you, they say: \"We had taken precautions in advance;\" and pleased, turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If good fortune befalls you, it vexes them; and if an affliction befalls you, they turn away in jubilation and say: \"We have taken due care of our affairs in good time.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you gain success, it grieves them but if you suffer hardship, they turn away from you saying, \"It's good that we took our affairs into our own hands\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If good befalls you they dislike it; and were some calamity to befall you, they would say, “We had resolved our matters in advance”, and would turn away rejoicing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If good befalls you, it grieves them, but if a calamity overtakes you, they say: \"We took our precaution beforehand,\" and they turn away rejoicing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If good befalls you, it grieves them, and if hardship afflicts you, they say: Indeed we had taken care of our affair before; and they turn back and are glad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If good fortune befalls thee, it vexes them; but if thou art visited by an affliction, they say, 'We took our dispositions before', and turn away, rejoicing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If good befalleth thee (O Muhammad) it afflicteth them, and if calamity befalleth thee, they say: We took precaution, and they turn away well pleased.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If good befalls you, it grieves them, but if a misfortune befalls you, they say, \"We took our precautions beforehand!\" They turn away rejoicing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If good befalleth thee, it annoyeth them, and if an affliction befalleth thee, they say; surely we took good hold of our affair before. And they turn away while they are exulting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If some good should befall you, it upsets them; but if an adversity befalls you, they say, ‘We had already taken our precautions in advance,’ and they go away boasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If good befalls thee, it grieves them; but if a misfortune befalls thee, they say, \"We took indeed our precautions beforehand,\" and they turn away rejoicing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If good befalls you (O Muhammad SAW), it grieves them, but if a calamity overtakes you, they say: \"We took our precaution beforehand,\" and they turn away rejoicing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If good comes to you, it grieves them; but if hardship befalls you, they say: 'We have taken our precautions' and they turn away, rejoicing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If something good happens to you, it upsets them; and if a calamity befalls you, they say, “We took our precautions in advance,” and they depart, happy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If good befalls you, it distresses them; but if disaster strikes you, they say, \"We took our matter [in hand] before,\" and turn away while they are rejoicing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:50] If good fortune, such as a victory or [a taking of] some spoils, befalls you, it vexes them; but if an affliction, some hardship, befalls you, they say, ‘We took our precaution, judiciously — when we stayed behind — before’, before this act of disobedience; and they turn away, rejoicing, at what has afflicted you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If good) conquest and the spoils of war as on the Day of Badr (befalleth thee (0 Muhammad) it afflicteth them) i.e. the hypocrites, (and if calamity) killings and defeat (befalleth thee) such as during the Battle of Uhud, (they say) the hypocrites, 'Abdullah Ibn Ubayy and his host, say: (We took precaution) by staying at home before the calamity took place, (and they turn away) from jihad (well pleased) with that which has befallen the Prophet (pbuh) and his Companions on the Day of Uhud.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِن تُصِبْكَ } في بعض أسفارك وغزواتك { حَسَنَةٌ } ظفرة وغنيمة { تَسُؤْهُمْ } وتزيد غيظهم ونفاقهم { وَإِن تُصِبْكَ } في بعضها { مُصِيبَةٌ } كسر وهزيمة { يَقُولُواْ } تصحيحاً وتحسيناً لرأيهم الفاسد: { قَدْ أَخَذْنَا أَمْرَنَا } وأصبنا فيه { مِن قَبْلُ } أي: حين تخلفنا { وَيَتَوَلَّواْ } عن مجمعهم الذي يتشامتون فيه بالمؤمنين تبجحاً { وَّهُمْ } في رجوعهم وتفرقهم { فَرِحُونَ } [التوبة: 50] مسرورون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:58",
      "similarity": 0.5456864831373721
    },
    {
      "verse": "3:120",
      "similarity": 0.5166842619150088
    },
    {
      "verse": "42:48",
      "similarity": 0.5090724860921717
    },
    {
      "verse": "13:26",
      "similarity": 0.3881411023863236
    },
    {
      "verse": "30:36",
      "similarity": 0.36868956989603224
    }
  ]
}