{
  "chapter": "التوبة",
  "text": "قل لن يصيبنا الا ما كتب الله لنا هو مولىنا وعلى الله فليتوكل المؤمنون",
  "translations": [
    {
      "translation": "Say: 'Nothing can happen to us except what Allah has ordained for us. He is Our Master. It is in Allah that the muminun should put their trust.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"Nothing can befall us except what God decrees. Our protector is He, and in God should the faithful place their trust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Nothing will befall us except what Allah has decreed for us; He is our Protector.\" Let the believers, then, put all their trust in Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"Nothing will happen to us besides what God has decreed for us. He is our Guardian. In God alone do the believers trust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, O dear Prophet “Nothing shall befall us except what Allah has destined for us; He is our Master; and the Muslims must rely only on Allah.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Nothing shall ever happen to us except what Allah has ordained for us. He is our Mawla (protector).\" And in Allah let the believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Nothing will afflict us save what Allah has ordained for us; He is our Patron; and on Allah let the believers rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Naught shall visit us but what God has prescribed for us; He is our Protector; in God let the believers put all their trust.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Naught befalleth us save that which Allah hath decreed for us. He is our Protecting Friend. In Allah let believers put their trust!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Nothing can befall us, except what God has ordained for us. He is our Supreme Lord. In God let the faithful put their trust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: naught shall ever befall us save that which Allah hath ordained for us; He is our patron, and on Allah let the believers rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Nothing will befall us except what Allah has ordained for us. He is our master, and in Allah let all the faithful put their trust.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Nothing will happen to us except what Allah has decreed for us: He is our protector\": and on Allah let the Believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Nothing shall ever happen to us except what Allah has ordained for us. He is our Maula (Lord, Helper and Protector).\" And in Allah let the believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Nothing will befall us except what Allah has ordained. He is our Guardian. In Allah, let the believers put their trust'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Nothing will happen to us except what God has ordained for us; He is our Protector.” In God let the faithful put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Never will we be struck except by what Allah has decreed for us; He is our protector.\" And upon Allah let the believers rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:51] Say, to them: ‘Nothing shall afflict us but that which God has decreed for us, that we be afflicted thereby; He is our Protector, our Helper and the One in charge of our affairs; in God let the believers put their trust’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتلقين جواب لقولهم : { قد أخذنا أمرنا من قبل } \\[ التوبة : 50 \\] المنبىء عن فرحهم بما ينال المسلمين من مصيبة بإثبات عدم اكتراث المسلمين بالمصيبة وانتفاء حزنهم عليها لأنهم يعلمون أن ما أصابهم ما كان إلاّ بتقدير الله لمصلحة المسلمين في ذلك ، فهو نفع محض كما تدلّ عليه تعدية فعل { كتب } باللام المؤذنة بأنّه كتب ذلك لنفعهم وموقع هذا الجواب هو أن العدوّ يفرح بمصاب عدوّه لأنّه ينكد عدوّه ويُحزنه ، فإذا علموا أنّ النبي لا يحزَن لما أصابه زال فرحهم .وفيه تعليم للمسلمين التخلق بهذا الخلق : وهو أن لا يحزنوا لما يصيبهم لئلا يهنو وتذهب قوتهم ، كما قال تعالى : { ولا تهنوا ولا تحزنوا وأنتم الأعلون إن كنتم مؤمنين إن يمسسكم قرح فقد مس القوم قرح مثله } \\[ آل عمران : 139 ، 140 \\]. وأن يرضوا بما قدر الله لهم ويرجوا رضى ربّهم لأنهم واثقون بأنّ الله يريد نصر دينه .وجملة { هو مولانا } في موضع الحال من اسم الجلالة ، أو معترضة أي لا يصيبنا إلا ما قدره الله لنا ، ولنا الرجاء بأنّه لا يكتب لنا إلا ما فيه خيرنا العَاجل أو الآجل ، لأن المولى لا يرضى لمولاه الخزي .وجملة { وعلى الله فليتوكل المؤمنون } يجوز أن تكون معطوفة على جملة { قل } فهي من كلام الله تعالى خبراً في معنى الأمر ، أي قل ذلك ولا تتوكّلوا إلا على الله دون نصرة هؤلاء ، أي اعتمدوا على فضله عليكم .ويجوز أن تكون معطوفة على جملة { لن يصيبنا } أي قل ذلك لهم ، وقل لهم إن المؤمنين لا يتوكّلون إلا على الله ، أي يؤمنون بأنّه مؤيّدهم ، وليس تأييدهم بإعانتكم ، وتفصيل هذا الإجمال في الجملة التي بعدها . والفاء الداخلة على { فليتوكل المؤمنون } فاء تدلّ على محذوف مفرّع عليه اقتضاه تقديم المعمول ، أي على الله فليتوكّل المؤمنون .\n\n",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the hypocrites: (Naught befalleth us save that which Allah hath decreed for us. He is our protecting Friend) He has better right to protect us. (In Allah let believers put their trust!) the believers ought to put their trust in Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلاَّ مَا كَتَبَ ٱللَّهُ لَنَا } معناهُ قَضى لَنَا\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, \"Except what Allah has decreed for us,\" means He has destined for us.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُل } يا أكمل الرسل للمتشامتين المنافقين على مقتضى كشفك وشهودك بربك: { لَّن يُصِيبَنَآ } من الحوادث { إِلاَّ مَا كَتَبَ ٱللَّهُ } المقدر للآجال والأرزاق\n وجميع الأفعال والأحوال\n والحوادث الجارية في عالم الغيب والشهادة { لَنَا } وخصصنا بها في حضرة علمه\n إذ { هُوَ } بذاته { مَوْلاَنَا } ومولي جميع أمورنا يصنع بنا على مقتضى ما ثبت في حضرة علمه بلا تبديل ولا تغيير { وَ } ما لنا إلا الرضا بما جرى علينا وسيجري من القضاء\n لذلك { عَلَى ٱللَّهِ } لا على غيره من الأسباب والوسائل\n إذ مرجع الكل إليه\n كما أن مبدأه منه أولاً بالذات { فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ } [التوبة: 51] بتوحيد الذات\n وسريان سر الوحدة على صفائح المكونات\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { قل } لهم يا محمد: { لن يصيبنا } من حسنة أو مصيبة\n { إلا ما كتبَ اللهُ لنا } في اللوح الحفوظ\n لا يتغير بموافقتكم ولا بمخالفتكم\n { هو مولانا } متولي أمرنا وناصرنا\n { وعلى الله فليتوكل المؤمنون } أي: وإليه فليفوض المؤمنون أمورهم رضاَ بتدبيره لأن مقتضى الإيمان ألا يتوكل إلا على الله إذ لا فاعل سواه\n { قل } لهم: { هل تربّصُون } أي: تنتظرون { بنا إحدى الحُسنيين } أي: إلا إحدى العاقبتين اللتين كل منهما حسنى: إما النصر وإما الشهادة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "64:13",
      "similarity": 0.5349633588165074
    },
    {
      "verse": "27:79",
      "similarity": 0.4360808301287849
    },
    {
      "verse": "6:102",
      "similarity": 0.4230284607409483
    },
    {
      "verse": "39:41",
      "similarity": 0.4194718626133329
    },
    {
      "verse": "2:156",
      "similarity": 0.4169699085285663
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009051.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009051.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:51.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}