{
  "chapter": "التوبة",
  "text": "قل هل تربصون بنا الا احدى الحسنيين ونحن نتربص بكم ان يصيبكم الله بعذاب من عنده او بايدينا فتربصوا۟ انا معكم متربصون",
  "translations": [
    {
      "translation": "Say: 'What do you await for us except for one of the two best things?* But what we await for you is for Allah to inflict a punishment on you either directly from Himself or at our hands. So wait, we are waiting with you!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Are you waiting for anything else but one of two good things for us, (victory or martyrdom)? Yet what we are waiting for you is the punishment of God, direct or through us. So keep waiting; we are waiting with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"What you await to befall upon us is nothing but one of the two good things! And what we await for you is that Allah visit you with chastisement from Him or chastise you at our hands. So continue waiting; we too shall wait with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For us, you can anticipate nothing other than Paradise if we are killed or success if we triumph. However, what we can anticipate for you is either punishment by the hands of God or by ours. Wait and we, too, are waiting with you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “What do you wait for to happen to us, except one of the two good things?* And for you, we look forward to Allah afflicting you with a punishment from Himself or by our hands; so wait – we too await with you.” (*Death in Allah’s way or victory.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Do you wait for us (anything) except one of the two best things; while we await for you either that Allah will afflict you with a punishment from Himself or at our hands. So wait, we too are waiting with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Do you await for us but one of two most excellent things? And we await for you that Allah will afflict you with punishment from Himself or by our hands. So wait; we too will wait with you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Are you awaiting for aught to come to us but one of the two rewards most fair? We are awaiting in your case too, for God to visit you with chastisement. from Him, or at our hands; so await; we are awaiting with you.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Can ye await for us aught save one of two good things (death or victory in Allah's way)? while we await for you that Allah will afflict you with a doom from Him or at our hands. Await then! Lo! We are awaiting with you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Are you waiting for anything to befall us except one of the two best things  [Victory in this world or Paradise in the next]? But we expect that God will send His punishment to you either directly from Himself, or by our hands. So wait, if you will; we too, are waiting with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou await ye for us ought save one of the two excellences; while for you we wait that Allah shall afflict you with a torment from Himself or at our hands. Await then, we also are with you awaiting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Do you not await one of the two excellent things to happen to us? But we await that Allah shall visit on you a punishment, from Him, or by our hands. So wait! We too are waiting along with you.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Can you expect for us (any fate) other than one of two glorious things- (Martyrdom or victory)? But we can expect for you either that Allah will send his punishment from Himself, or by our hands. So wait (expectant); we too will wait with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Do you wait for us (anything) except one of the two best things (martyrdom or victory); while we await for you either that Allah will afflict you with a punishment from Himself or at our hands. So wait, we too are waiting with you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Are you waiting for anything to befall us except one of the two excellent things (victory or martyrdom)? We are waiting for the punishment of Allah to smite you, either from Him or at our hands. Wait if you will, we are waiting'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Are you expecting for us anything other than one of the two excellences? As for us: we are expecting that God will afflict you with a punishment from Himself, or at our hands. So wait, we are waiting with you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Do you await for us except one of the two best things while we await for you that Allah will afflict you with punishment from Himself or at our hands? So wait; indeed we, along with you, are waiting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:52] Say: ‘Are you waiting (tarabbasūn: one of the two original tā’ letters [in tatarabbasūn] has been omitted) for anything, to occur, for us but one of the two fair things, [the two fair] outcomes? (husnayayn is the dual form of husnā, which is the feminine form of ahsan), that is, victory or martyrdom? We are waiting in your case too, for God to afflict you with a chastisement from Him, with a calamity from the heaven, or at our hands, should we be given permission to fight you. So wait, for this to [befall] us, we are also waiting with you’, your end.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the hypocrites: (Can ye await for us aught save one of two good things) conquest and spoils of war or death and martyrdom? (while we await for you that Allah will afflict you with a doom from Him) to destroy you (or at our hands) with our swords to kill you. (Await then! Lo! we are awaiting with you) for your destruction.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم أيضاً: { هَلْ تَرَبَّصُونَ } أي: تترقبون وتنتظرون { بِنَآ إِلاَّ إِحْدَى ٱلْحُسْنَيَيْنِ } أي: العاقبتين الحميدتين اللتين كل منهما محض خير\n إمَّا النصرة وإمَّا الشهادة إذ وعدنا الله من فضله بهما { وَنَحْنُ } أيضاً { نَتَرَبَّصُ بِكُمْ } على مقتضى وحي الله وإلهامه { أَن يُصِيبَكُمُ ٱللَّهُ بِعَذَابٍ } نازل { مِّنْ عِندِهِ } بلا دخل منا وصنع من كسف أو خسف وزلزلة وغيرها { أَوْ بِأَيْدِينَا } من القتل والأسر\n والإجلاء والإذلال { فَتَرَبَّصُوۤاْ } وانتظروا لما وُعد لنا { إِنَّا مَعَكُمْ مُّتَرَبِّصُونَ } [التوبة: 52] أيضاً لما أوعدتم به\n حتى ننظر كيف يجري حكم الله ومشيئته؟",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { قل } لهم يا محمد: { لن يصيبنا } من حسنة أو مصيبة، { إلا ما كتبَ اللهُ لنا } في اللوح الحفوظ، لا يتغير بموافقتكم ولا بمخالفتكم، { هو مولانا } متولي أمرنا وناصرنا، { وعلى الله فليتوكل المؤمنون } أي: وإليه فليفوض المؤمنون أمورهم رضاَ بتدبيره لأن مقتضى الإيمان ألا يتوكل إلا على الله إذ لا فاعل سواه، { قل } لهم: { هل تربّصُون } أي: تنتظرون { بنا إحدى الحُسنيين } أي: إلا إحدى العاقبتين اللتين كل منهما حسنى: إما النصر وإما الشهادة، { ونحنُ نتربصُ بكم } أيضاً إحدى العاقبتين السُوأتين: إما { أن يصيبَكم اللَّهُ بعذابٍ من عنده } بقارعة من السماء، { أو بأيدينا } أي: أو بعذاب بأيدينا، وهو القتل على الكفر، { فتربصُوا } ما هو عاقبتنا، { إنا معكم مُتَربِّصون } ما هو عاقبتكم\n الإشارة: ثلاثة أمور توجب للعبد الراحة من التعب، والسكون إلى رب الأرباب، وتذهب عنه حرارة التدبير والاختبار، وظلمة الأكدار والأغيار: أحدها: تحقيق العلم بسبقية القضاء والقدر، حتى يتحقق بأن ما أخطأه لم يكن ليصيبه، وما أصابه لم يكن ليخطئه، قال تعالى: { قل لن يصينا إلا ما كتب الله لنا } ، { وَإن يمْسسْك اللَّهُ بضُرِّ فَلا كَاشِفَ له إلاَّ هُوَ } ، وليتأمل قول الشاعر:\n\nوقد ورد عن سيدنا علي ـ كرم الله وجهه ـ أنه قال: سبع آيات: من قرأها أو حملها معه لو انطبقت السماء على الأرض لجعل الله له فرجاً ومخرجاً من أمره، فذكر هذه الآية: { قل لن يصيبنا } ، وآية في سورة يونس:\n\n[يونس: 107] الآية، وآيتان في سورة هود:\n\n[هود: 6]، الآية،\n\n[هود: 56]، الآية، وقوله تعالى:\n\n[العنكبوت: 60]،\n\n[فاطر: 2]، و\n\n\n\n في الزمر إلى قوله\n\n[الزمر: 38]، ونظمها بعضهم فقال:\n\nوإنما أشار رضي الله عنه إلى معنى الآيات لا إلى لفظها لأنها كلها تدل على النظر لسابق القدر، والتوكل على الواحد القهار\n الأمر الثاني: تحقق العبد برأفته ـ تعالى ـ ورحمته، وأنه لا يفعل به إلا ما هو في غاية الكمال في حقه، إن كان جمالاً فيقتضي منه الشكر، وإن كان جلالاً فيقتضي منه الصبر، وفيه غاية التقريب والتطهير وطي المسافة بينك وبين الحبيب\n\n\nوفي الحكم: \" خير أوقاتك وقت تشهد فيه وجودَ فاقتك، وتُرَدُ فيه إلى وجود ذلتك، إن أردت بسط المواهب عليك، فصحح الفقر والفاقة لديك، الفاقة أعياد المريدين \"\n إلى غير ذلك من كلامه في هذا المعنى\n الأمر الثالث: تحققه بخالص التوحيد فإذا علم أن الفاعل هو الله ولا فاعل سواه رضي بفعل حبيبه، كيفما كان، كما قال ابن الفارض رضي الله عنه:\n\nوكما قال صاحب العينية:\n\nفهذه الأمور الثلاثة، إذا تفكر فيها العبد دام حبوره وسروره، وسهلت عليه شؤونه وأموره\n وقوله تعالى: { قل هل تربصون بنا\n\n\n } الآية، مثله يقول أهل النسبة لأهل الإنكار: هل تربصون بنا إلا إحدى الحسنيين، إما حسن الختام بالموت على غاية الإسلام، يموت المرء على ما عاش عليه، وإما الظفر بمعرفة الملك العلام على غاية الكمال والتمام، ونحن نتربص بكم أن يصيبكم الله بعقوبة من عنده بسبب إذايتكم، أو بدعوة من عندنا إذا أَذِنَ لنا\n وبالله التوفيق\n ثم ذكر سبب إبطال عملهم وصدقاتهم، فقال: { قُلْ أَنفِقُواْ طَوْعاً أَوْ كَرْهاً }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "52:31",
      "similarity": 0.7156079668825174
    },
    {
      "verse": "23:25",
      "similarity": 0.558982032219111
    },
    {
      "verse": "20:135",
      "similarity": 0.5454090178109308
    },
    {
      "verse": "52:30",
      "similarity": 0.4823513029572949
    },
    {
      "verse": "57:14",
      "similarity": 0.3665412045957272
    }
  ]
}