{
  "chapter": "التوبة",
  "text": "قل انفقوا۟ طوعا او كرها لن يتقبل منكم انكم كنتم قوما فسقين",
  "translations": [
    {
      "translation": "Say: 'Whether you give readily or reluctantly, it will not be accepted from you. You are people who are deviators.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"You may spend (in the way of God), whether willingly or with reluctance, it will not be accepted from you, for you are reprobates.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"Whether you spend your money willingly or unwillingly, it shall not find acceptance (with Allah) for you are an evil-doing folk.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Whether you spend your wealth for the cause of God, willingly or reluctantly, it will never be accepted from you; you are an evil doing people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Spend willingly or with a heavy heart, it will never be accepted from you; indeed you are a disobedient people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Spend willingly or unwillingly, it will not be accepted from you. Verily, you are ever a people who are rebellious.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Spend willingly or unwillingly, it shall not be accepted from you; surely you are a transgressing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Expend willingly, or unwillingly, it shall not be accepted from you; you are surely a people ungodly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Pay (your contribution), willingly or unwillingly, it will not be accepted from you. Lo! ye were ever froward folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Whether you give willingly or unwillingly, your offerings shall not be accepted by God, for you are indeed a disobedient people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: expend willingly or unwillingly, it will not be accepted of you; verily ye are ever a people ungodly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Spend willingly or unwillingly, it shall never be accepted from you; for you are indeed a transgressing lot.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Spend (for the cause) willingly or unwillingly: not from you will it be accepted: for ye are indeed a people rebellious and wicked.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Spend (in Allah's Cause) willingly or unwillingly, it will not be accepted from you. Verily, you are ever a people who are Fasiqun (rebellious, disobedient to Allah).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Whether you spend voluntarily or reluctantly it shall not be accepted from you; for you are a wicked nation'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Whether you spend willingly or unwillingly, it will not be accepted from you. You are evil people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Spend willingly or unwillingly; never will it be accepted from you. Indeed, you have been a defiantly disobedient people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:53] Say: ‘Expend, in obedience to God, willingly or unwillingly, it, what you expend, shall not be accepted from you; you are surely a wicked folk’ (the imperative statement here [also] functions as a predicate).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the hypocrites: (Pay) your wealth, (willingly) with a good disposition of the soul (or unwillingly) coercively, out of fear from dying, (it will not be accepted from you. Lo! ye were ever froward folk) hypocrites.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } للمنافقين المتخلفين الذين يريدون إعاتنك بالمال بدل الخروج إلى الجهاد: لن ينفعكم إنفاقكم عند الله سواء { أَنفِقُواْ طَوْعاً } طائعين { أَوْ كَرْهاً } كارهين { لَّن يُتَقَبَّلَ مِنكُمْ } لأن الإنفاق إنما يقبل من المؤمنين الصالحين المخلصين { إِنَّكُمْ } بسبب كفرهم ونفاقكم مع الله ورسوله { كُنتُمْ قَوْماً فَاسِقِينَ } [التوبة: 53] لا يقبل منكم الصدقات مطلقاً؛ لعدم مقارنتها بالإيمان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:38",
      "similarity": 0.43177395114786316
    },
    {
      "verse": "47:26",
      "similarity": 0.4047307843906733
    },
    {
      "verse": "3:83",
      "similarity": 0.4039575002544337
    },
    {
      "verse": "43:78",
      "similarity": 0.397509349618426
    },
    {
      "verse": "63:6",
      "similarity": 0.3899358057560437
    }
  ]
}