{
  "chapter": "التوبة",
  "text": "وما منعهم ان تقبل منهم نفقتهم الا انهم كفروا۟ بالله وبرسوله ولا ياتون الصلوة الا وهم كسالى ولا ينفقون الا وهم كرهون",
  "translations": [
    {
      "translation": "Nothing prevents what they give from being accepted from them but the fact that they have rejected Allah and His Messenger, and that they only come to salat lethargically, and that they only give reluctantly.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing prevents the acceptance of what they spend except that they do not believe in God and His Apostle, and come to worship but languidly and spend only grudgingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing prevents that their expendings be accepted except that they disbelieve in Allah and His Messenger, and whenever they come to the Prayer they do so lazily, and whenever they spend they do so grudgingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What prevents their offerings from being accepted is their disbelief in God and His Messenger, their lack of interest in prayer and spending for the cause of God reluctantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their spending was not stopped being accepted, except because they disbelieved in Allah and His Noble Messenger, and they come to prayer with heavy hearts, and they do not spend except unwillingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And nothing prevents their contributions from being accepted from them except that they disbelieved in Allah and in His Messenger, and that they came not to the Salah except in a lazy state, and that they offer not contributions but unwillingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And nothing hinders their spendings being accepted from them, except that they disbelieve in Allah and in His Apostle and they do not come to prayer but while they are sluggish, and they do not spend but while they are unwilling.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And naught prevents that their expendings should be accepted from them, but that they believe not in God and His Messenger, and perform not the prayer save lazily, and that they expend not without they are averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And naught preventeth that their contributions should be accepted from them save that they have disbelieved in Allah and in His messenger, and they come not to worship save as idlers, and pay not (their contribution) save reluctantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only reason their contributions are not accepted is that they have denied God and His Messenger, they come to the prayer half heartedly, and they offer contributions unwillingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And naught preventeth their expendings being accepted except that they have disbelieved in Allah and His apostle, and they perform not prayer except as sluggards and expend not except as those averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing stops their charities from being accepted except that they have no faith in Allah and His Apostle and do not perform the prayer but lazily, and do not spend but reluctantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only reasons why their contributions are not accepted are: that they reject Allah and His Messenger; that they come to prayer without earnestness; and that they offer contributions unwillingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And nothing prevents their contributions from being accepted from them except that they disbelieved in Allah and in His Messenger (Muhammad SAW); and that they came not to As-Salat (the prayer) except in a lazy state; and that they offer not contributions but unwillingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing prevents their offerings from being accepted except that they do not believe in Allah and His Messenger. They do not come to the prayer except lazily and spend grudgingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What prevents the acceptance of their contributions is nothing but the fact that they disbelieved in God and His Messenger, and that they do not approach the prayer except lazily, and that they do not spend except grudgingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what prevents their expenditures from being accepted from them but that they have disbelieved in Allah and in His Messenger and that they come not to prayer except while they are lazy and that they do not spend except while they are unwilling.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:54] And nothing prevents their expenditure from being accepted (read as yuqbala or tuqbala) from them, but that they (innahum is the subject of the verb, while an tuqbala, ‘being accepted’ constitutes the object) have disbelieved in God and His Messenger, and that they do not come to [perform] prayer save as idlers, sluggishly, and that they do not expend without their being reluctant, to expend, for they consider it a financial penalty.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And naught preventeth that their contributions should be accepted from them save that they have disbelieved in Allah and in His messenger) in secret, (and they come not to worship) to the prayer (save as idlers) lax, (and pay not) anything in the way of Allah (save reluctantly) save when they are forced to.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا مَنَعَهُمْ أَن تُقْبَلَ مِنْهُمْ نَفَقَاتُهُمْ } أي: ليس عدم قبول نفاقهم وصدقاتهم عند الله { إِلاَّ أَنَّهُمْ كَفَرُواْ بِٱللَّهِ } المتوحد بذاته\n وأشركوا له ما هو من مصنوعاته { وَبِرَسُولِهِ } بتكذيبه\n وعدم إطاعته وإنقياده { وَ } علامة كفرهم ونفاقهم: إنهم { لاَ يَأْتُونَ ٱلصَّلاَةَ } الفاصلة الفارقة بين الكفر والإيمان { إِلاَّ } يأتونها مداهنةً { وَهُمْ كُسَالَىٰ } مبطئون مؤخرون بلا انبعاث قلبي وداعية شوقية { وَ } أيضاً { لاَ يُنفِقُونَ } ما ينفقون { إِلاَّ وَهُمْ كَارِهُونَ } [التوبة: 54] كراهة قلبية\n لأنهم لا يتوقعون ترتيب الثواب عليها\n لعدم إيمانهم بيوم الجزاء والثواب والعقاب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { وَمَا مَنَعَهُمْ أَن تُقْبَلَ مِنْهُمْ نَفَقَاتُهُمْ إِلاَّ أَنَّهُمْ كَفَرُواْ بِٱللَّهِ وَبِرَسُولِهِ وَلاَ يَأْتُونَ ٱلصَّلاَةَ إِلاَّ وَهُمْ كُسَالَىٰ وَلاَ يُنفِقُونَ إِلاَّ وَهُمْ كَارِهُونَ }  قلت: أن تُقبل: بدل من ضمير منعهم\n أو على حذف الجار\n و إلا أنهم كفروا: فاعل\n أي: وما منع قبول نفقاتهم\n أو من قبول نفقاتهم\n إلا كفرهم بالله وبرسوله\n ويحتمل أن يكون الفاعل ضميراً يعود على الله تعالى و إنهم مفعول من أجله\n  يقول الحق جل جلاله: { وما منعهم } وما منع المنافقين من قبول نفقاتهم وأعمالهم { إلا أنهم كفروا بالله وبرسوله } إلا كُفرهم بالله وبرسوله\n أو: ما منعهم الله من قبول نفقاتهم إلا لأجل كفرهم بالله وبرسوله\n وكونه { لا يأتُونَ الصلاةَ إلا وهم كُسَالى } متثاقلين\n { ولا ينفقون إلا وهم كَارِهُون } أي: لا يُعطون المال إلا في حال كراهيتهم للإعطاء لأنهم لا يرجون ثواباً ولا يخافون بتركها عقاباً\n فهم يعطون ذلك رياء ونفاقاً\n الإشارة: لا يتقبل الله إلا عمل المخلصين\n إما إخلاص العوام لقصد الثواب وخوف العقاب\n أو إخلاص الخواص لإظهار العبودية وإجلال الربوبية\n وعلامة الإخلاص: وجود النشاط والخفة حال المباشرة للعمل\n أو قبلها والغيبة عنه بعد الوقوع\n والله تعالى أعلم\n ثم نهى عن الإغترار بحال المنافقين\n فقال: { فَلاَ تُعْجِبْكَ أَمْوَالُهُمْ وَلاَ أَوْلاَدُهُمْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:142",
      "similarity": 0.6942471422350373
    },
    {
      "verse": "17:94",
      "similarity": 0.17861900687542123
    },
    {
      "verse": "18:55",
      "similarity": 0.17100722836370325
    },
    {
      "verse": "56:33",
      "similarity": 0.1675843404642476
    },
    {
      "verse": "70:21",
      "similarity": 0.16672686763862063
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/9:54.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/9:54.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/9:54.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}