{
  "chapter": "التوبة",
  "text": "فلا تعجبك امولهم ولا اولدهم انما يريد الله ليعذبهم بها فى الحيوة الدنيا وتزهق انفسهم وهم كفرون",
  "translations": [
    {
      "translation": "Do not let their wealth and children impress you. Allah merely wants to punish them by them during their life in this world and for them to expire while they are kuffar.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not marvel at their wealth and children. God intends to punish them through these in the world; and their souls will depart in a state of disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let neither their riches nor their children excite your admiration. Allah only wants to chastise them through these things in the present life, and to cause them to die while they are unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not their property and children tempt you; God wants to punish them through their things in this life so that their souls will depart while they are unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let not their riches or their children surprise you; Allah only intends to punish them in the life of this world with these things and that they die only as disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let not their wealth nor their children amaze you; in reality Allah's plan is to punish them with these things in the life of this world, and that their souls shall depart (die) while they are disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not then their property and their children excite your admiration; Allah only wishes to chastise them with these in this world's life and (that) their souls may depart while they are unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let not their possessions or their children please thee; God only desires thereby to chastise them in this present life, and that their souls should depart while they are unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let not their riches nor their children please thee (O Muhammad). Allah thereby intendeth but to punish them in the life of the world and that their souls shall pass away while they are disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not let their wealth and children impress you. For God seeks to punish them through these things in the life of this world, so that their souls shall depart while they are still denying the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not wherefore their riches and their children amaze thee. Allah intendeth only to torment them therewith in the life of the world and that their souls pass away while they are infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let not their wealth and children impress you: Allah only desires to punish them with these in the life of this world, and that their souls may depart while they are faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not their wealth nor their (following in) sons dazzle thee: in reality Allah's plan is to punish them with these things in this life, and that their souls may perish in their (very) denial of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let not their wealth or their children amaze you (O Muhammad SAW); in reality Allah's Plan is to punish them with these things in the life of the this world, and that their souls shall depart (die) while they are disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let neither their wealth nor their children please you. Through these Allah seeks to punish them in this life, and that their souls depart while they are unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let neither their possessions nor their children impress you. God intends to torment them through them in this worldly life, and that their souls depart while they are disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let not their wealth or their children impress you. Allah only intends to punish them through them in worldly life and that their souls should depart [at death] while they are disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:55] So do not let their wealth or their children please you, that is, do not deem fair Our graces to them, for this is a [way of] drawing [them] on by degrees [to punish them]: God only desires thereby to chastise them in the life of this world, by way of the hardship that they encounter in amassing such [wealth and children] and the calamities [they suffer] as a result thereof; and that their souls should depart while they are disbelievers, so He punishes them in the Hereafter with the worst punishment.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتفريع على مذمّة حالهم في أموالهم ، وأن وفرة أموالهم لا توجب لهم طُمَأنِينَة بال ، بإعلام المسلمين أنّ ما يرون بعض هؤلاء المنافقين فيه من متاع الحياة الدنيا لا ينبغي أن يكون محلّ إعجاب المؤمنين ، وأن يحسبوا المنافقين قد نالوا شيئاً من الحظّ العاجل ببيان أنّ ذلك سبب في عذابهم في الدنيا .فالخطاب للنبيء صلى الله عليه وسلم والمراد تعليم الأمّة .ومعنى هذه الآية : أنّ الله كشف سرّاً من أسرار نفوس المنافقين بأنّه خلق في نفوسهم شحّاً وحرصاً على المال وفتنة بتوفيره والإشفاق من ضياعه ، فجعلهم بسبب ذلك في عناء وعذاب من جرّاء أموالهم ، فهم في كَبَد من جمعها . وفي خوف عليها من النقصان ، وفي ألم من إنفاق ما يلجئهم الحال إلى إنفاقه منها ، فقد أراد الله تعذيبهم في الدنيا بما الشأن أن يكون سبب نعيم وراحة ، وتمّ مراده . وهذا من أشدّ العقوبات الدنيوية وهذا شأن البخلاء وأهل الشحّ مطلقاً ، إلاّ أنّ المؤمنين منهم لهم مسلاة عن الرزايا بما يرجون من الثواب على الإنفاق أو على الصبر . ثم يجوز أن يكون هذا الخلق قد جبلهم الله عليه من وقت وجودهم فيكون ذلك من جملة بواعث كفرهم ونفاقهم ، إذ الخلق السيّء يدعو بعضه بعضاً ، فإنّ الكفر خُلق سيّء فلا عجب أن تنساق إليه نفس البخيل الشحيح ، والنفاق يبعث عليه الخلقُ السيّء من الجُبن والبخل ، ليتقّي صاحبه المخاطر ، وكذلك الشأن في أولادهم إذ كانوا في فتنة من الخوف على إيمان بعض أولادهم ، وعلى خلاف بينهم وبين بعض أولادهم الموفّقين إلى الإسلام : مثل حنظلة : ابن أبي عامر الملقّببِ غَسيلَ الملائكة ، وعبد الله بننِ عبدِ الله بننِ أُبي فكان ذلك من تعذيب أبويهما .ولكون ذكر الأولاد كالتكملة هنا لزيادة بيان عدم انتفاعهم بكلّ ما هو مظنّة أن ينتفع به الناس ، عُطف الأولاد بإعادة حرف النفي بَعْد العاطف ، إيماء إلى أنّ ذكرهم كالتكملة والاستطراد .واللام في { ليعذّبهم } للتعليل : تعلّقت بفعل الإرادة للدلالة على أنّ المراد حكمة وعلّة فتغني عن مفعول الإرادة ، وأصل فعل الإرادة أن يعدَّى بنفسه كقوله تعالى : { يريد الله بكم اليسر ولا يريد بكم العسر } \\[ البقرة : 185 \\] ويعدّى غالباً باللام كما في هذه الآية وقوله تعالى : { يريد الله ليبين لكم } في سورة النساء ( 26 ) وقول كُثيّرِ :أريدُ لأنْسَى حُبَّها فكأنما ... تَمَثَّلُ لِي ليلَى بكلّ مكانوربما عَدَّوه باللام وكَي مبالغةً في التعليل كقول قيس بن عُبادة :أردتُ لكيما يعلمَ الناس أنّها ... سراويلُ قيس والوفُود شهودوهذه اللام كثير وقوعها بعد مادة الإرادة ومادة الأمر . وبعضُ القرّاء سمّاها ( لام أنْ ) بفتح الهمزة وتقدم عند قوله تعالى : { يريد الله ليبين لكم } في سورة النساء ( 26 ).فقوله : في الحياة الدنيا } متعلّق ب { يعذبهم } ومحاولة التقديم والتأخير تعسّف وعطف { وتزهق } على { ليعذبهم } باعتبار كونه أراده الله لهم عندما رزقهم الأموال والأولاد فيعلم منه : أنّه أراد موتهم على الكفر ، فيستغرق التعذيبُ بأموالهم وأولادهم حياتَهم كلّها ، لأنّهم لو آمنوا في جزء من آخر حياتهم لحصل لهم في ذلك الزمن انتفاع ما بأموالهم ولو مع الشحّ .وجملة : { وهم كافرون } في موضع الحال من الضمير المضاف إليه لأنّه إذا زهقت النفس في حال الكفر فقد مات كافراً .والإعجاب استحسان مشوب باستغراب وسرور من المرئي قال تعالى : { ولو أعجبك كثرة الخبيث } \\[ المائدة : 100 \\] أي استحسنت مرأى وفرة عدده .و ( الزهوق ) الخروج بشدّة وضيق ، وقد شاع ذكره في خروج الروح من الجسد ، وسيأتي مثل هذه الآية في هذه السورة .\n\n",
      "translations": [
        {
          "translation": "200 (So let not) Muhammad (their riches) the abundance of their riches (nor their children) the abundance of their children (please thee. Allah thereby intendeth but to punish them) in the Hereafter (and that their souls shall pass away) shall expire (in the life of the world while they are disbelievers).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَتَزْهَقَ أَنفُسُهُمْ } معناهُ تخرُجُ\n\n",
      "translations": [
        {
          "translation": " And his saying, \"And their souls will perish\" means they will exit.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومتى تحقق كفرهم ونفاقهم { فَلاَ تُعْجِبْكَ أَمْوَٰلُهُمْ وَلاَ أَوْلَـٰدُهُمْ } أي: كثرتها وتفاخرهم بها\n لأنها من أسباب العذاب والنكال عليهم { إِنَّمَا يُرِيدُ ٱللَّهُ } المنتقم منهم { لِيُعَذِّبَهُمْ بِهَا فِي ٱلْحَيَٰوةِ ٱلدُّنْيَا } بجمعها وحفظها ونمائها\n وارتكاب المحن والشدائد في تحصيلها { وَ } من كثرة محبتهم لها وحرصهم عليها { تَزْهَقَ } وتزول { أَنفُسُهُمْ } وقت حلول الأجل { وَهُمْ كَٰفِرُونَ } [التوبة: 55] محجوبون عن توحيد الله والإيمان",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جل جلاله: { فلا تُعْجِبُكَ } ، أيها الناظر إلى المنافقين، كثرةُ { أموالهم ولا أولادهم } فإن ذلك استدراج ووبال لهم { إنما يريد اللَّهُ ليُعذِّبَهم بها في الحياة الدنيا } بسبب ما يكابدون في جمعها وحفظها من المتاعب، وما يرون فيها من الأمراض والمصائب، أو ما ألزموا به من أداء زكاتها، مع كونهم لا يرجون خَلَفها { وتَزْهقَ أنفُسُهم وهم كافرون } فلا يستوفون التمتع بها في الدنيا لقصر مدتها، ولا يجدون ثواب ما أعطوا منها لعدم إيمانهم. وأصل الزهوق: الخروج بصعوبة، لصعوبة خروج أرواحهم، والعياذ بالله.  الإشارة: ينبغي لمريد الآخرة ألا يستحسن شيئاً من الدنيا، التي هي مدْرجة الاغترار، بل ينبغي له أن ينظر إليها وإلى إهلها بعين الغض والاحتقار،حتى ترتفع همته إلى دار القرار، وينبغي لمريد الحق ـ تعالى ـ ألا يحقر شيئاً من مصنوعاته، ولا يصغر شيئاً من تجلياته، إذ ما في الوجود إلا تجليات العلي الكبير، إما من مظاهر اسمه الحكيم، أو اسمه القدير، فيعطي الحكمة حقها والقدرة حقها، ويتلون مع كل واحدة بلونها، وبالله التوفيق. ثم ذكر وصف نفاق المنافقين، فقال: { وَيَحْلِفُونَ بِٱللَّهِ إِنَّهُمْ لَمِنكُمْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:85",
      "similarity": 0.9884720968175177
    },
    {
      "verse": "17:81",
      "similarity": 0.7816716970223786
    },
    {
      "verse": "21:18",
      "similarity": 0.26949135625458787
    },
    {
      "verse": "50:2",
      "similarity": 0.20919715753787324
    },
    {
      "verse": "38:5",
      "similarity": 0.20548603296922865
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009055.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009055.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:55.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}