{
  "chapter": "التوبة",
  "text": "ويحلفون بالله انهم لمنكم وما هم منكم ولكنهم قوم يفرقون",
  "translations": [
    {
      "translation": "They swear by Allah that they are of your number, but they are not of your number. Rather, they are people who are scared.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by God they are with you, though in fact they are not. They are only a frightened lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah that they are part of you whereas they are certainly not part of you. They are merely a people who dread you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by God that they are believers like you but they are not believers. They are a people who only cause differences.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they (the hypocrites) swear by Allah that they are from among you (Muslims); and they are not from among you – however those people are afraid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah that they are truly of you while they are not of you, but they are a people (hypocrites) who are afraid (that you may kill them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they swear by Allah that they are most surely of you, and they are not of you, but they are a people who are afraid (of you).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by God that they belong with you, but they are not of you they are a people that are afraid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they swear by Allah that they are in truth of you, when they are not of you, but they are folk who are afraid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by God that they are believers like you; but they are not. They are afraid [to appear in their true colours]:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they swear by Allah that they are surely of you, whereas they are not of you; but they are a people who dread.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah that they belong to you, but they do not belong to you. Rather, they are a frightened lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah that they are indeed of you; but they are not of you: yet they are afraid (to appear in their true colours).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah that they are truly of you while they are not of you, but they are a people (hypocrites) who are afraid (that you may kill them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah that they belong with you, yet they are not of you. They are a nation that are afraid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by God that they are of you. But they are not of you. They are divisive people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they swear by Allah that they are from among you while they are not from among you; but they are a people who are afraid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:56] And they swear by God that they truly are of you, that is, [that they are] believers; but they are not of you; they are a folk who are afraid, that you should deal with them as you have done with the idolaters, and so they swear merely in pretence, in order to protect themselves.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they) 'Abdullah Ibn Ubayy and his host (swear by Allah that they are in truth of you) with you secretly and openly, (when they are not of you) with you, (but they are folk who are afraid) of your swords.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة نفاقهم: إنهم { يَحْلِفُونَ بِٱللَّهِ } بالحلف الكاذب { إِنَّهُمْ لَمِنكُمْ } أي: من جملتكم وزمرتكم يفرحون بفرحكم وسروركم، ويتغممون بحزنكم ومصيبتكم { وَ } الحال أنهم { مَا هُم مِّنكُمْ } لكفرهم وشركهم المركوز في قلوبهم { وَلَـٰكِنَّهُمْ قَوْمٌ يَفْرَقُونَ } [التوبة: 56] يخافون أن تفعلوا بهم فعلكم من المشركين، فاضطربوا إلى المداهنة والنفاق فأظهروا الإسلام؛ حفظاً لدمائهم وأموالهم، وهم مضطرون على إظهار الإيمان، ومن غاية تذللهم واضطرارهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:62",
      "similarity": 0.7707704793107335
    },
    {
      "verse": "9:96",
      "similarity": 0.7337643090548812
    },
    {
      "verse": "58:14",
      "similarity": 0.6461066848860826
    },
    {
      "verse": "58:18",
      "similarity": 0.623098682025847
    },
    {
      "verse": "9:95",
      "similarity": 0.41815461548565
    }
  ]
}