{
  "chapter": "التوبة",
  "text": "لو يجدون ملجـا او مغرت او مدخلا لولوا۟ اليه وهم يجمحون",
  "translations": [
    {
      "translation": "If they could find a bolt-hole, cave or burrow, they would turn and scurry away into it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they find a place of shelter or a cave or hole to hide, they will turn to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they could find any shelter or any cavern, or any retreat, they would turn around and rush headlong into it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are so afraid of you that had there been a place for them to seek refuge, a cave or some entrance in which to hide themselves from you, they would have madly rushed therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they find some refuge, or caves, or a place to hide, they will break the bonds and return there.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should they find a refuge, or caves, or a place of concealment, they would turn straightway thereto with a swift rush.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they could find a refuge or cave or a place to enter into, they would certainly have turned thereto, running away in all haste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they could find a shelter, or some caverns, or any place to creep into, they would turn about and bolt away to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had they but found a refuge, or caverns, or a place to enter, they surely had resorted thither swift as runaways.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "if they could find a place of refuge, or a cave or any hiding-place, they would run there with frantic haste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Could they find a place of refuge or caverns or a retreating hole, they would turn round thereto rushing headlong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they could find a refuge, or a hideout, or a hole [to creep into], they would turn to it in frantic haste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they could find a place to flee to, or caves, or a place of concealment, they would turn straightaway thereto, with an obstinate rush.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should they find a refuge, or caves, or a place of concealment, they would turn straightway thereto with a swift rush.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they could find a shelter or caverns, or any place to creep into they will turn stampeding to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were they to find a shelter, or a cave, or a hideout, they would go to it, rushing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they could find a refuge or some caves or any place to enter [and hide], they would turn to it while they run heedlessly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:57] If they could find a shelter, in which to seek refuge, or some caverns, underground chambers, or any place to enter, they would turn and bolt away to it, they would hasten to enter it and get away from you with the undeterred speed of an indomitable steed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Had they but found a refuge) to run to, (or caverns) in the mountain, (or a place to enter) or an underground passage, (they surely had resorted thither swift as runaways) they would have promptly gone there.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَوْ يَجِدُونَ مَلْجَئاً أَوْ مَغَارَاتٍ أَوْ مُدَّخَلاً لَّوَلَّوْاْ إِلَيْهِ وَهُمْ يَجْمَحُونَ } فالمَلْجَأُ: الهَربُ، والجَوزُ فِي الجَبلِ\n والمَغاراتُ: السِّربُ في الأَرضِ\n والمُدْخَلُ: فَيقالُ هو الموتُ\n ويَجْمَحونَ: معناهُ يَطمَحونَ: وهو الإِسراعُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {If they were to find a refuge, or a cavern, or a place to enter, they would turn to it and be sure to hide themselves in it} - the refuge here means escape, and the cavern is in the mountain.\n\n\nAnd al-Mughārāt: The as-Sirb in the earth.\n\n\nAnd the entrance: it is said that death is its entrance.\n They aspire: its meaning is they aspire: and it is haste.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:47",
      "similarity": 0.3276412341715318
    },
    {
      "verse": "9:118",
      "similarity": 0.28014140576234825
    },
    {
      "verse": "67:30",
      "similarity": 0.25834914368601597
    },
    {
      "verse": "18:41",
      "similarity": 0.22504356765174638
    },
    {
      "verse": "9:40",
      "similarity": 0.21870369120232105
    }
  ]
}