{
  "chapter": "التوبة",
  "text": "ومنهم من يلمزك فى الصدقت فان اعطوا۟ منها رضوا۟ وان لم يعطوا۟ منها اذا هم يسخطون",
  "translations": [
    {
      "translation": "Among them there are some who find fault with you concerning the zakat. If they are given some of it. they are pleased but if they are not given any, they are angry.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some among them who blame you (of partiality) in distributing the offerings made in the name of God. In case they receive some of these they are pleased, if not, they are incensed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), some of them find fault with you in the distribution of alms. If they are given something of it they are pleased, and if they are given nothing they are angry.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They blame you about the distribution of the welfare funds. They are pleased when you give them something from it, but if they receive nothing, they become angry with you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them is one who slanders you regarding the distribution of charity; so if they receive some of it they would be happy – and if not, thereupon they get displeased!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them are some who accuse you concerning (the distribution of) the alms. If they are given part thereof, they are pleased, but if they are not given thereof, behold! They are enraged!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them there are those who blame you with respect to the alms; so if they are given from it they are pleased, and if they are not given from it, lo! they are full of rage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them find fault with thee touching the freewill offerings; if they are given a share of them they are well-pleased, but if they are given none then they are angry.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them is he who defameth thee in the matter of the alms. If they are given thereof they are content, and if they are not given thereof, behold! they are enraged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them there are some who find fault with you concerning the distribution of alms. If a share is given to them, they are pleased, but if they receive nothing, they grow resentful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them are some who traduce thee in respect of alms. Then if they are given thereof they are pleased and if they are not given thereof, lo! they are enraged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some of them who blame you regarding [the distribution of] the charities: if they are given from them, they are pleased, but if they are not given from them, behold, they are displeased.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are men who slander thee in the matter of (the distribution of) the alms: if they are given part thereof, they are pleased, but if not, behold! they are indignant!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them are some who accuse you (O Muhammad SAW) in the matter of (the distribution of) the alms. If they are given part thereof, they are pleased, but if they are not given thereof, behold! They are enraged!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some among them who find fault with you concerning the distribution of alms. If a share is given to them they are contented, but if they receive nothing then they are angry.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are those who criticize you in regard to charities. If they are given some of it, they become pleased; but if they are not given any, they grow resentful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are some who criticize you concerning the [distribution of] charities. If they are given from them, they approve; but if they are not given from them, at once they become angry.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:58] Some of them defame you concerning the, apportioning of, voluntary almsgivings; if they are given a share of them, they are content, but if they are given none then they are enraged.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of them) of the hypocrites: Abu'l-Ahwas and his host (is he who defameth thee in the matter of the alms) he defames you regarding the division of alms. They claimed that he did not divide them fairly. (If they are given thereof) of the alms a good share (they are content) with the division, (and if they are not given thereof) of the alms a good share, (behold! they are enraged) in relation to the division of the same.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمِنْهُمْ مَّن يَلْمِزُكَ فِي ٱلصَّدَقَاتِ } معناه يُعِيبُكَ ويَقعُ فِيكَ، ويَطعُنُ عَلَيكَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَوْ يَجِدُونَ مَلْجَئاً } منيعاً من الحصون والقلاع { أَوْ مَغَارَاتٍ } في شعاب الجبال { أَوْ مُدَّخَلاً } جحراً يمكنه الإنجحار والاستتار فيه { لَّوَلَّوْاْ } وانصرفوا ألبتة { إِلَيْهِ وَهُمْ يَجْمَحُونَ } [التوبة: 57] يسرعون، كالفرس الجموح { وَمِنْهُمْ مَّن يَلْمِزُكَ } يعينك وينصرك { فِي ٱلصَّدَقَاتِ } أي: قسمة الغنائم، ويتردد حولك حين القسمة طامعاً { فَإِنْ أُعْطُواْ مِنْهَا } بينهما أو شيئاً يعتد به { رَضُواْ } منك، وأثنوا عليك شكراً لإعطائك { وَإِن لَّمْ يُعْطَوْاْ مِنهَا } لعدم استحقاقهم؛ وبسبب تخلفهم ونفاقهم { إِذَا هُمْ يَسْخَطُونَ } [التوبة: 58] يفاجئون بالغيظ والسخط إظهاراً لما في قلوبهم من الأكنة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: لو: شرطية، و أنهم: قال سيبويه: مبتدأ، والخبر محذوف: ولو رضاهم ثابت أو موجود\n\n\n الخ\n وقال غيره: فاعل بفعل محذوف ولو ثبت رضاهم، وجواب لو: محذوف، أي: ولو أنهم رضوا لكان خيراً لهم\n يقول الحق جل جلاله: { ومنهم } ومن المنافقين { من يلمزك } أي: يعيبك، ويعترض عليك { في } قسم { الصدقات } ، { فإن أُعطوا منها رَضُوا } وفرحوا، { وإِنْ لمْ يُعْطُوا منها } شيئاً { إّذا هم يَسْخَطُون }\n والآية نزلت في ابن أُبي رأس المنافقين، قال: ألا تَرونَ إلى صاحِبِكُم إِنَّما يقْسِمُ صَدقَاتكُمْ في رُعَاةِ الغَنَم، ويَزْعُمُ أَنَّهُ يَعْدل\n وقيل: في ذي الخُوَيْصِرةِ رأس الخَوَارِجِ، كان رسول الله صلى الله عليه وسلم يقسم غنائم حنين، فاستعطف قلوب أهل مكة، فآثرهم بالعطاء، فقال: اعْدِلَ يا رَسُول الله، فقال:\n\n \" ويلَكَ،إنْ لَمْ أَعْدِلْ فمنْ يَعْدِل؟ \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "47:28",
      "similarity": 0.5406918154133336
    },
    {
      "verse": "5:80",
      "similarity": 0.5353489317950255
    },
    {
      "verse": "9:79",
      "similarity": 0.5339826368650518
    },
    {
      "verse": "3:162",
      "similarity": 0.5103777284697938
    },
    {
      "verse": "104:1",
      "similarity": 0.4075743058377354
    }
  ]
}