{
  "chapter": "التوبة",
  "text": "ولو انهم رضوا۟ ما ءاتىهم الله ورسوله وقالوا۟ حسبنا الله سيؤتينا الله من فضله ورسوله انا الى الله رغبون",
  "translations": [
    {
      "translation": "If only they had been pleased with what Allah and His Messenger had given them and had said, 'Allah is enough for us. Allah will give us of His bounty as will His Messenger. It is to Allah that we make our plea.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They should rather have been pleased with what God and His Prophet had given them, and said: \"God is sufficient for us; He will give us of His largesse as will His Apostle. We supplicate no one but God.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would that they were content with what Allah and His Messenger gave them, and were to say: \"Allah suffices for us, and Allah will give us out of His bounty and so will His Messenger. It is to Allah alone that we turn with hope.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would that they had been pleased with what God and His Messenger had given them and had said, \"God is All-Sufficient for us. God and His Messenger will soon do us more favors and we have hope in God's mercy.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How excellent it would be, if they were pleased with what Allah and His Noble Messenger had given them and said, “Allah suffices us; Allah will now give us by His munificence, and (so will) Allah’s Noble Messenger – and towards Allah only are we inclined.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would that they were content with what Allah and His Messenger gave them and had said: \"Allah is sufficient for us. Allah will give us of His bounty, and so will His Messenger. We implore Allah (to enrich us).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they were content with what Allah and His Apostle gave them, and had said: Allah is sufficient for us; Allah will soon give us (more) out of His grace and His Apostle too; surely to Allah do we make our petition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O were they well-pleased with what God and His Messenger have brought them, saying, 'Enough for us is God; God will bring us of His bounty, and His Messenger; to God we humbly turn.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(How much more seemly) had they been content with that which Allah and His messenger had given them and had said: Allah sufficeth us. Allah will give us of His bounty, and (also) His messenger. Unto Allah we are suppliants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only they had been content with what God and His Messenger had given them and had said, \"God is sufficient for us. God will give us out of His bounty, and so will His Messenger. To God alone do we turn with hope!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would that they were pleased with that which Allah and His apostle had given them, and were to say: sufficient unto us is Allah, anon Allah will give us out of His grace and so will His apostle, verily unto Allah we lean.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[It would have been better] if they had been pleased with what Allah and His Apostle gave them, and had said, ‘Allah is sufficient for us; Allah and His Apostle will give to us out of His grace. Indeed to Allah do we eagerly turn.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only they had been content with what Allah and His Messenger gave them, and had said, \"Sufficient unto us is Allah! Allah and His Messenger will soon give us of His bounty: to Allah do we turn our hopes!\" (that would have been the right course).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would that they were contented with what Allah and His Messenger (SAW) gave them and had said: \"Allah is Sufficient for us. Allah will give us of His Bounty, and (also) His Messenger (from alms, etc.). We implore Allah (to enrich us).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would that they were wellpleased with what Allah and His Messenger have given them, and would say: 'Allah is sufficient for us. Allah will provide for us from His abundance, and so will His Messenger. To Allah, we hope'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only they were content with what God and His Messenger have given them, and said, “God is sufficient for us; God will give us of His bounty, and so will His Messenger; to God we eagerly turn.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only they had been satisfied with what Allah and His Messenger gave them and said, \"Sufficient for us is Allah; Allah will give us of His bounty, and [so will] His Messenger; indeed, we are desirous toward Allah,\" [it would have been better for them].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:59] If only they had been content with what God and His Messenger have given them, in the way of spoils and the like, and had said, ‘Sufficient for us is God; God will give us from His bounty, and His Messenger [will also give us], from other spoils, what will suffice us; to God we are suppliants’, that He enrich us (the response of [the conditional] law, ‘if only’, is la-kāna khayran lahum, ‘it would have been better for them’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((How much more seemly) had they) i.e. the hypocrites (been content with that which Allah and His messenger had given them) of Allah's bounty (and had said: Allah sufficeth us) we trust in Allah. (Allah will give us of His bounty) Allah will make us rich with His favour by means of His sustenance, (and (also) His messenger) through his gifts. (Unto Allah we are supplicants) we desire Allah. Had they said this, it would have been better for them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ هو الحكيم في قسمة أرزاق عباده على تفاوت درجاتهم { وَرَسُولُهُ } المستخلف له\n الملهم من عنده { وَقَالُواْ } من كمال إخلاصهم وتفويضهم كسائر المؤمنين: { حَسْبُنَا ٱللَّهُ } المدبر الكافي لأمورنا يكفينا علمه بنا { سَيُؤْتِينَا ٱللَّهُ } المكفل لأرزاقنا { مِن فَضْلِهِ } وسعة لطفه وجوده ما يكيفنا { وَ } سيعطينا { وَرَسُولُهُ } النائب عنه بإذنه من الغنائم والصدقات ما يشبعنا ويغنينا { إِنَّآ } بعدما آمنا بالله\n وتحققنا بتوحيده بإرشاد رسله { إِلَى ٱللَّهِ } الباقي بالبقاء الأزلي السرمدي لا إلى غيره من الأظلال والأموال والمزخرفات الفانية { رَاغِبُونَ } [التوبة: 59] ليرزقنا من فوائد رزقه المعنوي\n وفوائد توحيده الذاتي\n أي: هم لو رضوا كما رضي المؤمنون الموقنون\n واعترفوا كما اعترفوا لكان خيراً لهم وأشد تثبيتاً وتقريراً في قلوبهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقالوا حسبنا الله } أي: كفانا فضلُه\n { سيؤتينا اللَّهُ من فضله ورسولهُ } صدقة أو غنيمة أخرى\n فيؤتينا أكثر مما أتانا\n { إنا إلى الله راغِبُون } في أن يُغنينا من فضله وجوده\n فلو فعلوا هذا لكان خيراً لهم من اعتراضهم عليك\n الموجب لهم المقت والعذاب\n  الإشارة: لا يكون المؤمن كاملاً حتى يستوي عنده المنع والعطاء\n والفقد والوجد\n والفقر\n والغنى والعز والذل\n وأما إن كان في حالة العطاء والوجد يفرح\n وفي حالة المنع والفقد يسخط\n فلا فرق بينه وبين أهل النفاق\n إلا من حيث التوسم بالإيمان\n ولو أنه رضي بما قسم الله له\n واكتفى بعلمه\n ورغب الله في زيادته من فضله\n لكان خيراً له وأسلم\n والله تعالى أعلم وأحكم\n ثم بيَّن مصرف الصدقات الواجبة قطعاً لأطماع من لا يستحقها\n فقال: { إِنَّمَا ٱلصَّدَقَاتُ لِلْفُقَرَآءِ وَٱلْمَسَاكِينِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "94:8",
      "similarity": 0.8084065207317146
    },
    {
      "verse": "68:32",
      "similarity": 0.6747351580116889
    },
    {
      "verse": "19:46",
      "similarity": 0.4363627451678258
    },
    {
      "verse": "2:130",
      "similarity": 0.43365525177900066
    },
    {
      "verse": "4:127",
      "similarity": 0.4300105520370069
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009059.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009059.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:59.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}