{
  "chapter": "التوبة",
  "text": "وان احد من المشركين استجارك فاجره حتى يسمع كلم الله ثم ابلغه مامنه ذلك بانهم قوم لا يعلمون",
  "translations": [
    {
      "translation": "If any of the idolaters ask you for protection, give them protection until they have heard the words of Allah. Then convey them to a place where they are safe. That is because they are a people who do not know.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If an idolater seeks protection, then give him asylum that he may hear the word of God. Then escort him to a place of safety, for they are people who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if any of those who associate others with Allah in His Divinity seeks asylum, grant him asylum that he may hear the Word of Allah, and then escort him to safety for they are a people who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of the pagans ask you to give them refuge, give them asylum so that they may hear the words of God. Then, return them to their towns for they are an ignorant people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O dear Prophet (Mohammed – peace and blessings be upon him), if a polytheist seeks your protection, give him protection so that he may hear the Word of Allah, and then transport him to his place of safety; this is because they are an unwise people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if anyone of the Mushrikin seeks your protection then grant him protection so that he may hear the Word of Allah (the Qur'an) and then escort him to where he can be secure, that is because they are men who know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if one of the idolaters seek protection from you, grant him protection till he hears the word of Allah, then make him attain his place of safety; this is because they are a people who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if any of the idolaters seeks of thee protection, grant him protection till he hears the words of God; then do thou convey him to his place of security -- that, because they are a people who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if anyone of the idolaters seeketh thy protection (O Muhammad), then protect him so that he may hear the Word of Allah, and afterward convey him to his place of safety. That is because they are a folk who know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any one of the polytheists seeks asylum with you, grant him asylum so that he may hear the word of God; then convey him to a place of safety. That is because they are a people who have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And should one of the associators seek protection of thee grant him protection, that he may hear the word of Allah, then let him reach his place of security. That is because they are a people who know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of the polytheists seeks asylum from you, grant him asylum until he hears the Word of Allah. Then convey him to his place of safety. That is because they are a people who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If one amongst the Pagans ask thee for asylum, grant it to him, so that he may hear the word of Allah; and then escort him to where he can be secure. That is because they are men without knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if anyone of the Mushrikun (polytheists, idolaters, pagans, disbelievers in the Oneness of Allah) seeks your protection then grant him protection, so that he may hear the Word of Allah (the Quran), and then escort him to where he can be secure, that is because they are men who know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If an idolater seeks asylum with you, give him protection in order that he hears the Word of Allah, and then convey him to his place of safety, because they are a nation who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if anyone of the polytheists asks you for protection, give him protection so that he may hear the Word of God; then escort him to his place of safety. That is because they are a people who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if any one of the polytheists seeks your protection, then grant him protection so that he may hear the words of Allah. Then deliver him to his place of safety. That is because they are a people who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:6] And if any one of the idolaters (ahadun, ‘one’, is in the nominative because of the [following] verb [istajāraka, ‘seeks your protection’] that validates it) seeks your protection, requests security from you against being killed, then grant him protection, provide security for him, so that he might hear the words of God — the Qur’ān — and afterward convey him to his place of security, that is, the dwelling-places of his folk, if he does not believe, so that he might reflect upon his situation — that, which is mentioned, is because they are a people who do not know, the religion of God, and so they must [be made to] hear the Qur’ān in order to [come to] know [religion].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على جملة : { فإن تابوا } \\[ التوبة : 5 \\] لتفصيل مفهوم الشرط ، أو عطف على جملة { فاقتلوا المشركين } \\[ التوبة : 5 \\] لتخصيص عمومه ، أي إلاّ مشركاً استجارك لمصلحة للسِفارة عن قومه أو لمعرفة شرائع الإسلام . وصيغ الكلام بطريقة الشرط لتأكيد حكم الجواب ، وللإشارة إلى أنّ الشأن أن تقع الرغبة في الجوار من جانب المشركين .وجيء بحرف { إنْ } التي شأنها أن يكون شرطها نادر الوقوع للتنبيه على أنّ هذا شرط فَرْضيّ؛ لكيلا يزعم المشركون أنّهم لم يتمكّنوا من لقاء النبي صلى الله عليه وسلم فيتّخذوه عذراً للاستمرار على الشرك إذا غزاهم المسلمون .ووقع في «تفسير الفخر» أنّه نقل عن ابن عبّاس قال : إنّ رجلاً من المشركين قال لعلي بن أبي طالب : أردنا أن نأتي الرسول بعد انقضاء هذا الأجل لسماع كلام الله أو لحاجة أخرى فهل نُقتل . فقال علي : لاَ إنّ الله تعالى قال : { وإن أحد من المشركين استجارك فأجره }. أي فأمنه حتّى يسمع كلام الله ، وهذا لا يعارض ما رأيناه من أنّ الشرط في قوله تعالى : { وإن أحد من المشركين استجارك } الخ ، شرط فرضي فإنّه يقتضي أنّ مقالة هذا الرجل وقعت بعد نزول الآية على أنّ هذا المروي لم أقف عليه .وجيء بلفظ أحد من المشركين دون لفظ مشرك للتنصيص على عموم الجنس ، لأنّ النكرة في سياق الشرط مثلها في سياق النفي إذا لم تُبنَ على الفتح احتملت إرادة عموم الجنس واحتملت بعض الأفراد ، فكان ذكر { أحد } في سياق الشرط تنصيصاً على العموم بمنزلة البناء على الفتح في سياق النفي بلا .و { أحد } أصله «واحد» لأنّ همزته بدل من الواو ويستعمل بمعنى الجزئي من الناس لأنّه واحد ، كما استعمل له «فَرد» في اصطلاح العلوم ، فمعنى { أحد من المشركين } مشرك .وتقديم { أحد } على { استجارك } للاهتمام بالمسند إليه ، ليكون أول ما يقرع السمع فيقع المسند بعد ذلك من نفس السامع موقع التمكن .وساغ الابتداء بالنكرة لأنّ المراد النوع ، أو لأنّ الشرط بمنزلة النفي في إفادة العموم ، ولا مانع من دخول حرف الشرط على المبتدأ ، لأن وقوع الخبر فعلاً مقنع لحرف الشرط في اقتضائه الجملة الفعلية ، فيعلم أنّ الفاعل مقدّم من تأخير لغرض مّا . ولذلك شاع عند النحاة أنّه فاعل بفعل مقدر ، وإنّما هو تقدير اعتبارٍ . ولعلّ المقصود من التنصيص على إفادة العموم ، ومن تقديم { أحد من المشركين } على الفعل ، تأكيد بذل الأمان لمن يسأله من المشركين إذا كان للقائه النبي صلى الله عليه وسلم ودخولِه بلاد الإسلام مصلحة ، ولو كان أحد من القبائل التي خانت العهد ، لئلاّ تحمِل خيانتُهم المسلمين على أن يخونوهم أو يغدروا بهم فذلك كقوله تعالى : { ولا يجرمنّكم شنآن قوم أن صدوكم عن المسجد الحرام أن تعتدوا }\\[ المائدة : 2 \\] ، وقول النبي صلى الله عليه وسلم \" ولا تَخُن من خانك \"والاستجارة : طلب الجوار ، وهو الكون بالقرب ، وقد استعمل مجازاً شائعاً في الأمن ، لأنّ المرء لا يستقر بمكان إلاّ إذا كان آمناً ، فمن ثم سمّوا المؤمِّن جاراً ، والحليفَ جاراً ، وصار فعل أجَار بمعنى أمَّن ، ولا يطلق بمعنى جعَلَ شخصاً جاراً له . والمعنى : إنْ أحد من المشركين استأمنك فأمنه .ولم يبيّن سبب الاستجارة ، لأنّ ذلك مختلف الغرض وهو موكول إلى مقاصد العقلاء فإنّه لا يستجير أحد إلاّ لغرض صحيح .ولما كانت إقامة المشرك المستجير عند النبي عليه الصلاة والسلام لا تخلو من عرض الإسلام عليه وإسماعِه القرآن ، سواء كانت استجارته لذلك أم لغرض آخر ، لما هو معروف من شأن النبي صلى الله عليه وسلم من الحرص على هدي الناس ، جعل سماع هذا المستجير القرآن غاية لإقامته الوقتية عند الرسول صلى الله عليه وسلم فدلّت هذه الغاية على كلام محذوف إيجازاً ، وهو ما تشتمل عليه إقامة المستجير من تفاوض في مهمّ ، أو طلب الدخول في الإسلام ، أو عرض الإسلام عليه ، فإذا سمع كلام الله فقد تمّت أغراض إقامته لأنَّ بعضها من مقصد المستجير وهو حريص على أن يبدأ بها ، وبعضها من مقصد النبي عليه الصلاة والسلام وهو لا يتركه يعود حتّى يعيد إرشاده ، ويكون آخر ما يدور معه في آخر أزمان إقامته إسماعه كلام الله تعالى .وكلام الله : القرآن ، أضيف إلى اسم الجلالة لأنّه كلام أوجده الله ليدلّ على مراده من الناس وأبلغه إلى الرسول عليه الصلاة والسلام بواسطة الملك ، فلم يكن من تأليف مخلوق ولكن الله أوجده بقدرته بدون صنع أحد ، بخلاف الحديث القدسي .ولذلك أعقبه بحرف المهلة { ثم أبلغه مأمنه } للدلالة على وجوب استمرار إجارته في أرض الإسلام إلى أن يبلغ المكان الذي يأمن فيه ، ولو بلغه بعد مدّة طويلة فحرف ( ثم ) هنا للتراخي الرتبي اهتماماً بإبلاغه مأمنه .ومعنى { أبلغه مأمنه } أمهله ولا تُهجه حتّى يبلغ مأمنه ، فلمّا كان تأمين النبي عليه الصلاة والسلام إياه سبباً في بلوغه مأمنه ، جعل التأمين إبلاغاً فأمر به النبي عليه الصلاة والسلام ، وهذا يتضمّن أمر المسلمين بأن لا يتعرّضوا له بسوء حتّى يبلغ بلاده التي يأمن فيها . وليس المراد أنّ النبي صلى الله عليه وسلم يتكلّف ترحيله ويبعث من يبلغه ، فالمعنى : اتركه يبلغ مأمنه ، كما يقول العرب لمن يبادر أحد بالكلام قبل إنهاء كلامه : «أبلعْني ريقي» ، أي أمهلني لحظة مقدار ما أبلعُ ريقي ثم أكلّمك ، قال الزمخشري : قلت لبعض أشياخي : «أبلعْني ريقي فقال قد أبلعْتك الرافدين» يعني دجلة والفرات .و ( المأمن ) مكان الأمن ، وهو المكان الذي يجد فيه المستجير أمْنَه السابق ، وذلك هو دار قومه حيث لا يستطيع أحد أن يناله بسوء .وقد أضيف المأمن إلى ضمير المشرك للإشارة إلى أنّه مكان الأمن الخاصّ به ، فيعلم أنّه مقرّه الأصلي ، بخلاف دار الجوار فإنّها مأمن عارض لا يُضاف إلى المُجار .وجملة : { ذلك بأنهم قوم لا يعلمون } في موضع التعليل لتأكيد الأمر بالوفاء لهم بالإجارة إلى أن يصلوا ديارهم ، فلذلك فصلت عن الجملة التي قبلها ، أي : أمَرْنا بذلك بسبب أنّهم قوم لا يعلمون ، فالإشارة إلى مضمون جملة : { فأجره حتى يسمع كلام الله ثم أبلغه مأمنه } أي لا تؤاخذهم في مدّة استجارتهم بما سبق من أذاهم لأنّهم قوم لا يعلمون وهذه مذمّة لهم بأنّ مثلهم لا يقام له وزن وأوف لهم به إلى أن يصلوا ديارهم لأنّهم قوم لا يعلمون ما يحتوي عليه القرآن من الإرشاد والهدى ، فكان اسم الإشارة أصلحَ طُرق التعريف في هذا المقام ، جمعاً للمعاني المقصودة ، وأوجزَه .وفي الكلام تنويه بمعالي أخلاق المسلمين وغض من أخلاق أهل الشرك ، وأنّ سبب ذلك الغضّ الإشراك الذي يفسد الأخلاق ، ولذلك جُعلوا قوماً لا يعلمون دون أن يقال بأنّهم لا يعلمون : للإشارة إلى أنّ نفي العلم مطّرد فيهم ، فيشير إلى أنّ سبب اطّراده فيهم هو نشأته عن الفكرة الجامعة لأشتاتهم ، وهي عقيدة الإشراك .والعلم ، في كلام العرب ، بمعنى العقل وأصالة الرأي ، وأنّ عقيدة الشرك مضادة لذلك ، أي كيف يعبد ذو الرأي حجراً صَنعه وهو يعلم أنّه لا يُغني عنه .\n\n",
      "translations": [
        {
          "translation": "(And if anyone of the idolaters seeketh thy protection (0 Muhammad), then protect him so that he may hear the word of Allah) so that he may hear your recitation of the words of Allah; (and afterward convey him to his place of safety) to the place he is going, if he remains an unbeliever. (That) which I have mentioned (is because they are a folk who know not) Allah's command and His divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِنْ أَحَدٌ مِّنَ ٱلْمُشْرِكِينَ } المناقضين الذين أمُمرت بقتلهم وأسرهم { ٱسْتَجَارَكَ } وطلب منك جوارك\n ليأمنه عما يؤذيه { فَأَجِرْهُ } أي: فعليك يا أكمل الرسل على مقتضى شفقة النبوة والرسالة أن تجيره وتؤمنه في جوارك { حَتَّىٰ يَسْمَعَ كَلاَمَ ٱللَّهِ } الهادي لعباده ويفهم سرائر دينك وشعائر شريعتك كأنه يطلع على حققته\n لأن أصل فطرة كل أحدٍ وجبلته على الإسلام\n\n\n{ ثُمَّ } بعد حصول ألياس عن الإيمان من إيمانه وتنبهه { أَبْلِغْهُ مَأْمَنَهُ } أي: موضع أمنه ومحل قرانه تتميماً للشفقة المروءة { ذٰلِكَ } الأمن والمواساة والتليين المأمور { بِأَنَّهُمْ قَوْمٌ } في غاية البعد عن الإيمان وما يترتب عليه من المؤاخاة والمواساة\n وأنواع الخيرات والمبرات { لاَّ يَعْلَمُونَ } [التوبة: 6] أي: لا يطمعون ولا يتوقعون صدورها من أهل الإيمان\n فمتى صدر منكم أمثال هذه عسى أن يتحاببوا ويتقربوا إليكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: \" أحد \": فاعل يفسره: \" استجارك \".  يقول الحق جل جلاله: { وإنْ } أتاك { أحدٌ من المشركين } المأمورين بالتعرض لهم، حيثما وجدوا، { استجاركَ } يطلب جوارك، ويستأمنك، { فأجِرْهُ } أي: فأمنهُ { حتى يسمع كلامَ الله } ويتدبره، ويطلع على حقيقة الأمر، لعله يُسلم، { ثم أبلغه مأمنه } أي: موضع أمنه إن لم يسلم، ولا تترك أحداً يتعرض له حتى يبلغ محل أمنه { ذلك بأنهم قومٌ لا يعلمون } أي: ذلك الأمر الذي أمرتك به بسبب أنهم قوم لا علم لهم بحقيقة الإيمان، ولا ما تدعوهم إليه، فلا بد من إيجارهم، لعلهم يسمعون ويتدبرون فيكون ذلك سبب إيمانهم. الإشارة: وإن استجارك ـ أيها العارف ـ أحد من عوام المسلمين ممن لم يدخل معكم بلاد الحقائق، وأراد أن يسمع شيئاً من علوم القوم، فأجره حتى يسمع شيئاً من علومهم وأسرارهم، فلعل ذلك يكون سبباً في دخوله في طريق القوم. ولا ينبغي للفقراء أن يطردوا من يأتيهم من العوام، بل يتلطفوا معهم، ويسمعوهم ما يليق بحالهم لأنَّ العوام لا علم لهم بما للخواص، فإن اطلعوا على ما خصهم الله به من العلوم دخلوا معهم، إن سبق لهم شيء من الخصوصية. وقال شيخ شيوخنا سيدي علي الجمل رضي الله عنه: لا ينبغي لأهل الخصوصية أن يدخلوا بلد العموم إلا في جوار أحد منهم، وإلاّ أنكرته البلد لأن البلد أم تغير على غير أبنائها، ولا ينبغي أيضاً للعموم أن يدخلوا بلد الخصوص إلا في جوار رجل منهم، وإلا أنكرته البلد. هـ. بالمعنى. ثم استبعد الحق أن يكون للمشركين عهد مع المسلمين، فقال: { كَيْفَ يَكُونُ لِلْمُشْرِكِينَ عَهْدٌ عِندَ ٱللَّهِ وَعِندَ رَسُولِهِ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:88",
      "similarity": 0.6920804184867078
    },
    {
      "verse": "67:28",
      "similarity": 0.6168789714021771
    },
    {
      "verse": "46:31",
      "similarity": 0.5825139744692565
    },
    {
      "verse": "72:22",
      "similarity": 0.4716745296433906
    },
    {
      "verse": "16:9",
      "similarity": 0.4338188073175502
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009006.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009006.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:6.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}