{
  "chapter": "التوبة",
  "text": "وان احد من المشركين استجارك فاجره حتى يسمع كلم الله ثم ابلغه مامنه ذلك بانهم قوم لا يعلمون",
  "translations": [
    {
      "translation": "If any of the idolaters ask you for protection, give them protection until they have heard the words of Allah. Then convey them to a place where they are safe. That is because they are a people who do not know.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If an idolater seeks protection, then give him asylum that he may hear the word of God. Then escort him to a place of safety, for they are people who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if any of those who associate others with Allah in His Divinity seeks asylum, grant him asylum that he may hear the Word of Allah, and then escort him to safety for they are a people who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of the pagans ask you to give them refuge, give them asylum so that they may hear the words of God. Then, return them to their towns for they are an ignorant people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O dear Prophet (Mohammed – peace and blessings be upon him), if a polytheist seeks your protection, give him protection so that he may hear the Word of Allah, and then transport him to his place of safety; this is because they are an unwise people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if anyone of the Mushrikin seeks your protection then grant him protection so that he may hear the Word of Allah (the Qur'an) and then escort him to where he can be secure, that is because they are men who know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if one of the idolaters seek protection from you, grant him protection till he hears the word of Allah, then make him attain his place of safety; this is because they are a people who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if any of the idolaters seeks of thee protection, grant him protection till he hears the words of God; then do thou convey him to his place of security -- that, because they are a people who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if anyone of the idolaters seeketh thy protection (O Muhammad), then protect him so that he may hear the Word of Allah, and afterward convey him to his place of safety. That is because they are a folk who know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any one of the polytheists seeks asylum with you, grant him asylum so that he may hear the word of God; then convey him to a place of safety. That is because they are a people who have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And should one of the associators seek protection of thee grant him protection, that he may hear the word of Allah, then let him reach his place of security. That is because they are a people who know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of the polytheists seeks asylum from you, grant him asylum until he hears the Word of Allah. Then convey him to his place of safety. That is because they are a people who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If one amongst the Pagans ask thee for asylum, grant it to him, so that he may hear the word of Allah; and then escort him to where he can be secure. That is because they are men without knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if anyone of the Mushrikun (polytheists, idolaters, pagans, disbelievers in the Oneness of Allah) seeks your protection then grant him protection, so that he may hear the Word of Allah (the Quran), and then escort him to where he can be secure, that is because they are men who know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If an idolater seeks asylum with you, give him protection in order that he hears the Word of Allah, and then convey him to his place of safety, because they are a nation who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if anyone of the polytheists asks you for protection, give him protection so that he may hear the Word of God; then escort him to his place of safety. That is because they are a people who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if any one of the polytheists seeks your protection, then grant him protection so that he may hear the words of Allah. Then deliver him to his place of safety. That is because they are a people who do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:6] And if any one of the idolaters (ahadun, ‘one’, is in the nominative because of the [following] verb [istajāraka, ‘seeks your protection’] that validates it) seeks your protection, requests security from you against being killed, then grant him protection, provide security for him, so that he might hear the words of God — the Qur’ān — and afterward convey him to his place of security, that is, the dwelling-places of his folk, if he does not believe, so that he might reflect upon his situation — that, which is mentioned, is because they are a people who do not know, the religion of God, and so they must [be made to] hear the Qur’ān in order to [come to] know [religion].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if anyone of the idolaters seeketh thy protection (0 Muhammad), then protect him so that he may hear the word of Allah) so that he may hear your recitation of the words of Allah; (and afterward convey him to his place of safety) to the place he is going, if he remains an unbeliever. (That) which I have mentioned (is because they are a folk who know not) Allah's command and His divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِنْ أَحَدٌ مِّنَ ٱلْمُشْرِكِينَ } المناقضين الذين أمُمرت بقتلهم وأسرهم { ٱسْتَجَارَكَ } وطلب منك جوارك\n ليأمنه عما يؤذيه { فَأَجِرْهُ } أي: فعليك يا أكمل الرسل على مقتضى شفقة النبوة والرسالة أن تجيره وتؤمنه في جوارك { حَتَّىٰ يَسْمَعَ كَلاَمَ ٱللَّهِ } الهادي لعباده ويفهم سرائر دينك وشعائر شريعتك كأنه يطلع على حققته\n لأن أصل فطرة كل أحدٍ وجبلته على الإسلام\n\n\n{ ثُمَّ } بعد حصول ألياس عن الإيمان من إيمانه وتنبهه { أَبْلِغْهُ مَأْمَنَهُ } أي: موضع أمنه ومحل قرانه تتميماً للشفقة المروءة { ذٰلِكَ } الأمن والمواساة والتليين المأمور { بِأَنَّهُمْ قَوْمٌ } في غاية البعد عن الإيمان وما يترتب عليه من المؤاخاة والمواساة\n وأنواع الخيرات والمبرات { لاَّ يَعْلَمُونَ } [التوبة: 6] أي: لا يطمعون ولا يتوقعون صدورها من أهل الإيمان\n فمتى صدر منكم أمثال هذه عسى أن يتحاببوا ويتقربوا إليكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: \" أحد \": فاعل يفسره: \" استجارك \".  يقول الحق جل جلاله: { وإنْ } أتاك { أحدٌ من المشركين } المأمورين بالتعرض لهم، حيثما وجدوا، { استجاركَ } يطلب جوارك، ويستأمنك، { فأجِرْهُ } أي: فأمنهُ { حتى يسمع كلامَ الله } ويتدبره، ويطلع على حقيقة الأمر، لعله يُسلم، { ثم أبلغه مأمنه } أي: موضع أمنه إن لم يسلم، ولا تترك أحداً يتعرض له حتى يبلغ محل أمنه { ذلك بأنهم قومٌ لا يعلمون } أي: ذلك الأمر الذي أمرتك به بسبب أنهم قوم لا علم لهم بحقيقة الإيمان، ولا ما تدعوهم إليه، فلا بد من إيجارهم، لعلهم يسمعون ويتدبرون فيكون ذلك سبب إيمانهم. الإشارة: وإن استجارك ـ أيها العارف ـ أحد من عوام المسلمين ممن لم يدخل معكم بلاد الحقائق، وأراد أن يسمع شيئاً من علوم القوم، فأجره حتى يسمع شيئاً من علومهم وأسرارهم، فلعل ذلك يكون سبباً في دخوله في طريق القوم. ولا ينبغي للفقراء أن يطردوا من يأتيهم من العوام، بل يتلطفوا معهم، ويسمعوهم ما يليق بحالهم لأنَّ العوام لا علم لهم بما للخواص، فإن اطلعوا على ما خصهم الله به من العلوم دخلوا معهم، إن سبق لهم شيء من الخصوصية. وقال شيخ شيوخنا سيدي علي الجمل رضي الله عنه: لا ينبغي لأهل الخصوصية أن يدخلوا بلد العموم إلا في جوار أحد منهم، وإلاّ أنكرته البلد لأن البلد أم تغير على غير أبنائها، ولا ينبغي أيضاً للعموم أن يدخلوا بلد الخصوص إلا في جوار رجل منهم، وإلا أنكرته البلد. هـ. بالمعنى. ثم استبعد الحق أن يكون للمشركين عهد مع المسلمين، فقال: { كَيْفَ يَكُونُ لِلْمُشْرِكِينَ عَهْدٌ عِندَ ٱللَّهِ وَعِندَ رَسُولِهِ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:88",
      "similarity": 0.6920804184867078
    },
    {
      "verse": "67:28",
      "similarity": 0.6168789714021771
    },
    {
      "verse": "46:31",
      "similarity": 0.5825139744692565
    },
    {
      "verse": "72:22",
      "similarity": 0.4716745296433906
    },
    {
      "verse": "16:9",
      "similarity": 0.4338188073175502
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009006.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009006.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:6.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}