{
  "chapter": "التوبة",
  "text": "انما الصدقت للفقراء والمسكين والعملين عليها والمؤلفة قلوبهم وفى الرقاب والغرمين وفى سبيل الله وابن السبيل فريضة من الله والله عليم حكيم",
  "translations": [
    {
      "translation": "Zakat is for: the poor, the destitute, those who collect it, reconciling people's hearts, freeing slaves, those in debt, spending in the Way of Allah, and travellers. It is a legal obligation from Allah. Allah is All-Knowing, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Charities are meant for the indigent and needy, and those who collect and distribute them, and those whom you wish to win over, and for redeeming slaves (and captives) and those who are burdened with debt, and in the cause of God, and the wayfarers: So does God ordain. God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The alms are meant only for the poor and the needy and those who are in charge thereof, those whose hearts are to be reconciled, and to free those in bondage, and to help those burdened with debt, and for expenditure in the Way of Allah and for the wayfarer. This is an obligation from Allah. Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Welfare funds (zakat) are only for the poor, the destitute, the tax collectors, those whose hearts are inclined (towards Islam), the slaves, those who cannot pay their debts, for the cause of God, and for those who have become needy on a journey. Paying zakat is an obligation that God has decreed. God is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The obligatory charity* is only for the destitute and the really needy, and those who collect it, and for those in whose hearts the love of Islam needs to be instilled**, and to free slaves, and to debtors, and in Allah's cause***, and to the traveller; this is decreed by Allah; and Allah is All Knowing, Wise. (* This applies only to Zakat. ** The new convert to Islam. *** To the fighter having no provisions for holy war.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As-Sadaqat (i.e., Zakah) are only for the Fuqara', and Al-Masakin and those employed to collect (the funds); and to attract the hearts of those who have been inclined (towards Islam); and to free the captives; and for those in debt; and for Allah's cause, and for Ibn As-Sabil; a duty imposed by Allah. And Allah is All-Knower, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alms are only for the poor and the needy, and the officials (appointed) over them, and those whose hearts are made to incline (to truth) and the (ransoming of) captives and those in debts and in the way of Allah and the wayfarer; an ordinance from Allah; and Allah is knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The freewill offerings are for the poor and needy, those who work to collect them, those whose hearts are brought together, the ransoming of slaves, debtors, in God's way, and the traveller; so God ordains; God is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The alms are only for the poor and the needy, and those who collect them, and those whose hearts are to be reconciled, and to free the captives and the debtors, and for the cause of Allah, and (for) the wayfarer; a duty imposed by Allah. Allah is Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alms are only for: the poor and the destitute, for those who collect zakat, for conciliating people's hearts, for freeing slaves, for those in debt, for spending for God's cause, and for travellers in need. It is a legal obligation enjoined by God. God is all-knowing and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The compulsory alms are only for the poor and the needy and the agents employed therein and those whose hearts are to be conciliated and those in bondage and debtors and for expenditure in the way of Allah and for the wayfarer: an ordinance from Allah: and Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The charities are only for the poor and the needy, and those employed to collect them, and those whose hearts are to be reconciled, and for [the freedom of] the slaves and the debtors, and in the way of Allah, and for the traveller. [This is] an ordinance from Allah, and Allah is all-knowing, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alms are for the poor and the needy, and those employed to administer the (funds); for those whose hearts have been (recently) reconciled (to Truth); for those in bondage and in debt; in the cause of Allah; and for the wayfarer: (thus is it) ordained by Allah, and Allah is full of knowledge and wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As-Sadaqat (here it means Zakat) are only for the Fuqara' (poor), and Al-Masakin (the poor) and those employed to collect (the funds); and for to attract the hearts of those who have been inclined (towards Islam); and to free the captives; and for those in debt; and for Allah's Cause (i.e. for Mujahidun - those fighting in the holy wars), and for the wayfarer (a traveller who is cut off from everything); a duty imposed by Allah. And Allah is All-Knower, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The obligatory charity shall be only for the poor and the needy, and for those who work to collect it, and to influence hearts (to belief), for ransoming captives, and debtors in the Way of Allah and the destitute traveler. It is an obligation from Allah. Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Charities are for the poor, and the destitute, and those who administer them, and for reconciling hearts, and for freeing slaves, and for those in debt, and in the path of God, and for the traveler in need—an obligation from God. God is All-Knowing, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Zakah expenditures are only for the poor and for the needy and for those employed to collect [zakah] and for bringing hearts together [for Islam] and for freeing captives [or slaves] and for those in debt and for the cause of Allah and for the [stranded] traveler - an obligation [imposed] by Allah. And Allah is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:60]   The voluntary almsgivings, the alms to be dispensed, are only for the poor, who cannot find anything to suffice them in the least, and the needy, who cannot find anything to suffice them, and those who work with them, that is, [with] these alms, in other words, the one who collects [them], the one who takes the oaths [from those who claim them], the slave to be manumitted by contract, as well as the tax-summoner; and those whose hearts are to be reconciled, so that they might become Muslims, or that Islam might be firmly established, or that their peers might become Muslims, or that they might defend Muslims, all of whom are [classed according to different] categories. According to al-Shāfi‘ī, may God be pleased with him, the first and the last [of these categories] are no longer given [of the alms-tax] today, because of the [established] power of Islam; in contrast, the other two [categories] are given [of the alms-tax], according to the sounder [opinion]; and for, the manumission of, slaves, that is, [for] slaves to be manumitted by contract, and for the debtors, those in debt, if they have taken out a debt without intending thereby an act of disobedience, or those who have repented but have nothing with which to fulfil [the penalty of expiation], or to set things right between people, even if they be wealthy; and, for the way of God, that is, [for] those who are engaged in the struggle, of those for whom there is no [share of the] booty (fay’), even if they be wealthy; and for the traveller, the one cut off [from resources] during his journey — a duty imposed by God (farīdatan, ‘a duty’, is in the accusative because of an implied verb [sc. faradahā, ‘which He has imposed’]). And God is Knower, of His creatures, Wise, in His actions. Thus, it is impermissible to dispense these [alms-proceeds] other than to these [categories], or to deny [these proceeds to] any one of these [categories] if they exist. The Imam must divide these [proceeds] among them equally, but he is permitted to give priority to certain individuals over others within any one category. The lām [of li’l-fuqarā’, ‘for the poor’] indicates that it is obligatory to include every individual [of these categories in the distribution of the proceeds]; it is not, however, obligatory [to do so] when the person in charge of the monies has to apportion it but [finds that] it is insufficient. Indeed [in such a situation] it suffices to give three individuals from each category, but anything less than that is not sufficient, as is indicated by the plural form. The Sunna shows that the prerequisite condition for receiving [a share] of such [monies] is that the person be a Muslim, but not a Hashimī or a Muttālibī.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then explained who is entitled to these alms, saying: (The alms are only for the poor) for the folk of the Platform (and the needy) among the pilgrims, (and those who collect them) i.e. the collectors of alms, (and those whose hearts are to be reconciled) by giving them gifts such as Abu Sufyan and his companions. These were 15 men, (and to free the captives) the captives who want to ransom themselves (and the debtors) those who incurred debts to fulfil works which are for the obedience of Allah, (and for the cause of Allah) and for the fighters for the cause of Allah, (and (for) the wayfarers) guests, the passer-by; (a duty imposed by Allah) an allotment from Allah for these. (Allah is Knower) of these, (Wise) regarding that which He has ordained for these categories of people.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّمَا ٱلصَّدَقَاتُ لِلْفُقَرَآءِ وَٱلْمَسَاكِينِ } فالفَقِيرُ: الَّذِي بِهِ زَمانةٌ\n والمِسكينُ: الصَّحيحُ المُحتاجُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ بيَّن سبحانه مصارف الصدقات فقال: { إِنَّمَا ٱلصَّدَقَاتُ } أي: الزكوات يصرف { لِلْفُقَرَآءِ } وهم الذين لا مال لهم ولا مكسب لهم من الحرث وغيره، كأنه يكسر فقار ظهرهم الفاقة والاحتياج { وَٱلْمَسَاكِينِ } الذين لهم مكسب وصنعة، لكن لا تفي لعيالهم كأن الاحتياج أسكنهم في زاوية المسكنة والهوان { وَٱلْعَامِلِينَ عَلَيْهَا } أي: الساعين لجمعها وإيصالها إلى مصارفها { وَٱلْمُؤَلَّفَةِ قُلُوبُهُمْ } وهم الذين قرب عهد إسلامهم، يجب على المسلمين مؤانستهم ومواساتهم؛ ليقروا على الإيمان { وَ } يصرف منها أيضاً { فِي ٱلرِّقَابِ } أي: فكها من الرق وتحريرها، وهو من أهم مهمات الإسلام { وَٱلْغَارِمِينَ } الذين استغرق أموالهم في ديونهم ولم تفِ لأدائها، يُصرف إليهم منها؛ ليؤديها\n\n\n\n\n{ وَ } يُصرف منها سهم { فِي سَبِيلِ ٱللَّهِ } لتجهيز جيوش أهل الجهاد وتهيئة أسبابهم وعُددهم؛ إذ هو من أهم مهمات هذا الدين { وَٱبْنِ ٱلسَّبِيلِ } الذي انقطع عن الأهل والمال لمصلحة شرعية، إنماجرى هذه القسمة لهؤلاء المستحقين { فَرِيضَةً } صادرة { مِّنَ ٱللَّهِ } مقدرة من عنده؛ ليحافظ المؤمنون عليها { وَٱللَّهُ } المدبر لأمور عباده { عَلِيمٌ } بمصارف الصدقات { حَكِيمٌ } [التوبة: 60] في صرفها إياهم تقويةً لهم وإمداداً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { إِنما } تدفع { الصدقاتُ } الواجبة ـ أي: الزكاة ـ لهؤلاء الثمانية، وهذا يُرَجَّحُ أن لَمْزهم كان في قسم الزكاة لا في الغنائم، واختصاص دفع الزكاة بهؤلاء الثمانية مجمع عليه، واختلف: هل يجب تعميمهم؟ فقال مالك: ذلك إلى الإمام، إن شاء عمم وإن شاء خصص، وإن لم يلها الإمام فصاحب المال مخير، وبه قال أبو حنيفة وأحمد، وأفتى به بعض الشافعية، وقال الشافعي: يجب أن تقسم على هذه الأصناف بالسواء، إن وجدت\n  أولها: الفقير: وهو من لا شيء له، وثانيها: المسكين: وهو من له شيء لا يكفيه\n فالفقير أحوج، وهو مشتق من فقار الظهر، كأنه أصيب فقاره، والمسكين من السكون، كأن العجز أسكنه\n ويدل على هذا قوله تعالى:\n\n[الكهف: 79]\n فسماهم مساكين مع ملكهم السفينة، وأنه صلى الله عليه وسلم سأل المسكنة وقيل بالعكس، لقوله تعالى:\n\n[البلد: 16] وقيل: هما سواء\n { والعاملينَ عليها } أي: الساعين في تحصيلها وجمعها، ويدخل فيهم الحاشر والكاتب والمفرق، ولا بأس أن يعلف خيلهم منها، ويضافون منها بلا سَرف\n { والمؤلفة قلوبهم } قال مالك: هم كفار ظهر ميلهم للإسلام، فيعطوا ترغيباً في الإسلام\n وقيل قوم أسلموا ونيتهم ضعيفة، فيعطوا ليتمكن الإسلام في قلبهم، وحكمُهم باق، وقيل: أشراف يُترقب بإعطائهم إسلام نظائرهم\n  { وفي الرقاب } أي: في فك الرقاب، يشترون ويعتقون، { والغَارِمينَ } ، أي: مَنْ عليهم دَيْن، فيعطى ليقضي دينه، ويشرط أن يكون استدانة في غير فساد ولا سرف، وليس له ما يبيع في قضائه\n { وفي سبيل الله } يعني: الجهاد، فيعطى منها المجاهدون وإن كانوا أغنياء، ويشتري منها آلة الحرب، ولا يبنى منها سور ولا مركب\n { وابن السبيل } وهو الغريب المحتاج لما يوصله لبلده، ولم يجد مسلفاً، إن كان مليَّاَ ببلده، وإلا أعطي مطلقاً\n  فرض الله ذلك { فريضة من الله } أي: حقاً محدوداً عند الله\n قال ابن جزي: ونصبه على المصدر ـ يعني: لفعل محذوف كما تقدم ـ فإن قيل: لِمَ ذكر مصرف الزكاة في تضاعيف ذكر المنافقين؟ فالجواب: أنه خص مصرف الزكاة في تلك الأصناف ليقطع طمع المنافقين فيها، فاتصلت هذه الآية في المعنى بقوله: { ومنهم من يلمزك في الصدقات\n\n\n } هـ\n { والله عليمٌ حكيم } يضع الأشياء في مواضعها\n  الإشارة: إنما النفحات والمواهب للفقراء والمساكين، الذين افتقروا من السِّوى، وسكنوا في حضرة شهود المولى\n وفي الحكم\n \" ورود الفاقات أعياد المريدين، ربما وجدت من المزيد في الفاقة ما لا تجده في الصوم والصلاة، الفاقات بسُطُ المواهب\n إن أردت بسط المواهب عليك فصحح الفقر والفاقة لديك\n { إنما الصدقات للفقراء والمساكين }\n\n\nوقال الهروي: الفقر صفة مهجورة، وهو ألذُّ ما يناله العارف، لكونها تدخله على الله، وتجلسه بين يدي الله، وهو أعم المقامات حكماً لقطع العوائق، والتجرد من العلائق، واشتغال القلب بالله\n وقيل: الفقير الصادق لا يملِك ولا يُملَك\n وقال الشبلي: الفقير لا يستغني بشيء دون الله\n وقال الشيخ ابن سبعين رضي الله عنه: الفقير هو الذي لا يحصره الكون\n هـ\n يعني: لخروج فكرته عن دائرة الأكوان، وقال القشيري: الفقير الصادق عندهم: مَنْ لا سماء تُظِله، ولا أرضَ تُقِلُّه، ولا سهم يتناوله، ولا معلومَ يشغِله، فهو عبد الله بالله\nهـ\n وقال السهروردي في عوارفه: الفقر أساس التصوف، وبه قوامه، ويلزم من وجود التصوف وجود الفقر لأن التصوف اسم جامع لمعاني الفقر والزهد، مع زيادة أحوال لا بد منها للصوفي، وإن كان فقيراً زاهداً\n وقال بعضهم: نهاية الفقر بداية التصوف لأن التصوف اسم جامع لكل خلق سني، والخروج من كل خلق دنيء، لكنهم اتفقوا ألاًّ دخول على الله إلا من باب الفقر، ومن لم يتحقق بالفقر لم يتحقق بشيء مما أشار إليه القوم\n  وقال أبو إسحاق الهروي أيضاً: من أراد ان يبلغ الشرفَ كل الشرف فليخترْ سبعاً على سبع، فإن الصالحين اختاروا حتى بَلَغُوا سنام الخير\n واختاروا الفقر على الغنى، والجوع على الشبع والدُّون على المرتفع، والذلَّ على العز، والتواضع على الكبر، والحزن على الفرح، والموت على الحياة\n هـ\n وقال بعضهم: إن الفقير الصادق ليحترز من الغنى حذراً أن يدخله فيفسد عليه فقره، كما يحترز الغنى من الفقر حذراً أن يفسد عليه غناه\n قال بعض الصالحين: كان لي مال، فرأيت فقيراً في الحرم جالساً منذ أيام، ولا يأكل ولا يشرب وعليه أطمار رثة، فقلت: أُعنيه بهذا المال فألقيته في حجره، وقلت: استعن بهذا على دنياك، فنفض بها في الحصباء، وقال لي: اشتريتُ هذه الجلسة مع ربي بما ملكت، وأنت تفسدها عليَّ؟ ثم انصرف وتركني ألقُطها\n فوالله ما رأيت أعز منه لَمَّا بَدَّدَها، ولا أذل مني لما كنت ألقطها\n هـ\n  وكان بعضهم إذا أصبح عنده شيء اصبح حزيناً، وإذا لم يصبح عنده شيء أصبح فرحاً مسروراً، فقيل له: إنما الناس بعكس هذا، فقال: إني إذا لم يصبح عندي شيء فلي برسول الله صلى الله عليه وسلم أُسوة، وإذا أصبح لي شيء لم يكن لي برسول الله صلى الله عليه وسلم أسوة حسنة\n هـ\n وجمهور الصوفية: يفضلون الفقير الصابر على الغني الشاكر، ويُفضلون الفقر في الجملة على الغني لأنه ـ عليه الصلاة والسلام ـ اختاره، وما كان ليختار المفضول\n وشذ منهم يحيى بن معاذ الواعظ وأحمد بن عطاء\n قال القشيري: كان ابن عطاء يُفضل الغنى على الفقر، فدعا عليه الجنيد فأصيب عقله ثلاثين سنة، فلما رجع إليه عقله قال: إنما أصابني ما أصابني بدعاء الجنيد\n\n\nوتكلم يحيى بن معاذ، ففضل الغنى على الفقر، فأعطاه بعض الأغنياء ثلاثين ألف درهم، فدعا بعض المشايخ عليه، فقال: لا بارك الله له فيها، فخرج عليه اللص فنهبه إياها\n هـ\n وحكي عن أبي يزيد البسطامي: أنه قال: أًسري بروحي، فرأيت كأني واقف بين يدي الله، فسمعت قائلاً يقول: يا أبا يزيد، إن أردت القرب منا فأتنا بما ليس عندنا، فقلت: يا مولاي وأي شيء ليس عندك، ولك خزائن السماوات والأرض؟ فسمعت: يا أبا يزيد، ليس عندي ذل ولا فقر فمن أتاني بهما بلّغته\n هـ\n  وقال في الإحياء: الفقر المستعاذ منه: فقر المضطر، والمسؤول هو: الاعتراف بالمسكنة والذلة والافتقار إلى الله عز وجل\n هـ\n قلت: والأحسن أن المستعاذ منه هو: فقر القلوب من اليقين، فيسكنها الجزع والهلع، والفقر المسؤول هو: التخفيف من الشواغل والعلائق، والله تعالى أعلم\n وقد تكلم القشيري هنا على أخذ الزكاة وتركها، فقال: من أهل المعرفة من رأى أنَّ أَخذَ الزكاة المفروضة أَولى، قالوا: لأن الله ـ سبحانه ـ جعل ذلك مِلكاً للفقير، فهو أحل له من المتطوع به\n ومنهم من قال: الزكاة المفروضة لأقوام مستحقة، ورأوا الإيثار على الإخوان أولى، فلم يزاحموا أرباب السهمان، وتحرجوا من أخذ الزكاة، ومنهم من قال: إن ذلك وسخ الأموال، وهو لأصحاب الضرورات\n وقالوا: نحن آثرنا الفَقْرَ اختياراً\n\n\n فلم يأخذوا الزكاة المفروضة\n ه\n وقوله تعالى: والعاملين عليها: هم المستعدون للمواهب بالتفرغ والتجريد، و المؤلفة قلوبهم على حضرة محبوبهم، والجادُّون في فك الرقاب من الجهل والغفلة وهم أهل التذكير، الداعون إلى الله، والغارمين أي: الدافعون أموالهم ومهجهم في رضى محبوبهم، فافتقروا فاستحقوا حظهم من المواهب والأسرار، وفي سبيل الله أي: المجاهدون أنفسهم في مرضاة الله\n وابن السبيل: السائحين في طلب معرفة الله\n والله تعالى أعلم\n ثم ذكر نوعاً آخر من مساوئ المنافقين، فقال: { وَمِنْهُمُ ٱلَّذِينَ يُؤْذُونَ ٱلنَّبِيَّ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:66",
      "similarity": 0.5274705940017054
    },
    {
      "verse": "25:65",
      "similarity": 0.4842063235254632
    },
    {
      "verse": "52:40",
      "similarity": 0.47703352645894576
    },
    {
      "verse": "68:46",
      "similarity": 0.47703352645894576
    },
    {
      "verse": "9:98",
      "similarity": 0.41909196457432346
    }
  ]
}