{
  "chapter": "التوبة",
  "text": "ومنهم الذين يؤذون النبى ويقولون هو اذن قل اذن خير لكم يؤمن بالله ويؤمن للمؤمنين ورحمة للذين ءامنوا۟ منكم والذين يؤذون رسول الله لهم عذاب اليم",
  "translations": [
    {
      "translation": "Among them are some who insult the Prophet, saying he is only an ear. Say, 'An ear of good for you, believing in Allah and believing in the muminun, and a mercy for those among you who have iman.' As for those who insult the Messenger of Allah, they will have a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some among them who talk ill of the Prophet by saying: \"He listens to everyone.\" Tell them: \"He listens for your good, and trusts in God and trusts the faithful, and he is a blessing for those who believe. For those who offend the Apostle of God there is painful punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them there are some who distress the Prophet, saying: \"He is all ears.\" Tell them: \"He listens for your good. He believes in Allah and trusts the believers, and is a mercy for those of you who believe. A painful punishment lies in store for those who cause distress to the Messenger of Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them speak ill of the Prophet, saying, \"He listens to everything and believes what he hears.\" (Muhammad), tell them, \"He only listens to what is good for you, believes in God, and has trust in the believers. He is a mercy for the believers among you. Those who speak ill of the Messenger of God will face a painful punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them (the hypocrites) are those who trouble* the Herald of the Hidden (the Prophet) and say, “He is only ears**”; say “He is a listener for your good, he believes in Allah and believes in what the Muslims say, and is a mercy for the Muslims among you”; and for those who trouble the Noble Messenger of Allah, is a painful punishment. (*To disrespect / trouble the Holy Prophet – peace and blessings be upon him – is blasphemy. **He believes whatever he is told.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are men who annoy the Prophet and say: \"He is (lending his) ear (to every news).\" Say: \"He listens to what is best for you; he believes in Allah; has faith in the believers; and is a mercy to those of you who believe.\" But those who annoy Allah's Messenger, will have a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are some of them who molest the Prophet and say: He is one who believes every thing that he hears; say: A hearer of good for you (who) believes in Allah and believes the faithful and a mercy for those of you who believe; and (as for) those who molest the Apostle of Allah, they shall have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some of them hurt the Prophet, saying, 'He is an ear!' Say: 'An ear of good for you; he believes in God, and believes the believers, and he is a mercy to the believers among you. Those who hurt God's Messenger -- for them awaits a painful chastisement.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them are those who vex the Prophet and say: He is only a hearer. Say: A hearer of good for you, who believeth in Allah and is true to the believers, and a mercy for such of you as believe. Those who vex the messenger of Allah, for them there is a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them are those who vex the Prophet by saying, \"He listens to everyone.\" Say, \"His listening to everyone is good for you; he believes in God and puts his trust in the faithful, and is a mercy to those of you who believe. Those who annoy God's Messenger shall have a painful punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them are some who vex the prophet and say: he is all ears Say thou: he is all ears unto good for you, believing in Allah and giving credence to the believers and a mercy unto those of you who believe. And those who vex the apostle of Allah, unto them shall be a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them are those who torment the Prophet, and say, ‘He is an ear.’ Say, ‘An ear that is good for you. He has faith in Allah and trusts the faithful, and is a mercy for those of you who have faith.’ As for those who torment the Apostle of Allah, there is a painful punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them are men who molest the Prophet and say, \"He is (all) ear.\" Say, \"He listens to what is best for you: he believes in Allah, has faith in the Believers, and is a Mercy to those of you who believe.\" But those who molest the Messenger will have a grievous penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are men who hurt the Prophet (Muhammad SAW) and say: \"He is (lending his) ear (to every news).\" Say: \"He listens to what is best for you; he believes in Allah; has faith in the believers; and is a mercy to those of you who believe.\" But those who hurt Allah's Messenger (Muhammad SAW) will have a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are others among them who hurt the Prophet saying: 'He lends an ear (to everything)' Say: 'He lends an ear of good for you; he believes in Allah and trusts the believers, and he is a mercy to the believers among you. Those who hurt the Messenger of Allah for them there is a painful punishment'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are those who insult the Prophet, and say, “He is all ears.” Say, “He listens for your own good. He believes in God, and trusts the believers, and is mercy for those of you who believe.” Those who insult the Messenger of God will have a painful penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are those who abuse the Prophet and say, \"He is an ear.\" Say, \"[It is] an ear of goodness for you that believes in Allah and believes the believers and [is] a mercy to those who believe among you.\" And those who abuse the Messenger of Allah - for them is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:61] And of them, the hypocrites, are those who injure the Prophet, by casting aspersions on him and communicating [to others] what he says [in confidence], saying, when they are forbidden from [doing] this, lest it should reach him: ‘He is only a listener!’, that is, he listens to anything that is said, and accepts it, so that when we swear to him that we have not communicated [to others] a particular thing, he believes us. Say, he is, ‘A listener, who listens, to good for you, and not one who listens to evil, one who believes in God and has faith, he trusts, in the believers, in what they inform him, and not in others (the lām [of li’lmu’minīna, ‘in the believers’] has been added to distinguish between belief in the sense of ‘submitting [to God]’ (islām), and in other senses [such as ‘trusting’]) and who is a mercy (read rahmatun, in the nominative, as a supplement to udhunun, ‘a listener’, or rahmatin, in the genitive, as a supplement to khayrin, ‘to good’) to those of you who believe. Those who injure God’s Messenger, for them there is a painful chastisement’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of them) of the hypocrites: Judham Ibn Khalid, Iyyas Ibn Qays, Sammak Ibn Yazid and 'Ubayd Ibn Malik (are those who vex the Prophet) by slandering and vilifying him (and say) to one another: (He is only a hearer) he listens to us and believes us when we tell him we have not said anything against you. (Say) to them, Muhammad: (A hearer of good) and not evil (for you) i.e. he listens to you and believes what is good rather than believes that you are lying; it is also said that this means: if he is a hearer, then it is good for you, (who believeth in Allah) he believes in the word of Allah (and is true to the believers) and he believes the word of sincere believers, (and a mercy) preventing from torment (for such of you as believe) both inwardly and outwardly. (Those who vex the Messenger of Allah) by not joining him at the Battle of Tabuk. The reference here is to Jallas Ibn Suwayd, Sammak Ibn 'Amr, Mikhsha' Ibn Humayr and their host, (for them there is a painful doom) in the life of this world and in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَيِقُولُونَ هُوَ أُذُنٌ } معناه يَسمعُ مَا يُقالُ لَهُ بِقَلبِهِ\n\n\n\n\nوقوله تعالى: { وَيُؤْمِنُ لِلْمُؤْمِنِينَ } معناهُ يُصدِّقُ للمؤمنينَ\n\n",
      "translations": [
        {
          "translation": " And His saying, {And they say, \"It is only a hearing\"} [Qur'an 17:46], its meaning is that he hears what is said to him with his heart.\n And His saying - exalted be He - {And believes in the believers}, its meaning is that He believes in the believers",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ويقولون هو أذن } كانوا يؤذونه ويغتابونه بسلامة القلب وسرعة القبول والتصديق لما يسمع\n فصدّقهم في ذلك وسلم وقال: هو كذلك\n ولكن بالنسبة إلى الخير فإنّ النفس الأبية والغليظة الجافية والكرة القاسية التي تتصلب في الأمور ولا تتأثر غير مستعدة للكمال\n إذ الكمال الإنساني لا يكون إلا بالقبول والتأثر والانفعال\n فكلما كانت النفس ألين عريكة وأسلم قلباً وأسهل قبولاً كانت أقبل للكمال وأشدّ استعداداً له\n وليس هذا اللين هو من باب الضعف والبلاهة الذي يقتضي الانفعال من كل ما يسمع حتى المحال والتأثر من كل ما يرد عليه ويراه حتى الكذب والشرور والضلال بل هو من باب اللطافة وسرعة القبول لما يناسبه من الخير والصدق\n فلذلك قال: { قل أذن خير } إذ صفاء الاستعداد ولطف النفس يوجب قبول ما يناسبه من باب الخيرات لا ما ينافيه من باب الشرور\n فإنّ الاستعداد الخيري لا يقبل الشر ولا يتأثر به ولا ينطبع فيه لمنافاته إياه وبعده عنه { لكم } أي: يسمع ما ينفعكم وما فيه صلاحكم دون غيره { يؤمن بالله } هو بيان لينه وقابليته لأن الإيمان لا يكون إلا مع سلامة القلب ولطافة النفس ولينها { ويؤمن للمؤمنين } يصدّق قولهم في الخيرات ويسمع كلامهم فيها ويقبله { ورحمة للذين آمنوا منكم } يعطف عليهم ويرق لهم فينجيهم من العذاب بالتزكية والتعليم\n ويصلح أمر معاشهم ومعادهم بالبرّ و الصلة وتعليم الأخلاق من الحلم والشفقة\n والأمر بالمعروف باتباعهم إياه فيها\n ووضع الشرائع الموجبة لنظام أمرهم في الدارين\n والتحريض على أبواب البرّ بالقول والفعل إلى غير ذلك",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بل { أُذُنُ خَيْرٍ لَّكُمْ } إن صدر عنكم ما يتعلق بأمور دينكم\n موافقاً لما أمر الله به يقبله منكم\n لأنه صلى الله عليه وسلم { يُؤْمِنُ بِٱللَّهِ } أي: يقر ويصدق بوحدانيته { وَيُؤْمِنُ } أيضاً { لِلْمُؤْمِنِينَ } المخلصين فيما أتوا به من الأعمال والأقوال الصادرة عن الإخلاص { وَ } كيف لا يكون الرسول أذن خير\n إذ هو كله { رَحْمَةٌ } أي: شفقة وعطف { لِّلَّذِينَ آمَنُواْ مِنكُمْ } وأخلصوا في إيمانهم؟! { وَ } بالجملة: { ٱلَّذِينَ يُؤْذُونَ رَسُولَ ٱللَّهِ } بأي وجه كان { لَهُمْ عَذَابٌ أَلِيمٌ } [التوبة: 61] في النشاة الأخرى\n جزاءً لما أتوا به من إيذاء رسوله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: قل أُذُنُ خير: من قرأ بالإضافة فـ لكم: متعلق بالاستقرار، أي: هو أذن خير كائن لكم. ومن قرأ بالتنوين فـ خير: خبر عن \" أُذن \" خبر ثانٍ، ومن قرأ: \" ورحمة \" بالرفع فعطف على أذن خير، ومن قرأ بالجر، فعطف على \" خير \" ، المجرور.  يقول الحق جل جلاله: { ومنهم الذين يُؤذون النبيَّ ويقولون } فيه: { هو أُذُنُ } يسمع كل ما يقال له يصدقه حقاً كان أو باطلاً، فإذا حلفنا له أنا لم نقل شيئاً صدقنا. والقائل لهذه المقالة: قيل: هو نَبْتَل بْن الحَارِثِ، وكان من مردة المنافقين: وقيل: عتاب بن قشير، في جماعة، قالوا: محمد أذن سامِِعِه، نقول ما شئنا، ثم نأتيه فيصدقنا فيما نقول. قال البيضاوي: سمي بالجارحة للمبالغة كأنه من فرط استماعه صار جملته آلة السماع، كما سمي الجاسوس عيناً. هـ.  قال تعالى في الرد عليهم: { قل أُذُنُ خيرٍ لكم } أي: هو لكم سماع خير وحق، فيسمع الخير والحق ويبلغه لكم، أو قل: هو أذنٌ خيرٌ لكم من كونه غير أذن لأن كونه أذناً يقبل معاذيركم ولو كان غير أذن لكذبكم وفضحكم. وفي الوجيز أي: مستمع خير وصلاح، لا مستمع شر وفساد.  قال البيضاوي: وهو تصديق لهم بأنه أذن، لكن لا على الوجه الذي ذموا به ـ يعني من تنقصه بقلة الحزم والانخداع ـ بل من حيث إنه يسمع الخير ويقبله. ثم فسر ذلك بقوله: { يؤمنُ بالله } يصدق بالله وبما له من الكمالات، { ويُومنُ للمؤمنين } ويصدقهم لما يعلم من خلوصهم، واللام مزيدة للتفرقة بين إيمان التصديق وإيمان الإذعان والأمان، { ورحمةٌ للذين آمنوا منكم } أي: هو رحمة لمن أظهر الإيمان منكم، بحيث يقبله ولا يكشف سره. وفيه تنبيه على أنه ليس يقبل قلولكم جهلاً بكم، بل رفقاً بكم وترحماً عليكم، قاله البيضاوي.  وفي ابن عطية: وخص الرحمة بالذين آمنوا إذ هم الذين نجوا بالرسول وفازوا. وفي الوجيز: وهو رحمة لهم، لأنه كان سبب إيمانهم. هـ. فظاهره أن الإيمان الصادر منهم كان حقيقياً، وهو حُسنُ خلافٍ ظاهر. قال البيضاوي: أي: هو رحمة لمن وفقه الله للإيمان منكم. { والذين يُؤذون رسول الله } بأي نوع من الإيذاء، { لهم عذابٌ أليم } موجع بسبب إذايته. الإشارة: تعظيم الرسول صلى الله عليه وسلم ومدحه وذكر محاسنه، من أجل القربات وأعظم الطاعات لأن تعظيمه ناشئ عن محبته، ومحبته عقد من عقود الإيمان، لا يتم الإيمان إلا بها، والإخلال بهذا الجانب من أعظم المعاصي عند الله، ولذلك قبح كفر المنافقين واليهود، الذين يؤذون جانب النبوة، وما عابه به المنافقون في هذه الآية هو عين الكمال عند أهل الكمال.\nقال القشيري: عابوه بما هو أماره كرمه، ودلالة فضله، فقالوا: إنه لحُسن خُلُقه، يسمع ما يقال له، وقد قال صلى الله عليه وسلم:\n \" المُؤمنُ غِرٌّ كَرِيمٌ والمُنافِقُ خِبٌّ لَئِيمٌ \". \nقالوا: من الفاضل؟ قالوا: الفَطِنُ المُتَغَافِلُ، وأنشدوا:\nوكل ولي يتخلق بهذا الخلق السني الذي هو التغافل والانخداع في الله، وكان عبد الله بن عمر يقول: من خدعنا في الله انخدعنا له. ورأى سيدنا عيسى عليه السلام رجلاً يسرق، فقال له: سرقت يا فلان؟ فقال: والله ما سرقت، فقال عليه السلام: آمنتُ بالله وكذبتُ عيني. فمن أخلاق الصوفي أن يؤمن بالله، ويؤمن للمؤمنين، كيفا كانوا، ورحمة للذين آمنوا، فمن آذى من هذا وصفه فله عذاب أليم. وبالله التوفيق. ومن مساوئ المنافقين أيضاً: أنهم يرضون الناس بسخط الله، كما أبان ذلك الحق تعالى بقوله: { يَحْلِفُونَ بِٱللَّهِ لَكُمْ لِيُرْضُوكُمْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:16",
      "similarity": 0.5402624823723426
    },
    {
      "verse": "14:12",
      "similarity": 0.48857686026012587
    },
    {
      "verse": "6:34",
      "similarity": 0.47739754866826817
    },
    {
      "verse": "33:69",
      "similarity": 0.4470642604948357
    },
    {
      "verse": "29:10",
      "similarity": 0.43262408713684375
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/9:61.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/9:61.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/9:61.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}