{
  "chapter": "التوبة",
  "text": "الم يعلموا۟ انه من يحادد الله ورسوله فان له نار جهنم خلدا فيها ذلك الخزى العظيم",
  "translations": [
    {
      "translation": "Do they not know that whoever opposes Allah and His Messenger, will have the Fire of Hell, remaining in it timelessly, for ever? That is the great disgrace.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not realised that anyone who opposes God and His Prophet, will abide in Hell for ever? And that is the worst disgrace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they not aware that Hell Fire awaits whosoever opposes Allah and His Messenger, and in it he shall abide? That surely is the great humiliation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that for displeasing God and His Messenger, one would be admitted to Hell wherein he would live forever. This indeed is a great humiliation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that for one who opposes Allah and His Noble Messenger, is the fire of hell, to remain in it forever? This is the greatest humiliation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know they not that whoever opposes and shows hostility to Allah and His Messenger, certainly for him will be the fire of Hell to abide therein. That is the extreme disgrace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that whoever acts in opposition to Allah and His Apostle, he shall surely have the fire of hell to abide in it? That is the grievous abasement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that whosoever opposes God and His Messenger -- for him awaits the fire of Gehenna, therein to dwell forever? That is the mighty degradation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know they not that whoso opposeth Allah and His messenger, his verily is fire of hell, to abide therein? That is the extreme abasement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that whoever opposes God and His Messenger shall abide forever in the fire of Hell? That is the supreme humiliation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know they not that whosoever shall oppose Allah and His apostle, verily for him shall be Hell-Fire wherein he shell be an abider? That is a mighty humiliation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that whoever opposes Allah and His Apostle, there awaits him the Fire of hell, to remain in it [forever]? That is the great disgrace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know they not that for those who oppose Allah and His Messenger, is the Fire of Hell?- wherein they shall dwell. That is the supreme disgrace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know they not that whoever opposes and shows hostility to Allah and His Messenger (SAW), certainly for him will be the Fire of Hell to abide therein. That is extreme disgrace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they not aware that whosoever opposes Allah and His Messenger shall live for ever in the Fire of Gehenna? That surely is the greatest degradation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that whoever opposes God and His Messenger, will have the Fire of Hell, abiding in it forever? That is the supreme disgrace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that whoever opposes Allah and His Messenger - that for him is the fire of Hell, wherein he will abide eternally? That is the great disgrace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:63] Do they not know that, the fact is that, whoever opposes God and His Messenger, for him shall be the fire of Hell, as a requital, to abide therein? That is the great abasement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Know they not) i.e. Jallas and his host (that whoso opposeth Allah and His messenger) inwardly, (his portion verily is hell, to abide therein? That is the extreme abasement) severe punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَلَمْ يَعْلَمُوۤاْ أَنَّهُ مَن يُحَادِدِ ٱللَّهَ وَرَسُولَهُ } معناهُ مَنْ يُحارِبُ ويُشاقِقُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ يَعْلَمُوۤاْ } ويفهموا أولئك المتخلفون، المؤذون لله ورسوله { أَنَّهُ } أي: الشأن { مَن يُحَادِدِ } ويشاقق { ٱللَّهَ وَرَسُولَهُ } ويتعد حدود الله ويخالف أمر رسوله { فَأَنَّ لَهُ نَارَ جَهَنَّمَ } جزاءً لما اقترف من المعاداة، فيكون { خَالِداً فِيهَا } لا ينجو منها أصلاً { ذٰلِكَ } أي: الخلود في جهنم الحرمان { ٱلْخِزْيُ ٱلْعَظِيمُ } [التوبة: 63] والهلاك الدائم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ألم يعلموا أنه } أي: الأمر والشأن، { من يُحادِدِ اللَّهَ ورسولهُ } يعاديهما، ويخالف أمرهما { فأنّ له } فواجبٌ أن له { نارَ جهنم خالداً فيها ذلك الخزيُ } أي: الهول { العظيم } ، والهلاك الدائم، والعياذ بالله\n  الإشارة: من أرضى الناسَ بسخط الله أسخطهم عليه وسخط عليه، ومن اسخط الناس في رضي الله أرضاهم عليه، ورضي عنه، فمن أقر منكراً حياء أو خوفاً من الناس، فقد أسخط مولاه، ومن انكر منكراً، ولم يراقب أحداً فقد أرضى مولاه، ومن راقب الناس لم يراقب الله، ومن راقب الله لم يراقب الناس، { والله ورسوله أحق أن يُرضُوه إن كانوا مؤمنين }\n وتأمل قول الشاعر:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:14",
      "similarity": 0.4664511512516862
    },
    {
      "verse": "4:13",
      "similarity": 0.4646183159531096
    },
    {
      "verse": "58:20",
      "similarity": 0.4519294025115669
    },
    {
      "verse": "3:192",
      "similarity": 0.4512359874489681
    },
    {
      "verse": "15:69",
      "similarity": 0.4433420448372497
    }
  ]
}