{
  "chapter": "التوبة",
  "text": "يحذر المنفقون ان تنزل عليهم سورة تنبئهم بما فى قلوبهم قل استهزءوا۟ ان الله مخرج ما تحذرون",
  "translations": [
    {
      "translation": "The hypocrites are afraid that a sura may be sent down about them, informing them of what is in their hearts. Say: 'Go on mocking! Allah will expose everything you are afraid of.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites fear lest a Surah is revealed concerning them, exposing what is in their hearts. Say to them: \"Mock as much as you like; God will surely expose what you dread.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites are afraid lest a surah should be revealed concerning them intimating to the believers what lay hidden in their hearts. Tell them (O Prophet): \"Continue your mockery if you will. Allah will surely bring to light all that whose disclosure you dread.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites are afraid that some revelation will be revealed, thus, making public what is in their hearts. (Muhammad), tell them, \"Continue in your mockery; God will certainly let whatever causes you worry to take place\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites fear for a chapter being revealed regarding them, which may disclose what is hidden in their hearts; say, “Keep mocking; Allah will certainly disclose what you fear.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites fear lest a Surah should be revealed about them, showing them what is in their hearts. Say: \"(Go ahead and) mock! But certainly Allah will bring to light all that you fear.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites fear lest a chapter should be sent down to them telling them plainly of what is in their hearts. Say: Go on mocking, surely Allah will bring forth what you fear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites are afraid, lest a sura should be sent down against them, telling thee what is in their hearts. Say: 'Mock on; God will bring forth what you fear.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites fear lest a surah should be revealed concerning them, proclaiming what is in their hearts. Say: Scoff (your fill)! Lo! Allah is disclosing what ye fear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites are afraid lest a chapter [of the Quran] be sent down about them, telling them what is in their hearts -- say, \"Go on mocking. God will surely bring to light what you are dreading.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites apprehend lest a Surah should be revealed unto them declaring unto them that which is in their hearts. Say thou: mock on! verily Allah is about to bring out that which ye apprehend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites are apprehensive lest a surah should be sent down against them, informing them about what is in their hearts. Say, ‘Go on deriding. Allah will indeed bring out what you are apprehensive of.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hypocrites are afraid lest a Sura should be sent down about them, showing them what is (really passing) in their hearts. Say: \"Mock ye! But verily Allah will bring to light all that ye fear (should be revealed).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites fear lest a Surah (chapter of the Quran) should be revealed about them, showing them what is in their hearts. Say: \"(Go ahead and) mock! But certainly Allah will bring to light all that you fear.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites are afraid lest a chapter be sent down against them telling them what is in their hearts. Say: 'Mock if you will; Allah will surely bring forth what you are fearing'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites worry lest a chapter may be revealed about them, informing them of what is in their hearts. Say, “Go on mocking; God will bring out what you fear.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They hypocrites are apprehensive lest a surah be revealed about them, informing them of what is in their hearts. Say, \"Mock [as you wish]; indeed, Allah will expose that which you fear.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:64] The hypocrites are cautious, they fear, lest a sūra should be revealed to them, that is, [to] the believers, informing them of what is in their [the hypocrites’] hearts, of hypocrisy, and yet despite this they persist in mockery. Say: ‘Keep mocking! (this is an imperative of threat) God will bring out, He will make manifest, that, hypocrisy of yours, of which you are fearful’, lest it be brought out.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The hypocrites) 'Abdullah Ibn Ubayy and his host (fear lest a surah should be revealed) to their Prophet (concerning them, proclaiming) informing about (what is in their hearts) of hypocrisy. (Say) Muhammad, to Wadi'ah Ibn Judham, Jadd Ibn Qays and Juhayr Ibn Humayr: (Scoff (your fill)) Muhammad (pbuh) and the Qur'an! (Lo! Allah is disclosing what ye fear) what you conceal regarding Muhammad (pbuh) and his Companions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن شدة نفاقهم وشقاقهم { يَحْذَرُ ٱلْمُنَافِقُونَ } المصرون على الكفر الكامن في قلوبهم\n المظهرون للإيمان استهزاءً ومداهنةً { أَن تُنَزَّلَ عَلَيْهِمْ } أي: على المؤمنين { سُورَةٌ } طائفة من الكلام { تُنَبِّئُهُمْ } وتخبرهم { بِمَا فِي قُلُوبِهِم } من الكفر والنفاق فحينئذٍ فعلوا ما فعلوا بالمشركين المجاهدين { قُلِ } لهم تهديداً وتقريراً: { ٱسْتَهْزِءُوۤاْ } بالمؤمنين\n وامضوا على ما أنتم عليه من الكفر والنفاق { إِنَّ ٱللَّهَ } المنتقم منكم { مُخْرِجٌ } مظهر { مَّا } كنتم { تَحْذَرُونَ } [التوبة: 64] منه\n وهو إنزال السورة\n لإفشاء حالكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الضمائر في \" عليهم \" \n و \" تنبئهم \" \n و \" قلوبكم \" \n تعود على المنافقين خلافاً للزمخشري في الأولين\n فقال: يعود على المؤمنين\n وتبعه البيضاوي\n يقول الحق جل جلاله: { يحذَرَ المنافقون أن تُنَزّلَ عليهم } أي: في شأنهم\n { سورةٌ } من القرآن على النبي صلى الله عليه وسلم\n { تُنبئهم } أي: تخبرهم\n أي: المنافقين\n { بما في قلوبهم } من الشك والنفاق\n وتهتك أستارهم\n وكانوا يستهزئون بأمر الوحي والدين\n فقال تعالى لنبيه ـ عليه الصلاة والسلام: { قل } لهم: { استهزئوا } تهديداً لهم\n { إن الله مُخرِجٌ ما تحذَرُون } من إنزال السورة فيكم\n أو ما تحذرون من إظهار مساوئكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:124",
      "similarity": 0.4357233593733593
    },
    {
      "verse": "2:23",
      "similarity": 0.4270868871818686
    },
    {
      "verse": "26:56",
      "similarity": 0.42673602673952576
    },
    {
      "verse": "10:38",
      "similarity": 0.4083355089381808
    },
    {
      "verse": "5:92",
      "similarity": 0.40750020993406505
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/9:64.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/9:64.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/9:64.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}