{
  "chapter": "التوبة",
  "text": "لا تعتذروا۟ قد كفرتم بعد ايمنكم ان نعف عن طائفة منكم نعذب طائفةۢ بانهم كانوا۟ مجرمين",
  "translations": [
    {
      "translation": "Do not try to excuse yourselves. You have become kafir after having iman. If one group of you is pardoned, another group will be punished for being evildoers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not make excuses: You turned unbelievers after having come to faith. If We pardon a section of you (for being frivolous), We shall punish the other for being guilty (of deliberate sin).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now, make no excuses. The truth is, you have fallen into unbelief after having believed. Even if We were to forgive some of you, We will surely chastise others because they are guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make no excuses. You have certainly turned back to disbelief. If We forgive one group of you, We must punish the other for they are guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Do not feign excuses, you have turned disbelievers after becoming Muslims”; if We forgive some of you*, We shall punish others because they were guilty. (* One who kept quiet and later repented.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make no excuse; you disbelieved after you had believed. If We pardon some of you, We will punish others among you because they were criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not make excuses; you have denied indeed after you had believed; if We pardon a party of you, We will chastise (another) party because they are guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make no excuses. You have disbelieved after your believing. If We forgive one party of you, We will chastise another party for that they were sinners.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make no excuse. Ye have disbelieved after your (confession of) belief. If We forgive a party of you, a party of you We shall punish because they have been guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make no excuses; you rejected the faith after you accepted it.\" If We pardon some of you, We will punish others amongst you, for they are guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make no excuse. Of a surety ye are disbelieving after declaring your faith. If, party of you We shall Opardon, anot her party We shall torment for they have remained sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not make excuses. You have disbelieved after your faith.’ If We forgive a group among you, We will punish another group, for they have been guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make ye no excuses: ye have rejected Faith after ye had accepted it. If We pardon some of you, We will punish others amongst you, for that they are in sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make no excuse; you have disbelieved after you had believed. If We pardon some of you, We will punish others amongst you because they were Mujrimun (disbelievers, polytheists, sinners, criminals, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not make excuses. You have disbelieved after you believed. If we forgive some of you, We will punish others, for they were sinners'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not apologize. You have disbelieved after your belief. If We pardon some of you, We will punish others, because they are guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Make no excuse; you have disbelieved after your belief. If We pardon one faction of you - We will punish another faction because they were criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:66] Make no excuses, for that. You have disbelieved after believing, that is, your disbelief has become manifest even as you have manifested belief. If We forgive (read passive yu‘fa, ‘it is forgiven’, or active [first person plural] na‘fu, ‘We forgive’) a party of you, because of its sincerity and its repentance, as in the case of Jahsh b. Humayyir, We will chastise (read either [passive] tu‘adhdhab, ‘[it] shall be chastised’, or nu‘adhdhib) another party because they were sinners’, persisting in hypocrisy and mockery.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Make no excuse) for what you said. (Ye have disbelieved after your (confession of) belief) while claiming you are believers. (If We forgive a party of you) i.e. Juhayr Ibn Humayr because he did not make fun of Allah or the Messenger but laughed with the others, (a party of you) Wadi'ah Ibn Judham and Jadd Ibn Qays (We shall punish because they have been guilty) because they were inwardly idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لاَ تَعْتَذِرُواْ } بالأعذار الفاسدة\n ولا تحلفوا بالحلف الكاذب\n إنكم { قَدْ كَفَرْتُمْ } وأظهرتم بإيذاء الرسول والطعن في دينه { بَعْدَ إِيمَانِكُمْ } بعدما أظهرتم الإيمان فارتفع الأمان عنكم بفعلكم هذا فلحقتم بالمشركين\n فنفعل بكم ما نفعل بهم { إِن نَّعْفُ عَن طَآئِفَةٍ مِّنْكُمْ } بعدما تابوا عمَّا صدر عنهم\n ورجعوا إلى الله نادمين خاشعين عن ظهر القلب { نُعَذِّبْ } بالقتل والأسر\n والإجلاء والإذلال { طَآئِفَةً } أخرى منكم { بِأَنَّهُمْ كَانُواْ مُجْرِمِينَ } [التوبة: 66] مصرين على ما هم عليه من الكفر والنفاق وإيذاء الرسول والتخلف عن أمره بلا توبة وندامة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لا تعتذروا } أي: لا تشتغلوا باعتذاراتكم الكاذبة { قد كفرتم بعد إيمانكم } أي: قد أظهرتم الكفر بإيذاء الرسول والطعن عليه\n بعد إظهار إيمانكم الكاذب\n { إن نعفُ عن طائفةٍ منكم } بتوبتهم وإخلاصهم\n حيث سبق لهم ذلك كانَ منهم رجل اسمه مَخشِيّ\n تاب ومات شهيداً\n أو لكفهم عن الإيذاء\n { نُعَذِّب طائفة بأنهم كانوا } في علم الله { مجرمين } مُصرين على النفاق\n أو مستمرين على الإيذاء والاستهزاء\n والله تعالى أعلم\n الإشارة: الاستهزاء بالأولياء والطعن عليهم من أسباب المقت والبعد من الله\n والإصرار على ذلك شؤمه سوء الخاتمة\n وترى بعض الطاعنين عليهم يحذر منهم أن يكاشفوا بأسراهم\n وقد يُطلع الله أولياءه على ذلك\n وقد لا يطلعهم\n وبعد أن يطلعهم على ذلك لا يواجهوهُم بكشف أسرارهم لتخلقهم بالرحمة الإلهية\n والله تعالى أعلم\n ومن مساوئ المنافقين أيضاً: أمرهم ونهيهم عن المعروف كما قال تعالى: { ٱلْمُنَافِقُونَ وَٱلْمُنَافِقَاتُ بَعْضُهُمْ مِّن بَعْضٍ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:36",
      "similarity": 0.6297474256413996
    },
    {
      "verse": "75:15",
      "similarity": 0.6245455478627916
    },
    {
      "verse": "77:6",
      "similarity": 0.6234193695038156
    },
    {
      "verse": "66:7",
      "similarity": 0.6231317016263089
    },
    {
      "verse": "18:76",
      "similarity": 0.529974333729007
    }
  ]
}