{
  "chapter": "التوبة",
  "text": "الم ياتهم نبا الذين من قبلهم قوم نوح وعاد وثمود وقوم ابرهيم واصحب مدين والمؤتفكت اتتهم رسلهم بالبينت فما كان الله ليظلمهم ولكن كانوا۟ انفسهم يظلمون",
  "translations": [
    {
      "translation": "Has the news of those who came before them not reached them the people of Nuh and 'Ad and Thamud, and the people of Ibrahim and the inhabitants of Madyan and the overturned cities? Their Messengers brought them the Clear Signs. Allah did not wrong them; rather they wronged themselves.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the account of those before them come to them, -- of the people of Noah and 'Ad and Thamud, of Abraham and Midian, and all the habitations that were destroyed? Their apostles had come to them with clear proofs; and God did not surely wrong them, they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not heard the accounts of those who came before them - of the people of Noah and 'Ad and Thamud, and the people of Abraham and the dwellers of Madyan (Midian), and the cities that were overturned? Their Messengers came to them with Clear Signs. Then, it was not Allah Who caused them any wrong; they rather wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not heard the stories of the people of Noah, the tribe of Ad, Thamud, the people of Abraham, the dwellers of the city of Midian, and those of the Subverted Cities? God's Messengers came to each of them with miracles. God did not do any injustice to them, but they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did not the news of those before them reach them – the people of Nooh, and the A’ad, and the Thamud – the people of Ibrahim, the people of Madyan and the dwellings that were overturned? Their Noble Messengers had brought clear proofs to them; so it did not befit Allah’s Majesty to oppress them, but in fact they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the story reached them of those before them -- The people of Nuh,`Ad, Thamud, the people of Ibrahim, the dwellers of Madyan and the overturned cities; to them came their Messengers with clear proofs. So it was not Allah Who wronged them, but they used to wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the news of those before them come to them; of the people of Nuh and Ad and Samood, and the people of Ibrahim and the dwellers of Madyan and the overthrown cities; their apostles came to them with clear arguments; so it was not Allah Who should do them injustice, but they were unjust to themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has there not come to you the tidings of those who were before you -- the people of Noah, Ad, Thamood, the people of Abraham, the men of Midian and the subverted cities? Their Messengers came to them with the clear signs God would not wrong them, but themselves they wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath not the fame of those before them reached them - the folk of Noah, A'ad, Thamud, the folk of Abraham, the dwellers of Midian and the disasters (which befell them)? Their messengers (from Allah) came unto them with proofs (of Allah's Sovereignty). So Allah surely wronged them not, but they did wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they never heard the stories about their predecessors, the peoples of Noah, 'Ad, Thamud, Abraham, Midian, and of the ruined cities? Their messengers brought them clear evidence of the truth. It was not God who wronged them; they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have not come to them the tidings of those before them: the people of Nuh and 'Ad and Thamud and the people of Ibrahim and the dwellers of Madyan and of the overturned cities! There came unto them their apostles with evidences. Wherefore Allah was not one to wrong them, but themselves they were wont to wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has there not come to them the account of those who were before them—the people of Noah, ‘Ad, and Tham£d, and the people of Abraham, the inhabitants of Midian, and the towns that were overturned? Their apostles brought them manifest proofs. So it was not Allah who wronged them, but it was they who used to wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath not the story reached them of those before them?- the People of Noah, and 'Ad, and Thamud; the People of Abraham, the men of Midian, and the cities overthrown. To them came their messengers with clear signs. It is not Allah Who wrongs them, but they wrong their own souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the story reached them of those before them? - The people of Nuh (Noah), 'Ad, and Thamud, the people of Ibrahim (Abraham), the dwellers of Madyan (Midian) and the cities overthrown [i.e. the people to whom Lout (Lot) preached], to them came their Messengers with clear proofs. So it was not Allah Who wronged them, but they used to wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not heard the news of those who have gone before them? The news of the nations of Noah, Aad and Thamood, of Abraham's nation, and the people of Midian and the ruined cities? Their Messengers showed them clear signs. Allah did not harm them, but they harmed themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not heard the stories of those before them? The people of Noah, and Aad, and Thamood; and the people of Abraham, and the inhabitants of Median, and the Overturned Cities? Their messengers came to them with the clear proofs. God never wronged them, but they used to wrong their own selves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has there not reached them the news of those before them - the people of Noah and [the tribes of] 'Aad and Thamud and the people of Abraham and the companions of Madyan and the towns overturned? Their messengers came to them with clear proofs. And Allah would never have wronged them, but they were wronging themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:70] Has not the tidings, the tale, of those before them reached them — the folk of Noah, and ‘Ād, the folk of Hūd, and Thamūd, the folk of Sālih, and the folk of Abraham, and the dwellers of Midian, the folk of Shu‘ayb, and the Deviant [cities]?, the cities of the folk of Lot, meaning, its inhabitants. Their messengers brought them clear proofs, with miracles, but they denied them, and so were destroyed. God would never have wronged them, by punishing them for no sin [on their part], but they wronged themselves, by committing sin.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hath not the fame) the news (of those before them reached them) how We destroyed them (the folk of Noah) We destroyed them by drowning, ('Aad) the people of Hud, We destroyed them by the wind, (Thamud) the people of Salih, We destroyed them by means of the earthquake, (the folk of Abraham) We destroyed them by razing them down, (the dwellers of Midian) the people of Shu'ayb, We destroyed them by the earthquake (and the disasters) the deniers who were swallowed up by the earth, i.e. the people of Lot who were destroyed by being swallowed up by the earth and also by a rain of stones? (Their messengers (from Allah) came unto them with proofs) with commands and prohibitions as well as signs, but they refused to believe in them and Allah destroyed them. (So Allah surely wronged them not) by destroying them, (but they did wrong themselves) through disbelief and giving the lie to the prophets.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱلْمُؤْتَفِكَاتِ } وهُم قَومُ لُوطٍ إِئتَفكَتْ بِهِم الأَرضُ معناهُ إنفكتْ بِهِم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَ } يصر المنافقون على النقاق والشقاق و { لَمْ يَأْتِهِمْ نَبَأُ } أي: خبر إهلاك القوم { ٱلَّذِينَ } مضوا { مِن قَبْلِهِمْ } كيف يهلكهم الله بظلمهم وذنوبهم مثل { قَوْمِ نُوحٍ } كيف استؤصلوا بالطوفان { وَعَادٍ } بالريح { وَثَمُودَ } بالرجفة { وَقَوْمِ إِبْرَٰهِيمَ } بالبعوض { وَأَصْحَـٰبِ مَدْيَنَ } أي: قوم شعيب أُهلكوا بالنار النازلة عليهم من السماء يوم الظلة { وَٱلْمُؤْتَفِكَـٰتِ } قرى قوم لوط هلكوا بالزلزلة وإمطار الأحجار إلى حيث يجعل عاليها سافلها، كل من أولئك الهالكين { أَتَتْهُمْ رُسُلُهُمْ بِٱلْبَيِّنَـٰتِ } الواضحة الدالة على صدقهم ودعواهم فكذبوهم؛ عناداً ومكابرةً، فلحقهم ما لحقهم بشؤم تكذيبهم { فَمَا كَانَ ٱللَّهُ } المصلح لأحوال عباده { لِيَظْلِمَهُمْ } أي: لم تكن من سنته سبحانه الانحراف عن القسط إلى حيث يؤدي إلى الظلم؛ إذ هو سبحانه مستوٍ على العدل القويم { وَلَـٰكِن كَانُوۤاْ أَنْفُسَهُمْ يَظْلِمُونَ } [التوبة: 70] بالخروج عن مقتضى العدل الإلهي الموضوع، فيهم من قبل الحق بنيابة رسله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:42",
      "similarity": 0.5467742815018202
    },
    {
      "verse": "14:9",
      "similarity": 0.39124440147515704
    },
    {
      "verse": "40:31",
      "similarity": 0.35371823217475895
    },
    {
      "verse": "11:95",
      "similarity": 0.3468767408279421
    },
    {
      "verse": "29:38",
      "similarity": 0.32472373718259334
    }
  ]
}