{
  "chapter": "التوبة",
  "text": "والمؤمنون والمؤمنت بعضهم اولياء بعض يامرون بالمعروف وينهون عن المنكر ويقيمون الصلوة ويؤتون الزكوة ويطيعون الله ورسوله او۟لئك سيرحمهم الله ان الله عزيز حكيم",
  "translations": [
    {
      "translation": "The men and women of the muminun are friends of one another. They command what is right and forbid what is wrong, and establish salat and pay zakat, and obey Allah and His Messenger. They are the people on whom Allah will have mercy. Allah is Almighty, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, men and women, befriend one another, and enjoin what is right and prohibit what is wrong. They observe their devotional obligations, pay the zakat, and obey God and His Apostle. God will be merciful to them, for God is all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers, both men and women, are allies of one another. They enjoin good, forbid evil, establish Prayer, pay Zakah, and obey Allah and His Messenger. Surely Allah will show mercy to them. Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers, both male and female, are each other's guardians. They try to make others do good, prevent them from committing sins, perform their prayers, pay the religious tax, and obey God and His Messenger. God will have mercy on them; He is Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Muslim men and Muslim women are the friends of one another; enjoining right and forbidding wrong, and keeping the prayer established and paying the obligatory charity, obeying Allah and His Noble Messenger; these are upon whom Allah will soon have mercy; indeed Allah is the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers, men and women, are supporters of one another; they enjoin good, and forbid evil; they perform the Salah, and give the Zakah, and obey Allah and His Messenger. Allah will have His mercy on them. Surely, Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) the believing men and the believing women, they are guardians of each other; they enjoin good and forbid evil and keep up prayer and pay the poor-rate, and obey Allah and His Apostle; (as for) these, Allah will show mercy to them; surely Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the believers, the men and the women, are friends one of the other; they bid to honour, and forbid dishonour; they perform the prayer, and pay the alms, and they obey God and His Messenger. Those -- upon them God will have mercy; God is All-mighty, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the believers, men and women, are protecting friends one of another; they enjoin the right and forbid the wrong, and they establish worship and they pay the poor-due, and they obey Allah and His messenger. As for these, Allah will have mercy on them. Lo! Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers, both men and women, are friends to each other; they enjoin what is good and forbid evil, they attend to their prayers and pay the alms and obey God and His Messenger. On these God will have mercy, for God is almighty and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the believing men and believing women are friends one unto anot her: they command that which is reputable and restrain from that which is disreputable, and establish prayer and give the poor-rate and obey Allah and His apostle. Those! Allah will surely show mercy to them; verily Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the faithful, men and women, are comrades of one another: they bid what is right and forbid what is wrong and maintain the prayer, give the zakat, and obey Allah and His Apostle. It is they to whom Allah will soon grant His mercy. Indeed Allah is all-mighty, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Believers, men and women, are protectors one of another: they enjoin what is just, and forbid what is evil: they observe regular prayers, practise regular charity, and obey Allah and His Messenger. On them will Allah pour His mercy: for Allah is Exalted in power, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers, men and women, are Auliya' (helpers, supporters, friends, protectors) of one another, they enjoin (on the people) Al-Ma'ruf (i.e. Islamic Monotheism and all that Islam orders one to do), and forbid (people) from Al-Munkar (i.e. polytheism and disbelief of all kinds, and all that Islam has forbidden); they perform As-Salat (Iqamat-as-Salat) and give the Zakat, and obey Allah and His Messenger. Allah will have His Mercy on them. Surely Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers, both men and women, are guides to each other. They order what is just and forbid what is evil; they establish their prayers and pay the obligatory charity and obey Allah and His Messenger. On these Allah will have mercy. He is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believing men and believing women are friends of one another. They advocate virtue, forbid evil, perform the prayers, practice charity, and obey God and His Messenger. These—God will have mercy on them. God is Noble and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believing men and believing women are allies of one another. They enjoin what is right and forbid what is wrong and establish prayer and give zakah and obey Allah and His Messenger. Those - Allah will have mercy upon them. Indeed, Allah is Exalted in Might and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:71] And the believers, both men and women, are allies of one another; they enjoin decency and forbid   indecency; they observe prayer and pay the alms, and they obey God and His Messenger. Those, God will have mercy on them. Truly God is Mighty, nothing can prevent Him from fulfilling His promise and His threat; Wise, He puts everything in its proper place.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the believers, men and women, are protecting friends one of another) they follow the religion of one another inwardly and outwardly; (they enjoin the right) the confession of Allah's divine unity and the following of Muhammad (pbuh) (and forbid the wrong) disbelief, idolatry and abstention from following Muhammad (pbuh) (and they establish worship) they perform the five daily prayers (and they pay the poor- due) from their wealth, (and they obey Allah and His messenger) in secret and in the open. (As for these, Allah will have mercy on them) He will not punish them. (Lo! Allah is Mighty) in his dominion and sovereignty, (Wise) in His command and ordinance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { وَٱلْمُؤْمِنُونَ } الموقنون بتوحيد الله\n المصدقون لرسله { وَٱلْمُؤْمِنَاتُ } الملحقات بهم\n المتفرعات عليهم { بَعْضُهُمْ } في الأمور الدينية { أَوْلِيَآءُ بَعْضٍ يَأْمُرُونَ بِٱلْمَعْرُوفِ } بالمظاهرة والموالاة { وَيَنْهَوْنَ عَنِ ٱلْمُنْكَرِ } على مقتضى ما وصل إليه من رسلهم { وَيُقِيمُونَ ٱلصَّلاَةَ } المفروضة المصفية لبواطنهم على الميل إلى غير الحق { وَيُؤْتُونَ ٱلزَّكَاةَ } المطهرة لظواهرهم عن الاشتغال بما سواه سبحانه { وَ } بالجلمة: { يُطِيعُونَ ٱللَّهَ } في جميع حالاتهم إطاعة تفويض وتسليم { وَ } ينقادون { رَسُولَهُ } في جميع ما جاء به ودعا إليه { أُوْلَـٰئِكَ } السعداء المفوضون أمورهم إلى الله\n المنقادون لرسوله { سَيَرْحَمُهُمُ ٱللَّهُ } الرقيب عليهم من فضله ولطفه { إِنَّ ٱللَّهَ } المدبر لأمور عباده { عَزِيزٌ } غالب قادر على جميع ما أراد بهم { حَكِيمٌ } [التوبة: 71] متقن في جزائهم حسب أعمالهم واستعدادهم لذلك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { والمؤمنون والمؤمناتُ بعضهم أولياءُ } أي: أصدقاء { بعضٍ } \n هذا في مقابلة قوله: { المنافقون والمنافقات بعضهم من بعض } \n وحض المؤمنين بالوصف بالولاية\n { يأمرون بالمعروف وينهَونَ عن المنكر } ضد ما فعله المنافقون\n { ويُقيمون الصلاة وَيُؤتون الزكاة } ضد قوله: { وَيَقْبِضُون أَيْدِيَهُمْ } \n { ويُطيعون الله ورسوله } في سائر الأمور\n ضد قوله: { نَسُوا اللهَ فَنَسِيَهُمْ } \n { أولئك سيرحمهم الله } لا محالة لأن السين مؤكدة للوقوع\n { إن الله عزيزٌ } غالب على كل شيء\n ولا يمتنع عليه ما يريده\n { حكيم } يضع الأشياء مواضعها\n ثم ذكر ما أعد لهم فقال: { وَعَدَ اللَّهُ المؤمنين والمؤمنات جناتٍ تجري من تحتها الأنهارُ خالدين فيها ومساكن طيبةً } أي: تستطيبها النفس\n أو يطيب فيها العيش\n وفي الحديث:\n \" إنها قصور من اللؤلؤ والزبرجد والياقوت الأحمر \"\n \nوفي حديث آخر:\n \" إنَّ في الجنَّة غُرفاً يُرى ظَاهِرُها من بَاطنِها وباطنها مِنْ ظَاهِرهَا\n أَعَدَّها اللَّهُ لِمَنْ أَطعَمَ الطَّعَام\n وأَلانَ الكَلامَ\n وبذَل السَّلام\n وتَابَعَ الصِّيام\n وصلَّى باللَّيلِ والناس نِيامٌ \"\n \nوذلك { في جنات عَدنْ } \n أي: إقامةٍ وخلود\n وعنه ـ عليه الصلاة والسلام ـ: \" جنات عدن: دار الله\n التي لم ترها عين\n ولا تخطر على قلب بشر\n لا يسكنها غير ثلاث: النبيون\n والصديقون\n والشهداء\n يقول الله تعالى: { طوبى لمن دخلك } قاله البيضاوي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:41",
      "similarity": 0.6031101939830064
    },
    {
      "verse": "3:104",
      "similarity": 0.5071341917070272
    },
    {
      "verse": "3:114",
      "similarity": 0.49261957335566803
    },
    {
      "verse": "3:110",
      "similarity": 0.47853753276673855
    },
    {
      "verse": "24:56",
      "similarity": 0.4420895143878889
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/9:71.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/9:71.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/9:71.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}