{
  "chapter": "التوبة",
  "text": "وعد الله المؤمنين والمؤمنت جنت تجرى من تحتها الانهر خلدين فيها ومسكن طيبة فى جنت عدن ورضون من الله اكبر ذلك هو الفوز العظيم",
  "translations": [
    {
      "translation": "Allah has promised the men and women of the muminun Gardens with rivers flowing under them, remaining in them timelessly, for ever, and fine dwellings in the Gardens of Eden. And Allah's good pleasure is even greater. That is the great victory.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has promised men and women who believe gardens with streams of running water where they will abide for ever, and beautiful mansions in the Garden of Eden, and the blessings of God above all. That will be happiness supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised the believing men and believing women Gardens beneath which rivers flow. They shall abide in it. There are delightful dwelling places for them in the Gardens of Eternity. They shall, above all, enjoy the good pleasure of Allah. That is the great achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has promised the believers gardens wherein streams flow and wherein they will live forever in the excellent mansions of the garden of Eden. What is more important than all this for them is that God is pleased with them. Such is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised the Muslim men and Muslim women, Gardens beneath which rivers flow – they will abide in it forever – and pure dwellings in Gardens of everlasting stay; and the greatest (reward) is Allah’s pleasure; this is the supreme success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised the believers -- men and women, -- Gardens under which rivers flow to dwell therein forever, and beautiful mansions in gardens of `Adn (Eden; Paradise). But the greatest bliss is the good pleasure of Allah. That is the supreme success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised to the believing men and the believing women gardens, beneath which rivers flow, to abide in them, and goodly dwellings in gardens of perpetual abode; and best of all is Allah's goodly pleasure; that is the grand achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has promised the believers, men and women, gardens underneath which rivers flow, forever therein to dwell, and goodly dwelling-places in the Gardens of Eden; and greater, God's good pleasure; that is the mighty triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah promiseth to the believers, men and women, Gardens underneath which rivers flow, wherein they will abide - blessed dwellings in Gardens of Eden. And - greater (far)! - acceptance from Allah. That is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has promised the believers, both men and women, Gardens through which rivers flow, wherein they will abide, and fine dwelling places in Gardens of eternity. But the good pleasure of God is greater still. That is the supreme achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath promised the believing men and believing women Gardens whereunder rivers flow, wherein they shall be abiders, and goodly dwellings in the Everlasting Gardens --and goodwill from Allah is the greatest ofall--that! it is the achievement supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised the faithful, men and women, gardens with streams running in them, to remain in them [forever], and good dwellings in the Gardens of Eden. Yet Allah’s pleasure is greater [than all these]; that is the great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath promised to Believers, men and women, gardens under which rivers flow, to dwell therein, and beautiful mansions in gardens of everlasting bliss. But the greatest bliss is the good pleasure of Allah: that is the supreme felicity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised to the believers -men and women, - Gardens under which rivers flow to dwell therein forever, and beautiful mansions in Gardens of 'Adn (Eden Paradise). But the greatest bliss is the Good Pleasure of Allah. That is the supreme success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised the believing men and women gardens underneath which rivers flow, in which they shall live for ever. Goodly mansions in the Gardens of Eden, and the pleasure from Allah which is greater. That is the greatest winning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God promises the believers, men and women, gardens beneath which rivers flow, abiding therein forever, and fine homes in the Gardens of Eden. But approval from God is even greater. That is the supreme achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised the believing men and believing women gardens beneath which rivers flow, wherein they abide eternally, and pleasant dwellings in gardens of perpetual residence; but approval from Allah is greater. It is that which is the great attainment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:72] God has promised the believers, both men and women, Gardens underneath which rivers flow, to abide therein, and blessed dwellings in the Gardens of Eden, for residence, and beatitude from God is greater, is superior to all of that. That is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah promiseth to the believers, men and women, Gardens beneath which) beneath its tress and habitations (rivers) rivers of wine, water, honey and milk (flow, wherein they will abide) in Paradise (blessed dwellings) seemly dwellings which Allah has made fragrant with musk and sweet basil; it is also said that (blessed dwellings) means: beautiful dwellings; and it is said that this means: dwellings filled with people (in Gardens of Eden) a high degree. (And greater (far)! acceptance from Allah) the good pleasure of Allah is greater than that which they are in. (That) which I have mentioned (is the Supreme Triumph) abounding safety.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِي جَنَّاتِ عَدْنٍ } معناه خُلدٌ وإِقَامةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"in the Gardens of 'Adan,\" means eternity and establishment.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وعد الله المُؤمنين والمؤمنات جنات تجري من تحتها الأنهار } وهي جنات النفوس { ومساكن طيبة } مقامات أرباب التوكل في جنات الأفعال بدليل قوله تعالى: { وَرِضْوَانٌ مِّنَ ٱللَّهِ أَكْبَرُ } [التوبة\n الآية: 72]\n فإن الرضوان من جنات الصفات { ذلك } أي الرضوان { هو الفوز العظيم } لكرامة أهله عند الله وشدّة قربهم منه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَعَدَ ٱللَّهُ ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَاتِ جَنَّاتٍ } منتزهات من العلم والعين والحق { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } أي: أنهار المعارف والمكاشفات المتجددة حسب تجددات التجليات الإلهية { خَالِدِينَ فِيهَا } أبداً لا يتحولون عنها أصلاً { وَمَسَاكِنَ طَيِّبَةً } أي: مقراً في مقام التوحيد\n خالياً عن وصمة الكثرة\n طاهراً عن لوث السّوى والأغيار مطلقاً { فِي جَنَّاتِ عَدْنٍ وَ } بالجملة: { رِضْوَانٌ } وقبول { مِّنَ ٱللَّهِ } المستوي على العدل القويم\n بحيث لا يسخط لهم أصلاً\n لتحققهم بمقام التخلق بأخلاقه سبحانه\n بحيث لا يبقى لهم شائبة انحراف عن صراطه المستقيم الذي هو صراط الله الأقوم الأعدل { أَكْبَرُ } من جميع ما ذكر من قبل من المدرجات العليَّة { ذٰلِكَ } الرضا من الله\n والقبول من جانبه { هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ } [التوبة: 72] واللطف الجسيم لأرباب الولاء\n الواصلين إلى مرتبة الفناء فيه سبحانه والبقاء ببقائه\n لذلك وعدوا من عنده بما لا يمكن التعبير عن كنهه إلا كوشف به وشوهد\n\n\n{ يٰأَيُّهَا ٱلنَّبِيُّ } الهادي لعباد الله إلى تلك المرتبة بإذن الله { جَاهِدِ ٱلْكُفَّارَ } المتمردين على الإطاعة الانقياد لإرشادك وتكميلك { وَٱلْمُنَافِقِينَ } الذين يحليون ويخدعون معك في إظهار الإيمان",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال: ومرجع العطف فيها ـ أي: في قوله: { ومساكن طيبة } ـ يحتمل أن يكون لتعدد الموعود لكل واحد له\n أي: فكل مؤمن ومؤمنة له جنات ومساكن\n أو للجميع على سبيل التوزيع\n أي: فالجنات والمساكن معدة للجميع\n ثم يقسمونها على حسب سعيهم في الدنيا\n أو إلى تغاير وصفه ـ أي: الموعود ـ فكأنه وصفه أولاً بأنه جنس ما هو أبهى الأماكن التي يعرفونها لتميل إليه طبائعهم أول ما يقرع أسماعهم\n ثم وصفه بأنه محفوف بطيب العيش\n معرى عن شوائب الكدرات التي لا تخلو عن شيء منها أماكن الدنيا\n وفيها ما تشتهيه الأنفس وتلذ الأعين\n ثم وصفه بأنه دار إقامة وثبات في جوار رب العالمين\n لا يعتريهم فيها فناء ولا تغيير\n ثم وعدهم بما هو أكبر من ذلك فقال: { ورضوانٌ من الله أكبرُ } لأنه المَبدأ لكل سعادة وكرامة\n والمؤدي إلى نيل الوصول والفوز باللقاء\n وعنه صلى الله عليه وسلم:\n \" إنَّ اللَّهَ تعالى يَقُولُ لأَهْلِ الجَنَّةِ: هَلْ رَضيتُم؟ \" \nفَيَقُولونَ: وَما لَنَا لا نَرضى وَقَد أعطيتَنا ما لم تُعطِ أحداً مَنْ خَلقِكَ\n فيَقُول: أَنَا أُعطِيكُم أفضل مَنْ ذَلِكَ\n قالوا: أَيّ شَيء أَفضَلُ مَنْ ذلِكَ؟ قال:\n \" \" أُحِلَ عَلَيكُم رِضوَاني فَلاَ أسخَطُ عَلَيكُم أَبَدا \" \n{ ذلك } أي: الرضوان\n أو جميع ما تقدم\n { هو الفوزُ العظيم } الذي تستحقر دونه الدنيا وما فيها\n\nهـ\n الإشارة: قد أعد الله لأهل الإيمان الحقيقي الذين بذلوا مهجهم وأموالهم في مرضاته\n جنات المعارف\n تجري من تحت أفكارهم أنهار العلوم والحِكَم\n ومساكن طيبة\n وهي: عكوف أرواحهم في الحضرة\n متلذذين بحلاوة الفكرة والنظرة\n في محل المشاهدة والمكالمة\n والمساررة والمناجاة\n ورضوان من الله\n الذي هو نعيم الأرواح\n أكبر من كل شيء لأن نعيم الأرواح أجل وأعظم من نعيم الأشباح\n حتى أن المقربين ليضحكون على أهل اليمين\n حين يرونهم يلعبون مع الولدان والحور\n كما ذكر الغزالي\n وأما المقربون فيشاركونهم في ذلك\n ويزيدون عليهم بلذة الشهود\n قال القشيري\n عند قوله تعالى:\n[يس: 55]: إنه لا تنافي بين اشتغالهم بلذاتهم مع أهليهم وبين شهود أمرهم\n كما أنهم اليومَ مستلذون بمعرفته بأي حالةٍ هم فيها\n ولا يَقْدَحُ اشتغالهم بحُظُوظِهِم في معارفهم\n انتهى لفظه\n وهو حسن\n والله تعالى أعلم\n ثم أمر نبيه بالإغلاظ على المنافقين\n فقال: { يٰأَيُّهَا ٱلنَّبِيُّ جَاهِدِ ٱلْكُفَّارَ وَٱلْمُنَافِقِينَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "61:12",
      "similarity": 0.8428139824887467
    },
    {
      "verse": "20:76",
      "similarity": 0.6894196904833447
    },
    {
      "verse": "98:8",
      "similarity": 0.6616706494773278
    },
    {
      "verse": "16:31",
      "similarity": 0.6531457931204647
    },
    {
      "verse": "9:89",
      "similarity": 0.551841910285058
    }
  ]
}