{
  "chapter": "التوبة",
  "text": "يايها النبى جهد الكفار والمنفقين واغلظ عليهم وماوىهم جهنم وبئس المصير",
  "translations": [
    {
      "translation": "O Prophet, do jihad against the kafirun and hypocrites and be harsh with them. Their shelter will be Hell. What an evil destination!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Strive, O Prophet, against the unbelievers and the hypocrites, and deal with them firmly. Their final abode is Hell: And what a wretched destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Strive against the unbelievers and the hypocrites, and be severe to them. Hell shall be their abode; what an evil destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prophet, fight the unbelievers and hypocrites vehemently for the cause of God. Their dwelling is hell, a terrible destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Herald of the Hidden! Fight against the disbelievers and the hypocrites, and be stern with them; and their destination hell; and what an evil place to return!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Strive hard against the disbelievers and the hypocrites, and be harsh against them, their abode is Hell, -- and worst indeed is that destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! strive hard against the unbelievers and the hypocrites and be unyielding to them; and their abode is hell, and evil is the destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, struggle with the unbelievers and hypocrites, and be thou harsh with them; their refuge is Gehenna -- an evil homecoming!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Strive against the disbelievers and the hypocrites! Be harsh with them. Their ultimate abode is hell, a hapless journey's end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, strive against those who deny the truth and the hypocrites, and be firm against them. Their abode shall be Hell: an evil destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! strive hard against the infidels and the hypocrites; and be severe unto them. And their resort is Hell--a hapless destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Wage jihad against the faithless and the hypocrites, and be severe with them. Their refuge shall be hell, and it is an evil destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! strive hard against the unbelievers and the Hypocrites, and be firm against them. Their abode is Hell,- an evil refuge indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet (Muhammad SAW)! Strive hard against the disbelievers and the hypocrites, and be harsh against them, their abode is Hell, - and worst indeed is that destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, struggle with the unbelievers and the hypocrites and be harsh with them. Gehenna shall be their refuge an evil arrival.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Strive against the disbelievers and the hypocrites, and be stern with them. Their abode is Hell—what a miserable destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, fight against the disbelievers and the hypocrites and be harsh upon them. And their refuge is Hell, and wretched is the destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:73] O Prophet, struggle against the disbelievers, with the sword, and the hypocrites, with words and [definitive] arguments, and be harsh with them, through rebuke and aversion [towards them]; for their abode will be Hell, an evil journey’s end, [an evil] resort it is!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلمّا أشعر قوله تعالى في الآية السابقة { وعد الله المنافقين والمنافقات والكفار نار جهنم خالدين فيها هي حسبهم ولعنهم الله ولهم عذاب مقيم } \\[ التوبة : 68 \\]. بأنّ لهم عذابين عذاباً أخروياً وهو نار جهنم ، تعيَّن أنّ العذاب الثاني عذاب دنيوي وهو عذاب القتل ، فلمّا أعقب ذلك بشنائع المنافقين وبضرب المثل لهم بالأمم البائدة ، أمر نبيئَهُ بجهاد المنافقين وهذا هو الجهاد الذي أنذروا به في سورة الأحزاب ( 60 ، 61 ) في قوله : { ثم لا يجاورونك فيها إلا قليلاً ملعونين أينما ثقفوا أخذوا وقتلوا تقتيلاً } فبعد أن أنذرهم الله بذلك فلم يرتدعوا ومضى عليهم من المدّة ما كُشفت فيه دخيلتُهم بما تكرّر منهم من بوادر الكفر والكيد للمسلمين ، أنجز الله ما أنذرهم به بأن أمر رسوله بجهادهم . والجهاد القتال لنصر الدين ، وتقدّم في قوله تعالى : { يجاهدون في سبيل الله ولا يخافون لومة لآئم } في سورة العقود ( 54 ).وقُرن المنافقون هنا بالكفار : تنبيهاً على أنّ سبب الأمر بجهاد الكفار قد تحقّق في المنافقين ، فجهادهم كجهاد الكفار ، ولأنّ الله لمّا قرنهم في الوعيد بعذاب الآخرة إذ قال : { وعد الله المنافقين والمنافقات والكفار نار جهنم } \\[ التوبة : 68 \\] وأومأ قوله هنالك بأنّ لهم عذاباً آخرَ ، لا جرم جَمعَهم عند شرع هذا العذاب الآخرِ لهم .فالجهاد المأمور للفريقين مختلف ، ولفظ ( الجهاد ) مستعمل في حقيقتِه ومجازه . وفائدة القرن بين الكفّار والمنافقين في الجهاد : إلقاء الرعب في قلوبهم ، فإنّ كلّ واحد منهم يخشى أن يظهر أمره فيعامَلَ معاملة الكفار المحاربين فيكون ذلك خاضداً شوكتَهم .وأمّا جهادهم بالفعل فمتعذر ، لأنّهم غير مظهرين الكفر ، ولذلك تأوّل أكثر المفسّرين الجهادَ بالنسبة إلى المنافقين بالمقاومة بالحجّة وإقامة الحدود عند ظهور ما يقتضيها ، وكان غالبُ من أقيم عليه الحدّ في عهد النبوءة من المنافقين . وقال بعض السلف جهادهم ينتهي إلى الكشر في وجوههم . وحملها الزجّاج والطبري على ظاهر الأمر بالجهاد ، ونسبه الطبري إلى عبد الله بن مسعود ، ولكنّهما لم يأتيا بمقنع من تحقيق المعنى .وهذه الآية إيذان للمنافقين بأنّ النفاق يوجب جهادهم قطعاً لشأفتهم من بين المسلمين ، وكان رسول الله صلى الله عليه وسلم يَعلمهم ويعرّفهم لحذيفةَ بن اليَمان ، وكان المسلمون يعرفون منهم مَن تكرّرت بوادر أحواله ، وفلتات مقاله . وإنّما كان النبي ممسكاً عن قتلهم سَدّا لذريعة دخول الشكّ في الأمان على الداخلين في الإسلام كما قال لعُمر : «لا يتحدّث الناس أنّ محمّداً يقتل أصحابه» لأنّ العامّة والغائبين عن المدينة لا يَبْلغون بعلمهم إلى معرفة حقائق الأمور الجارية بالمدينة ، فيستطيع دعاة الفتنة أن يشوّهوا الأعمال النافعة بما فيها من صورة بشيعة عند من لا يعلم الحقيقة ، فلمّا كثر الداخلون في الإسلام واشتهر من أمان المسلمين ما لا شكّ معه في وفاء المسلمين ، وشاع من أمر المنافقين وخيانتهم ما تسامعتْه القبائل وتحقّقه المسلم والكافر ، تمحّضت المصلحة في استئصال شافتهم ، وانتفت ذريعة تطرّق الشكّ في أمان المسلمين ، وعلم الله أنّ أجل رسوله عليه الصلاة والسلام قد اقترب ، وأنّه إن بقيت بعده هذه الفئة ذات الفتنة تفاقم أمرها وعسر تداركها ، واقتدى بها كلّ من في قلبه مرض ، لا جرم آذنهم بحرب ليرتدعوا ويقلعوا عن النفاق .والذي يوجب قتالهم أنّهم صرّحوا بكلمات الكفر ، أي صرّح كلّ واحد بما يدلّ على إبطانه الكفر وسمعها الآخرون فرضوا بها ، وصدرت من فريق منهم أقوال وأفعال تدلّ على أنّهم مستخفون بالدين ، وقد توفّي رسول الله صلى الله عليه وسلم بقرب نزول هذه الآية . ولعلّ من حكمة الإعلام بهذا الجهاد تهيئةَ المسلمين لِجهاد كلّ قوم ينقضون عُرى الإسلام وهم يزعمون أنّهم مسلمون ، كما فعل الذين منعوا الزكاة وزعموا أنّهم لم يكفروا وإنّما الزكاة حقّ الرسول في حياته ، وما ذلك إلاّ نفاقٌ من قادَتهم اتَّبعه دَهماؤهم ، ولعلّ هذه الآية كانت سبباً في انزجار معظم المنافقين عن النفار وإخلاصِهم الإيمانَ كما ورد في قصّة الجُلَاس بن سُويد . وكان قد كفَى الله شرّ متولّي كِبْر النفاق عبدِ اللَّه بننِ أبي بننِ سَلول بموته فكان كلّ ذلك كافياً عن إعمال الأمرِ بجهادهم في هذه الآية { وكفى الله المؤمنين القتال } \\[ الأحزاب : 25 \\].وهذه الآية تدلّ على التكفير بما يدلّ على الكفر من قائله أو فاعله دلالةً بيّنة ، وإن لم يكن أعلن الكفر .{ واغلظ عليهم } أمر بأنْ يكون غليظاً معهم . والغلظة يأتي معناها عند قوله : { وليجدوا فيكم غلظة } في هذه السورة ( 123 ).وإنّما وجه هذا الأمر إلى الرسول عليه الصلاة والسلام لأنّه جُبل على الرحمة فأمر بأن يتخلّى عن جبلّته في حقّ الكفار والمنافقين وأن لا يغضي عنهم كما كان شأنه من قبل .وهذه الآية تقتضي نسخ إعطاء الكفارِ المؤلّفةِ قلوبهم على الإسلام وإنّما يبقى ذلك للداخلين في الإسلام حديثاً .وجملة : وبئس المصير } تذييل . وتقدّم نظيره مرات . والمأوى ما يأوي إليه المرء من المكان ، أي يرجع إليه .والمصير المكان الذي يصير إليه المرء ، أي يرجع فالاختلاف بينه وبين المأوى بالاعتبار ، والجمع بينهما هنا تفنّن .\n\n",
      "translations": [
        {
          "translation": "(O Prophet! Strive against the disbelievers) with the sword (and the hypocrites) with words! (Be harsh) be tough (with them) with both parties with words and actions. (Their ultimate abode is hell) their destiny is hell, (a hapless journey's end) they shall come to.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يٰأَيُّهَا ٱلنَّبِيُّ جَاهِدِ ٱلْكُفَّارَ وَٱلْمُنَافِقِينَ } قال زيدُ بن علي عليهما السَّلام معناهُ جَاهدِ الكفارَ بالسَّيفِ\n والمُنافقينَ: بالحُدُودِ معناهُ أقِم عَليهم حُدودَ الله تَعالى\n\n",
      "translations": [
        {
          "translation": "\nThe saying of the Most High: {O Prophet, strive against the disbelievers and the hypocrites} Zayd ibn `Ali, may Allah be pleased with him, said: Its meaning is \"to strive against the disbelievers with the sword.\"\n The hypocrites: with its meaning that Allah has set boundaries for them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وهم في سرهم وباطنهم على شركهم وكفرهم الأصلي متقررون ثابتون { وَ } بعدما أصروا على نفاقهم وشقاقهم { ٱغْلُظْ عَلَيْهِمْ } حسب إصرارهم وإعراضهم { وَ } لا تبال بهم\n { مَأْوَاهُمْ } ومنقلبهم { جَهَنَّمُ } العبد والخذلان في الدنيا والآخرة { وَبِئْسَ ٱلْمَصِيرُ } [التوبة: 73] مصير أولئك المحرومين المطرودين عن ساحة عز القبول\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { يا أيها النبيُّ جاهد الكفار } بالسيف\n { والمنافقين } باللسان بإلزام الحجة وبإقامة الحدود ما لم يظهر عليهم ما يدل على كفرهم\n فإن ظهر عليهم ذلك فحكمهم كحكم الزنديق\n فيقتل على المشهور\n { واغْلظْ عليهم } بالقول والفعل\n إن استوجبوا ذلك\n ولا تراقبهم\n { ومأواهم جهنُم وبئس المصير } أي: المرجع\n مصيرهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "66:9",
      "similarity": 1.0000000000000002
    },
    {
      "verse": "9:123",
      "similarity": 0.49366482023370545
    },
    {
      "verse": "67:6",
      "similarity": 0.4395525381872514
    },
    {
      "verse": "31:24",
      "similarity": 0.4387552633439822
    },
    {
      "verse": "24:57",
      "similarity": 0.4307236601973984
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009073.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009073.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:73.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}