{
  "chapter": "التوبة",
  "text": "يايها النبى جهد الكفار والمنفقين واغلظ عليهم وماوىهم جهنم وبئس المصير",
  "translations": [
    {
      "translation": "Strive, O Prophet, against the unbelievers and the hypocrites, and deal with them firmly. Their final abode is Hell: And what a wretched destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Strive against the unbelievers and the hypocrites, and be severe to them. Hell shall be their abode; what an evil destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prophet, fight the unbelievers and hypocrites vehemently for the cause of God. Their dwelling is hell, a terrible destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Herald of the Hidden! Fight against the disbelievers and the hypocrites, and be stern with them; and their destination hell; and what an evil place to return!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Strive hard against the disbelievers and the hypocrites, and be harsh against them, their abode is Hell, -- and worst indeed is that destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! strive hard against the unbelievers and the hypocrites and be unyielding to them; and their abode is hell, and evil is the destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, struggle with the unbelievers and hypocrites, and be thou harsh with them; their refuge is Gehenna -- an evil homecoming!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Strive against the disbelievers and the hypocrites! Be harsh with them. Their ultimate abode is hell, a hapless journey's end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, strive against those who deny the truth and the hypocrites, and be firm against them. Their abode shall be Hell: an evil destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! strive hard against the infidels and the hypocrites; and be severe unto them. And their resort is Hell--a hapless destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Wage jihad against the faithless and the hypocrites, and be severe with them. Their refuge shall be hell, and it is an evil destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! strive hard against the unbelievers and the Hypocrites, and be firm against them. Their abode is Hell,- an evil refuge indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet (Muhammad SAW)! Strive hard against the disbelievers and the hypocrites, and be harsh against them, their abode is Hell, - and worst indeed is that destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, struggle with the unbelievers and the hypocrites and be harsh with them. Gehenna shall be their refuge an evil arrival.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Strive against the disbelievers and the hypocrites, and be stern with them. Their abode is Hell—what a miserable destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, fight against the disbelievers and the hypocrites and be harsh upon them. And their refuge is Hell, and wretched is the destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:73] O Prophet, struggle against the disbelievers, with the sword, and the hypocrites, with words and [definitive] arguments, and be harsh with them, through rebuke and aversion [towards them]; for their abode will be Hell, an evil journey’s end, [an evil] resort it is!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(O Prophet! Strive against the disbelievers) with the sword (and the hypocrites) with words! (Be harsh) be tough (with them) with both parties with words and actions. (Their ultimate abode is hell) their destiny is hell, (a hapless journey's end) they shall come to.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يٰأَيُّهَا ٱلنَّبِيُّ جَاهِدِ ٱلْكُفَّارَ وَٱلْمُنَافِقِينَ } قال زيدُ بن علي عليهما السَّلام معناهُ جَاهدِ الكفارَ بالسَّيفِ\n والمُنافقينَ: بالحُدُودِ معناهُ أقِم عَليهم حُدودَ الله تَعالى\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلنَّبِيُّ } الهادي لعباد الله إلى تلك المرتبة بإذن الله { جَاهِدِ ٱلْكُفَّارَ } المتمردين على الإطاعة الانقياد لإرشادك وتكميلك { وَٱلْمُنَافِقِينَ } الذين يحليون ويخدعون معك في إظهار الإيمان، وهم في سرهم وباطنهم على شركهم وكفرهم الأصلي متقررون ثابتون { وَ } بعدما أصروا على نفاقهم وشقاقهم { ٱغْلُظْ عَلَيْهِمْ } حسب إصرارهم وإعراضهم { وَ } لا تبال بهم؛ { مَأْوَاهُمْ } ومنقلبهم { جَهَنَّمُ } العبد والخذلان في الدنيا والآخرة { وَبِئْسَ ٱلْمَصِيرُ } [التوبة: 73] مصير أولئك المحرومين المطرودين عن ساحة عز القبول\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}