{
  "chapter": "التوبة",
  "text": "يحلفون بالله ما قالوا۟ ولقد قالوا۟ كلمة الكفر وكفروا۟ بعد اسلمهم وهموا۟ بما لم ينالوا۟ وما نقموا۟ الا ان اغنىهم الله ورسوله من فضله فان يتوبوا۟ يك خيرا لهم وان يتولوا۟ يعذبهم الله عذابا اليما فى الدنيا والءاخرة وما لهم فى الارض من ولى ولا نصير",
  "translations": [
    {
      "translation": "They swear by Allah that they said nothing, but they definitely spoke the word of kufr and returned to kufr after their Islam. They planned something which they did not achieve and they were vindictive for no other reason than that Allah and His Messenger had enriched them from His bounty. If they were to make tawba, it would be better for them. But if they turn away, Allah will punish them with a painful punishment in this world and the Next World, and they will not find any protector or helper on the earth.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by God: \"We never said this.\" But they surely said words disbelieving the truth, and they turned unbelievers after having come to faith, and designed what they could not accomplish. They did it only out of vengeance for God and His Apostle had enriched them by their grace. So, if they repent it is better for them. If they turn away then God would afflict them with painful punishment in this world and the next; and none will they have on the face of the earth to protect or help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah that they said nothing blasphemous whereas they indeed blasphemed, and fell into unbelief after believing, and also had evil designs which they could not carry into effect. They are spiteful against Muslims for no other reason than that Allah and His Messenger have enriched them through His bounty! So, if they repent, it will be to their own good. But if they turn away, Allah will sternly punish them in this world and in the Hereafter. None in the world will be able to protect or help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (the hypocrites) swear by the Name of God (to make others believe in what they are saying). They have spoken the testimony of disbelief and have then turned back to disbelief. They have made unsuccessful attempts to cause trouble. There is no other reason for their ungratefulness except that God and His Messenger enriched them through their favors. If they repent, it will be better for them, but if they turn away (from the faith), God will make them suffer a painful punishment both in this life and in the life hereafter. They will find no guardian nor any helper in the land.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they swear by Allah that they did not say it; whereas indeed they had certainly uttered the words of disbelief, and after having entered Islam turned disbelievers and had wished for what they did not get; and what annoyed them except that Allah, and His Noble Messenger, made them prosperous with His grace? So if they repent, it is better for them; and if they turn away, Allah will afflict them with a painful punishment – in this world and the Hereafter; and they will have neither a protector nor any supporter in the entire earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah that they said nothing (bad), but really they said the word of disbelief, and they disbelieved after accepting Islam, and they resolved that (plot) which they were unable to carry out, and they could not find any cause to do so except that Allah and His Messenger had enriched them of His bounty. If then they repent, it will be better for them, but if they turn away; Allah will punish them with a painful torment in this worldly life and in the Hereafter. And there is none for them on earth as a protector or a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah that they did not speak, and certainly they did speak, the word of unbelief, and disbelieved after their Islam, and they had determined upon what they have not been able to effect, and they did not find fault except because Allah and His Apostle enriched them out of His grace; therefore if they repent, it will be good for them; and if they turn back, Allah will chastise them with a painful chastisement in this world and the hereafter, and they shall not have in the land any guardian or a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by God that they said nothing, but they indeed said the word of unbelief and disbelieved, after they had surrendered. They purposed what they never attained to, and they took revenge only that God enriched them, and His Messenger, of His bounty. So if they repent it will be better for them; if they turn away, God will chastise them with a painful chastisement in this world and the next; on the earth they have no protector or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah that they said nothing (wrong), yet they did say the word of disbelief, and did disbelieve after their Surrender (to Allah). And they purposed that which they could not attain, and they sought revenge only that Allah by His messenger should enrich them of His bounty. If they repent it will be better for them; and if they turn away, Allah will afflict them with a painful doom in the world and the Hereafter, and they have no protecting friend nor helper in the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by God that they did not, yet they uttered the words of denial of truth after they had accepted Islam. They meditated a plot which they were unable to carry out, and being spiteful was their only response to God, who had enriched them out of His bounty, and to His Messenger. If they repent, it will indeed be better for them. If they turn away, God will punish them with grievous suffering in this world and the Hereafter, and there will be no one on earth to protect or help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah that they said it not, but assuredly they said the word of infidelity and disbelieved after their Profession of Islam and they resolved that to which they could not attain. And they avenged not except for this that Allah and His apostle had enriched them out of His grace. If then they repent, it will be better for them, and if they turn away, Allah will torment them with an afflictive torment in the world and the Hereafter, and theirs shall be on the earth no friend nor helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah that they did not say it. But they certainly did utter the word of unfaith and renounced faith after their Islam. They contemplated what they could not achieve, and they were vindictive only because Allah and His Apostle had enriched them out of His grace. Yet if they repent, it will be better for them; but if they turn away, Allah shall punish them with a painful punishment in this world and the Hereafter, and they shall not find on the earth any guardian or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah that they said nothing (evil), but indeed they uttered blasphemy, and they did it after accepting Islam; and they meditated a plot which they were unable to carry out: this revenge of theirs was (their) only return for the bounty with which Allah and His Messenger had enriched them! If they repent, it will be best for them; but if they turn back (to their evil ways), Allah will punish them with a grievous penalty in this life and in the Hereafter: They shall have none on earth to protect or help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah that they said nothing (bad), but really they said the word of disbelief, and they disbelieved after accepting Islam, and they resolved that (plot to murder Prophet Muhammad SAW) which they were unable to carry out, and they could not find any cause to do so except that Allah and His Messenger had enriched them of His Bounty. If then they repent, it will be better for them, but if they turn away, Allah will punish them with a painful torment in this worldly life and in the Hereafter. And there is none for them on earth as a Wali (supporter, protector) or a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah that they said nothing. Yet they did utter the word of disbelief and disbelieved after they had submitted. They intended what they never attained to, and took revenge only that Allah enriched them, and His Messenger, of His Bounty. If they repent, it will indeed be better for them; but if they turn away, Allah will sternly punish them both in this world and in the Everlasting Life. They have none on earth to protect or help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by God that they said nothing; but they did utter the word of blasphemy, and they renounced faith after their submission. And they plotted what they could not attain. They were resentful only because God and His Messenger have enriched them out of His grace. If they repent, it would be best for them; but if they turn away, God will afflict them with a painful punishment—in this life and in the Hereafter—and they will have on earth no protector and no savior.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah that they did not say [anything against the Prophet] while they had said the word of disbelief and disbelieved after their [pretense of] Islam and planned that which they were not to attain. And they were not resentful except [for the fact] that Allah and His Messenger had enriched them of His bounty. So if they repent, it is better for them; but if they turn away, Allah will punish them with a painful punishment in this world and the Hereafter. And there will not be for them on earth any protector or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:74] They, the hypocrites, swear by God that they said nothing, of the defamation that has reached you [as being] from them; but they did indeed say the word of disbelief and did disbelieve after their submission [to God]: they did indeed manifest disbelief after having manifested submission [to God]. And they purposed that which they never attained, in the way of assassinating the Prophet on the night of al-‘Aqaba, upon his return from Tabūk — there were about ten to twenty of them, and ‘Ammār b. Yāsir struck the faces of their riding camels when they came against him and were thus repulsed; and they were only spiteful, they detested, that God and His Messenger should have enriched them of His bounty, by way of spoils, when they had been in dire need: the meaning is that this was all that they attained from him, which is nothing to be spiteful about. So if they repent, of hypocrisy and believe in you, it will be better for them; but if they turn away, from belief, God will chastise them with a painful chastisement in this world, by having them killed, and in the Hereafter, in the Fire, and they have none on earth as protector, to guard them from Him, or helper, to defend them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلمّا كان معظم ما أخِذ على المنافقين هو كلماتٍ دالّةً على الطعن في الرسول صلى الله عليه وسلم ونحو ذلك من دلائل الكفر وكانوا إذا نُقِل ذلك عنهم تنصّلوا منه بالأيمان الكاذبة ، عُقّبت آية الأمر بجهادهم بالتنبيه على أنّ ما يتنصّلون به تنصلٌ كاذب وأن لا ثِقة بحَلفهم ، وعلى إثبات أنّهم قالوا ما هو صريح في كفرهم . فجملة { يحلفون } مستأنفة استئنافاً بيانياً يثيره الأمر بجهادهم مع مشاهدة ظاهر أحوالهم من التنصّل ممّا نقل عنهم ، إن اعتبر المقصود من الجملة تكذيبهم فِي حلفهم .وقد تكون الجملة في محلّ التعليل للأمر بالجهاد إن اعتبر المقصود منها قوله : { ولقد قالوا كلمة الكفر } وما بعده ، وأن ذلك إنّما أخَّر للاهتمام بتكذيب أيمانهم ابتداء ، وأتِي بالمقصود في صورة جملة حاليَّة . ومعلوم أنّ القيد هو المقصود من الكلام المقيَّد . ويرجّح هذا أنّ معظم ما في الجملة هو شواهد كفرهم ونقضِهم عهد الإسلام ، إذ لو كان المقصود خصوص تكذيبهم فيما حلفوا لاقتُصر على إثبات مقابله وهو { ولقد قالوا كلمة الكفر } ، ولم يكن لما بعده مزيد اتّصال به .وأيّاً ما كان فالجملة مستحقّة الفصل دون العطف .ومفعول ما قالوا محذوف دلّ عليه قوله : { ولقد قالوا كلمة الكفر }.وأكَّد صدور كلمة الكفر منهم ، في مقابلة تأكيدهم نفي صدورها ، بصيغة القَسم ليكون تكذيب قولهم مساوياً لقولهم في التأكيد .وكلمةُ الكفر الكلام الدالّ عليه ، وأصل الكلمة اللفظ الواحد الذي يتركّب منه ومن مثله الكلام المفيد ، وتطلق الكلمة على الكلام إذا كان كلاماً جامعاً موجَزاً كما في قوله تعالى : { كلا إنها كلمة هو قائلها } \\[ المؤمنون : 8 \\] وفي الحديث : « أصدق كلمة قالها شاعر كلمة لبيد : ألا كلّ شيء ما خلا الله باطل »فكلمة الكفر جنس لكلّ كلام فيه تكذيب النبي صلى الله عليه وسلم كما أطلقت كلمة الإسلام على شهادة أن لا إله إلا الله وأنّ محمداً رسول الله . فالكلمات الصادرة عنهم على اختلافها ، ما هي إلاّ أفرادٌ من هذا الجنس كما دلّ عليه إسناد القول إلى ضمير جماعةِ المنافقين . فعن قتادة : لا عِلْمَ لنا بأنّ ذلك من أيّ إذ كان لا خبر يوجب الحجّة ونتوصّل به إلى العلم .وقيل : المراد كلمة صدرت من بعض المنافقين تدلّ على تكذيب النبي صلى الله عليه وسلم فعن عروة بن الزبير ، ومجاهد ، وابن إسحاق أنّ الجُلاَسَ بضم الجيم وتخفيف اللام بنَ سُويد بننِ الصامت قال : لئن كان ما يقول محمد حقّاً لنحن أشرّ من حميرنا هذه التي نحن عليها ، فأخبَر عنه ربيبُه النبي فدعاه النبي وسأله عن مقالته ، فحلف بالله ما قال ذلك ، وقيل : بل نزلت في عبد الله بن أُبي بن سَلُول لقوله الذي حكاه الله عنه بقوله :{ يقولون لئن رجعنا إلى المدينة ليُخْرِجَنّ الأعز منها الأذلّ } \\[ المنافقون : 8 \\] فسعى به رجل من المسلمين فأرسل إليه رسول الله فسأله فجعل يحلف بالله ما قال ذلك .فعلى هذه الروايات يكون إسناد القول إلى ضمير جمععٍ كناية عن إخفاء اسم القائل كما يقال ما بال أقوام يفعلون كذا . وقد فعله واحد ، أو باعتبار قوللِ واحدٍ وسماع البقية فجُعلوا مشاركين في التبعة كما يقال : بنو فلان قتلوا فلاناً وإنّما قتله واحد من القبيلة ، وعلى فرض صحّة وقوع كلمة من واحد معيّن فذلك لا يقتضي أنّه لم يشاركه فيها غيره لأنّهم كانوا يتآمرون على ما يختلقونه . وكان ما يصدر من واحد منهم يتلقفه جلساؤه وأصحابه ويشاركونه فيه .وأمّا إسناد الكفر إلى الجمع في قوله : { وكفروا بعد إسلامهم } فكذلك .ومعنى { بعد إسلامهم } بعد أن أظهروا الإسلام في الصورة ، ولذلك أضيف الإسلام إليهم كما تقدّم في قوله تعالى : { لا تعتذروا قد كفرتم بعد إيمانكم } \\[ التوبة : 66 \\].والهَمّ : نيَّة الفعل سواء فُعل أم لم يفعل .ونوال الشيء حصوله ، أي همّوا بشيء لم يحصّلوه والذي همّوا به هو الفتك برسول الله صلى الله عليه وسلم عند مرجعه من تبوك تواثقَ خمسةَ عشرَ منهم على أن يترصّدوا له في عَقبة بالطريق تحتها واددٍ فإذا اعتلاها ليْلاً يدفعونه عن راحلته إلى الوادي وكان رسول الله صلى الله عليه وسلم سائراً وقد أخذَ عَمَّار بن يَاسِر بخطام راحلته يقودها . وكان حذيفة بن اليمان يسوقها فأحس حذيفة بهم فصاح بهم فهربوا .وجملة : { وما نقموا } عطف على { ولقد قالوا } أي والحال أنّهم ما ينقمون على النبي صلى الله عليه وسلم ولا على دخول الإسلاممِ المدينةَ شيئاً يدعوهم إلى ما يصنعونه من آثار الكراهية والعداوة .والنقْم الامتعاض من الشيء واستنكاره وتقدّم في قوله تعالى : { وما تنقم منا إلا أن آمنا بآيات ربنا } في سورة الأعراف ( 126 ).وقوله : إلا أن أغناهم الله ورسوله من فضله } استثناء تهكّمي . وهو من تأكيد الشيء بما يشبه ضدّه كقول النابغة :ولا عيبَ فيهم غير أنّ سيوفهم ... بهِنَّ فُلُول من قِراع الكتائبونكتته أنّ المتكلّم يظهر كأنّه يبحث عن شيء ينقض حكمَه الخبري ونحوَه فيذكر شيئاً هو من مؤكدات الحكم للإشارة إلى أنّه استقصى فلم يجد ما ينقضه .وإنّما أغناهم الله ورسوله بما جلبه حلول النبي عليه الصلاة والسلام بينهم من أسباب الرزق بكثرة عمل المهاجرين وبوفرة الغنائم في الغزوات وبالأمْن الذي أدخله الإسلام فيهم إذ جعل المؤمنين إخوة فانتفت الضغائن بينهم والثارات ، وقد كان الأوس والخزرج قبل الإسلام أعداء وكانت بينهم حروبٌ تفانَوا فيها قُبيل الهجرة وهي حروب بعاث .والفضل : الزيادة في البذل والسخاء . و { مِن } ابتدائية . وفي جعل الإغناء من الفضل كنايةٌ عن وفرة الشيء المغنَى به لأنّ ذا الفضللِ يعطي الجَزل .وعطف الرسول على اسم الجلالة في فعل الإغناء لأنّه السبب الظاهر المباشر .( 74 ) { فَإِن يَتُوبُواْ يَكُ خَيْراً لَّهُمْ وَإِن يَتَوَلَّوْا يُعَذِّبْهُمُ الله عَذَابًا أَلِيمًا فِى الدنيا والاخرة وَمَا لَهُمْ فِى الارض مِن وَلِيٍّ وَلاَ نَصِيرٍ }.التفريع على قوله : { جاهد الكفار والمنافقين } \\[ التوبة : 73 \\] على عادة القرآن في تعقيب الوعيد بالوعد والعكس فلمّا أمر بجهادهم والغِلظة عليهم وتوعّدهم بالمصير إلى النار ، فرّع على ذلك الإخبارَ بأنّ التوبة مفتوحة لهم وأنَّ تدارك أمرهم في مكنتهم ، لأنّ المقصود من الأمر بجهادهم قطع شافة مضرّتهم أو أن يصلح حالهم .والتوبة هي إخلاصهم الأيمانَ . والضمير يعود إلى الكفّار والمنافقين ، والضمير في { يك } عائد إلى مصدر { يتوبوا } وهو التوبُ .والتولّي : الإعراض والمراد به الإعراض عن التوبة . والعذاب في الدنيا عذاب الجهاد والأسر ، وفي الآخرة عذاب النار .وجيء بفعل { يك } في جواب الشرط دون أن يقال فإن يتوبوا فهو خيرٌ لهم لتأكيد وقوع الخَيْر عند التوبة ، والإيماءِ إلى أنّه لا يحصل الخير إلاّ عند التوبة لأنّ فعل التكوين مؤذن بذلك .وحَذف نون «يكن» للتخفيف لأنّها لسكونها تهيّأت للحذف وحسَّنه وقوع حركة بعدها والحركة ثقيلة فلذلك شاع حذف هذه النون في كلامهم كقوله : { وإن تك حسنة يضاعفها } في سورة النساء ( 40 ).وجملة : وما لهم في الأرض من ولي ولا نصير } عطف على جملة { يعذبهم الله } الخ فتكون جواباً ثانياً للشرط ، ولا يريبك أنّها جملة اسمية لا تصلح لمباشرة أداة الشرط بدون فاء رابطة . لأنّه يغتفر في التوابع ما لا يغتفر في المتبوعات فإنّ حرف العطف كاف في ربط الجملة تبعاً للجملة المعطوف عليها .والمعنى أنّهم إن تولّوا لم يجدوا من ينصرهم مِن القبائل إذ لم يبق من العرب من لم يدخل في الإسلام إلاّ من لا يعبأ بهم عَدداً وعُدداً ، والمراد نفي الولي النافع كما هو مفهوم الولي وأمّا من لا ينفع فهو حبيب وودود وليس بالولي .\n\n",
      "translations": [
        {
          "translation": "(They swear by Allah that they said nothing (wrong)) Jallas Ibn Suwayd swore by Allah that he did not say what 'Amir Ibn Qays said he did, (yet they did say the word of disbelief) the word of the disbelievers because when the Prophet (pbuh) mentioned the defects of the hypocrites and their inward illnesses, Jallas Ibn Suwayd said: \"by Allah, if Muhammad is true in what he says about our brothers, we are worse than asses\". When 'Amir Ibn Qays informed the Prophet (pbuh) Jallas swore by Allah that he did not say this. But Allah gave him the lie and said (yet they did say the word of disbelief, and did disbelieve after their Surrender (to Allah). And they purposed that which they could not attain) they wanted to expel and kill the Messenger without success, (and they sought revenge) they could not find anything wrong with the Prophet (pbuh) and his Companions (only that Allah by His messenger should enrich them of His bounty) through the spoils of war. (If they repent) from disbelief and hypocrisy (it will be better for them) than disbelief and hypocrisy; (and if they turn away) from repentance, (Allah will afflict them with a painful doom in the world and the Hereafter, and they have no protecting friend) who will protect them (nor helper in the earth) to prevent them from that which is wanted with them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن جملة نفاقهم وكفرهم: إنهم { يَحْلِفُونَ بِٱللَّهِ } كذباً وميناً\n إنهم { مَا قَالُواْ } من الطعن في كتاب الله وتكذيب رسوله صلى الله عليه وسلم { وَ } الحال أنهم { لَقَدْ قَالُواْ كَلِمَةَ ٱلْكُفْرِ } أي: كلمة الطعن والتكذيب المستلزم للكفر\n فحلفوا على عدم القول كذباً { وَ } هم في أنفسهم { كَفَرُواْ } بالحق وأعرضوا عنه { بَعْدَ إِسْلاَمِهِمْ } أي: انقيادهم وتسليمهم\n أي: اختاروا الكفر بعدما أظهروا الإسلام { وَ } لا يقتصرون على إظهار الكفر فقط\n بل { هَمُّواْ } وقصدوا { بِمَا لَمْ يَنَالُواْ } من قتبل الرسول صلى الله عليه وسلم والاقتحام عليه بغتة في الليل بلا علم من أصحابه\n او هموا بإخراجه ومن معه من أصحابه من المدينة { وَمَا نَقَمُوۤاْ } وقصدوا إهلاك رسول الله صلى الله عليه وسلم وإخراجه { إِلاَّ أَنْ أَغْنَاهُمُ ٱللَّهُ } أي: أصحاب رسول الله صلى الله عليه وسلم بفتح أبواب الرزق والمكاسب { وَرَسُولُهُ } بإعطاء الغنائم { مِن فَضْلِهِ } ففي مقام الشكر وإظهار المنة ينكرون له\n ويكفرون نعمه وبعدما وقع ما وقع\n\n\n{ فَإِن يَتُوبُواْ } عمَّا صدر عنهم توبة صادرة عن محض الندامة والإخلاص { يَكُ خَيْراً لَّهُمْ } عند الله\n يغفر لهم ويعفوا عن زلتهم { وَإِن يَتَوَلَّوْا } ويعرضوا عن التوبة\n ويصروا على ما هم عليه من الكفر والنفاق { يُعَذِّبْهُمُ ٱللَّهُ } المنتقم منهم { عَذَاباً أَلِيماً } مؤلماً فجيعاً { فِي ٱلدُّنْيَا وَ } بالقتل والسبي والإجلاء والإذلال\n وأنواع العقوبات في { ٱلآخِرَةِ } بأضعاف ما في الدنيا والآفها\n لانحطاطهم عن المرتبة الإنسانية\n وقبول التكاليفات الإلهية المقتضية لإظهار الحكمة والكرامة المودعة في هياكلهم { وَ } إن استظهروا واستنصروا من أوليائهم { مَا لَهُمْ فِي ٱلأَرْضِ } بعد انتشار دين الإسلام في أقطارها { مِن وَلِيٍّ } يعينهم ويولي أمورهم { وَلاَ نَصِيرٍ } [التوبة: 74] ينصرهم من باس الله وعذابه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { يحلفون بالله ما قالوا } \n رُوي: أنه صلى الله عليه وسلم أقام في غزوة تبوك شهرين\n ينزل عليه القرآن\n ويعيب المختلفين فقال الجُلاس بن سُويد: لئن كان ما يقول محمد في إخواننا حقاً لنحن شرٌّ من الحمير\n فبلغ النبي صلى الله عليه وسلم فاستحضره\n فحلف بالله ما قال\n فنزلت\n فتاب الجُلاس\n وحسُنَت توبته\n قال تعالى: { ولقد قالوا كلمة الكفر } \n يعني: ما تقدم من قول الجُلاس\n أو قول ابن أُبيّ: سَمِّن كَلبَك يأكُلك\n أو: { لئن رجعنا إلى المدينة }\n\n\n الآية\n { كفروا بعد إسلامهم } وأظهروا الكفر بعد إظهار الإسلام\n ولم يقل بعد إيمانهم\n لأنهم يقولون بألسنتهم: آمنا\n ولم يدخل في قلوبهم\n { وهَمُّوا بما لم ينالوا } من قتل النبي صلى الله عليه وسلم وهو: أن خمسة عشر منهم توافقوا عند مَرْجِعِه من تبوك\n أن يدفعوه عن راحلته إلى الوادي\n إذا وصل إلى العَقَبة بالليل\n فأخذ عمَّار بن ياسر بخطام راحلته يقودها\n وحُذيفة خلفها يسوقها\n فبينما هم كذلك إذ سمع حُذَيفة تقعقع أخفاف الإبل وقعقعة السلاح\n فقال: إليكم إليكم إليكم يا أعداء الله\n فهربوا\n أو: هموا بإخراجه من المدينة\n أو إخراج المؤمنين\n أو هموا بأن يُتَوجُوا عبد الله بن أُبي\n وإن لم يرض رسول الله صلى الله عليه وسلم\n فلم ينالوا شياً من ذلك\n  { وما نَقَمُوا } أي: وما عابوا وكرهوا { إلا أن أغناهم الله ورسولُهُ من فضله } الذين حقهم أن يشكروا عليه\n وذلك أن اكثر أهل المدينة كانوا محاويج\n في ضَنَكٍ من العيش\n فلما قَدِمَهم رسول الله صلى الله عليه وسلم استغنوا بالغنائم\n وقُتِل للجُلاَس مولى\n فأمر رسول الله صلى الله عليه وسلم بديته اثنى عشر ألفاً\n فأُعطيت له\n فاستغنى\n { فأن يتوبُوا يَكُ خيراً لهم } \n وهذا حمل الجلاس على التوبة\n والضمير يعود على الرجوع المفهوم من التوبة\n { وإن يتولوا } عنك بالإصرار على النفاق\n { يعذبهم الله عذاباً أليماً في الدنيا والآخرة } بالقتل والنار\n { وما لهم في الأرض من وليِّ ولا نصير } ينجيهم من العذاب\n  الإشارة: كفار الخصوصية على القسمين: قسم أظهروا الإنكار على أهلها\n وقسم أبطنوه وأظهروا الوفاق\n ففيهم شبه بأهل النفاق\n فينبغي الإعراض عن الجميع\n والاشتغال بالله عنهم\n وهو جهادهم والإغلاظ عليهم\n فعداوة العدو حقاً هو اشتغالك بمحبة الحبيب حقاً\n وقد تَصْدر عنهم في جانب أهل الخصوصية مقالات ثم ينكرونها\n وقد يَهمُّوا بما لم ينالوا من إذايتهم وقتلهم\n لو قدروا\n والله يتولى الصالحين\n ونزل في ثعلبة بن حاطب\n قوله تعالى: { وَمِنْهُمْ مَّنْ عَاهَدَ ٱللَّهَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:113",
      "similarity": 0.3894491851003225
    },
    {
      "verse": "5:11",
      "similarity": 0.31692343891056557
    },
    {
      "verse": "3:92",
      "similarity": 0.30149583263660656
    },
    {
      "verse": "2:124",
      "similarity": 0.29681865779880684
    },
    {
      "verse": "7:49",
      "similarity": 0.29366161388001877
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009074.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009074.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:74.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}