{
  "chapter": "التوبة",
  "text": "ومنهم من عهد الله لئن ءاتىنا من فضله لنصدقن ولنكونن من الصلحين",
  "translations": [
    {
      "translation": "Among them there were some who made an agreement with Allah: 'If He gives us of His bounty we will definitely give sadaqa and be among the righteous.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them made a covenant with God: \"If You give us in Your bounty we shall give alms and be upright.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them made a covenant with Allah: \"If Allah gives us out of His bounty, we will give alms and act righteously.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them have promised God that if He will favor them, they will certainly spend for His cause and be righteous ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are those who made a covenant with Allah that, “If He gives us by His munificence, we will surely give charity and surely become righteous.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them are some who made a covenant with Allah (saying): \"If He bestowed on us of His bounty, we will verily, give Sadaqah and will be certainly among the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are those of them who made a covenant with Allah: If He give us out of His grace, we will certainly give alms and we will certainly be of the good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some of them have made covenant with God: 'If He gives us of His bounty, we will make offerings and be of the righteous.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them is he who made a covenant with Allah (saying): If He give us of His bounty we will give alms and become of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some among them who pledged themselves to God, saying, \"If God gives us something out of His bounty, we shall certainly give alms and be righteous,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them are some who covenanted With saying: if He giveth of His grace, we will surely give alms and we will surely become of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them are those who made a pledge with Allah: ‘If He gives us out of His grace, we will surely give the zakat and we will surely be among the righteous.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Amongst them are men who made a covenant with Allah, that if He bestowed on them of His bounty, they would give (largely) in charity, and be truly amongst those who are righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them are some who made a covenant with Allah (saying): \"If He bestowed on us of His Bounty, we will verily, give Sadaqah (Zakat and voluntary charity in Allah's Cause) and will be certainly among those who are righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them have made a covenant with Allah, 'If Allah gives to us of His bounty, we will give charity and be of the righteous'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them are those who promised God: “If He gives us of His bounty, we will donate and be among the upright.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are those who made a covenant with Allah, [saying], \"If He should give us from His bounty, we will surely spend in charity, and we will surely be among the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:75] And some of them have made a covenant with God [saying]: ‘If He gives us of His bounty, we will give voluntary alms (la-nassaddaqanna: the original tā’ [of natasaddaqanna] has been assimilated with the sād) and become of the righteous’: this was Tha‘laba b. Hātib, who asked the Prophet (s) to supplicate on his behalf so that God would give him wealth, of which he would give every needy person his due. He [the Prophet] thus supplicated for him and he became wealthy, but stopped attending the Friday prayer and congregational prayers and refused to pay the alms-tax, as God, exalted be He, says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "203 (And of them) i.e. of the hypocrites (is he who made a covenant with Allah) he who swore by Allah, the reference here is to Hatib Ibn Abi Balta'ah ((saying): If He give us of His bounty) the wealth that he has in Historic Syria (We will give alms) for the sake of Allah's religion: we shall give from it what is due to Allah and will use it to keep our ties of kinship (and become of the righteous) of the thankful.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنْهُمْ } أي: من المنافقين { مَّنْ عَاهَدَ ٱللَّهَ لَئِنْ آتَانَا مِن فَضْلِهِ } مالاً\n وأعطانا رزقاً كثيراً { لَنَصَّدَّقَنَّ } منها للفقراء المستحقين { وَلَنَكُونَنَّ } بالبذل والإنفاق\n أداء الشكر { مِنَ ٱلصَّالِحِينَ } [التوبة: 75] الشاكرين المنفقين\n طلباً لمراضاة الله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { ومنهم من عاهد الله } قال: { لئن آتانا من فضله لنصدِّقنّ ولنكونَنَّ من الصالحين } \n وهو ثعلبة بن حاطب\n أتى النبي صلى الله عليه وسلم وقال: ادعُ الله يرزقني مالاً\n فقال له النبي صلى الله عليه وسلم:\n \" يا ثعلبة\n قليلٌ تُؤدي شُكرَهُ خيرٌ من كثير لا تُطيقه \" \nفراجعه\n وقال: والذي بعثك بالحق\n لئن رزقني الله مالاً لأعطين كلَّ ذي حقٍّ حقَّه\n فدعا له\n فاتخذ غنماً\n فَنَمت كما تنمو الدود\n حتى ضاقت بها المدينة\n فنزل وادياً\n وانقطع عن الجماعة والجمعة\n فسأل عنه النبي صلى الله عليه وسلم\n فقيل: كثر ماله حتى لا يسعه وادٍ\n فقال:\n \" يا ويح ثعلبة \"\n \nفبعث له مُصدقين لأخذ الصدقات فاستقبلهما الناس بصدقاتهم\n ومروا بثعلبة فسألاه الصدقة\n وأقرآه الكتابَ الذي فيه الفرائض\n فقال: ما هذه صدقة\n ما هذه إلا أخت الجزية\n فارجعا حتى أرى رأيي\n فنزلت فيه الآية\n فجاء ثلعلبة بالصدقة\n فقال: إن الله منعني أن أقبل منك\n فجعل يحثو التراب على رأسه\n فقال له صلى الله عليه وسلم:\n \" هذا منك فقد أمرتُك فلم تطعني \" \nفقُبض الرسول صلى الله عليه وسلم\n فجاء بها إلى أبي بكر\n فلم يقبلها\n ثم جاء بها إلى عمر في خلافته\n فلم يقبلها منه\n وهلك في زمن عثمان\n بعد أن لم يقبلها منه\n  وهذا معنى قوله: { فلما آتاهم من فضله بخلوا به } أي: منعوا حق الله منعه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:183",
      "similarity": 0.47983789293936135
    },
    {
      "verse": "7:102",
      "similarity": 0.4628271161706473
    },
    {
      "verse": "33:15",
      "similarity": 0.44904831938901146
    },
    {
      "verse": "43:49",
      "similarity": 0.4406795896914918
    },
    {
      "verse": "9:1",
      "similarity": 0.42151585277372616
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009075.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009075.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:75.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}