{
  "chapter": "التوبة",
  "text": "فاعقبهم نفاقا فى قلوبهم الى يوم يلقونه بما اخلفوا۟ الله ما وعدوه وبما كانوا۟ يكذبون",
  "translations": [
    {
      "translation": "so He has punished them by putting hypocrisy in their hearts until the day they meet Him because they failed Allah in what they promised Him and because they lied.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As a consequence of breaking their promise made to God, and telling lies, he filled their hearts with hypocrisy which will last till the day they come before Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He caused hypocrisy to take root in their hearts and to remain therein until the Day they meet Him because they broke their promise with Allah and because they lied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will, for their disregard of their promise and their telling lies, place hypocrisy in their hearts which will not leave them until they face the consequences of their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So following this, Allah put hypocrisy in their hearts until the day when they will meet Him – the result of their breaching the promise made to Allah, and because they lied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He punished them by putting hypocrisy into their hearts till the Day whereon they shall meet Him, because they broke that (covenant) with Allah which they had promised to Him and because they used to tell lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He made hypocrisy to follow as a consequence into their hearts till the day when they shall meet Him because they failed to perform towards Allah what they had promised with Him and because they told lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So as a consequence He put hypocrisy into their hearts, until the day they meet Him, for that they failed God in that they promised Him and they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He hath made the consequence (to be) hypocrisy in their hearts until the day when they shall meet Him, because they broke their word to Allah that they promised Him, and because they lied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He caused hypocrisy to settle in their hearts until the Day of their meeting with Him, because they broke their word to God, and because they lied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He chastised them with setting hypocrisy in their hearts until the Day they shall meet Him, because they kept back from Allah that which they had promised Him, and because they were wont to lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He caused hypocrisy to ensue in their hearts until the day they will encounter Him, because of their going back on what they had promised Allah and because of the lies they used to tell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He hath put as a consequence hypocrisy into their hearts, (to last) till the Day, whereon they shall meet Him: because they broke their covenant with Allah, and because they lied (again and again).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He punished them by putting hypocrisy into their hearts till the Day whereon they shall meet Him, because they broke that (covenant with Allah) which they had promised Him and because they used to tell lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has caused hypocrisy to be in their hearts till the Day they meet Him, because they have changed what they promised Allah and because they were liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He penalized them with hypocrisy in their hearts, until the Day they face Him—because they broke their promise to God, and because they used to lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He penalized them with hypocrisy in their hearts until the Day they will meet Him - because they failed Allah in what they promised Him and because they [habitually] used to lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:77] So He made the consequence in their case hypocrisy, fixed, in their hearts, until the day they meet Him, that is, God, on the Day of Resurrection, because they failed God in what they promised Him and because, of that concerning which, they lied: he [Tha‘laba] then brought [the payment of] his alms to the Prophet (s), who said to him, ‘God has forbidden me to accept [it] from you’; so he [Tha‘laba] began to throw earth on his head [in remorse]. He then approached Abū Bakr with it, who did not accept it. He then went to ‘Umar [b. al-Khattāb], who also did not accept it. He went to ‘Uthmān [b. ‘Affān], but he did not accept it; he died during the latter’s reign.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So He hath made the consequence (to be) hypocrisy in their hearts) his end was that Allah cast hypocrisy in his heart (until the day when they shall meet Him) until the day of Judgement, (because they broke their word to Allah that they promised Him) because of breaking his promise, (and because they lied) and because he lied about what he said.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَأَعْقَبَهُمْ } الله بسبب فعلهم هذا { نِفَاقاً } راسخاً متمكناً { فِي قُلُوبِهِمْ } مستمراً { إِلَىٰ يَوْمِ يَلْقَوْنَهُ } أي: الله سبحانه في يوم الجزاء، فيجازيهم على مقتضى نفاقهم وشقاقهم أسوأ الجزاء؛ ذلك { بِمَآ أَخْلَفُواْ ٱللَّهَ مَا وَعَدُوهُ } من الصدق والصلاح، والشكر والفلاح، ونقضوا عهده { وَبِمَا كَانُواْ يَكْذِبُونَ } [التوبة: 77] أي: ويكذبهم حين العهد والميثاق بلا موافقة من قبلهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال البيضاوي: ويجوز أن يكون الضمير للبخل، والمعنى: فأورثهم البخلُ نفاقاً متمكناً في قلوبهم { إلى يوم يَلْقونه } ، أي: يلقون الله بالموت، والمراد: يلقون جزاءه أو عقابه\n وذلك { بما أخَلَفوا اللَّه ما وعدوه } أي: بسبب إخلافهم ما وعده من التصدق والصلاح، { وبما كانوا يكذبُون } أي: وبكونهم كاذبين فيه فإن خلف الوعد متضمن للكذب، مستقبح من الوجهين",
      "translations": []
    }
  ]
}