{
  "chapter": "التوبة",
  "text": "الم يعلموا۟ ان الله يعلم سرهم ونجوىهم وان الله علم الغيوب",
  "translations": [
    {
      "translation": "Do they not know that Allah knows their secrets and their private talk, and that Allah is the Knower of all unseen things?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not realised that God knows their secrets and their confidential talk, and that God has the knowledge of unknown things?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they not aware that Allah knows what they conceal and what they secretly discuss, and that Allah has full knowledge even of all that is beyond the reach of perception.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were they not aware that God knows all that they hide or whisper and that He has absolute knowledge of the unseen?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that Allah knows their secrets and the schemes they whisper, and that Allah is the All Knowing of all the hidden?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know they not that Allah knows their secret ideas, and their Najwa (secret counsels), and that Allah is the All-Knower of things unseen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that Allah knows their hidden thoughts and their secret counsels, and that Allah is the great Knower of the unseen things?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did they not know that God knows their secret and what they conspire together, and that God knows the things unseen?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know they not that Allah knoweth both their secret and the thought that they confide, and that Allah is the Knower of Things Hidden?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that God knows what they conceal and what they talk about in secret? That God knows all that is hidden?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Knew they not that Allah knoweth their secret and their Whisper, and that Allah is the Knower of Things Hidden!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that Allah knows their secret [thoughts] and [hears] their secret talks, and that Allah is knower of all that is Unseen?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know they not that Allah doth know their secret (thoughts) and their secret counsels, and that Allah knoweth well all things unseen?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know they not that Allah knows their secret ideas, and their Najwa (secret counsels), and that Allah is the All-Knower of the unseen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did they not know that Allah knows their secret and what they conspire together, and that Allah knows all the unseen?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not know that God knows their secrets and their conspiracies? And that God is the Knower of the unseen?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did they not know that Allah knows their secrets and their private conversations and that Allah is the Knower of the unseen?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:78]   Did they, the hypocrites, not know that God knows their secret, what they conceal within themselves, and their confidential talks, what they confide in each other, and that God is the Knower of the hidden things?, what is concealed from the eyes.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Know they not) i.e. the hypocrites (that Allah knoweth both their secret) that which is between them (and the thought that they confide) when they are alone, (and that Allah is the Knower of Things Hidden) from His servants?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ يَعْلَمُواْ } حين همُّوا إلى القول الكذب مع الله { أَنَّ ٱللَّهَ } المطلع لضمائرهم { يَعْلَمُ } بعلمه الحضوري { سِرَّهُمْ } إي: إخلافهم الوعد من حصول المطلوب { وَنَجْوَاهُمْ } أي: مناجاتهم معه لا عن إخلاص ناشئ من محض المعرفة والإيمان بالله، والإقرار بربوبيته؛ لرسوخ الكفر والشرك في جبلتهم { وَ } لم يعلموا أيضاً { أَنَّ ٱللَّهَ عَلاَّمُ ٱلْغُيُوبِ } [التوبة: 78] لا يعزب عن علمه مثقال ذرة في الأرض ولا في السماء، فمن آمن بتوحيده وإحاطة علمه وقدرته، كيف خرج عن أمره وإطاعته؟\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ألم يعلموا } أي: المنافقون، أو من عاهد الله، { أن الله يعلمُ سِرهُمْ } أي: ما أسروا في أنفسهم من النفاق، { ونجواهم } ما يتناجون فيه، فيما بينهم، من المطاعن وتسمية الزكاة جزية، { وأنَّ الله علامُ الغيوب } فلا يخفى عليه شيء من ذلك، والله تعالى أعلم\n الإشارة: في الحِكَم العطائية: \" من تمام النعمة عليك: أن يرزقك ما يكفيك، ويمنعك ما يطغيك \"\n وقال أبو سعيد الخدري رضي الله عنه: سمعت رسول الله صلى الله عليه وسلم يقول:\n\n \" خير الرِّزقِ ما يَكفي، وخَيرُ الذِّكرِ الخَفيُّ \"\n \n\n \n\nوقال صلى الله عليه وسلم:\n\n \" ما طَلَعت شمسٌ إلا وَبِجَنْبيها ملكان يُناديَان، يُسمعان الخَلائِقَ: أيُّها النَّاس، هلمُّوا إلى ربَّكم، ما قَلَّ وكَفى خَيرٌ مما كَثرَ وألهى \"\n \n\nوقال بعض العارفين: كل من لا يعرف قدر ما زوي عنه في الدنيا، ابتلى بأحد وجهين: إما بحرص مع فقر يتقطع به حسرات، أو رغبة في غنى تنسيه شكر ما أنعم به عليه\n وقد ثبت عن النبي صلى الله عليه وسلم أنه قال:\n\n \" لَيْسَ الغِنى بكَثرةِ العَرَض، إنما الغِنى غِنى النَّفس \" \n\nوغنى النفس عن الدنيا: شرف الأولياء المختارين، وعز أهل التقوى المؤمنين المحسنين\n ولقد صدق قول الشاعر:\n\nوقد قيل: من أخذ من الدنيا فوق ما يكفيه أعمى الله عيني قلبه\n وقالت الجارية المجنونة لعبد الواحد بن زيد: يا عبد الواحد، اعلم أن العبد إذا كان في كفاية، ثم مال إلى الدنيا، سلبه الله حلاوة الزهد، فيظل حيراناً والِهاً، فإن كان له عند الله تعالى نصيب، عاتبه وحياً في سره، فقال: عبدي أردتُ أن أرفع قدرك عند ملائكتي وحملة عرشي، وإجعلك دليلاً لأوليائي وأهل طاعتي في أرضي، فملت إلى عرض من أعراض الدنيا وتركتني فورثتك بذلك الوحشة بعد الأنس، والذل بعد العز، والفقر بعد الغنى، عبدي ارجع إلى ما كنت عليه، أرجعْ بك إلى ما كنت تعرفه\n هـ\n وقد تقدمت الحكاية\n وفي بعض الكتب: إن أهون ما أصنع بالعالِمِ، إذا مال إلى الدنيا أن أسلبه حلاوة مناجاتي\n هـ\n ثم ذم المنافقين بعيب آخر، فقال: { ٱلَّذِينَ يَلْمِزُونَ ٱلْمُطَّوِّعِينَ مِنَ الْمُؤْمِنِينَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:44",
      "similarity": 0.517234437297023
    },
    {
      "verse": "84:13",
      "similarity": 0.48469415332611854
    },
    {
      "verse": "20:62",
      "similarity": 0.473798058612718
    },
    {
      "verse": "25:6",
      "similarity": 0.4641168993922713
    },
    {
      "verse": "84:9",
      "similarity": 0.460043908643913
    }
  ]
}