{
  "chapter": "التوبة",
  "text": "الذين يلمزون المطوعين من المؤمنين فى الصدقت والذين لا يجدون الا جهدهم فيسخرون منهم سخر الله منهم ولهم عذاب اليم",
  "translations": [
    {
      "translation": "As for the people who find fault with those muminun who give sadaqa spontaneously, and with those who can find nothing to give but their own effort, and deride them, Allah derides them. They will have a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They who defame those of the believers who give alms willingly, and deride those who have nothing besides what they earn by their labour (to give in charity), will be derided by God, and will suffer painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He also knows (the rich that are niggardly) who taunt the believers that voluntarily give alms, they scoff at those who have nothing to give except what they earn through their hard toil. Allah scoffs at them in return. A grievous chastisement awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God mocks those (hypocrites) who blame and mock the rich or poor believers who donate to the welfare funds, and He has prepared a painful torment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who find fault in the Muslims who give the charity wholeheartedly and in those who gain nothing except from their own toil – so they mock at them; Allah will punish them for their mocking; and for them is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who defame such of the believers who give charity voluntarily, and such who could not find to give charity except what is available to them -- so they mock at them (believers); Allah will throw back their mockery on them, and they shall have a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They who taunt those of the faithful who give their alms freely, and those who give to the extent of their earnings and scoff at them; Allah will pay them back their scoffing, and they shall have a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who find fault with the believers who volunteer their freewill offerings, and those who find nothing but their endeavour they deride -- God derides them; for them awaits a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who point at such of the believers as give the alms willingly and such as can find naught to give but their endeavours, and deride them - Allah (Himself) derideth them. Theirs will be a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who ridicule such believers as give alms freely for the sake of God and taunt those who find nothing to give save that which they earn through their toil, God will cause their ridicule to rebound on them: they shall have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who traduce those who give alms cheerfully, from among the believers, and those who find not anything to give but their hard earnings: at them they scoff. Allah shall scoff back at them. and theirs shall be a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who blame the voluntary donors from among the faithful concerning the charities—and as for those who do not find [anything] except [what] their means [permit], they ridicule them—Allah shall put them to ridicule, and there is a painful punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who slander such of the believers as give themselves freely to (deeds of) charity, as well as such as can find nothing to give except the fruits of their labour,- and throw ridicule on them,- Allah will throw back their ridicule on them: and they shall have a grievous penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who defame such of the believers who give charity (in Allah's Cause) voluntarily, and those who could not find to give charity (in Allah's Cause) except what is available to them, so they mock at them (believers), Allah will throw back their mockery on them, and they shall have a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who taunt the believers who give charity voluntarily, and scoff at those who give according to their means, Allah will scoff at them. Theirs shall be a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who criticize the believers who give charity voluntarily, and ridicule those who find nothing to give except their own efforts—God ridicules them. They will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who criticize the contributors among the believers concerning [their] charities and [criticize] the ones who find nothing [to spend] except their effort, so they ridicule them - Allah will ridicule them, and they will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:79] When the verse concerning ‘voluntary alms’ [Q. 9:75] was revealed, a man came and gave a large amount as voluntary alms, so the hypocrites said, ‘He is [merely] showing off!’ Another man then came and gave a [moderate] measure [of food], and so they said, ‘God has no need of this man’s charity!’ The following was then revealed: Those who (alladhīna is the subject) find fault with, defame, the believers who offer alms voluntarily, performing supererogation, and such as find nothing [to offer] but their endeavours, [nothing but] what they are capable of, and offer it; and deride them (and the predicate [of the mentioned subject] is [the following]) — God [Himself] derides them, He has requited them for their derision, and theirs will be a painful chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ابتدائي ، نزلت بسبب حادث حدث في مدّة نزول السورة ، ذلك أن النبي صلى الله عليه وسلم حثّ الناس على الصدقة فجاء عبد الرحمن بن عوف بأربعة آلاف درهم ، وجاء عَاصم بن عَدِي بأوسققٍ كثيرة من تمر ، وجاء أبو عَقيل بصاع من تمر ، فقال المنافقون : ما أعطَى عبدُ الرحمن وعاصم إلاّ رياءً وأحَبَّ أبو عَقيل أن يُذكِّر بنفسه ليُعطى من الصدقات فأنزل الله فيهم هذه الآية .فالذين يلمزون مبتدأ وخبره جملة { سخر الله منهم .واللمز : الطعن . وتقدّم في هذه السورة في قوله : { ومنهم من يلمزك في الصدقات } \\[ التوبة : 58 \\]. وقرأه يعقوب بضمّ الميم كما قرأ قوله : { ومنهم من يلمزك في الصدقات } \\[ التوبة : 58 \\].و { المُطّوّعين } أصله المُتَطَوّعين ، أدغمت التاء في الطاء لقرب مخرجيهما .و { في } للظرفية المجازية بجعل سبب اللمز كالظرف للمسبَّب .وعُطف الذين لا يجدون إلاّ جهدهم على المطوعين وهم منهم ، اهتماماً بشأنهم والجُهد بضمّ الجيم الطاقة . وأطلقت الطاقة على مسبّبها الناشىءِ عنها .وحُذف مفعول { يجدون } لظهوره من قوله : { الصدقات } أي لا يجدون ما يتصدّقون به إلاّ جهدهم .والمراد لا يجدون سبيلاً إلى إيجاد ما يتصدّقون به إلاّ طاقتهم ، أي جُهد أبدانهم . أو يكونُ وجَدَ هنا هو الذي بمعنى كان ذا جدة ، أي غنىً فلا يقدر له مفعول ، أي الذين لا مال لهم إلاّ جُهدهم وهذا أحسن .وفيه ثناء على قوة البدن والعمل وأنّها تقوم مقام المال .وهذا أصل عظيم في اعتبار أصول الثروة العامة والتنويه بشأن العامل .والسخرية : الاستهزاء . يقال : سخر منه ، أي حصلت السخرية له من كذا ، فمن اتّصالية .واختير المضارع في يلمزون ويسخَرون للدلالة على التكرر .وإسناد سخر إلى الله تعالى على سبيل المجاز الذي حسَّنتْه المشاكلة لفعلهم ، والمعنى أنّ الله عامَلَهم معاملةً تُشبه سخرية الساخر ، على طريقة التمثيل ، وذلك في أنْ أمر نبيه بإجراء أحكام المسلمين على ظاهرهم زمناً ثم أمْرِه بفضحهم .ويجوز أن يكون إطلاق سَخر الله منهم على طريقة المجاز المرسل ، أي احتقرهم ولعنهم ولمّا كان كلّ ذلك حاصلاً من قبل عبّر عنه بالماضي في { سخر الله منهموجملة : ولهم عذاب أليم } عطف على الخبر ، أي سخر منهم وقضى عليهم بالعذاب في الآخرة .\n\n",
      "translations": [
        {
          "translation": "(Those who point at such of the believers as give the alms willingly) those who find fault with 'Abd al- Rahman [Ibn 'Awf] and his fellow Companions who give alms, accusing them of showing off and seeking fame (and such as can find naught to give but their endeavours) and discredit those who do not find anything to give away except their effort. This refers to Abu 'Uqayl 'Abd al-Rahman Ibn Tijan who could not find anything to give for alms except a measure of dates, (and deride them) because of the little alms he gave. The hypocrites said about him: he did not bring this except that he wished to be mentioned and be given more alms than he gave himself, (Allah (Himself) derideth them) on the day of Judgement. (Theirs will be a painful doom) in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلاَّ جُهْدَهُمْ } معناه إِلاَّ طَاقَتهُمْ\n\n",
      "translations": [
        {
          "translation": " And His saying - Exalted is He - {Except for their effort} means except for their ability.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n هم { ٱلَّذِينَ يَلْمِزُونَ } ويتسهزئون { ٱلْمُطَّوِّعِينَ } المتطوعين { مِنَ الْمُؤْمِنِينَ فِي } إعطاء { الصَّدَقَاتِ } خصوصاً المؤمنين { وَالَّذِينَ لاَ يَجِدُونَ } من الصدقة { إِلاَّ جُهْدَهُمْ } أي: يبذلون مقدار طاقتهم\n طلباً لمرضاة الله { فَيَسْخَرُونَ } أولئك اللامزون المستهزئون { مِنْهُمْ } أي: من الذين بذلوا جهدهم في أمر الصدقة { سَخِرَ ٱللَّهُ مِنْهُمْ } في الآخرة\n مجازاة على سخريتهم هذه { وَلَهُمْ } فيها { عَذَابٌ أَلِيمٌ } [التوبة: 79] بدلَّ لذتهم بسخريتهم\n\n\nوذلك أنه صلى الله عليه وسلم حثَّ المؤمنين يوماً على الصدقة\n فجاء عبد الرحمن بن عوف بأربعة آلاف دينار وقال: لي ثمانية آلاف فأقرضت ربي أربعة آلاف\n وأمسكت لعيالي أربعة\n فقال: صلى الله عليه وسلم:\n \" بارك الله لك فيما أعطيت\n وفيما أمسكت \"\n \n \nوأتى عاصم بن عدي بمائة وسق من تمر\n وجاء عقيل الأنصاري بصاع تتمر\n فقال: بت ليلتي أجر بالجرير الماء حتى نلت صاعين من تمر\n وتركت صاعاً لعيالي\n وأتيت بالآخر\n فأمره صلى الله عليه وسلم أن ينثره على الصدقات تبركاً\n فلمزهم المنافقون\n فقالو: ما أعطى عبد الرحمن وعاصم إلا رياء\n ولقد كان الله ورسوله غنيين عن صاع عقيل\n ولكنه أحب أن يعد نفسه مع المتصدقين فنزلت\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الذين: مبتدأ حُذف خبره\n أي: منهم الذين\n أو خبر عن مبتدأ\n أو منصوب على الذم\n أو بدل من ضمير سرهم\n وأصل المطوعين: المتطوعين\n فأدغمت التاء في الطاء\n وجهدهم: مصدر جهد في الأمر: بالغ فيه\n يقول الحق جل جلاله: ومنهم { الذين يلمزون } أي: يعيبون { المُطَّوِّعِين من المؤمنين في الصدقات } \n روي أنه صلى الله عليه وسلم حث على الصدقة\n فجاء عبدُ الرَّحْمنِ بْنُ عَوْفٍ بأرْبَعَةِ آلافِ دِرْهم\n وقال: كان لي ثمانية آلافٍ\n فأقرضت ربي أربعة\n وأمسكت لعيالي أربعة\n فقال رسول الله صلى الله عليه وسلم:\n \" باركَ الله لكَ فِيما أَعطَيت وفيما أمْسَكْتَُ \"\n \nفبارك الله له حتى صالحته إحدى زوجتيه عن نصف الثمن على ثمانين ألف درهم\n وتصدق عاصم بن عدي بثمانية أوسق تمراً\n وجاء أبو عقيل الأنصاري بصاع تمر\n فأمره رسول الله صلى الله عليه وسلم أن يَنْثُرَه على تمر الصدقات\n فلمزَهم المنافقون\n وقالوا: ما أعطي عبد الرحمن عاصم إلا رياءً\n ولقد كان الله ورسوله لغنيين عن صاع أبي عقيل\n فنزلت الآية\n  ونزلت في أبي عقيل: { والذين لا يجِدُون إلا جُهدهُم } إلا طاقتهم\n { فيسْخَرون منهم } يستهزئون بهم\n قال تعالى: { سخر الله منهم } جازاهم على سخريتهم\n كقوله:\n[البقرة: 15]\n { ولهم عذاب أليم } على كفرهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:58",
      "similarity": 0.5339826368650518
    },
    {
      "verse": "104:1",
      "similarity": 0.5167646455277007
    },
    {
      "verse": "49:11",
      "similarity": 0.20378154002157714
    },
    {
      "verse": "25:52",
      "similarity": 0.1882510838660331
    },
    {
      "verse": "49:15",
      "similarity": 0.16912480805821717
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009079.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009079.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:79.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}