{
  "chapter": "التوبة",
  "text": "استغفر لهم او لا تستغفر لهم ان تستغفر لهم سبعين مرة فلن يغفر الله لهم ذلك بانهم كفروا۟ بالله ورسوله والله لا يهدى القوم الفسقين",
  "translations": [
    {
      "translation": "You can ask forgiveness for them, or not ask forgiveness for them. Even if you asked forgiveness for them seventy times, Allah still would not forgive them. That is because they have rejected Allah and His",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you plead forgiveness for them or not, God will not forgive them, even though you plead seventy times, for they disbelieved in God and His Apostle; and God does not show transgressors the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), it is all the same whether or not you ask for their forgiveness. Even if you were to ask forgiveness for them seventy times, Allah shall not forgive them. That is because they disbelieved in Allah and His Messenger; and Allah does not bestow His Guidance on such evil-doing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), whether you ask God to forgive them or not, He will never do so, even if you were to beg seventy times; they have disbelieved in God and His Messenger and God does not guide the evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you (O dear Prophet Mohammed – peace and blessings be upon him) ask forgiveness for them* or not ask forgiveness for them; even if you ask forgiveness for them seventy times, Allah will not forgive them; that is because they disbelieved in Allah and His Noble Messenger, and Allah does not guide the sinful. (* for the hypocrites.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you (O Muhammad) ask forgiveness for them (hypocrites) or ask not forgiveness for them -- (and even) if you ask seventy times for their forgiveness -- Allah will not forgive them because they have disbelieved in Allah and His Messenger. And Allah guides not those people who are rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask forgiveness for them or do not ask forgiveness for them; even if you ask forgiveness for them seventy times, Allah will not forgive them; this is because they disbelieve in Allah and His Apostle, and Allah does not guide the transgressing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask pardon for them, or ask not pardon for them; if thou askest pardon for them seventy times, God will not pardon them; that, because they disbelieved in God and His Messenger; God guides not the people of the ungodly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask forgiveness for them (O Muhammad), or ask not forgiveness for them; though thou ask forgiveness for them seventy times Allah will not forgive them. That is because they disbelieved in Allah and His messenger, and Allah guideth not wrongdoing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the same whether or not you ask forgiveness for them. Even if you ask forgiveness for them seventy times, God will not forgive them, for they have denied God and His Messenger. God does not guide the evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask thou forgiveness for them or ask thou not forgiveness for them: if thou askest forgiveness for them seventy times, Allah will forgive them not. This, because they disbelieved in Allah and His apostle, and Allah guideth not an ungodly people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you plead forgiveness for them or do not plead forgiveness for them, even if you plead forgiveness for them seventy times, Allah shall never forgive them because they defied Allah and His Apostle; and Allah does not guide the transgressing lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether thou ask for their forgiveness, or not, (their sin is unforgivable): if thou ask seventy times for their forgiveness, Allah will not forgive them: because they have rejected Allah and His Messenger: and Allah guideth not those who are perversely rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you (O Muhammad SAW) ask forgiveness for them (hypocrites) or ask not forgiveness for them  (and even) if you ask seventy times for their forgiveness  Allah will not forgive them, because they have disbelieved in Allah and His Messenger (Muhammad SAW). And Allah guides not those people who are Fasiqun (rebellious, disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It is the same) whether or not you beg forgiveness for them. If you beg forgiveness for them seventy times Allah will not forgive them, for they have disbelieved in Allah and His Messenger. Allah does not guide the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you ask forgiveness for them, or do not ask forgiveness for them—even if you ask forgiveness for them seventy times, God will not forgive them. That is because they disbelieved in God and His Messenger. God does not guide the immoral people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask forgiveness for them, [O Muhammad], or do not ask forgiveness for them. If you should ask forgiveness for them seventy times - never will Allah forgive them. That is because they disbelieved in Allah and His Messenger, and Allah does not guide the defiantly disobedient people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:80] Ask forgiveness for them, O Muhammad (s), or do not ask forgiveness for them: this leaves the choice of asking forgiveness, or refraining, up to him; the Prophet (s) said, ‘I have been given the choice, and I made it’, meaning [the choice] to ask forgiveness, as reported by al-Bukhārī. If you ask forgiveness for them seventy times, God will not forgive them: it is said that the ‘seventy’ is intended to express [by hyperbole] a great frequency of asking forgiveness. In [the Sahīh of] al-Bukhārī there is a hadīth [which states]: ‘If I was sure that were I to ask more than seventy times, God would forgive [them], I would have done so’. It is also said, however, that the very number [seventy] is actually meant, on account of this other hadīth of his: ‘I shall ask more than seventy times’, whereupon it was made clear to him [the Prophet] that the matter regarding forgiveness had been concluded by the verse, [Q. 63:6] Alike it will be regarding them: whether you ask forgiveness for them or you do not ask forgiveness for them [God will not forgive them]; that is because they disbelieved in God and His Messenger; and God does not guide the wicked folk.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Ask forgiveness for them (0 Muhammad)) Allah says: if you ask forgiveness for 'Abdullah Ibn Ubayy, Jadd Ibn Qays, and Mu'attib Ibn Qushayr and their followers-who were about 70 men-, (or ask not forgiveness for them) it is all the same for them; (though thou ask forgiveness for them seventy times Allah will not forgive them) that punishment. (That is because they disbelieved in Allah and His messenger) in secret, (and Allah guideth not) forgives not (wrong-doing folk) the hypocrites: 'Abdullah Ibn Ubayy and his host.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱسْتَغْفِرْ لَهُمْ } يا أكمل الرسل لهؤلاء اللازمين المستهزئين\n المستسخرين من المؤمين بإنقاذهم من العذاب أو تخفيفه { أَوْ لاَ تَسْتَغْفِرْ لَهُمْ } سواء عند الله في انتقامهم وعذابهم\n بل { إِن تَسْتَغْفِرْ لَهُمْ } لا مرة ولا مرتين\n بل { سَبْعِينَ مَرَّةً فَلَن يَغْفِرَ ٱللَّهُ لَهُمْ } ألبتة\n لعظم جرمهم وفسقهم { ذٰلِكَ } أي: عدم غفرانهم { بِأَنَّهُمْ كَفَرُواْ بِٱللَّهِ } وأشركوا معه غيره في الألوهية\n مع أنه منزه عن الشريك مطلقاً { وَرَسُولِهِ } أي: كذبوا رسوله\n وبما جاء به من عند ربه\n واستهزءوا بالمؤمنين المصدقين له\n المتصفين في سبيل الله { وَٱللَّهُ } الهادي لعباده { لاَ يَهْدِي ٱلْقَوْمَ ٱلْفَاسِقِينَ } [التوبة: 80] عن مقتضى أوامر الله ونواهيه المسيئين الأدب مع الله ورسوله والمؤمنين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { اسْتَغفِر لهم أو لا تستَغفر لهم } \n يريد به التساوي بين الأمرين في عدم الإفادة\n كما نص عليه بقوله: { إن تستغفر لهم سبعينَ مرة فلن يغفر الله لهم } \n رُوي أن عبد الله بن عبد الله بن أبي ـ وكان من خيار المسلمين ـ سأل رسول الله صلى الله عليه وسلم\n في مرض أبيه\n أن يستغفر له\n ففعل\n فنزلت:\n[المنافقون: 6]\n وذلك لأنه ـ عليه الصلاة والسلام ـ فَهِمَ من السبعين العدد المخصوص\n وقال: ولو علمت أني إن زدت على السبعين\n غُفِر له\n لزدت\n فبيَّنَ له أن المراد به التكثير\n دون التحديد\n وقد شاع استعمال السبعة والسبعين والسبعمائة في التكثر لاشتمال السبعة على جملة أقسام العدد\n فكأنه بأسره قاله البيضاوي\n { ذلك } أي: عدم قبول استغفارك بسبب أنهم { كفروا بالله ورسوله } أي: ليس لبُخل منا\n ولا تقصير في حقك\n بل لعدم قابليتهم بسبب الكفر الصارف عنها\n { والله لا يهدي القوم الفاسقين } المتمردين في كفرهم\n وهو كالدليل على الحكم السابق\n فإن مغفرة الكافر بالإقلاع عن الكفر\n والإرشاد إلى الحق\n والمنهمك في كفره\n المطبوع عليه\n لا ينقلع ولا يهتدي\n والتنبيه على عذر الرسول في استغفاره\n وهو عدم يأسه من إيمانهم\n ما لم يعلم مطبُوعون على الضلالة\n والممنوع هو الاستغفار بعد العلم لقوله:\n\n\n\n الآية [التوبة: 113] قاله البيضاوي\n الإشارة: من نصب الميزان على المؤمنين فيما يصدر منهم\n أو على الصالحين أو الأولياء فيما يظهر عليهم\n حتى يسخر منهم\n سخر الله منه\n وأبعده من رحمته\n فلا تنفع فيه شفاعة الشافعين ولا استغفار المستغفرين\n وفي بعض الأخبار: \" من تتبع عورة أخيه المؤمن تتبع الله عورته حتى يفضحه\n ولو في جوف بيته \"\n ومن اشتغل بإذاية الأولياء\n ولم يتب\n مات على سوء الخاتمة\n وذلك جزاء من حارب الله ـ والعياذ بالله ـ\n ثم ذكر تخلف المنافقين عن الجهاد\n فقال: { فَرِحَ ٱلْمُخَلَّفُونَ بِمَقْعَدِهِمْ خِلاَفَ رَسُولِ ٱللَّهِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "63:6",
      "similarity": 0.42406687616786254
    },
    {
      "verse": "2:29",
      "similarity": 0.4063151874937884
    },
    {
      "verse": "78:12",
      "similarity": 0.39910286898748404
    },
    {
      "verse": "23:86",
      "similarity": 0.3951948978900692
    },
    {
      "verse": "15:87",
      "similarity": 0.3591913595973142
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/9:80.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/9:80.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/9:80.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}