{
  "chapter": "التوبة",
  "text": "استغفر لهم او لا تستغفر لهم ان تستغفر لهم سبعين مرة فلن يغفر الله لهم ذلك بانهم كفروا۟ بالله ورسوله والله لا يهدى القوم الفسقين",
  "translations": [
    {
      "translation": "You can ask forgiveness for them, or not ask forgiveness for them. Even if you asked forgiveness for them seventy times, Allah still would not forgive them. That is because they have rejected Allah and His",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you plead forgiveness for them or not, God will not forgive them, even though you plead seventy times, for they disbelieved in God and His Apostle; and God does not show transgressors the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), it is all the same whether or not you ask for their forgiveness. Even if you were to ask forgiveness for them seventy times, Allah shall not forgive them. That is because they disbelieved in Allah and His Messenger; and Allah does not bestow His Guidance on such evil-doing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), whether you ask God to forgive them or not, He will never do so, even if you were to beg seventy times; they have disbelieved in God and His Messenger and God does not guide the evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you (O dear Prophet Mohammed – peace and blessings be upon him) ask forgiveness for them* or not ask forgiveness for them; even if you ask forgiveness for them seventy times, Allah will not forgive them; that is because they disbelieved in Allah and His Noble Messenger, and Allah does not guide the sinful. (* for the hypocrites.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you (O Muhammad) ask forgiveness for them (hypocrites) or ask not forgiveness for them -- (and even) if you ask seventy times for their forgiveness -- Allah will not forgive them because they have disbelieved in Allah and His Messenger. And Allah guides not those people who are rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask forgiveness for them or do not ask forgiveness for them; even if you ask forgiveness for them seventy times, Allah will not forgive them; this is because they disbelieve in Allah and His Apostle, and Allah does not guide the transgressing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask pardon for them, or ask not pardon for them; if thou askest pardon for them seventy times, God will not pardon them; that, because they disbelieved in God and His Messenger; God guides not the people of the ungodly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask forgiveness for them (O Muhammad), or ask not forgiveness for them; though thou ask forgiveness for them seventy times Allah will not forgive them. That is because they disbelieved in Allah and His messenger, and Allah guideth not wrongdoing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the same whether or not you ask forgiveness for them. Even if you ask forgiveness for them seventy times, God will not forgive them, for they have denied God and His Messenger. God does not guide the evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask thou forgiveness for them or ask thou not forgiveness for them: if thou askest forgiveness for them seventy times, Allah will forgive them not. This, because they disbelieved in Allah and His apostle, and Allah guideth not an ungodly people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you plead forgiveness for them or do not plead forgiveness for them, even if you plead forgiveness for them seventy times, Allah shall never forgive them because they defied Allah and His Apostle; and Allah does not guide the transgressing lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether thou ask for their forgiveness, or not, (their sin is unforgivable): if thou ask seventy times for their forgiveness, Allah will not forgive them: because they have rejected Allah and His Messenger: and Allah guideth not those who are perversely rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you (O Muhammad SAW) ask forgiveness for them (hypocrites) or ask not forgiveness for them  (and even) if you ask seventy times for their forgiveness  Allah will not forgive them, because they have disbelieved in Allah and His Messenger (Muhammad SAW). And Allah guides not those people who are Fasiqun (rebellious, disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It is the same) whether or not you beg forgiveness for them. If you beg forgiveness for them seventy times Allah will not forgive them, for they have disbelieved in Allah and His Messenger. Allah does not guide the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you ask forgiveness for them, or do not ask forgiveness for them—even if you ask forgiveness for them seventy times, God will not forgive them. That is because they disbelieved in God and His Messenger. God does not guide the immoral people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask forgiveness for them, [O Muhammad], or do not ask forgiveness for them. If you should ask forgiveness for them seventy times - never will Allah forgive them. That is because they disbelieved in Allah and His Messenger, and Allah does not guide the defiantly disobedient people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:80] Ask forgiveness for them, O Muhammad (s), or do not ask forgiveness for them: this leaves the choice of asking forgiveness, or refraining, up to him; the Prophet (s) said, ‘I have been given the choice, and I made it’, meaning [the choice] to ask forgiveness, as reported by al-Bukhārī. If you ask forgiveness for them seventy times, God will not forgive them: it is said that the ‘seventy’ is intended to express [by hyperbole] a great frequency of asking forgiveness. In [the Sahīh of] al-Bukhārī there is a hadīth [which states]: ‘If I was sure that were I to ask more than seventy times, God would forgive [them], I would have done so’. It is also said, however, that the very number [seventy] is actually meant, on account of this other hadīth of his: ‘I shall ask more than seventy times’, whereupon it was made clear to him [the Prophet] that the matter regarding forgiveness had been concluded by the verse, [Q. 63:6] Alike it will be regarding them: whether you ask forgiveness for them or you do not ask forgiveness for them [God will not forgive them]; that is because they disbelieved in God and His Messenger; and God does not guide the wicked folk.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذا استئناف ابتدائي ليس متصلاً بالكلام السابق ، وإنّما كان نزوله لسبب حدث في أحوال المنافقين المحكية بالآيات السالفة ، فكان من جملة شرح أحوالهم وأحكامهم ، وفي الآية ما يدلّ على أنّ النبي صلى الله عليه وسلم كان يستغفر لهم .روى المفسّرون عن ابن عباس أنّه لمّا نزلت بعض الآيات السابقة في أحوالهم إلى قوله : { سخر الله منهم ولهم عذاب أليم } \\[ التوبة : 79 \\]. قال فريق منهم : استغفر لنا يا رسول الله ، أي ممّن صدر منه عمل وبِّخُوا عليه في القرآن دون تصريح بأنّ فاعله منافق فوعدهم النبي عليه الصلاة والسلام بأن يستغفر للذين سألوه . وقال الحسن : كانوا يأتون رسول الله فيعتذرون إليه ، ويقولون : إن أردْنا إلاّ الحسنى . وذلك في معنى الاستغفار ، أي طلب مَحْومَا عُدّ عليهم أنّه ذنب ، يريدون أنّه استغفار من ظاهر إيهام أفعالهم . وعن الأصمّ أنّ عبد الله بنَ أُبي بن سَلول لمّا ظهر ما ظهر من نفاقه وتنكّر الناس له من كلّ جهة لقيه رجل من قومه فقال له : ارجع إلى رسول الله يستغفر لك ، فقال : ما أبالي استغفر لي أم لم يستغفر لي . فنزل فيه قوله تعالى في سورة المنافقين ( 5 ، 6 ) : { وإذا قيل لهم تعالَوا يستغفر لكم رسولُ الله لَوَوْا رُؤُوسَهم ورأيتَهم يَصُدُّون وهم مستكبرون سواءٌ عليهم أسْتَغْفَرْتَ لهم أم لم تستغفر لهم لَن يغفرَ الله لهم } يعني فتكون هذه الآية مؤكّدةً لآية سورة المنافقين عند حدوث مثل السبب الذي نزلت فيه آية سورة المنافقين جمعاً بين الروايات .وعن الشعبي ، وعروة ، ومجاهد ، وابن جبير ، وقتادة أنّ عبد الله بن أُبَيْ بن سلول مرض فسألَ ابنُه عبدُ الله بنُ عبد الله النبي أن يستغفر له ففعل . فنزلت . فقال النبي إنّ الله قد رخَّص لي فسأزيدُ على السبعين فنزلت { سواء عليهم أستغفرت لهم أم لم تستغفر لهم لن يغفر الله لهم } \\[ المنافقون : 6 \\].والذي يظهر لي أنّ رسول الله صلى الله عليه وسلم لمّا أوحي إليه بآية سورة المنافقين ، وفيها أنّ استغفاره وعدمه سواء في حقّهم . تأوَّلَ ذلك على الاستغفار غيرِ المؤكّد وبعثته رحمته بالناس وحرصه على هداهم وتكدّره من اعْتراضهم عن الإيماننِ أن يستغفر للمنافقين استغفاراً مكرّراً مؤكّداً عسى أن يغفر الله لهم ويزول عنهم غضبه تعالى فيهديهم إلى الإيمان الحقّ . بما أنّ مخالطتهم لأحوال الإيمان ولو في ظاهر الحال قد يجرّ إلى تعلّق هديه بقلوبهم بأقلّ سبب ، فيكون نزول هذه الآية تأيِيساً من رضى الله عنهم ، أي عن البقية الباقية منهم تأييساً لهم ولمن كان على شاكلتهم ممّن اطّلع على دخائلهم فاغتبط بحالهم بأنّهم انتفعوا بصحبة المسلمين والكفار ، فالآية تأييس من غير تعيين .وصيغة الأمر في قوله : { استغفر } مستعملة في معنى التسوية المراد منها لازمها وهو عدم الحذر من الأمر المباح ، والمقصود من ذلك إفادة معنى التسوية التي تَرد صيغة الأمر لإفادتها كثيراً ، وعدَّ علماءُ أصول الفقه في معاني صيغة الأمر معنى التسوية ومثّلوه بقوله تعالى :{ اصلوها فاصبروا أو لا تصبروا } \\[ الطور : 16 \\].فأمَّا قوله : { أو لا تستغفر لهم } فموقعه غريب ولم يُعْنَ المفسّرون والمعرِبون ببيانه فإنّ كونه بعد { لا } مجزوماً يجعله في صورة النهي ، ومعنى النهي لا يستقيم في هذا المقام إذ لا يستعمل النهي في معنى التخيير والإباحة . فلا يتأتّى منه معنىً يعادل معنى التسوية التي استُعمل فيها الأمر . ولذلك لم نر علماء الأصول يذكرون التسوية في معاني صيغة النهي كما ذكروها في معاني صيغة الأمروتأويل الآية :إمّا أن تكون { لا } نافية ويكون جزم الفعل بعدها لكونه معطوفاً على فعل الأمر فإن فعل الأمر مجزوم بلام الأمر المقدرة على التحقيق وهو مذهب الكوفيين واختاره الأخفش من البصريين ، وابن هشام الأنصاري وأبو علي بن الأحوص ، شيخ أبي حيّان ، وهو الحقّ لأنّه لو كان مبنياً للزم حالةً واحدةً ، ولأنّ أحوال آخره جارية على أحوال علامات الجزم فلا يبعد أن يكون ذلك التقدير ملاحظاً في كلامهم فيعطف عليه بالجزم على التوهّم .ولا يصح كون هذا من عطف الجمل لأنّه لا وجه لِجزم الفعل لو كان كذلك ، لا سيما والأمر مؤول بالخبر ، ثم إنّ ما أفاده حرف التخيير قد دلّ على تخيير المخاطب في أحد الأمرين مع انتفاء الفائدة على كليهما .وإمّا أن تكون صيغة النهي استعملت لمعنى التسوية لأنّها قارنت الأمر الدالّ على إرادة التسوية ويكون المعنى : أمرك بالاستغفار لهم ونهيُك عنه سواء ، وذلك كناية عن كون الآمِر والناهي ليس بمغيِّر مراده فيهم سواء فُعل المأمور أو فُعل المنهي ويجوز أن يكون الفعلان معمولين لفعل قول محذوف . والتقدير : نقول لك : استغفر لهم ، أو نقول لا تستغفر لهم .و { سبعين مرة } غير مراد به المقدارُ من العدد بل هذا الاسم من أسماء العدد التي تستعمل في معنى الكثرة . قال «الكشاف» : «السبعون جار مجرى المثل في كلامهم للتكثر» . ويدل له قول النبي صلى الله عليه وسلم \" لو أعلم أنّي لو زدت على السبعين غُفر له لزدت \" وهو ما رواه البخاري والترمذي من حديث عمر بن الخطاب . وأمّا ما رواه البخاري من حديث أنس بن عياض وأبي أسامة عن عبيد الله عن نافع عن ابن عمر أنّ النبي صلى الله عليه وسلم قال : \" وسأزيد على السبعين \" فهو توهم من الراوي لمنافاته روايةَ عمرَ بن الخطاب ، وروايةُ عمَر أرجح لأنّه صاحب القصّة ، ولأنّ تلك الزيادة لم تُرو من حديث يحيى بن سعيد عن عبيد الله عن نافع عن ابن عمر عند الترمذي وابن ماجة والنسائي .وانتصب { سبعين مرة } على المفعولية المطلقة لبيان العدد . وتقدّم الكلام على لفظ مرّة عند قوله تعالى : { وهم بدأوكم أول مرة } في هذه السورة ( 13 ).وضمائر الغيبة راجعة إلى المنافقين الذين علم اللَّهُ نفاقهم وأعلم نبيئَه عليه الصلاة والسلام بهم . وكان المسلمون يحسبونهم مسلمين اغتراراً بظاهر حالهم . وكان النبي يُجري عليهم أحكام ظاهر حالهم بين عامّة المسلمين ، والقرآن ينعتهم بسيماهم كيلا يطمئنّ لهم المسلمون وليأخذوا الحذر منهم ، فبذلك قُضي حقّ المصالح كلّها .ومن أجل هذا الجري على ظاهر الحال اختلف أسلوب التأييس من المغفرة بين ما في هذه الآية وبين ما في آية { ما كان للنبي والذين آمنوا أن يستغفروا للمشركين } \\[ التوبة : 113 \\] لأنّ المشركين كفرُهم ظاهر فجاء النهي عن الاستغفار لهم صريحاً ، وكُفر المنافقين خفي فجاء التأييس من المغفزة لهم منوطاً بوصف يعلمونه في أنفسهم ويعلمه الرسول عليه الصلاة والسلام ولأجل هذا كان يستغفر لمن يسأله الاستغفار من المنافقين لئلا يكون امتناعه من الاستغفار له إعلاماً بباطن حاله الذي اقتضت حكمةُ الشريعة عدمَ كشفه . وقال في أبي طالب : «لأستغفرنّ لك ما لم أُنه عنك» فلمّا نهاه الله عن ذلك أمسك عن الاستغفار له .وكان النبي صلى الله عليه وسلم يصلي صلاة الجنازة على من مات من المنافقين لأنّ صلاة الجنازة من الاستغفار ولمّا مات عبدُ الله بن أبي بن سلول رأسُ المنافقين بعد نزول هذه الآية وسألَ ابنُه عبدُ الله بنُ عبد الله النبي صلى الله عليه وسلم أن يصلي عليه ، فصلّى عليه كرامة لابنه وقال عمر للنبيء صلى الله عليه وسلم قد نهاك ربك أن تصلي عليه ، قال له على سبيل الرد «إنّما خَيّرني الله» ، أي ليس في هذه الآية نهي عن الاستغفار ، فكان لصلاته عليهم واستغفاره لهم حكمة غير حصول المغفرة بل لمصالح أخرى ، ولعلّ النبي صلى الله عليه وسلم أخذ بأضعف الاحتمالين في صيغة { استغفر لهم أو لا تستغفر لهم } وكذلك في لفظ عدد { سبعين مرة } استقصاء لمظنّة الرحمة على نحو ما أصّلناه في المقدمة التاسعة من مقدّمات هذا التفسير .والإشارةُ في قوله : { ذلك بأنهم كفروا } لانتفاء الغفران المستفاد من قوله : { فلن يغفر الله لهم }.والباء للسببية ، وكفرهم بالله هو الشرك . وكفرهم برسوله جحدهم رسالته صلى الله عليه وسلم وفي هذه الآية دليل على أن جاحد نبوءة محمد صلى الله عليه وسلم يطلق عليه كافر .ومعنى { والله لا يهدي القوم الفاسقين } أنّ الله لا يُقَدّر لهم الهدي إلى الإيمان لأجل فسقهم ، أي بُعدهِم عن التأمّل في أدلّة النبوءة ، وعن الإنصاف في الاعتراف بالحق فمن كان ذلك ديدنه طُبع على قلبه فلا يقبل الهُدى فمعنى { لا يهدي } لا يخلق الهُدى في قلوبهم .\n\n",
      "translations": [
        {
          "translation": "(Ask forgiveness for them (0 Muhammad)) Allah says: if you ask forgiveness for 'Abdullah Ibn Ubayy, Jadd Ibn Qays, and Mu'attib Ibn Qushayr and their followers-who were about 70 men-, (or ask not forgiveness for them) it is all the same for them; (though thou ask forgiveness for them seventy times Allah will not forgive them) that punishment. (That is because they disbelieved in Allah and His messenger) in secret, (and Allah guideth not) forgives not (wrong-doing folk) the hypocrites: 'Abdullah Ibn Ubayy and his host.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱسْتَغْفِرْ لَهُمْ } يا أكمل الرسل لهؤلاء اللازمين المستهزئين\n المستسخرين من المؤمين بإنقاذهم من العذاب أو تخفيفه { أَوْ لاَ تَسْتَغْفِرْ لَهُمْ } سواء عند الله في انتقامهم وعذابهم\n بل { إِن تَسْتَغْفِرْ لَهُمْ } لا مرة ولا مرتين\n بل { سَبْعِينَ مَرَّةً فَلَن يَغْفِرَ ٱللَّهُ لَهُمْ } ألبتة\n لعظم جرمهم وفسقهم { ذٰلِكَ } أي: عدم غفرانهم { بِأَنَّهُمْ كَفَرُواْ بِٱللَّهِ } وأشركوا معه غيره في الألوهية\n مع أنه منزه عن الشريك مطلقاً { وَرَسُولِهِ } أي: كذبوا رسوله\n وبما جاء به من عند ربه\n واستهزءوا بالمؤمنين المصدقين له\n المتصفين في سبيل الله { وَٱللَّهُ } الهادي لعباده { لاَ يَهْدِي ٱلْقَوْمَ ٱلْفَاسِقِينَ } [التوبة: 80] عن مقتضى أوامر الله ونواهيه المسيئين الأدب مع الله ورسوله والمؤمنين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { اسْتَغفِر لهم أو لا تستَغفر لهم } \n يريد به التساوي بين الأمرين في عدم الإفادة\n كما نص عليه بقوله: { إن تستغفر لهم سبعينَ مرة فلن يغفر الله لهم } \n رُوي أن عبد الله بن عبد الله بن أبي ـ وكان من خيار المسلمين ـ سأل رسول الله صلى الله عليه وسلم\n في مرض أبيه\n أن يستغفر له\n ففعل\n فنزلت:\n[المنافقون: 6]\n وذلك لأنه ـ عليه الصلاة والسلام ـ فَهِمَ من السبعين العدد المخصوص\n وقال: ولو علمت أني إن زدت على السبعين\n غُفِر له\n لزدت\n فبيَّنَ له أن المراد به التكثير\n دون التحديد\n وقد شاع استعمال السبعة والسبعين والسبعمائة في التكثر لاشتمال السبعة على جملة أقسام العدد\n فكأنه بأسره قاله البيضاوي\n { ذلك } أي: عدم قبول استغفارك بسبب أنهم { كفروا بالله ورسوله } أي: ليس لبُخل منا\n ولا تقصير في حقك\n بل لعدم قابليتهم بسبب الكفر الصارف عنها\n { والله لا يهدي القوم الفاسقين } المتمردين في كفرهم\n وهو كالدليل على الحكم السابق\n فإن مغفرة الكافر بالإقلاع عن الكفر\n والإرشاد إلى الحق\n والمنهمك في كفره\n المطبوع عليه\n لا ينقلع ولا يهتدي\n والتنبيه على عذر الرسول في استغفاره\n وهو عدم يأسه من إيمانهم\n ما لم يعلم مطبُوعون على الضلالة\n والممنوع هو الاستغفار بعد العلم لقوله:\n\n\n\n الآية [التوبة: 113] قاله البيضاوي\n الإشارة: من نصب الميزان على المؤمنين فيما يصدر منهم\n أو على الصالحين أو الأولياء فيما يظهر عليهم\n حتى يسخر منهم\n سخر الله منه\n وأبعده من رحمته\n فلا تنفع فيه شفاعة الشافعين ولا استغفار المستغفرين\n وفي بعض الأخبار: \" من تتبع عورة أخيه المؤمن تتبع الله عورته حتى يفضحه\n ولو في جوف بيته \"\n ومن اشتغل بإذاية الأولياء\n ولم يتب\n مات على سوء الخاتمة\n وذلك جزاء من حارب الله ـ والعياذ بالله ـ\n ثم ذكر تخلف المنافقين عن الجهاد\n فقال: { فَرِحَ ٱلْمُخَلَّفُونَ بِمَقْعَدِهِمْ خِلاَفَ رَسُولِ ٱللَّهِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "63:6",
      "similarity": 0.42406687616786254
    },
    {
      "verse": "2:29",
      "similarity": 0.4063151874937884
    },
    {
      "verse": "78:12",
      "similarity": 0.39910286898748404
    },
    {
      "verse": "23:86",
      "similarity": 0.3951948978900692
    },
    {
      "verse": "15:87",
      "similarity": 0.3591913595973142
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/009080.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/009080.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/9:80.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}