{
  "chapter": "التوبة",
  "text": "فرح المخلفون بمقعدهم خلف رسول الله وكرهوا۟ ان يجهدوا۟ بامولهم وانفسهم فى سبيل الله وقالوا۟ لا تنفروا۟ فى الحر قل نار جهنم اشد حرا لو كانوا۟ يفقهون",
  "translations": [
    {
      "translation": "Those who were left behind were glad to stay behind the Messenger of Allah. They did not want to do jihad with their wealth and themselves in the Way of Allah. They said, 'Do not go out to fight in the heat.' Say: The Fire of Hell is much hotter, if they only understood.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were left behind rejoiced that they stayed at home against the wishes of God's Apostle, being averse to fighting in the way of God with their wealth and lives, and said: \"Do not go in this heat.\" Tell them: \"The heat of Hell is far more intense.\" If only they had cared to instruct themselves!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were allowed to stay behind rejoiced at remaining behind and not accompanying the Messenger of Allah. They were averse to striving in the Way of Allah with their belongings and their lives and told others: \"Do not go forth in this fierce heat.\" Tell them: \"The Hell is far fiercer in heat.\" Would that they understand!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who did not take part in the battle (of Tabuk), were glad about their staying home against the order of the Messenger of God. They did not want to fight for the cause of God with their property and in person and said, \"Do not march (to the battle) on the hot days.\" (Muhammad), tell them, \"The heat of hell fire is much more severe, if only you would understand.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were left behind rejoiced that behind the Noble Messenger of Allah they had remained seated, and they were unwilling to fight in Allah's cause with their lives or their wealth, and said “Do not venture out in the heat”; say, “The fire of hell is the hottest”; if only they understood!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who stayed away (from Tabuk expedition) rejoiced in their staying behind the Messenger of Allah; they hated to strive and fight with their properties and their lives in the cause of Allah, and they said: \"March not forth in the heat.\" Say: \"The fire of Hell is more intense in heat;\" if only they could understand!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were left behind were glad on account of their sitting behind Allah's Apostle and they were averse from striving in Allah's way with their property and their persons, and said: Do not go forth in the heat. Say: The fire of hell is much severe in heat. Would that they understood (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were left behind rejoiced in tarrying behind the Messenger of God, and were averse to struggle with their possessions and their selves in the way of God. They said, 'Go not forth in the heat.' Say: 'Gehenna's fire is hotter, did they but understand.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were left behind rejoiced at sitting still behind the messenger of Allah, and were averse to striving with their wealth and their lives in Allah's way. And they said: Go not forth in the heat! Say: The fire of hell is more intense of heat, if they but understood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who stayed at home were glad that they were left behind by God's Messenger. They hated the thought of striving for God's cause with their possessions and their persons. They said, \"Do not go forth  in this heat.\" Say, \"The Fire of Hell is far hotter.\" If only they could understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were left rejoiced at their staying behind the apostle of Allah, and they detested to strive hard with their riches and their lives in the way of Allah, and they said: march not forth in the heat. - Say thou: hotter still is the Hell-Fire. Would that they understood!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were left behind boasted for sitting back against [the command of] the Apostle of Allah, and were reluctant to wage jihad with their possessions and persons in the way of Allah, and they said, ‘Do not go forth in this heat.’ Say, The fire of hell is severer in heat, should they understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were left behind (in the Tabuk expedition) rejoiced in their inaction behind the back of the Messenger of Allah: they hated to strive and fight, with their goods and their persons, in the cause of Allah: they said, \"Go not forth in the heat.\" Say, \"The fire of Hell is fiercer in heat.\" If only they could understand!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who stayed away (from Tabuk expedition) rejoiced in their staying behind the Messenger of Allah; they hated to strive and fight with their properties and their lives in the Cause of Allah, and they said: \"March not forth in the heat.\" Say: \"The Fire of Hell is more intense in heat\", if only they could understand!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were left behind were glad that they were left behind by the Messenger of Allah, for they disliked to struggle in the Way of Allah with their wealth and their persons. They said: 'Do not go forth in the heat' Say: 'The Fire of Gehenna is more hot' Would that they understood!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who stayed behind rejoiced at their staying behind the Messenger of God. And they hated to strive with their wealth and their lives in God’s way. And they said, “Do not venture out in the heat.” Say, “The Fire of Hell is much hotter, if they only understood.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who remained behind rejoiced in their staying [at home] after [the departure of] the Messenger of Allah and disliked to strive with their wealth and their lives in the cause of Allah and said, \"Do not go forth in the heat.\" Say, \"The fire of Hell is more intensive in heat\" - if they would but understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:81] Those who were left behind, from [the journey to] Tabūk, rejoiced at remaining behind the Messenger of God, and were averse to striving with their wealth and their lives in the way of God. And they said, that is, they said to one another, ‘Do not go forth, do not set off to [join] the fight, in the heat!’ Say: ‘The fire of Hell is hotter, than Tabūk, and more worthy for them to guard against, by not staying behind, did they but understand’, this, they would not have stayed behind.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who were left behind rejoiced) the hypocrites were pleased (at sitting still) at staying behind and not joining the battle of Tabuk (behind the Messenger of Allah, and were averse to striving with their wealth and their lives in Allah's way) in obedience of Allah. (And they said) to one another: (Go not forth in the heat!) do not go with Muhammad (pbuh) to the battle of Tabuk in the scorching heat. (Say) to them, Muhammad: (The heat of hell is more intense of heat) is most intense in firebrands, (if they but understood) and believed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { خِلاَفَ رَسُولِ ٱللَّهِ } معناهُ بَعدَهُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { فَرِحَ } المنافقون { ٱلْمُخَلَّفُونَ } عن رسول الله، المتخلفون لأمره، المتمكنون { بِمَقْعَدِهِمْ } أي: بمكان قعودهم { خِلاَفَ رَسُولِ ٱللَّهِ } حين خرج إلى غزوة تبوك { وَ } ما ذلك؛ أي: قعودهم واستقرارهم بعد رسول الله صلى الله عليه وسلم في مكانهم، إلا أنهم { كَرِهُوۤاْ أَن يُجَاهِدُواْ بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ فِي سَبِيلِ ٱللَّهِ } لخبث باطنهم وقسوة قلوبهم { وَقَالُواْ } أيضاً للمؤمنين تقريراً وتكسيلاً: { لاَ تَنفِرُواْ فِي ٱلْحَرِّ } أي: لا تجاهدوا ولا تقاتلوا في الصيف حتى لا تضعفوا أنتم ومواشيكم { قُلْ } لهم يا أكمل الرسل: { نَارُ جَهَنَّمَ } البعد والخذلان التي استوجبتم بها بتخلفكم وقعودكم عن الجهاد { أَشَدُّ حَرّاً } وأبلغ إحراقاً وإيلاماً { لَّوْ كَانُوا يَفْقَهُونَ } [التوبة: 81] ويفهمون ما هي وكيف هي لم يختاروها على حر الدنيا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: خلافَ رسول الله: منصوب على الظرفية، أي: بعده، يقال: أقام خلاف الحي، أي: بعدهم، وقيل: مصدر خالف، فيكون مفعولاً لأجله، أو حال\n يقول الحق جل جلاله: { فَرَحَ المخلَّفُون } أي: الذين خلفهم الله عن الغزو، وأقعدهم عنه، ولذلك عبَّر بالمخلفين دون المتخلفين، فرحوا { بمقعدهم خلافَ رسول الله } أي: بعده في غزوة تبوك، { وكَرِهُوا أن يُجاهدوا بأموالهم وأنفسهم في سبيل الله } إيثاراً للراحة والدّعَةِ على طاعة الله ورسوله\n وفيه تعريض بالمؤمنين الذين آثروا عليها تحصيل رضاه ببذل الأموال والمهج، وأما المنافقون فآثروا الراحة وقعدوا، { وقالوا لا تَنفروا في الحر } ، قاله بعضهم لبعض، أو قالوه للمؤمنين تثبيطاً لهم\n قال ابن جزي: قائل هذه المقالة رجل من بني سليم، ممن صعب عليه السفر إلى تبوك في الحر\n هـ\n { قلْ نارُ جهنم أشدُّ حراً } ، وقد آثرتموها بهذه المخالفة، { لو كانوا يفقهون } أن مآلهم إليها، أو كيف هي؟\n\n\n ما اختاروا بإيثار الدعة على الطاعة",
      "translations": []
    }
  ]
}