{
  "chapter": "التوبة",
  "text": "فليضحكوا۟ قليلا وليبكوا۟ كثيرا جزاءۢ بما كانوا۟ يكسبون",
  "translations": [
    {
      "translation": "So let them laugh a little, for weep they will, more as retribution for what they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let them, then, laugh little, and weep much at the contemplation of the punishment for the evil they have committed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They should laugh less and weep more as a recompense for what they have gained.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they should laugh a little and weep much; the reward of what they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let them laugh a little and (they will) cry much as a recompense of what they used to earn (by committing sins).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore they shall laugh little and weep much as a recompense for what they earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore let them laugh little, and weep much, in recompense for what they have been earning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then let them laugh a little: they will weep much, as the reward of what they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let them laugh a little and weep much in return for their misdeeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Little then let them laugh, and much they shall weep: the meed of that which they have been earning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let them laugh a little; much will they weep as a requital for what they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let them laugh a little: much will they weep: a recompense for the (evil) that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let them laugh a little and (they will) cry much as a recompense of what they used to earn (by committing sins).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall laugh but little and shed many tears. So shall they be recompensed for their earnings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let them laugh a little, and weep much; in recompense for what they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let them laugh a little and [then] weep much as recompense for what they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:82] But let them laugh a little, in this world, and weep much, in the Hereafter, as a requital for what they used to earn (the sentence is predicative of their state, expressed in the form of an imperative).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then let them laugh a little) in the life of this world: (they will weep much) in the Hereafter, (as the award 204 of what they used to earn) of what they used to say and do of transgression.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلْيَضْحَكُواْ } أولئك المتخلفون الهالكون في العذاب المؤبد، والوبال المخلد { قَلِيلاً } في الدنيا { وَلْيَبْكُواْ كَثِيراً } لما لحقهم بعد خروجهم منها من أنواع العذاب والنكال { جَزَآءً بِمَا كَانُواْ يَكْسِبُونَ } [التوبة: 82] فيها من الجرائم العظائم والمعاصي، والآثام\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فليضْحَكُوا قليلاً وليبكوا كثيراً جزاءً بما كانوا يكسِبُون } ، وهو إخبار عما يؤول إليه حالهم في الدنيا والآخرة، أي: سيضحكون قليلاً، ويبكون كثيراً لما يرون من سوء العاقبة، وأتى به على صيغة الأمر للدلالة على أن حَتمٌ واجب وقوعه\n قال ابن جزي: أمرٌ بمعنى الخبر، فضحكهم القليل في الدنيا مدة بقائهم فيها، وبكاؤهم الكثير في الآخرة، أي: سيضحكون قليلاً في الدنيا، ويبكون كثيراً في الآخرة، وقيل: هو بمعنى الأمر، أي: يجب أن يكونوا يضحكون قليلاً ويبكون كثيراً في الدنيا، لِمَا وقعوا فيه\n ـ",
      "translations": []
    }
  ]
}