{
  "chapter": "التوبة",
  "text": "فان رجعك الله الى طائفة منهم فاستـذنوك للخروج فقل لن تخرجوا۟ معى ابدا ولن تقتلوا۟ معى عدوا انكم رضيتم بالقعود اول مرة فاقعدوا۟ مع الخلفين",
  "translations": [
    {
      "translation": "If Allah returns you to a group of them, and they ask you for permission to go out, say, 'You will never go out with me, nor will you ever fight an enemy with me. You were happy to stay behind the first time, so stay behind with those who are left behind.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you come back to them by (the grace of) God, and they seek your permission to go (to fight), you should tell them: \"You will never go out nor fight the enemy with me any more. You preferred to stay back on the first occasion, so stay at home with those who stay behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if Allah brings you face to face with a party of them, and they ask your leave to go forth (to fight in the Way of Allah), tell them: \"You shall not go forth with me, and shall never fight against any enemy along with me. You were well-pleased to remain at home the first time, so now continue to remain with those who have stayed behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God brings you back safely and a group of hypocrites ask you to make them exempt from taking part in the battle, tell them, \"Never march with me and never fight with us against any of the enemies (of God). You chose to linger behind the first time, so this time stay behind with those who are of no help in the battle.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if Allah takes you back to a group of them and they seek permission from you to go out to fight, say to them, “You shall never go out with me nor ever fight with me against any enemy; you were happy to remain seated for the first time, therefore remain seated with those who stay behind.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah brings you back to a party of them (the hypocrites), and they ask your permission to go out (to fight), say: \"Never shall you go out with me nor fight an enemy with me; you were pleased to sit (inactive) on the first occasion, then you sit (now) with those who lag behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore if Allah brings you back to a party of them and then they ask your permission to go forth, say: By no means shall you ever go forth with me and by no means shall you fight an enemy with me; surely you chose to sit the first time, therefore sit (now) with those who remain behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, if God returns thee to a party of them and they ask leave of thee to go forth, say: 'You shall not go forth with me ever, and you shall not fight with me any enemy. You were well-pleased to tarry the first time, so now tarry with those behind.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah bring thee back (from the campaign) unto a party of them and they ask of thee leave to go out (to fight), then say unto them: Ye shall never more go out with me nor fight with me against a foe. Ye were content with sitting still the first time. So sit still, with the useless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So [Prophet], if God brings you back to a group of them, and should they ask your leave to go forth with you, say, \"You shall never go forth with me and shall never fight an enemy with me. You chose to sit at home the first time, so sit now with those who remain behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If, then, Allah bring thee back to a party of them, and they ask leave of thee for going forth, say thou: never ye shall go forth with me, nor ever fight an enemy with me; verily ye were pleased with sitting at home the first time, wherefore sit now with those who stay behind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah brings you back [from the battlefront] to a group of them and they seek your permission to go forth, say, ‘You shall never go forth with me, and you shall not fight with me against any enemy. You were indeed pleased to sit back the first time, so sit back with those who stay behind.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If, then, Allah bring thee back to any of them, and they ask thy permission to come out (with thee), say: \"Never shall ye come out with me, nor fight an enemy with me: for ye preferred to sit inactive on the first occasion: Then sit ye (now) with those who lag behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah brings you back to a party of them (the hypocrites), and they ask your permission to go out (to fight), say: \"Never shall you go out with me, nor fight an enemy with me; you agreed to sit inactive on the first occasion, then you sit (now) with those who lag behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah brings you back to a party of them and they ask permission to march with you, say: 'You shall never march with me, nor shall you fight with me against any enemy. You were pleased to remain on the first occasion, therefore, you shall now stay with those who remain behind'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God brings you back to a party of them, and they ask your permission to go out, say, “You will not go out with me, ever, nor will you ever fight an enemy with me. You were content to sit back the first time, so sit back with those who stay behind.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah should return you to a faction of them [after the expedition] and then they ask your permission to go out [to battle], say, \"You will not go out with me, ever, and you will never fight with me an enemy. Indeed, you were satisfied with sitting [at home] the first time, so sit [now] with those who stay behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:83] So if God brings you back, from Tabūk, to a party of them, of those hypocrites who stayed behind in Medina, and they ask leave of you to go forth, with you on some other campaign, say, to them: ‘You shall never more go forth with me, and you shall never fight with me against an enemy. You were content to stay behind the first time, so stay behind with those who stay behind’, away from [military] campaigns, such as women and children and others.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If Allah bring thee back) from the Battle of Tabuk (unto a party of them) a party of the hypocrites in Medina (and they ask of thee leave to go out (to fight)) in another battle, (then say unto them) Muhammad: (Ye shall never more go out with me) after the Battle of Tabuk (nor fight with me against a foe. Ye were content with sitting still the first time) upon leaving for the Battle of Tabuk. (So sit still) not participating in jihad, (with the useless) with the women and children.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَعَ ٱلْخَالِفِينَ } معناهُ معَ الذِينَ خَلفوا بعدَ الشَاخصينَ\n والخَوالفُ: النِّساءُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِن رَّجَعَكَ ٱللَّهُ } وردك من غزوتك هذه؛ أي: غزوة تبوك { إِلَىٰ طَآئِفَةٍ مِّنْهُمْ } أي: من المستخلفين، المستأذنين الذين قعدوا في المدينة بلا عذر، وبعدما قصدت عزوة أخرى { فَٱسْتَأْذَنُوكَ لِلْخُرُوجِ } تلاقياً لما مضى { فَقُلْ } لهم: { لَّن تَخْرُجُواْ مَعِيَ } إلى الجهاد { أَبَداً وَلَن تُقَاتِلُواْ مَعِيَ عَدُوّاً } أصلاً { إِنَّكُمْ } قوم { رَضِيتُمْ بِٱلْقُعُودِ } والتخلف { أَوَّلَ مَرَّةٍ } بلا عذر بل عن عذر وخديعة { فَٱقْعُدُواْ } دائماً { مَعَ ٱلْخَالِفِينَ } [التوبة: 83] المعذورين من النساء والصبيان، والزمنى والمرضى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { فإنَّ رجعَك اللَّهُ إلى طائفَةٍ منهم } أي: فإن ردك الله من الغزو إلى المدينة، وفيها طائفة من المتخلفين ـ يعني منافقيهم ـ وكانوا اثنى عشر رجلاً ممن تخلف من المنافقين، وإنما لم يقل: إليهم لأن منهم من تاب من النفاق، وندم على التخلف، { فاستأذنوك للخروج } معك إلى غزوة أخرى بعد تبوك، { فقل لن تخرجوا معي أبداً ولن تُقاتلوا معي عدواً } عقوبة لهم، وفيها خزي وتوبيخ لهم، { إنكم رضيتم بالقعود أَوَّلَ مرةٍ } ، يعني: عن تبوك، وهو تعليل لعدم خروجهم معه في المستقبل، { فاقعدُوا مع الخالفين } أي: المتخلفين، أي: لعدم تأهلهم للجهاد كالنساء والصبيان\n الإشارة: من قلَّ إيقانه، وضعف نور إيمانه، فرح ببقائه، مع متابعة هواه وتيسير أمور دنياه، وكره ارتكاب مشاق المجاهدة، واقتحام حَر المخالفة والمكابدة، وثبط من رآه يروم تلك الوجهة، ويريد أن يتأهب لدخول ميدان تلك الحضرة فسَنَندم قريباً، حين يفوز الشجعان بحضرة الوصال، ويتأهلون لمشاهدة الكبير المتعال، ولا ينفع الندم وقد زلت القدم، وإنما الصبر عند الصدمة الأولى\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "59:11",
      "similarity": 0.3135410751565924
    },
    {
      "verse": "5:24",
      "similarity": 0.31064840544299205
    },
    {
      "verse": "85:6",
      "similarity": 0.277151889647533
    },
    {
      "verse": "54:55",
      "similarity": 0.25666069264148494
    },
    {
      "verse": "2:95",
      "similarity": 0.25539205256432207
    }
  ]
}