{
  "chapter": "التوبة",
  "text": "ولا تعجبك امولهم واولدهم انما يريد الله ان يعذبهم بها فى الدنيا وتزهق انفسهم وهم كفرون",
  "translations": [
    {
      "translation": "Do not let their wealth and their children impress you. Allah merely wants to punish them by them in this world, and for them to expire while they are kafirun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not their wealth and children astonish you. God wishes to punish them through these in the world, and their souls will depart in a state of disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not their riches or their children excite your admiration. Through these Allah seeks to chastise them in this world, and that their lives will depart them while they are unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their wealth or children should not tempt you; God wants to punish them through these things in this life so that they will die as disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be surprised at their wealth or their children; Allah only wills to torment them with it in this world, and that they pass away upon disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not their wealth or their children amaze you. Allah only wants to punish them with these things in this world, and that their souls shall depart (die) while they are disbelievers.) We mentioned before the explanation of a similar Ayah, all the thanks and praises are due to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not their property and their children excite your admiration; Allah only wishes to chastise them with these in this world and (that) their souls may depart while they are unbelievers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not their possessions and their children please thee; God only desires thereby to chastise them in this present world, and that their souls should depart while they are unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not their wealth nor their children please thee! Allah purposeth only to punish them thereby in the world, and that their souls shall pass away while they are disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not let their wealth and their children dazzle you. God only wants to punish them through these things in this world, and let their souls depart while they deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let nor their riches and their children amaze thee. Allah intendeth only to torment them therewith in the world, and that their souls may pass away while they are infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let not their possessions or their children impress you. Allah only desires to punish them with these in this world, and that their souls may depart while they are faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor let their wealth nor their (following in) sons dazzle thee: Allah's plan is to punish them with these things in this world, and that their souls may perish in their (very) denial of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not their wealth or their children amaze you. Allah's Plan is to punish them with these things in this world, and that their souls shall depart (die) while they are disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let neither their riches nor their children please you. With it Allah wants to punish them in this life, so that their souls depart while they disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not let their possessions and their children impress you. God desires to torment them through them in this world, and their souls expire while they are disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let not their wealth and their children impress you. Allah only intends to punish them through them in this world and that their souls should depart [at death] while they are disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:85] And let not their wealth and their children please you; God desires only to chastise them thereby in this world, and that their souls should depart while they are disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Let not their wealth) the abundance of their wealth (nor their children) nor the abundance of their children (please thee! Allah purposeth only to punish them thereby in the world) and in the Hereafter, (and that their souls shall pass away while they are disbelievers) and that they shall die while they are unbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما تحقق عندك، وظهر كفرهم وفسقهم { لاَ تُعْجِبْكَ أَمْوَٰلُهُمْ وَأَوْلَـٰدُهُمْ } التي هي وبال عليهم { إِنَّمَا يُرِيدُ ٱللَّهُ } المضف المذل لعصاة عباده { أَن يُعَذِّبَهُمْ بِهَا فِي ٱلدُّنْيَا } بأنواع الحوادث والمصيبات { وَتَزْهَقَ أَنفُسُهُمْ } وميلهم ومحبتهم منوطة بها { وَهُمْ كَٰفِرُونَ } [التوبة: 85] بالله، غير معتبرين معترفين بألوهيته وربوبيته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}