{
  "chapter": "التوبة",
  "text": "واذا انزلت سورة ان ءامنوا۟ بالله وجهدوا۟ مع رسوله استـذنك او۟لوا۟ الطول منهم وقالوا۟ ذرنا نكن مع القعدين",
  "translations": [
    {
      "translation": "When a sura is sent down saying: 'Have iman in Allah and do jihad together with His Messenger,' those among them with wealth will ask you to excuse them, saying, 'Let us remain with those who stay behind.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever a Surah is revealed (which says): \"Believe in God and fight along with His Prophet,\" the well-to-do among them ask for leave to stay at home, and say: \"Leave us with those who are left behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever any surah is revealed enjoining: \"Believe in Allah and strive (in His Way) along with His Messenger,\" the affluent among them ask you to excuse them, saying: \"Leave us with those who will sit back at home.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a chapter of the Quran is revealed telling them to believe in God and fight along with His Messenger for His cause against His enemies, the healthy and rich ones of them ask you to exempt them from taking part in the battle for the cause of God and to let them stay home with the people who are of no help in the battle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a chapter is sent down that “Accept faith in Allah and fight along with His Noble Messenger”, the men of means among them seek exemption from you and say, “Leave us, for us to be with those who sit.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a Surah is revealed, enjoining them to believe in Allah and to strive hard and fight along with His Messenger, the wealthy among them ask your leave to exempt them and say, \"Leave us (behind), we would be with those who sit (at home).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever a chapter is revealed, saying: Believe in Allah and strive hard along with His Apostle, those having ampleness of means ask permission of you and say: Leave us (behind), that we may be with those who sit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a sura is sent down, saying, 'Believe in God, and struggle with His Messenger,' the affluent among them ask leave of thee, saying, 'Let us be with the tarriers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a surah is revealed (which saith): Believe in Allah and strive along with His messenger, the men of wealth among them still ask leave of thee and say: Suffer us to be with those who sit (at home).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a chapter is revealed enjoining, \"Believe in God and strive for the cause of God along with His Messenger,\" the wealthy among them ask you to exempt them saying, \"Let us stay with those who are to stay behind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever any Surah is sent down commanding: believe in Allah and strive hard in the company of His apostle, the opulent among them ask leave of thee, and say: leave us; we shall be with those who stay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a surah is sent down [declaring]: ‘Have faith in Allah, and wage jihad along with His Apostle, the affluent among them ask you for leave, and say, ‘Let us remain with those who sit back.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a Sura comes down, enjoining them to believe in Allah and to strive and fight along with His Messenger, those with wealth and influence among them ask thee for exemption, and say: \"Leave us (behind): we would be with those who sit (at home).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a Surah (chapter from the Quran) is revealed, enjoining them to believe in Allah and to strive hard and fight along with His Messenger, the wealthy among them ask your leave to exempt them (from Jihad) and say, \"Leave us (behind), we would be with those who sit (at home).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever a chapter is sent down, saying: 'Believe in Allah and struggle with His Messenger' the rich among them asked you to excuse them, saying: 'Leave us with those who are to stay behind'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a chapter is revealed, stating: “Believe in God and strive with His Messenger,” the prominent among them ask you for exemption. They say, “Allow us to stay with those who stay behind.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a surah was revealed [enjoining them] to believe in Allah and to fight with His Messenger, those of wealth among them asked your permission [to stay back] and said, \"Leave us to be with them who sit [at home].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:86] And when a sūra, that is, a section of the Qur’ān, is revealed, saying: ‘Believe in God and strive with His Messenger’, the affluent among them ask leave of you, saying, ‘Leave us to be with those who sit at home’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when a surah) from the Qur'an (is revealed (which saith)) as a command: (Believe in Allah) be genuine in your belief in Allah (and strive along with His messenger, the men of wealth among them) among the hypocrites: 'Abdullah Ibn Ubayy, Jadd Ibn Qays and Mu'attib Ibn Qushayr (still ask leave of you) Muhammad (and say: Suffer us to be with those who sit (at home)) without any excuse.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من شدة نفاقهم وبغضهم مع الله ورسوله { إِذَآ أُنزِلَتْ سُورَةٌ } من القرآن ناطقة { أَنْ آمِنُواْ } أيها المكلفون { بِٱللَّهِ وَجَاهِدُواْ مَعَ رَسُولِهِ } في سبيله { ٱسْتَأْذَنَكَ أُوْلُواْ ٱلطَّوْلِ } والسعة { مِنْهُمْ } أي: صناديدهم وعظماؤهم؛ خوفاً من أموالهم وأنفسهم { وَقَالُواْ ذَرْنَا } ودعنا { نَكُنْ مَّعَ ٱلْقَاعِدِينَ } [التوبة: 86] المعذورين الغير القادرين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { وإذا أنزلت سورة } ، أو بعضها، في شأن الجهاد قائله: { ان آمنوا بالله } وحده، { وجاهدوا مع رسوله } صلى الله عليه وسلم، { استأذَنَكَ } في التخلف { أُولو الطَّولِ منهم } أي: أولو الغنى والسعة، { وقالوا ذَرْنَا نكن مع القاعدين } الذين قعدوا لعذر، { رَضُوا بأن يكونوا مع الخوالِف } مع النساء، جمع خالفة، وقد يقال: الخالفة للذي لا خير فيه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "73:7",
      "similarity": 0.4840758771333192
    },
    {
      "verse": "76:26",
      "similarity": 0.4703244239183032
    },
    {
      "verse": "40:3",
      "similarity": 0.42199731741612245
    },
    {
      "verse": "9:124",
      "similarity": 0.3453061554583371
    },
    {
      "verse": "2:23",
      "similarity": 0.31902617179362536
    }
  ]
}