{
  "chapter": "التوبة",
  "text": "لكن الرسول والذين ءامنوا۟ معه جهدوا۟ بامولهم وانفسهم واو۟لئك لهم الخيرت واو۟لئك هم المفلحون",
  "translations": [
    {
      "translation": "But the Messenger and those who have iman along with him have done jihad with their wealth and with themselves. They are the people who will have the good things. They are the ones who are successful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Prophet and those who have embraced the faith with him, and have fought wealth and soul (in the way of God), are blessed and will be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Messenger and those who shared his faith strove with their belongings and their lives. It is they who shall have all kinds of good. It is they who shall prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Messenger of God and the believers with him fought for the cause of God with their possessions and in person and their reward will be all good things and everlasting happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Noble Messenger and those who accepted faith with him, fought with their wealth and lives; and for them only are the virtues (rewards); and it is they who have achieved the goal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Messenger and those who believed with him strove hard and fought with their wealth and their lives. Such are they for whom are the good things, and it is they who will be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Apostle and those who believe with him strive hard with their property and their persons; and these it is who shall have the good things and these it is who shall be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Messenger, and the believers with him, have struggled with their possessions and their selves, and those -- for them await the good things; those -- they are the prosperers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the messenger and those who believe with him strive with their wealth and their lives. Such are they for whom are the good things. Such are they who are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Messenger and those who shared his faith strove hard with their possessions and their lives. It is they who shall have all kinds of good, and it is they who shall surely prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the apostle and those who believed in his company strave hard with their riches and their lives. These are they for whom are goods, and these: they are the blissful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Apostle and the faithful who are with him wage jihad with their possessions and persons, and to such belong all the blessings, and it is they who are the felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Messenger, and those who believe with him, strive and fight with their wealth and their persons: for them are (all) good things: and it is they who will prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Messenger (Muhammad SAW) and those who believed with him (in Islamic Monotheism) strove hard and fought with their wealth and their lives (in Allah's Cause). Such are they for whom are the good things, and it is they who will be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Messenger and those who believed with him struggled with their wealth and their selves For them awaits goodness and those are the winners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Messenger and those who believe with him struggle with their possessions and their lives. These have deserved the good things. These are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Messenger and those who believed with him fought with their wealth and their lives. Those will have [all that is] good, and it is those who are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:88] But the Messenger and those who believe with him strive with their wealth and their lives: for them are the good things, in this life and in the Hereafter; those, they are the successful, the triumphant.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But the messenger) Muhammad (pbuh) (and those who believe) in secret and in the open (with him strive with their wealth and their lives) in the way of Allah. (Such are they for whom are the good things) accepted good deeds in the life of this world; it is also said that the good things means: beautiful maidens in the Hereafter. (Such are they who are the successful) those who escape Allah's wrath and torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لذلك { جَاهَدُواْ بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ } في سبيل الله\n ابتغاءً لمرضاته وتثبيتاً في دينه { وَأُوْلَـٰئِكَ } المؤمنون المجاهدون { لَهُمُ ٱلْخَيْرَاتُ } المثوبات العظمى\n والدرجات العليا عند الله { وَأُوْلَـٰئِكَ هُمُ ٱلْمُفْلِحُونَ } [التوبة: 88] الفائزون من عنده بما لا عينٌ رأت\n ولا أذنٌ سمعت\n ولا خطر على قلب بشر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأولئك لهم الخيراتُ } منافع الدارين: النصر والغنيمة في الدنيا\n والجنة والكرامة في الآخرة\n وقيل: الحُور\n لقوله\n[الرحمن: 70]\n و { وأولئك هم المفلحون } الفائزون بالمطالب البهية والمراغب السنية\n { أعدَّ اللَّهُ لهم جنات تجري من تحتها الأنهار خالدين فيها ذلك الفوز العظيم } بيان لبعض الخيرات الأخروية\n  الإشارة: إذا ظهر الدعاة إلى الله يُشوقون الناس إلى حضرة الله ترى من صُرِفَ عنه عِنَانُ العناية\n ولم يضرب له مع السابقين بسهم الهداية\n يميل إلى التقاعد إلى وطن الراحة\n والميل إلى ما ألفه من سيئ العادة\n يستأذن أن يتخلف مع النساء والصبيان\n ويتنكب طريق الأقوياء من الشجعان\n فإن تخلف هذا مع عوام الضعفاء فقد تقدم لهذا الأمر من يقوم به من الأقوياء\n اختارهم الله لحضرته\n وقواهم على مكافحة مشاهدته ومحبته\n جاهدوا نفوسهم في معرفة محبوبهم\n وبذلوا أموالهم ومهجهم في الوصول إلى مطلوبهم\n { وأولئك لهم الخيرات وأولئك هم المفلحون }\n ثم ذكر اعتذار الأعراب\n فقال: { وَجَآءَ ٱلْمُعَذِّرُونَ مِنَ ٱلأَعْرَابِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "61:11",
      "similarity": 0.6875878001189253
    },
    {
      "verse": "9:44",
      "similarity": 0.5595610419520861
    },
    {
      "verse": "49:15",
      "similarity": 0.5141051891904809
    },
    {
      "verse": "29:69",
      "similarity": 0.4646119554332524
    },
    {
      "verse": "29:6",
      "similarity": 0.4361532577682441
    }
  ]
}