{
  "chapter": "التوبة",
  "text": "اعد الله لهم جنت تجرى من تحتها الانهر خلدين فيها ذلك الفوز العظيم",
  "translations": [
    {
      "translation": "Allah has prepared Gardens for them with rivers flowing under them, remaining in them timelessly, for ever. That is the great victory.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has provision for them of gardens with Streams of running water, where they will abide for ever. This will be the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has prepared for them Gardens beneath which rivers flow. There shall they abide. That is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has established gardens for them wherein streams flow and wherein they will live forever. This indeed is the greatest triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has kept ready for them Gardens beneath which rivers flow, abiding in it forever; this is the greatest success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them Allah has prepared Gardens (Paradise) under which rivers flow, to dwell therein forever. That is the supreme success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has prepared for them gardens beneath which rivers flow, to abide in them; that is the great achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has prepared for them gardens underneath which rivers flow, therein to dwell forever; that is the mighty triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath made ready for them Gardens underneath which rivers flow, wherein they will abide. That is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has prepared for them Gardens through which rivers flow, in which they shall abide forever. That is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them Allah hath gotten ready Gardens whereunder rivers flow, wherein they shall be as abiders. That is the supreme achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has prepared for them gardens with streams running in them, to remain in them [forever]. That is the great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath prepared for them gardens under which rivers flow, to dwell therein: that is the supreme felicity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them Allah has got ready Gardens (Paradise) under which rivers flow, to dwell therein forever. That is the supreme success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has prepared for them gardens underneath which rivers flow, in which they shall live for ever. That is the greatest winning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has prepared for them gardens beneath which rivers flow, wherein they will abide forever. That is the great victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has prepared for them gardens beneath which rivers flow, wherein they will abide eternally. That is the great attainment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:89] God has prepared for them Gardens underneath which rivers flow, to abide therein: that is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah hath made ready for them Gardens underneath which) beneath its trees and habitations (rivers) rivers of wine, water, honey and milk (flow, wherein they will abide) they will dwell in Paradise: never to die or be removed. (That) which I have mentioned (is the Supreme Triumph) the abounding safety: they earned Paradise and that which is in it and were saved from hell and that which is in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { أَعَدَّ ٱللَّهُ } المجازي لخلَّص عباده { لَهُمْ } أي: لهؤلاء المجاهدين المرابطين قلوبهم مع الله ورسوله، الباذلين مهجهم في سبيله { جَنَّاتٍ } منتزهات علمية وعينية وحقية { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } أنهار الشهود والكشوف والواردات والإلهامات، لا دفعة ولا دفعات، بل { خَالِدِينَ فِيهَا } أبداً { ذٰلِكَ ٱلْفَوْزُ ٱلْعَظِيمُ } [التوبة: 89] واللطف العميم لهؤلاء المختصين بالعناية الأزلية والسعادة السرمدية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}