{
  "chapter": "التوبة",
  "text": "ولا على الذين اذا ما اتوك لتحملهم قلت لا اجد ما احملكم عليه تولوا۟ واعينهم تفيض من الدمع حزنا الا يجدوا۟ ما ينفقون",
  "translations": [
    {
      "translation": "nor is anything held against those who, when they came to you for you to provide them with mounts and you said, 'I cannot find anything on which to mount you,' turned away with their eyes overflowing with tears, overcome by grief at having nothing to give.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor will they be blamed who came to you for transport, to whom you said: \"I cannot find any means of conveyance for you,\" and they went away in tears, grieving that they lacked the means to spend (on carriage).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor can there be any cause for reproach against those who, when they came to you asking for mounts to go to the battlefront, and when you said that you had no mounts for them, they went back, their eyes overflowing with tears, grieving that they had no resources to enable them to take part in fighting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who come to you, (Muhammad), asking to be taken to the battle, but you cannot find the necessary means for them, are exempt from the duty of fighting for the cause of God, even though they leave you with their eyes flooded with tears because of not being able to help the cause of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor against those who humbly present themselves before you in order that you provide them a mount, and receive an answer from you that “I do not have any beast to carry you” – and so they turn back with eyes overflowing with tears, due to the sorrow that they could not find the means to spend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor (is there blame) on those who came to you to be provided with mounts, when you said: \"I can find no mounts for you,\" they turned back, with their eyes overflowing with tears of grief that they could not find anything to spend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor in those who when they came to you that you might carry them, you said: I cannot find that on which to carry you; they went back while their eyes overflowed with tears on account of grief for not finding that which they should spend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "neither against those who, when they came to thee, for thee to mount them, thou saidst to them, 'I find not whereon to mount you'; they turned away, their eyes overflowing with tears of sorrow, because they found nothing to expend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor unto those whom, when they came to thee (asking) that thou shouldst mount them, thou didst tell: I cannot find whereon to mount you. They turned back with eyes flowing with tears, for sorrow that they could not find the means to spend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor [does any blame] attach to those who came to you to be provided with mounts, and when you said, \"I can find no mounts for you,\" they went back, and tears welled up in their eyes with sadness, since they could not find any way to contribute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor on those who, when they came unto thee that thou mightest mount them and thou saidst: I find not any animal to mount you on, turned back while their eyes overflowed with tears for grief that they could not find ought to expend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor [is there any blame] on those to whom, when they came to you to provide them with a mount, you said, ‘I do not find any mount for you,’ and they turned back, their eyes flowing with tears, grieved because they did not find any means to spend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor (is there blame) on those who came to thee to be provided with mounts, and when thou saidst, \"I can find no mounts for you,\" they turned back, their eyes streaming with tears of grief that they had no resources wherewith to provide the expenses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor (is there blame) on those who came to you to be provided with mounts, and when you said: \"I can find no mounts for you,\" they turned back, while their eyes overflowing with tears of grief that they could not find anything to spend (for Jihad).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor shall those who came to you to be provided with mounts. And when you said: 'I can find no mounts for you' they turned back, their eyes streaming with tears grieving that they could not find the means to spend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor on those who approach you, wishing to ride with you, and you said, “I have nothing to carry you on.” So they went away, with their eyes overflowing with tears, sorrowing for not finding the means to spend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor [is there blame] upon those who, when they came to you that you might give them mounts, you said, \"I can find nothing for you to ride upon.\" They turned back while their eyes overflowed with tears out of grief that they could not find something to spend [for the cause of Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:92] Nor against those who, when they came to you so that you might give them a mount, [to ride] with you on the raid — these were seven men of the Ansār; but it is also said that they were the Banū Muqrin — you having said to them, ‘I cannot find [a mount] whereon to mount you’ (this [last sentence] is a circumstantial qualifier), turned back (this is the response to the [clause beginning with] idhā, ‘when’), that is, they departed, their eyes flowing, pouring, with tears (min al-dam‘i: min is explicative) for sorrow that they could not find the means to expend, for the [campaign] struggle.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nor unto those whom, when they came to you (asking) that thou shouldest mount them) spend on them so that they take part in jihad. The reference here is to 'Abdullah Ibn Maghfal Ibn Yasar al-Muzani, Salim Ibn 'Umayr al-Ansari and their fellow Companions, (thou didst tell) them: (I cannot find) provision (whereon to mount you) for jihad. (They turned back) they left you (with eyes flowing with tears, for sorrow that they could not find the means to spend) for jihad.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ } حرج ولا عقاب أيضاً { عَلَى } المؤمنين المخلصين { ٱلَّذِينَ إِذَا مَآ أَتَوْكَ } حين صمم عزمك إلى الخروج { لِتَحْمِلَهُمْ } على الخفاف المرفوعة، والنعال المخصوفة، كمعقل بن يسار وصخر بن خنساء وسالم بن عمير وثعلبة بن غنمة وعبد الله بن زيد وعبد الله بن مغفل، وهم البكاؤون، وعبد الله بن كعب الأنصاري وغيرهم، حتى يبلغوا مكان العدو { قُلْتَ } لهم: { لاَ أَجِدُ مَآ أَحْمِلُكُمْ عَلَيْهِ تَوَلَّوْا } وانصرفوا من عند آيسين { وَّأَعْيُنُهُمْ } حين توليهم { تَفِيضُ } وتسيل { مِنَ ٱلدَّمْعِ حَزَناً } وأسفاً { أَلاَّ يَجِدُواْ } لئلا يجدوا { مَا يُنْفِقُونَ } [التوبة: 92] حتى يبلغوا المعركة ويحضروا الوغى، فهؤلاء أيضاً لا عتاب لهم ولا عقاب، بل يرجى لهم الأجر الجزيل من الله؛ لإخلاصهم وأسفهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قلت لا أجِدُ ما أحملكم عليه } وليس عندي ما أحملكم عليه، { تولَّوا } عنك { وأعيُنهم تفيضُ من الدمع } أي: يفيض دمعها { حزناً } على { ألا يجدوا ما يُنفقون } في غزوهم\n زاد البخاري: فلما رجع أبو موسى وأصحابه، أُتي ـ عليه الصلاة والسلام ـ بِنَهَب إبل، فدعاهم وحملهم عليها، فقالوا: يا رسول الله، إِنَّكَ حَلَفتَ أَلا تِحْمِلنَا، فخفنا أن نكون أغفلناك يمينك، فقال:\n\n \" ما أنا حملتكم، ولكن الله حملكم، وإنِّي والله، ما أحْلِفُ على يَمِينٍ فَأرَى خَيْراً مِنْها إلا كَفّرْتُ عن يَمِيني وأَتَيتُ الذي هُوَ خَيْر \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:83",
      "similarity": 0.9055971184088303
    },
    {
      "verse": "2:199",
      "similarity": 0.28031271521502255
    },
    {
      "verse": "24:14",
      "similarity": 0.27704339333784217
    },
    {
      "verse": "7:50",
      "similarity": 0.27456670737677485
    },
    {
      "verse": "46:8",
      "similarity": 0.2734047491664524
    }
  ]
}