{
  "chapter": "التوبة",
  "text": "انما السبيل على الذين يستـذنونك وهم اغنياء رضوا۟ بان يكونوا۟ مع الخوالف وطبع الله على قلوبهم فهم لا يعلمون",
  "translations": [
    {
      "translation": "There are only grounds against those who ask you for permission to stay when they are rich. They were pleased to be among those who were left behind. Allah has sealed up their hearts so they do not know.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blame will lie on those who are rich yet ask your leave to stay behind. They prefer to stay with women who stay at home, and God seals their hearts; so they do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But there are grounds for reproach against those who seek leave to stay behind even though they are affluent. They are the ones who were content to be with the womenfolk who stay behind. Allah has set a seal on their hearts, leaving them bereft of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The blameworthy ones are those who ask for exemption despite their ability and who preferred to stay at home with those who are truly exempt. God has placed a seal on their hearts but they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The way (of reproach) is only against those who seek exemption from you although they are rich; they preferred to be with the women who stay behind – and Allah has sealed their hearts, so they do not know anything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The means (of complaint) is only against those who are rich, and yet ask exemption. They are content to be with (the women) who sit behind (at home) and Allah has sealed up their hearts so that they know not (what they are losing).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The way (to blame) is only against those who ask permission of you though they are rich; they have chosen to be with those who remained behind, and Allah has set a seal upon their hearts so they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The way is open only against those who ask leave of thee, being rich; they are well-pleased to be with those behind; God has set a seal on their hearts, so they know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The road (of blame) is only against those who ask for leave of thee (to stay at home) when they are rich. They are content to be with the useless. Allah hath sealed their hearts so that they know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The blameworthy are those who are men of wealth and yet ask for exemption. They are content to be with those [women] who stay behind. God has sealed their hearts: they do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The way is only against those who ask leave of thee while they are rich. They are pleased that they should be with the women sitters-at-home. Allah hath sealed up their hearts, so they know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The blame lies only on those who ask leave of you [to stay behind] though they are well-off. They are pleased to be with those who stay back; Allah has set a seal on their hearts, so they do not know [the outcome of their conduct].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ground (of complaint) is against such as claim exemption while they are rich. They prefer to stay with the (women) who remain behind: Allah hath sealed their hearts; so they know not (What they miss).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ground (of complaint) is only against those who are rich, and yet ask exemption. They are content to be with (the women) who sit behind (at home) and Allah has sealed up their hearts (from all kinds of goodness and right guidance) so that they know not (what they are losing).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the blame is to be laid on those who asked permission of you whilst they are rich. They are content to remain with those who stay behind. Allah has set a seal upon their hearts so they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But blame is on those who ask you for exemption, although they are rich. They are content to be with those who stay behind. God has sealed their hearts, so they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The cause [for blame] is only upon those who ask permission of you while they are rich. They are satisfied to be with those who stay behind, and Allah has sealed over their hearts, so they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:93]   The way [of blame] is only against those who ask leave of you, to stay behind, when they are rich. They are content to be with those who stay behind and God has set a seal on their hearts, so that they do not know: a similar statement has already been made.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The road (of blame) is only against those who ask for leave of thee) to stay at home (when they are rich) these are 'Abdullah Ibn Ubayy, Jadd Ibn Qays, Mu'attib Ibn Qushayr and their host who were about 70 men. (They are content to be with the useless) with the women and children. (Allah hath sealed their hearts so that they know not) Allah's command nor do they genuinely believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّمَا ٱلسَّبِيلُ } بالمعاتبة والمعاقبة، وأنواع العذاب { عَلَى ٱلَّذِينَ يَسْتَأْذِنُونَكَ } بالقعود معتذرين { وَ } الحال أنه { هُمْ أَغْنِيَآءُ } مستطيعون قادرون بالجسد والمال، غاية ما في الباب أنهم { رَضُواْ } من خبث باطنهم ومرض قلوبهم { بِأَن يَكُونُواْ مَعَ ٱلْخَوَالِفِ } المعذورين الغير االمستطيعين { وَ } ما ذلك إلا أن { طَبَعَ ٱللَّهُ } المذل والمضل لأهل الغفلة والعناد { عَلَىٰ قُلُوبِهِمْ } بالجهل والضلال { فَهُمْ لاَ يَعْلَمُونَ } [التوبة: 93] جهلهم وضلالهم حتى يتسببوا لإنزاحتها وإزالتها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:87",
      "similarity": 0.7583049347556267
    },
    {
      "verse": "30:59",
      "similarity": 0.7402852260500679
    },
    {
      "verse": "16:108",
      "similarity": 0.6432718953564549
    },
    {
      "verse": "63:3",
      "similarity": 0.6181331872286588
    },
    {
      "verse": "10:74",
      "similarity": 0.6130931862094784
    }
  ]
}