{
  "chapter": "التوبة",
  "text": "سيحلفون بالله لكم اذا انقلبتم اليهم لتعرضوا۟ عنهم فاعرضوا۟ عنهم انهم رجس وماوىهم جهنم جزاءۢ بما كانوا۟ يكسبون",
  "translations": [
    {
      "translation": "They will swear to you by Allah when you return to them, so that you leave them alone. Leave them alone, then! They are filth. Their shelter will be Hell as repayment for what they did.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will beg you in the name of God, on your return, to forgive them; but you keep away from them: They are scum; their abode is Hell: Requital for what they had done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you return to them they will surely swear to you in the name of Allah that you may leave them alone. So do leave them alone; they are unclean. Hell shall be their home, a recompense for what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you return they will appeal to you in the Name of God to leave them alone. So leave them alone. They are filthy and their dwelling will be hell as a recompense for what they had gained.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will now swear by Allah before you, when you return to them, in order that you do not pay attention to them; so do not bother about them; they are indeed filthy; and their destination is hell; the reward of what they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will swear by Allah to you (Muslims) when you return to them, that you may turn away from them. So turn away from them. Surely, they are Rijs (impure), and Hell is their dwelling place -- a recompense for that which they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will swear to you by Allah when you return to them so that you may turn aside from them; so do turn aside from them; surely they are unclean and their abode is hell; a recompense for what they earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will swear to you by God, when you turn back to them, that you may turn aside from them. So turn aside from them, for they are an abomination, and their refuge is Gehenna -- a recompense for what they have been earning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will swear by Allah unto you, when ye return unto them, that ye may let them be. Let them be, for lo! they are unclean, and their abode is hell as the reward for what they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you return, they will swear to you by God so that you may leave them alone, so leave them alone. They are unclean, and Hell will be their home as a reward for their actions --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will indeed swear unto you by Allah when ye return to them that ye may avert from them. So avert from them: verily they are an abomination, and their resort is Hell--a recompense for that which they have been earning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will swear to you by Allah when you return to them, that you may leave them alone. So leave them alone. They are indeed filth, and their refuge shall be hell, a requital for what they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will swear to you by Allah, when ye return to them, that ye may leave them alone. So leave them alone: For they are an abomination, and Hell is their dwelling-place,-a fitting recompense for the (evil) that they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will swear by Allah to you (Muslims) when you return to them, that you may turn away from them. So turn away from them. Surely, they are Rijsun [i.e. Najasun (impure) because of their evil deeds], and Hell is their dwelling place, - a recompense for that which they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you return to them, they will swear to you by Allah that you might turn aside from them. Let them alone, they are unclean. Gehenna shall be their refuge, a recompense for their earnings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will swear to you by God, when you return to them, that you may leave them alone. So leave them alone. They are a disgrace, and their destiny is Hell; a reward for what they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will swear by Allah to you when you return to them that you would leave them alone. So leave them alone; indeed they are evil; and their refuge is Hell as recompense for what they had been earning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:95] They will swear to you by God, when you turn back, [when] you return, to them, from Tabūk, that they had [genuine] excuses for staying behind, so that you may leave them be, refraining from reproaching them. So leave them be, for they are an abomination, filth, on account of their inner vileness, and their abode shall be Hell, as requital for what they used to earn.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They) 'Abdullah Ibn Ubayy and his host (will swear by Allah unto you, when ye return) from the Battle of Tabuk (unto them) in Medina, (that ye may let them be) that you may pardon them and not punish them. (Let them be) and do not punish them, (for lo! they are unclean) impure and filthy, (and their abode) their destiny (is hell as the reward for what they used to earn) for what they used to say and do of evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن جملة نفاقهم وتلبسيهم: إنهم { سَيَحْلِفُونَ } يقسمون { بِٱللَّهِ لَكُمْ إِذَا ٱنْقَلَبْتُمْ } ورجعتم مشتكياً معاتباً { إِلَيْهِمْ } عن قعودهم وتخلفهم، إنما عرضهم من الحلف الكاذب تغريركم وتلبيسكم { لِتُعْرِضُواْ عَنْهُمْ } وعن عتابهم، ولا تسألوا عن مخالفتهم وقعودهم { فَأَعْرِضُواْ عَنْهُمْ } وعن عتابهم قبل حلفهم وتلبيسهم، ولا تلتفتوا إليهم { إِنَّهُمْ } في أنفسهم { رِجْسٌ } جبلتهم على الخباثة والنجاسة لا تقبل التطهير بالتأديب أصلاً { وَمَأْوَاهُمْ } أي: مرجعهم ومنقلبهم في النشأة الأخرى { جَهَنَّمُ } الطرد والخذلان { جَزَآءً بِمَا كَانُواْ يَكْسِبُونَ } [التوبة: 95] في النشأة الأولى من الكفر والنفاق، والإصرار على الشرك والشقاق\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:100",
      "similarity": 0.4964040443299919
    },
    {
      "verse": "9:125",
      "similarity": 0.46894660143894795
    },
    {
      "verse": "9:62",
      "similarity": 0.42007835543121497
    },
    {
      "verse": "9:56",
      "similarity": 0.41815461548565
    },
    {
      "verse": "9:96",
      "similarity": 0.41232845516200667
    }
  ]
}