{
  "chapter": "التوبة",
  "text": "يحلفون لكم لترضوا۟ عنهم فان ترضوا۟ عنهم فان الله لا يرضى عن القوم الفسقين",
  "translations": [
    {
      "translation": "They will swear to you to make you pleased with them, but even if you are pleased with them, Allah is certainly not pleased with deviant people.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will plead on oath that you accept them. Even if you accept them, remember God does not accept people who are disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will swear to you in order to please you. But even if you become pleased with them, Allah will not be pleased with such an evil-doing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear in the Name of God to please you. Even if you were to be pleased with them, God is not pleased with evil-doing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear before you that you may be pleased with them; so if you become pleased with them, then indeed Allah will never be pleased with the sinful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (the hypocrites) swear to you (Muslims) that you may be pleased with them, but if you are pleased with them, certainly Allah is not pleased with the people who are Fasiqin (rebellious).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will swear to you that you may be pleased with them; but if you are pleased with them, yet surely Allah is not pleased with the transgressing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will swear to you, that you may be well-pleased with them; but if you are well-pleased with them, God will surely not be well-pleased with the people of the ungodly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear unto you, that ye may accept them. Though ye accept them. Allah verily accepteth not wrongdoing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they will swear to you, so that you may be pleased with them. But [even] if you are pleased with them, God is not pleased with rebellious people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will swear unto you in order that ye may be well- pleased with them. Then if ye are well-pleased with them, verily Allah will not be well-pleased with an ungodly people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear to you that you may be reconciled to them. But even if you are reconciled to them, Allah shall not be reconciled to the transgressing lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will swear unto you, that ye may be pleased with them but if ye are pleased with them, Allah is not pleased with those who disobey.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (the hypocrites) swear to you (Muslims) that you may be pleased with them, but if you are pleased with them, certainly Allah is not pleased with the people who are Al-Fasiqun (rebellious, disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will swear to you in order to please you. But if you will be pleased with them, Allah will not be pleased with the evildoing nation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will swear to you that you may accept them. But even if you accept them, God does not accept the wicked people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear to you so that you might be satisfied with them. But if you should be satisfied with them - indeed, Allah is not satisfied with a defiantly disobedient people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:96] They will swear to you, that you may be satisfied with them; but if you are satisfied with them, God will surely not be satisfied with the wicked folk, that is, with them: your satisfaction is of no avail in the face of the wrath of God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They swear unto you, that ye may accept them) due to their swearing. (Though ye accept them) due to lying with their oaths, (Allah verily accepteth not wrong-doing folk) the hypocrites.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإنَّما { يَحْلِفُونَ لَكُمْ } حين شكواكم وعتابكم { لِتَرْضَوْاْ عَنْهُمْ } وتقبلوا إخلاصهم ومودتهم وتكونوا معهم كما كنتم { فَإِن تَرْضَوْاْ عَنْهُمْ } بمجرد حلفهم الكاذب، وتغريرهم الفاسد، لا يغني رضاكم عنهم شيئاً من سخط الله عليهم { فَإِنَّ ٱللَّهَ } المطلع لما في ضمائرهم من الأكنة والنفاق { لاَ يَرْضَىٰ عَنِ ٱلْقَوْمِ ٱلْفَاسِقِينَ } [التوبة: 96] الخارجين عن مقتضى الأوامر والنواهي الواردة؛ لتطهير النفوس الخبيثة عن أرجاس الطبيعة، وتصفيتها عن أدناس الأخلاق الذميمة، العائقة عن الوصول إلى مقر التوحيد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:62",
      "similarity": 0.8537488534573967
    },
    {
      "verse": "9:56",
      "similarity": 0.7337643090548812
    },
    {
      "verse": "58:14",
      "similarity": 0.6146706014958663
    },
    {
      "verse": "58:18",
      "similarity": 0.5939224787839873
    },
    {
      "verse": "9:95",
      "similarity": 0.4123284551620067
    }
  ]
}