{
  "chapter": "التوبة",
  "text": "ومن الاعراب من يتخذ ما ينفق مغرما ويتربص بكم الدوائر عليهم دائرة السوء والله سميع عليم",
  "translations": [
    {
      "translation": "Among the desert arabs there are some who regard what they give as an imposition and are waiting for your fortunes to change. The evil turn of fortune will be theirs! Allah is All-Hearing, All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of these rustics take whatever they spend in the way of God as a penalty, and wait for an adverse turn in your fortune. For them will be the adverse change, as God hears all and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the bedouin Arabs there are such as regard whatever they spend (in the Way of Allah) as a fine and wait for some misfortune to befall you. May ill fortune befall them! Allah is All-Hearing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever some of the desert dwelling Arabs spend for the cause of God, they consider it a loss to themselves. They wish to see you in trouble. Trouble has struck them already. God is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some of the ignorant are those who when spending in Allah's cause consider it a ransom, and await the coming of the cycles (of misfortunes) upon you; upon them only is the evil cycle of misfortune; and Allah is All Hearing, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the bedouins there are some who look upon what they spend (in Allah's cause) as a fine and watch for calamities for you, on them be the calamity of evil. And Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the dwellers of the desert are those who take what they spend to be a fine, and they wait (the befalling of) calamities to you; on them (will be) the evil calamity; and Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of the Bedouins take what they expend for a fine, and await the turns of fortune to go against you. Theirs shall be the evil turn; God is All-hearing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the wandering Arabs there is he who taketh that which he expendeth (for the cause of Allah) as a loss, and awaiteth (evil) turns of fortune for you (that he may be rid of it). The evil turn of fortune will be theirs. Allah is Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some desert Arabs regard what they give for the cause of God as a fine and wait for some misfortune to befall you. May ill-fortune befall them! God hears all and knows all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the dwellers of the desert is one who taketh that which he expen deth as a fine, and waiteth for evil turns of fortune for you. Upon them shall be the evil turn of fortune. And Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the Bedouins are those who regard what they spend as a loss, and they watch for a reversal of your fortunes. Theirs shall be an adverse turn of fortune, and Allah is all-hearing, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of the desert Arabs look upon their payments as a fine, and watch for disasters for you: on them be the disaster of evil: for Allah is He That heareth and knoweth (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the bedouins there are some who look upon what they spend (in Allah's Cause) as a fine and watch for calamities for you, on them be the calamity of evil. And Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some Arabs (Banu Asad and Ghatfan tribes) regard what they spend as a (compulsory) fine and wait for some misfortune to befall you. Theirs shall be the evil turn! Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the Desert-Arabs are those who consider their contribution to be a fine. And they wait for a reversal of your fortunes. Upon them will fall the cycle of misfortune. God is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the bedouins are some who consider what they spend as a loss and await for you turns of misfortune. Upon them will be a misfortune of evil. And Allah is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:98] And of the Bedouins there is he who takes what he expends, in the way of God, as a penalty, as a liability and a [financial] loss, because he does not aspire to be rewarded for it, but expends it out of fear: these were Banū Asad and [Banū] Ghatafān; and awaits for you [evil] turns of fortune, the fortunes of time, for you, that these should turn against you, and so be rid [of you]. Theirs shall be the evil (read as al-sū‘, or alsaw‘) turn of fortune, that is, chastisement and destruction shall turn on them, not on you. And God is Hearer, of the sayings of His servants, Knower, of their actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of the wandering Arabs) i.e. Asad and Ghatafan (there is he who taketh) who presumes that (that which he expendeth) in jihad, (as a loss, and awaiteth (evil) turns of fortune) death and perishing (for you (that he may be rid of it). The evil turn of fortune will be theirs) the evil turn of events and consequence will be theirs. (Allah is Hearer) of what they say, (Knower) of their punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنَ } منافقي { ٱلأَعْرَابِ مَن يَتَّخِذُ } أي: بعد ويحسب { مَا يُنفِقُ } بأمر الله في سبيله { مَغْرَماً } أي: غرامةً وخسراناً؛ لعدم إيمانه واعتقاده بترتب الثواب عليه، بل إنما ينفق رياءً وتقيةً { وَ } من خباثة باطنه { يَتَرَبَّصُ } أي: يترقب وينتظر { بِكُمُ ٱلدَّوَائِرَ } أي: نوائب الزمان الدائرة عليكم؛ لينقلب الأمر ويتحول الحال، ويخلص من الإنفاق بالنفاق، بل يدور { عَلَيْهِمْ دَآئِرَةُ ٱلسَّوْءِ } على عكس مرامهم دائماً متجدداً، مستمراً { وَٱللَّهُ } الرقيب عليهم { سَمِيعٌ } لمناجاتهم { عَلِيمٌ } [التوبة: 98] بنياتهم وحاجاتهم تدبر عليهم ما يتربصون بكم من الدوائر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن الأعراب من يتخذ } أي: يعدُ { ما ينفقُ } من الزكاة وغيرها في سبيل الله، { مَغرَماً } أي: غرامة وخسراناً إذ لا يحتسبه عند الله، ولا يرجوا عليه ثواباً، وإنما ينفقه لرياء أو تقية، فيثقل عليه ثقل المغرم الذي ليس بحق، { ويتربصُ بكم الدوائرَ } أي: دوائر الزمان ونُوبه، أو ينتظر بكم مصائب الزمان، لينقلب الأمر عليكم فيتخلص من الإنفاق الذي كلف به\n  قال تعالى: { عليهم دائرةُ السَّوْءِ } ، وهو دعاء عليهم بنحو ما يتربصونه ـ أي: عليهم يدور من الدهر ما يَسُوؤهم أو جعل الله دائرة السوء نازلة بهم\n قال ابن عطية: كل ما كان بلفظ دعاء من جهة الله ـ عز وجل ـ فإنما هو بمعنى إيجاب الشيء لأن الله تعالى لا يدعو على مخلوقاته وهي في قَبضته، ومن هذا قوله:\n\n[الهمزة: 1]،\n\n[المطففين: 1]، وهي كلها أحكام تامة تضمنها خبره تعالى\n هـ\n أو إخبار عن وقوع ما يتربصونه عليهم\n قال البيضاوي: الدوائر في الأصل: مصدر أضيف إليه السوء للمبالغة، كقولك: رَجلُ صدق\n وقرأ ابن كثير وأبو عمرو: \" السُّوء \" هنا، وفي الفتح بضم السين\n هـ\n { والله سميعٌ } لما يقولونه عند الإنفاق { عليم } بما يضمرونه من الرياء وغيره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:66",
      "similarity": 0.647214935430933
    },
    {
      "verse": "25:65",
      "similarity": 0.5843083908449279
    },
    {
      "verse": "52:40",
      "similarity": 0.5758848906140023
    },
    {
      "verse": "68:46",
      "similarity": 0.5758848906140023
    },
    {
      "verse": "9:60",
      "similarity": 0.4190919645743235
    }
  ]
}