{
  "chapter": "التوبة",
  "text": "ومن الاعراب من يؤمن بالله واليوم الءاخر ويتخذ ما ينفق قربت عند الله وصلوت الرسول الا انها قربة لهم سيدخلهم الله فى رحمته ان الله غفور رحيم",
  "translations": [
    {
      "translation": "And among the desert arabs there are some who have iman in Allah and the Last Day and regard what they give as something which will bring them nearer to Allah and to the prayers of the Messenger. It does indeed bring them near. Allah will admit them into His mercy. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet some Arabs of the desert believe in God and the Last Day, and consider what they spend to be a means of bringing them nearer to God and the blessings of the Prophet. This is certainly a means of achieving nearness (to God), and God will admit them to His mercy, for God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the bedouin Arabs are those who believe in Allah and the Last Day, and regard their spending (in the Way of Allah) as a means of drawing near to Allah and of deserving the prayers of the Messenger. Indeed, this shall be a means of drawing near to Allah. Allah will surely admit them to His mercy. Allah is All-Forgiving, Ever Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of the desert dwelling Arabs believe in God and the Day of Judgment. Whatever they spend for the cause of God they consider it as a means of getting nearer to God and have the prayers of the Messenger in their favor. This, certainly is a means to get nearer to God. God will admit them into His mercy. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some villagers are those who believe in Allah and the Last Day, and consider the spending as the means of obtaining proximity to Allah and obtaining the prayers of the Noble Messenger; pay heed! Yes indeed it is the means of proximity for them; Allah will soon admit them into His mercy; indeed Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the bedouins there are some who believe in Allah and the Last Day, and look upon what they spend (in Allah's cause) as means of nearness to Allah, and a cause of receiving the Messenger's invocations. Indeed these (expenditures) are a means of nearness for them. Allah will admit them to His mercy. Certainly Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the dwellers of the desert are those who believe in Allah and the latter day and take what they spend to be (means of) the nearness of Allah and the Apostle's prayers; surely it shall be means of nearness for them; Allah will make them enter into His mercy; surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some of the Bedouins believe in God and the Last Day, and take what they expend for offerings bringing them near to God, and the prayers of the Messenger. Surely they are an offering for them, and God will admit them into His mercy; God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the wandering Arabs there is he who believeth in Allah and the Last Day, and taketh that which he expendeth and also the prayers of the messenger as acceptable offerings in the sight of Allah. Lo! verily it is an acceptable offering for them. Allah will bring them into His mercy. Lo! Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are also those among them who believe in God and the Last Day and regard what they spend for the cause of God as a means of bringing them nearer to God and of deserving the prayers of the Messenger. This shall certainly be for them a means of drawing near to God. God will admit them into His mercy; God is indeed most forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the dwellers of the desert is one who believeth in Allah and the Last Day, and taketh that which he expendeth as approaches unto Allah and the blessings of His apostle. Lo! verily these are an approach for them; anon Allah will enter them into His mercy. Verily Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet among the Bedouins are [also] those who believe in Allah and the Last Day, and regard what they spend as [a means of attaining] nearness to Allah and the blessings of the Apostle. Now, it shall indeed bring them nearness, and Allah will admit them into His mercy. Indeed Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But some of the desert Arabs believe in Allah and the Last Day, and look on their payments as pious gifts bringing them nearer to Allah and obtaining the prayers of the Messenger. Aye, indeed they bring them nearer (to Him): soon will Allah admit them to His Mercy: for Allah is Oft-forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the bedouins there are some who believe in Allah and the Last Day, and look upon what they spend in Allah's Cause as approaches to Allah, and a cause of receiving the Messenger's invocations. Indeed these (spendings in Allah's Cause) are an approach for them. Allah will admit them to His Mercy. Certainly Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet there are some Arabs (Juhaina and Muszaina tribes) who believe in Allah and the Last Day, and regard what they spend as a means of bringing them close to Allah and to the prayers of the Messenger. Indeed, they are an offering for them; Allah will admit them to His Mercy. He is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet among the Desert-Arabs are those who believe in God and the Last Day, and consider their contribution to be a means towards God, and the prayers of the Messenger. Surely it will draw them closer, and God will admit them into His mercy. God is Forgiving and Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But among the bedouins are some who believe in Allah and the Last Day and consider what they spend as means of nearness to Allah and of [obtaining] invocations of the Messenger. Unquestionably, it is a means of nearness for them. Allah will admit them to His mercy. Indeed, Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[9:99] And of the Bedouins there is he who believes in God and the Last Day, such as [men from among the tribes of] Juhayna and Muzayna, and takes what he expends, in the way of God, as [pious] offerings to bring [him] nearer to God, and, as a means, to [secure] the prayers, the supplications, of the Messenger, for him. Surely these, the expenditure of such [men], will bring them nearer (read qurubatun or qurbatun), to Him. God will admit them into His mercy, His Paradise. Truly God is Forgiving, to those who obey Him, Merciful, to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of the wandering Arabs) the tribes of Muzaynah, Juhaynah and Aslam (there is he who believeth in Allah and the Last Day) in secret and in the open, (and taketh that which he expandeth) in jihad (and also the prayers of the messenger as acceptable offering for in the sight of Allah) as means of drawing near to Allah in degrees. (Lo! verily it) i.e. the expenditure (is an acceptable offering for them) to Allah which raises them in degrees. (Allah will bring them into His mercy) into His Paradise. (Lo! Allah is Forgiving, Merciful) towards he who repents.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنَ } مخلصي { ٱلأَعْرَابِ مَن يُؤْمِنُ بِٱللَّهِ } أي: يوقن ويذعن بتوحيده { وَٱلْيَوْمِ ٱلآخِرِ } أي: يصدق باليوم الآخر المعد لجزاء الأعمال، وترتب المثوبات بالقربات والصدقات { وَيَتَّخِذُ مَا يُنفِقُ } في سبيل الله { قُرُبَاتٍ } ونيل مثوبات ورفع درجات { عِندَ ٱللَّهِ وَصَلَوَاتِ ٱلرَّسُولِ } أي: بسبب استغفاره ودعائه له { أَلاۤ إِنَّهَا } أي: ما يتصدقون بها أولئك المؤمنون، المخلصون، المتقربون { قُرْبَةٌ لَّهُمْ } وسبب وصولهم إليه { سَيُدْخِلُهُمُ ٱللَّهُ } الموفق له، الرقيب عليهم { فِي } سعة { رَحْمَتِهِ } وجوده بعد انقضاء النشأة الأولى { إِنَّ ٱللَّهَ } المصلح لأحوالهم { غَفُورٌ } لما صدر عنه من المعاصي قبل إيمانهم { رَّحِيمٌ } [التوبة: 99] لهم، يقبل منهم بعد إيمانهم وإخلاصهم ما يتقربون به لمرضاته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ذكر ضدهم، فقال: { ومن الأعراب من يؤمن بالله واليوم الآخر ويتخذُ ما يُنفق } أي: يعد ما ينفقه من الزكاة وغيرها { قرباتٍ عند الله } تُقربهم إليه زلفى لإخلاصهم فيها\n { وصلواتِ الرسول } أي: ويتخذ ما ينفق سبَبَ صلوات الرسول لأنه ـ عليه الصلاة والسلام ـ كان يدعو للمتصدقين، ويقول: اللهم صل على فلان، ويستغفر لهم\n ولذلك سُن للمصدّق عليه أن يدعو للمتصدق عند أخذ صدقته، ولكن ليس له أن يصلي عليه، كما كان يفعل صلى الله عليه وسلم لأن ذلك منصبه، فله أن يتفضل به على غيره\n { ألا إنها } أي: نفقاتهم، { قُربة لهم } تقربهم إلى حضرة ربهم، وهذا شهادة من الله لصحة معتقدهم وكمال إخلاصهم، { سَيُدخلهم اللهُ في رحمته } ، وعدٌ من الله لهم بإحاطة الرحمة بهم، أو سيدخلهم في جنته التي هي محل رحمته وكرامته، والسين لتحقيق وقوعه\n\n\n{ إن الله غفور رحيم } يغفرما فرط من الخلل، ويتفضل برحمته على ما نقص عن درجات الكمال\n قيل: إن الآية الأولى نزلت في أسد وغطفان وبني تميم فهم الذين يتخذون ما ينفقون مغرماً\n والثانية نزلت في عبد الله ذي البجادين وقومه فهم الذين يتخذون ما ينفقون قربات عند الله وصلوات الرسول\n والله تعالى أعلم\n الإشارة: قد ورد الترغيب في سكنى المدن لأنها محل العلم وسماع الوعظ، وفيها من يستعان بهم على الدين، وورد الترغيب أيضاً في سكنى الجبال والفرارا بالدين من الفتن، وخصوصاً في آخر الزمان\n ولهذا اختار كثير من الصحابة والتابعين سكنى البوادي كأبي ذر وسلمة بن الأكوع، وغيرهما ـ رضي الله عنهم ـ\n والتحرير في المسألة: أن ذلك يختلف باختلاف الأشخاص والمقاصد، فمن كان مراده تحقيق الشريعة، وتحرير مسائل العلم الظاهر، والقيام بوظائف الدين، ولم يجد في البادية من يعينه على ذلك فسكنى المدن أفضل له، ومن كان مراده تصفية قلبه وتحقيق علم الطريقة، وتهيئة القلب لإشراق أنوار الحقيقة، فالاعتزال في البوادي، وقرون الجبال، أوفق له، إن وجد من يستعين بهم على ذلك لأن شواغل المدن، وعوائدها كثيرة، وقد كثرت فيها الحظوظ والأهوية فلا يجد فيها إلا من هو مفتون بدنيا أو مبتلى بهوى، بخلاف أهل البادية، هذه العوائد فيهم قليلة، وجُلّ أهلها على الفطرة\n وأيضاً: هم مفتقرون إلى من يسوسهم بالعلم أكثر من غيرهم، فمن تصدى لتعليمهم وتذكيرهم لا يعلم قدره إلا الله\n قال الشيخ أبو الحسن الشاذلي رضي الله عنه: أرحم الناس بالناس من يرحم من لا يرحم نفسه\n أي: من يرحم الجاهل الذي لا يرحم نفسه بأن يعلمه ما ينفع به نفسه ويرحمها\n وقال الغزالي في الإحياء: يجب على العلماء أن يبعثوا من يعلم الناس في البوادي فإن أخلوا بذلك الأمر عاقبهم الله، فمن تعرض لتعليمهم قام بهذا الواجب\n والله تعالى أعلم\n وأما يذكر حديثاً:\n\n \" أمتي في المدن، وقليل في البادية \" فلم يصح، بل قال ـ عليه الصلاة والسلام ـ للرجل الذي أراد أن ينتقل إلى المدينة: \" اعبد الله حيثما كنت، فإن الله لن يترك من أعمالك شيئاً \" \n\nوكذلك قوله: إذا إراد الله بعبد خيراً نقله من البادية إلى الحاضرة لم أقف عليه حديثاً\n وبالله التوفيق\n ثم ذكر فضل السابقين إلى الإسلام، فقال: { وَٱلسَّابِقُونَ ٱلأَوَّلُونَ مِنَ ٱلْمُهَاجِرِينَ وَٱلأَنْصَارِ }\n\n",
      "translations": []
    }
  ]
}